{
  "id": 3353,
  "name": "Antoine Riard",
  "username": "ariard",
  "avatar_template": "/letter_avatar_proxy/v4/letter/a/c67d28/{size}.png",
  "created_at": "2024-10-11T22:31:12.210Z",
  "cooked": "<p>Thanks again for the clarifications</p>\n<blockquote>\n<p>Sure — people who work in the same company tend to work together on the same stuff. SuperScalar was released in a limited venue internal to Block, before we presented it at the summit.</p>\n</blockquote>\n<p>Be sure, I don’t question a private company to seek profit, neither people working at the same company working together on the same stuff, that’s all right.</p>\n<p>I’m questioning if all of that it’s not a bit of corporate capture of the communication channels and venues dedicated to the Lightning protocol. Such protocol has been developed in common by different implementations since the Milan meeting around Scaling Bitcoin in 2016, and all the protocol specifications have been released under Creative Common License 4.0 since then.</p>\n<p>Such meetings have been usually reserved to discuss matters related to the lightning protocol, and not to present commercial products in exclusivity. E.g, the folks at Lightning Labs, has never used that to talk about their Lightning Pool product, that they released in late 2020, and I think it would have been inappropriate for them to do so.</p>\n<p>Moreover, and here I’ll recall the example of Blockstream in 2014, when they released the sidechain paper, this was explicitly licensed into the public domain. Concerning the SuperScalar construction, given it has been developed internally at Block Inc as you said so, there could be patent protection in application. As far as I can see, there has been no such mention when you published your post few weeks ago, and this forum has moderation rules noticing about “deceptively encouraring the use of patent-encumbered techniques\" as documented here:\n</p><aside class=\"quote quote-modified\" data-post=\"1\" data-topic=\"1085\">\n  <div class=\"title\">\n    <div class=\"quote-controls\"></div>\n    <img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ajtowns/48/417_2.png\" class=\"avatar\">\n    <a href=\"https://delvingbitcoin.org/t/flagging-posts-topics/1085\">Flagging posts/topics</a> <a class=\"badge-category__wrapper \" href=\"/c/meta/2\"><span data-category-id=\"2\" style=\"--category-badge-color: #808281; --category-badge-text-color: #FFFFFF;\" data-drop-close=\"true\" class=\"badge-category \" title=\"Discussion about this site, its organization, how it works, and how we can improve it.\"><span class=\"badge-category__name\">Meta</span></span></a>\n  </div>\n  <blockquote>\n    Hey all, \nI’ve changed the “inappropriate” flag (“This post contains content that a reasonable person would consider offensive, abusive, to be hateful conduct or a violation of our community guidelines”) to a slightly more general “not constructive” flag, with the description: \n\nIt’s Not Constructive This post contains non-constructive content, for example it may be repetitive, trolling, argumentative, or include content that a reasonable person would consider offensive, abusive, or a violation …\n  </blockquote>\n</aside>\n\n<p>Beyond, and here it’s more concerning the lightning summit attendees, has any Block Inc employe explicitly said to the non-Block attendees that the SuperScalar construction was a Block Inc product, before to make a presentation about it ? If yes, have they give opportunity to\nthe non-Block attendees to leave the room or not attend the session if they didn’t wish to discuss SuperScalar ? For the ones who did attend a session on it, as all materials presented to them being explicitly put into the public domain or a creative common license ?</p>\n<p>As a reminder, it’s not liked “closed-door” meetings, where only some developers were invited have raised many controversies in the past, of which the Hong Kong Agreement of 2016 is a good example.</p>\n<p>So far there has been no answer on a public forum or channel from TheBlueMatt, a Block Inc employee, how the invitation list has been composed: <a href=\"https://github.com/lightning/bolts/issues/1201\" class=\"inline-onebox\">Follow-up Lightning Dev Summit · Issue #1201 · lightning/bolts · GitHub</a> and if any technical criterias has been followed.</p>\n<p>Some in the community could have doubt if it wasn’t just opportunistically to lobby some\nlightning devs about BlockInc’s SuperScalar product ?</p>\n<p>Concerning lightning summits, I think Rusty Russel sets a good standard in the past in matters of open-source protocol meetings, where the invitation for the Adelaide meeting of 2018 were announced on the mailing list: <a href=\"https://lists.linuxfoundation.org/pipermail/lightning-dev/2018-April/001168.html\" class=\"inline-onebox\">[Lightning-dev] Lightning Developer Summit #2: Adelaide,\tAustralia 2018-10-08 and 2018-10-09</a></p>\n<p>I certainly don’t wish to accuse TheBlueMatt of hypocrisy or double-standard on a public forum in matters of open-source, neither that he would forget his open-source standards everytime he’s changing of corporate employer. After all, I contributed with him for years on the <code>rust-lightning</code> open-source project.</p>\n<blockquote>\n<p>The initial SuperScalar was lousy — it was just laddered timeout trees,\nwithout the Decker-Wattenhofer. This was developed a few months ago,\ninternally to Block, and not released publicly because it sucked. A few\nweeks ago, while looking over <a class=\"mention\" href=\"/u/instagibbs\">@instagibbs</a> work on P2A, I realized that\nP2A handled the issues I had with Decker-Wattenhofer — in particular,\nthe difficulty of having either exogenous fees (without P2A, you need\nevery participant to have its own anchor output, increasing the size of\neach tx with an output per participant) or mutable endogenous fees (because\nnot every offchain transaction is changed at each state change, earlier\ntransactions cannot change their feerates when you update the state for\na feerate change), which is why I shelved Decker-Wattenhofer constructions\nand stopped work on sidepools, which used Decker-Wattenhofer. However,\nwith P2A, I realized that Decker-Wattenhofer was actually more viable —\nand thus can be combined with timeout trees, creating the current\nSuperScalar. I then rushed to create a quick writeup, got it reviewed\ninternally, and got permission to publish it on Delving, so we could\npresent this at the summit. <a class=\"mention\" href=\"/u/moneyball\">@moneyball</a> believes it provides a possible\npath to wider Lightning onboarding, so this encouraged me to focus more\nattention on it and figuring out its flaws and limitations.</p>\n</blockquote>\n<p>I don’t know if you’re reading the mailing list, though the timeout trees concept was presented there. If I remember numerous limitations were pointed out. Beyond, it’s not like the P2A sounds to be broken too, as a fee-bumping scheme for off-chain counterparties with competing interest.</p>\n<blockquote>\n<p>(You can track my thinking around laddered timeout trees by my Twitter\nposts, incidentally — again, I only started posting about timeout trees,\nand musing on laddering them, in the past 6 months. Thinking takes time.)</p>\n</blockquote>\n<p>I’m not on Twitter. Social medias culture can only make you dumb, and\nmore inclined to follow the madness of the crowd. Good to read again the\nphilosopher Hannah Arendt, her writings on the crisis of culture or some\nof her essays on the essence of totalitarism.</p>\n<blockquote>\n<p>Adding Decker-Wattenhofer to laddered timeout-trees was an idea that occurred\nto me literally a few weeks before the summit. Again, remember that I stopped\nworking on sidepools because Decker-Wattenhofer sucked (exogenous fees are out\nbecause you need an output per participant, endogenous fees cannot be meaningfully\nchanged because each state transition only changes a subset of offchain transactions),\nand I only returned my attention to Decker-Wattenhofer after <a class=\"mention\" href=\"/u/instagibbs\">@instagibbs</a> could\nrelease P2A for Bitcoin Core 28. Without thinking about Decker-Wattenhofer, I\ncannot combine Decker-Wattenhofer with timeout-trees, obviously. The timing was\ncoincidental, not planned. Thinking takes time.</p>\n</blockquote>\n<p>The main issue with Decker-Wattenhofer, whatever the elegance of the construction, is that for each state update, the relative timelocks are decremented and when they reach near of expiration, you can suddenly have massive surface of transactions to fee-bump, at the worst time of block demand.</p>\n<p>On the other hand, the long safety timelocks can only make the construction very burdensome for the user, as they would have to wait until their on-chain expiration if there is an early exit.</p>\n<blockquote>\n<p>I have not made any representation that the construction has been peer-reviewed\nmeaningfully, even internally in Block. Given the addenda I have been writing, it\nis very much a work-in-progress, one that I am taking all of my time to work on rather\nthan anything else. If anyone can poke holes into it, they can do so in this very thread,\nthat is the whole point of making this thread and presenting it at the summit. I am in\nfact taking the time here to allow people to respond. All I did was present this to the\npeople at the conference, and I believe it to be worth my time to think about and refine.</p>\n</blockquote>\n<p>Again, see all the comments above about making the timing of this publication at the same time than the summit and that being explicitly pointed out by another Block Inc employe in the github thread about the lightning dev summit.</p>\n<p>In 2017, the way the extension block proposal was brought into the public conversation too raise controversies, when it was published on a Medium post, rather than usual communication venues.</p>\n<blockquote>\n<p>I have been advised to avoid mentioning of legal or regulatory stuff, as I am not a\nlawyer and anything I say about regulations, legal frameworks, or regulatory bodies\nwould not be expert advice on it. Let me ask my supervisor about this.</p>\n</blockquote>\n<p>Why your supervisor cannot comment here on this public forum on this name ? That’s only sounds more like corporate capture of the lightning protocol, when questions are asked on how a “closed-door” meetings, did happen. Some folks it was just pure hazard about the timing of publication and meetings happening, and when asked more questions someone falls into the “let me ask to my boss…” as they were just doing Silicon Valley-style bad public relationships…</p>\n<p>Corrected: s/this name/its name/g - English can be hard.</p>\n<p>Personally, I’m fine too to talk about technical and legal matters in a public fashion, and I think few other bitcoin and lightning protocols devs are versed too in legal matters.</p>\n<p>Again, it’s not like your top-down hierarchical supervisor, Jack Dorsey might freely have given in the past his contacts to some devs in that space and some people can go to ask in private explanations if someone wishes to know more. But if a supervisor at Block Inc is not able to explain on a public why there are some irregularities in the organization of a “closed-doors” meeting about an open-source protocol, this can only raise doubts among the bitcoin community what that SuperScalar product is all about.</p>\n<blockquote>\n<p>We are aware of this issue and this issue was also presented at the Lightning\nProto Dev Summit. However, the tree structure does allow for subsets to sign off\non changes instead of requiring the entire participant set to be online to sign;\nthis reduces the need for large groups to come online.</p>\n</blockquote>\n<p>If some participants are signing off the changes, the construction is broken,\nas they cannot verify that ulterior state changes are correct, and the LSP\nand another subset of the group colludes to double-spend the balance. The\nwhole lightning security model is about not trusting the channel counterparty\nwith loss of funds style risk, or the Lightning Service Provider, for what\nthe LSP is worth.</p>\n<blockquote>\n<p><a class=\"mention\" href=\"/u/adiabat\">@adiabat</a> last year in TABConf had a talk about how onlineness (specifically,\ncoordination problems with large groups) will be the next problem; tree structures\nallow us to reduce participant sets, regardless of consensus change, and tree\nstructures do still require a multiple of N data to publish N leaves. Full exits\nof OP_TLUV-style trees are even worse, as they require O(N log N) instead of O(N)\ndata (m * N data to be specific, where m is reduced by higher arity). OP_TLUV-style\ntrees also cannot change subset without changing the root, which means they do not\ngain the ability of SuperScalar to have subsets sign off on changes; this is because\nOP_TLUV-style trees use Merkle trees, unlike timeout trees which use transaction\ntrees which allow sub-trees to mutate if you combine it with Decker-Wattenhofer.</p>\n</blockquote>\n<p>Lol, Tadge saying that onliness and coordination problems with large groups will\nbe the next problem. It’s not like something that the OG working on Lightning\nhave known for years…and even some more.</p>\n<p>Sure, OP_TLUV-style trees cannot changes subset without changing the root, however\n<em><strong>if done correctly</strong></em> they do not require trust in any of the other counterparty about\nintegrity of the balance.</p>\n<blockquote>\n<p>I have been refining SuperScalar to shift much of the risk to the LSP, precisely to\nprevent risks on clients. You may not agree that it goes far enough, but I think it\ncan be done in practice such that it is more economical for the LSP to not screw over\nits clients, just as typical capitalism works.</p>\n</blockquote>\n<p>That’s missing the point about the discussion about levels of security risks. What\nyou’re presentation of this SuperScalar product is saying, is that the LSP can\nrug pull at anytime one of the user, so it’s a loss of balance security risk. Not\na simpler risk like a delay in processing due to the bitcoin CSV timelocks.</p>\n<p>In the real world, there is something call “bank run” and as one put it\ninto the bitcoin blockchain years years ago, \"Chancellor on brink of\nsecond bailout for banks”.</p>\n<blockquote>\n<p>You cannot earn money from a dead customer, which is why capitalism works</p>\n</blockquote>\n<p>I’ll let you dig into the etymology of mortgage, a financial instrument underpinning\nmany of business operations in modern capitalism.</p>\n<blockquote>\n<p>The thing about SuperScalar is that timeout trees suck because of the large numbers\nof transactions that need to be put onchain in the worst case, Decker-Wattenhofer\nsucks because of the large numbers of transaction that need to be put onchain in\nthe worst case, but when you mash them together they gain more power while not increasing\ntheir suckiness — their suckiness combines to a common suckiness instead of adding their\nsuckiness together. Timeout trees get the ability to mutate due to combining with\nDecker-Wattenhofer, while Decker-Wattenhofer gets the ability to mutate using partial\nparticipant sets. The whole is better than the sum of its parts, and I think it is\nworth my while to investigate if this is good enough in practice.</p>\n</blockquote>\n<p>That SuperScalar construction still does not solve the \"Forced Expiration Spam”\nabout a massive number of off-chain state transactions hitting the blockchain,\nas whoever is paying the on-chain fees, be it the LSP or the channel counterparty,\nthere is a limited blockchain space (4MB) and a limited number of coins (<code>MAX_MONEY</code>)\nthat can be used to pay the fees. The LSP can inflate the timeout trees, with actually no fee-bumping reserves to back them up, so it’s clearly trusted and the LSP can steal the participant sets at anytime.</p>\n<p>But sure, what you’re doing or what Block Inc is doing you it’s up to you guys.</p>\n<p>The rest of the lightning community, they will prefer something that scales bitcoin in a more trust-minimized fashion.</p>",
  "post_number": 30,
  "post_type": 1,
  "updated_at": "2024-10-11T22:34:21.936Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 2,
  "readers_count": 1,
  "score": 0.4,
  "yours": false,
  "topic_id": 1143,
  "topic_slug": "superscalar-laddered-timeout-tree-structured-decker-wattenhofer-factories",
  "topic_title": "SuperScalar: Laddered Timeout-Tree-Structured Decker-Wattenhofer Factories",
  "topic_html_title": "SuperScalar: Laddered Timeout-Tree-Structured Decker-Wattenhofer Factories",
  "category_id": 7,
  "display_username": "Antoine Riard",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Thanks again for the clarifications\n\n> Sure — people who work in the same company tend to work together on the same stuff. SuperScalar was released in a limited venue internal to Block, before we presented it at the summit.\n\nBe sure, I don't question a private company to seek profit, neither people working at the same company working together on the same stuff, that's all right.\n\nI'm questioning if all of that it's not a bit of corporate capture of the communication channels and venues dedicated to the Lightning protocol. Such protocol has been developed in common by different implementations since the Milan meeting around Scaling Bitcoin in 2016, and all the protocol specifications have been released under Creative Common License 4.0 since then.\n\nSuch meetings have been usually reserved to discuss matters related to the lightning protocol, and not to present commercial products in exclusivity. E.g, the folks at Lightning Labs, has never used that to talk about their Lightning Pool product, that they released in late 2020, and I think it would have been inappropriate for them to do so.\n\nMoreover, and here I'll recall the example of Blockstream in 2014, when they released the sidechain paper, this was explicitly licensed into the public domain. Concerning the SuperScalar construction, given it has been developed internally at Block Inc as you said so, there could be patent protection in application. As far as I can see, there has been no such mention when you published your post few weeks ago, and this forum has moderation rules noticing about “deceptively encouraring the use of patent-encumbered techniques\" as documented here:\nhttps://delvingbitcoin.org/t/flagging-posts-topics/1085\n\nBeyond, and here it's more concerning the lightning summit attendees, has any Block Inc employe explicitly said to the non-Block attendees that the SuperScalar construction was a Block Inc product, before to make a presentation about it ? If yes, have they give opportunity to\nthe non-Block attendees to leave the room or not attend the session if they didn't wish to discuss SuperScalar ? For the ones who did attend a session on it, as all materials presented to them being explicitly put into the public domain or a creative common license ?\n\nAs a reminder, it's not liked \"closed-door\" meetings, where only some developers were invited have raised many controversies in the past, of which the Hong Kong Agreement of 2016 is a good example.\n\nSo far there has been no answer on a public forum or channel from TheBlueMatt, a Block Inc employee, how the invitation list has been composed: https://github.com/lightning/bolts/issues/1201 and if any technical criterias has been followed. \n\nSome in the community could have doubt if it wasn't just opportunistically to lobby some\nlightning devs about BlockInc's SuperScalar product ?\n\nConcerning lightning summits, I think Rusty Russel sets a good standard in the past in matters of open-source protocol meetings, where the invitation for the Adelaide meeting of 2018 were announced on the mailing list: https://lists.linuxfoundation.org/pipermail/lightning-dev/2018-April/001168.html\n\nI certainly don't wish to accuse TheBlueMatt of hypocrisy or double-standard on a public forum in matters of open-source, neither that he would forget his open-source standards everytime he's changing of corporate employer. After all, I contributed with him for years on the `rust-lightning` open-source project.\n\n> The initial SuperScalar was lousy — it was just laddered timeout trees,\n> without the Decker-Wattenhofer. This was developed a few months ago,\n> internally to Block, and not released publicly because it sucked. A few\n> weeks ago, while looking over @instagibbs work on P2A, I realized that\n> P2A handled the issues I had with Decker-Wattenhofer — in particular,\n> the difficulty of having either exogenous fees (without P2A, you need\n> every participant to have its own anchor output, increasing the size of\n> each tx with an output per participant) or mutable endogenous fees (because\n> not every offchain transaction is changed at each state change, earlier\n> transactions cannot change their feerates when you update the state for\n> a feerate change), which is why I shelved Decker-Wattenhofer constructions\n> and stopped work on sidepools, which used Decker-Wattenhofer. However,\n> with P2A, I realized that Decker-Wattenhofer was actually more viable —\n> and thus can be combined with timeout trees, creating the current\n> SuperScalar. I then rushed to create a quick writeup, got it reviewed\n> internally, and got permission to publish it on Delving, so we could\n> present this at the summit. @moneyball believes it provides a possible\n> path to wider Lightning onboarding, so this encouraged me to focus more\n> attention on it and figuring out its flaws and limitations.\n\nI don't know if you're reading the mailing list, though the timeout trees concept was presented there. If I remember numerous limitations were pointed out. Beyond, it's not like the P2A sounds to be broken too, as a fee-bumping scheme for off-chain counterparties with competing interest.\n\n> (You can track my thinking around laddered timeout trees by my Twitter\n> posts, incidentally — again, I only started posting about timeout trees,\n> and musing on laddering them, in the past 6 months. Thinking takes time.)\n\nI'm not on Twitter. Social medias culture can only make you dumb, and\nmore inclined to follow the madness of the crowd. Good to read again the\nphilosopher Hannah Arendt, her writings on the crisis of culture or some\nof her essays on the essence of totalitarism.\n\n> Adding Decker-Wattenhofer to laddered timeout-trees was an idea that occurred\n> to me literally a few weeks before the summit. Again, remember that I stopped\n> working on sidepools because Decker-Wattenhofer sucked (exogenous fees are out\n> because you need an output per participant, endogenous fees cannot be meaningfully\n> changed because each state transition only changes a subset of offchain transactions),\n> and I only returned my attention to Decker-Wattenhofer after @instagibbs could\n> release P2A for Bitcoin Core 28. Without thinking about Decker-Wattenhofer, I\n> cannot combine Decker-Wattenhofer with timeout-trees, obviously. The timing was\n> coincidental, not planned. Thinking takes time.\n\nThe main issue with Decker-Wattenhofer, whatever the elegance of the construction, is that for each state update, the relative timelocks are decremented and when they reach near of expiration, you can suddenly have massive surface of transactions to fee-bump, at the worst time of block demand.\n\nOn the other hand, the long safety timelocks can only make the construction very burdensome for the user, as they would have to wait until their on-chain expiration if there is an early exit.\n\n> I have not made any representation that the construction has been peer-reviewed\n> meaningfully, even internally in Block. Given the addenda I have been writing, it\n> is very much a work-in-progress, one that I am taking all of my time to work on rather\n> than anything else. If anyone can poke holes into it, they can do so in this very thread,\n> that is the whole point of making this thread and presenting it at the summit. I am in\n> fact taking the time here to allow people to respond. All I did was present this to the\n> people at the conference, and I believe it to be worth my time to think about and refine.\n\nAgain, see all the comments above about making the timing of this publication at the same time than the summit and that being explicitly pointed out by another Block Inc employe in the github thread about the lightning dev summit.\n\nIn 2017, the way the extension block proposal was brought into the public conversation too raise controversies, when it was published on a Medium post, rather than usual communication venues.\n\n> I have been advised to avoid mentioning of legal or regulatory stuff, as I am not a\n> lawyer and anything I say about regulations, legal frameworks, or regulatory bodies\n> would not be expert advice on it. Let me ask my supervisor about this.\n\nWhy your supervisor cannot comment here on this public forum on this name ? That’s only sounds more like corporate capture of the lightning protocol, when questions are asked on how a \"closed-door\" meetings, did happen. Some folks it was just pure hazard about the timing of publication and meetings happening, and when asked more questions someone falls into the \"let me ask to my boss..\" as they were just doing Silicon Valley-style bad public relationships…\n\nCorrected: s/this name/its name/g - English can be hard.\n\nPersonally, I'm fine too to talk about technical and legal matters in a public fashion, and I think few other bitcoin and lightning protocols devs are versed too in legal matters.\n\nAgain, it's not like your top-down hierarchical supervisor, Jack Dorsey might freely have given in the past his contacts to some devs in that space and some people can go to ask in private explanations if someone wishes to know more. But if a supervisor at Block Inc is not able to explain on a public why there are some irregularities in the organization of a \"closed-doors\" meeting about an open-source protocol, this can only raise doubts among the bitcoin community what that SuperScalar product is all about.\n\n> We are aware of this issue and this issue was also presented at the Lightning\n> Proto Dev Summit. However, the tree structure does allow for subsets to sign off\n> on changes instead of requiring the entire participant set to be online to sign;\n> this reduces the need for large groups to come online.\n\nIf some participants are signing off the changes, the construction is broken,\nas they cannot verify that ulterior state changes are correct, and the LSP\nand another subset of the group colludes to double-spend the balance. The\nwhole lightning security model is about not trusting the channel counterparty\nwith loss of funds style risk, or the Lightning Service Provider, for what\nthe LSP is worth.\n\n> @adiabat last year in TABConf had a talk about how onlineness (specifically,\n> coordination problems with large groups) will be the next problem; tree structures\n> allow us to reduce participant sets, regardless of consensus change, and tree\n> structures do still require a multiple of N data to publish N leaves. Full exits\n> of OP_TLUV-style trees are even worse, as they require O(N log N) instead of O(N)\n> data (m * N data to be specific, where m is reduced by higher arity). OP_TLUV-style\n> trees also cannot change subset without changing the root, which means they do not\n> gain the ability of SuperScalar to have subsets sign off on changes; this is because\n> OP_TLUV-style trees use Merkle trees, unlike timeout trees which use transaction\n> trees which allow sub-trees to mutate if you combine it with Decker-Wattenhofer.\n\nLol, Tadge saying that onliness and coordination problems with large groups will\nbe the next problem. It's not like something that the OG working on Lightning\nhave known for years...and even some more.\n\nSure, OP_TLUV-style trees cannot changes subset without changing the root, however\n_**if done correctly**_ they do not require trust in any of the other counterparty about\nintegrity of the balance.\n\n> I have been refining SuperScalar to shift much of the risk to the LSP, precisely to\n> prevent risks on clients. You may not agree that it goes far enough, but I think it\n> can be done in practice such that it is more economical for the LSP to not screw over\n> its clients, just as typical capitalism works.\n\nThat's missing the point about the discussion about levels of security risks. What\nyou're presentation of this SuperScalar product is saying, is that the LSP can\nrug pull at anytime one of the user, so it's a loss of balance security risk. Not\na simpler risk like a delay in processing due to the bitcoin CSV timelocks.\n\nIn the real world, there is something call \"bank run\" and as one put it\ninto the bitcoin blockchain years years ago, \"Chancellor on brink of\nsecond bailout for banks”.\n\n> You cannot earn money from a dead customer, which is why capitalism works\n\nI'll let you dig into the etymology of mortgage, a financial instrument underpinning\nmany of business operations in modern capitalism.\n\n> The thing about SuperScalar is that timeout trees suck because of the large numbers\n> of transactions that need to be put onchain in the worst case, Decker-Wattenhofer\n> sucks because of the large numbers of transaction that need to be put onchain in\n> the worst case, but when you mash them together they gain more power while not increasing\n> their suckiness — their suckiness combines to a common suckiness instead of adding their\n> suckiness together. Timeout trees get the ability to mutate due to combining with\n> Decker-Wattenhofer, while Decker-Wattenhofer gets the ability to mutate using partial\n> participant sets. The whole is better than the sum of its parts, and I think it is\n> worth my while to investigate if this is good enough in practice.\n\nThat SuperScalar construction still does not solve the \"Forced Expiration Spam”\nabout a massive number of off-chain state transactions hitting the blockchain,\nas whoever is paying the on-chain fees, be it the LSP or the channel counterparty,\nthere is a limited blockchain space (4MB) and a limited number of coins (`MAX_MONEY`)\nthat can be used to pay the fees. The LSP can inflate the timeout trees, with actually no fee-bumping reserves to back them up, so it's clearly trusted and the LSP can steal the participant sets at anytime.\n\nBut sure, what you're doing or what Block Inc is doing you it's up to you guys.\n\nThe rest of the lightning community, they will prefer something that scales bitcoin in a more trust-minimized fashion.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 5,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}