{
  "id": 3338,
  "name": "Antoine Riard",
  "username": "ariard",
  "avatar_template": "/letter_avatar_proxy/v4/letter/a/c67d28/{size}.png",
  "created_at": "2024-10-09T19:19:34.028Z",
  "cooked": "<p>Thanks for the clarification.</p>\n<p>Let’s recall some fact for the public bitcoin community:</p>\n<ul>\n<li>few months agos, a block inc employe A is making an <a href=\"https://github.com/lightning/bolts/issues/1171#issuecomment-2391532275\">invitation list</a> for a so-called Lightning Dev Summit and apparently deliberately excluding people who are scientifically critical to their technical ideas</li>\n<li>during the time that meeting happening, you, a block inc employe B publish out of nowwhere, without any peer review that one expect at academic or industry venue, that SuperScalar construction</li>\n<li>during that meeting happening, another block inc employe C, <a href=\"https://github.com/lightning/bolts/issues/1171#issuecomment-2365479410\">shows the light</a> on SuperScalar construction, making the call to discuss that construction</li>\n<li>after that meeting, you, a block inc employe B and another block inc employe D are using the fact that this construction was discussed at that recent Lightning Dev Summit, as an argument of authority, or at least I’m under that impression, that this construction has been peer-reviewed in any meaningful way</li>\n</ul>\n<p>Correct me, if I’m wrong on the fact, though I think it’s a fair description of the fact.</p>\n<p>I don’t know if you’re familiar with the history of Bitcoin protocol development (here the Wikipedia <a href=\"https://en.wikipedia.org/wiki/Bitcoin_scalability_problem\">link</a>). During the block size war, in 2016, there was something called the Hongkong Agreement, where some devs attended and industry participants, and while some more senior devs discourage other folks to attend, there was some pow-mow style agreement born out of that on the future of bitcoin scalability.</p>\n<p>That agreement, which was done in a complete opaque fashion for the rest of the bitcoin community and maybe without considering the maths, economics and network aspects of discussed topics with distant minds, gave the birth years latter to many controversies and was used as an argument to plan the Segwit2x hard fork.</p>\n<p>In the spirit of avoiding future controversies in the community, I think it would be great if you\ncould highlight that this SuperScalar constructions represents only the view of the block inc employes. Or worst if  has been also vetted in a pow-mow fashion by the other lightning protocol devs present at this summit, and they’re weighing their experts opinions on it. Far from me to accuse block inc to engage in a embrace, extend, extinguish stragegy a la microsoft about the lightning protocol, but many in the communities can have real doubts. At least, when\nblockstream folks published their landmark paper about sidechains in 2014, there were more vocal about their vested interest in the adoption of this blockchain technology (— and the company CEOs were old cypherpunks themselves).</p>\n<p>I don’t think the lightning community has put so much years of works in getting a decentralized network of payment, with instant and private settlements, to fall into some very ill-designed\noff-chain construction, with a lot of trust in the LSP. If block inc is designing a product only for the US market, where there are legal framework in case of issues, it’s better to be more verbose about it (-- I’m not going to say that Jack Dorsey’s tweets are misleading between what he’s saying and what block inc is really doing, but why TBD hasn’t released yet a LSP ?).</p>\n<p>Edit: corrected  s/defamatory/misleading/g. it’s not the same.</p>\n<p>Personally, I’m more interested in a decentralized network where a lambda user in El Salvador\nor Oman can pay another user in Seoul or Singapor, while relying only on the trust-minimized\nassumptions of the protocol. A protocol working well in war zones and developing countries,\nwhere there is not always a stable nation-state authority and a legal remedy is not an option.</p>\n<blockquote>\n<p>Feel free to attack the actual Lightning Network to demonstrate the problem. Clearly, you believe:</p>\n</blockquote>\n<p>As far as I know, I’ve never seen any CVE or responsible disclosure associated to your name in the bitcoin field. You might have done so in the past in another industry as an infosec researcher, and if so you’re free to communicate such realizations.</p>\n<p>In the lack of such information, I don’t really think you’re familiar with ethical disclosure as a security researcher when end-users money are at risk, and as such I’ll let your naive remark\nhere. Sorry, not sorry.</p>\n<blockquote>\n<p>If so, you can demonstrate this, today, with the actual Lightning Network.</p>\n</blockquote>\n<p>I don’t think you’re understanding how the “Forced Expiration Spam” laid out in the lightning whitepaper of 2015 characterize a systemic risk in a world where the bitcoin blockchain space is limited and the number of coins limited to 21 millions.</p>\n<p>Let’s me re-give you an explanation.</p>\n<p>Post-segwit, blocks are limited to 4MB in weight units. Under current lightning protocol safety timelocks of 144 blocks in average and assuming commitment transactions of 300 weight units in average, the block chain can only process 13k channels per bloc. That means the blockchain can only process 2M of channel per day in the worst-case scenario of everyone force-closing at the same time.</p>\n<p>Failing to confirming on-time a commitment transaction and the corresponding HTLC-preimage or HTLC-timeout leads to loss of funds for one of the lightning counterparty.</p>\n<p>This is the best scenario, I’m not considering fully charged lightning channels with <code>max_accepted_htlc</code> limits number of HTLCs, neither second-stage transactions and usage of lower than 144 blocks, as done in practice by lightning implementation. We have only 44k public channels in lightning today, though probably another order of magnitude of private channels, so ~500k. Massive force expiration spam could already be an issue for today’s Lightning Network, if we see such forced expiration spam happening (or in other words a bank run).</p>\n<p>Your SuperScalar proposal, even if it does not implies a consensus change, only makes the problem worst, as now all the combinations of the full tree of transactions might have to be confirmed on-chain. Corresponding fee reserves have to be provisioned by the lightning routing nodes, or the end-users lightning wallet, who ever is paying the fee. So if you assume timeout tree with a k-factor of 2 and 8 users, that’s 12 transactions that have been to confirm in the worst-case. 12 transactions, that’s more than the 8 commitment transactions that have to be confirmed in the worst-case scenarios, rather than 8 commitment transactions, and there is no, or only small compression gain as the k-factor has to be materialized in the fan-out output at each intersection of your timeout tree.</p>\n<p>So, I’ll re-say what I’ve already said the SuperScalar construction is broken and only makes the systemic risk that is already happening with open lightning channels, in a world where the size of the block is statically limited. Pleasure to discuss the mathematics and the economics, if there is still some persistent wondering.</p>\n<p>I think that problem has been understood for years by many bitcoin protocol experts, and again it’s described in the lightning whitepaper section 9.2</p>",
  "post_number": 28,
  "post_type": 1,
  "updated_at": "2024-10-09T19:26:22.020Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 4,
  "reads": 4,
  "readers_count": 3,
  "score": 20.8,
  "yours": false,
  "topic_id": 1143,
  "topic_slug": "superscalar-laddered-timeout-tree-structured-decker-wattenhofer-factories",
  "topic_title": "SuperScalar: Laddered Timeout-Tree-Structured Decker-Wattenhofer Factories",
  "topic_html_title": "SuperScalar: Laddered Timeout-Tree-Structured Decker-Wattenhofer Factories",
  "category_id": 7,
  "display_username": "Antoine Riard",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Thanks for the clarification.\n\nLet's recall some fact for the public bitcoin community:\n\n- few months agos, a block inc employe A is making an [invitation list](https://github.com/lightning/bolts/issues/1171#issuecomment-2391532275) for a so-called Lightning Dev Summit and apparently deliberately excluding people who are scientifically critical to their technical ideas\n- during the time that meeting happening, you, a block inc employe B publish out of nowwhere, without any peer review that one expect at academic or industry venue, that SuperScalar construction\n- during that meeting happening, another block inc employe C, [shows the light](https://github.com/lightning/bolts/issues/1171#issuecomment-2365479410) on SuperScalar construction, making the call to discuss that construction\n- after that meeting, you, a block inc employe B and another block inc employe D are using the fact that this construction was discussed at that recent Lightning Dev Summit, as an argument of authority, or at least I'm under that impression, that this construction has been peer-reviewed in any meaningful way\n\nCorrect me, if I'm wrong on the fact, though I think it's a fair description of the fact.\n\nI don't know if you're familiar with the history of Bitcoin protocol development (here the Wikipedia [link](https://en.wikipedia.org/wiki/Bitcoin_scalability_problem)). During the block size war, in 2016, there was something called the Hongkong Agreement, where some devs attended and industry participants, and while some more senior devs discourage other folks to attend, there was some pow-mow style agreement born out of that on the future of bitcoin scalability.\n\nThat agreement, which was done in a complete opaque fashion for the rest of the bitcoin community and maybe without considering the maths, economics and network aspects of discussed topics with distant minds, gave the birth years latter to many controversies and was used as an argument to plan the Segwit2x hard fork.\n\nIn the spirit of avoiding future controversies in the community, I think it would be great if you\ncould highlight that this SuperScalar constructions represents only the view of the block inc employes. Or worst if  has been also vetted in a pow-mow fashion by the other lightning protocol devs present at this summit, and they’re weighing their experts opinions on it. Far from me to accuse block inc to engage in a embrace, extend, extinguish stragegy a la microsoft about the lightning protocol, but many in the communities can have real doubts. At least, when\nblockstream folks published their landmark paper about sidechains in 2014, there were more vocal about their vested interest in the adoption of this blockchain technology (— and the company CEOs were old cypherpunks themselves).\n\nI don't think the lightning community has put so much years of works in getting a decentralized network of payment, with instant and private settlements, to fall into some very ill-designed\noff-chain construction, with a lot of trust in the LSP. If block inc is designing a product only for the US market, where there are legal framework in case of issues, it's better to be more verbose about it (-- I'm not going to say that Jack Dorsey's tweets are misleading between what he's saying and what block inc is really doing, but why TBD hasn't released yet a LSP ?).\n\nEdit: corrected  s/defamatory/misleading/g. it’s not the same.\n\nPersonally, I'm more interested in a decentralized network where a lambda user in El Salvador\nor Oman can pay another user in Seoul or Singapor, while relying only on the trust-minimized\nassumptions of the protocol. A protocol working well in war zones and developing countries,\nwhere there is not always a stable nation-state authority and a legal remedy is not an option.\n\n> Feel free to attack the actual Lightning Network to demonstrate the problem. Clearly, you believe:\n\nAs far as I know, I've never seen any CVE or responsible disclosure associated to your name in the bitcoin field. You might have done so in the past in another industry as an infosec researcher, and if so you're free to communicate such realizations.\n\nIn the lack of such information, I don't really think you're familiar with ethical disclosure as a security researcher when end-users money are at risk, and as such I'll let your naive remark\nhere. Sorry, not sorry.\n\n> If so, you can demonstrate this, today, with the actual Lightning Network.\n\nI don't think you're understanding how the \"Forced Expiration Spam\" laid out in the lightning whitepaper of 2015 characterize a systemic risk in a world where the bitcoin blockchain space is limited and the number of coins limited to 21 millions.\n\nLet's me re-give you an explanation.\n\nPost-segwit, blocks are limited to 4MB in weight units. Under current lightning protocol safety timelocks of 144 blocks in average and assuming commitment transactions of 300 weight units in average, the block chain can only process 13k channels per bloc. That means the blockchain can only process 2M of channel per day in the worst-case scenario of everyone force-closing at the same time.\n\nFailing to confirming on-time a commitment transaction and the corresponding HTLC-preimage or HTLC-timeout leads to loss of funds for one of the lightning counterparty.\n\nThis is the best scenario, I'm not considering fully charged lightning channels with `max_accepted_htlc` limits number of HTLCs, neither second-stage transactions and usage of lower than 144 blocks, as done in practice by lightning implementation. We have only 44k public channels in lightning today, though probably another order of magnitude of private channels, so ~500k. Massive force expiration spam could already be an issue for today's Lightning Network, if we see such forced expiration spam happening (or in other words a bank run).\n\nYour SuperScalar proposal, even if it does not implies a consensus change, only makes the problem worst, as now all the combinations of the full tree of transactions might have to be confirmed on-chain. Corresponding fee reserves have to be provisioned by the lightning routing nodes, or the end-users lightning wallet, who ever is paying the fee. So if you assume timeout tree with a k-factor of 2 and 8 users, that's 12 transactions that have been to confirm in the worst-case. 12 transactions, that's more than the 8 commitment transactions that have to be confirmed in the worst-case scenarios, rather than 8 commitment transactions, and there is no, or only small compression gain as the k-factor has to be materialized in the fan-out output at each intersection of your timeout tree.\n\nSo, I'll re-say what I've already said the SuperScalar construction is broken and only makes the systemic risk that is already happening with open lightning channels, in a world where the size of the block is statically limited. Pleasure to discuss the mathematics and the economics, if there is still some persistent wondering.\n\nI think that problem has been understood for years by many bitcoin protocol experts, and again it's described in the lightning whitepaper section 9.2",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 5,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}