{
  "id": 3397,
  "name": "",
  "username": "conduition",
  "avatar_template": "/user_avatar/delvingbitcoin.org/conduition/{size}/384_2.png",
  "created_at": "2024-10-22T19:51:57.030Z",
  "cooked": "<p>Hi <a class=\"mention\" href=\"/u/cryptoquick\">@cryptoquick</a>. Thank you for pushing for quantum-resistance! This is an extremely important long-term problem and we need smart people thinking about it today.</p>\n<p>However, we would be jumping the gun if we designed a soft-fork for quantum resistant addresses using today’s post-quantum signing algorithms. It seems likely to me that when a large-scale quantum computer eventually comes about, we will likely know much more about post-quantum signature schemes than we do today, even if that day comes as soon as 5 years from now (unlikely).</p>\n<p>I have an idea which I hope might help bitcoin users transition to post-quantum secure keys today, without any near-term consensus changes.</p>\n<p><a href=\"https://conduition.io/cryptography/quantum-hbs/\" rel=\"noopener nofollow ugc\">I spent the last month surveying the history and current landscape of hash-based signature (HBS) algorithms</a>. HBS algorithms are the most conservative but also the least practical option for post-quantum signatures. They’re conservative because HBS relies on even fewer cryptographic assumptions than Schnorr signatures, but they’re impractical because of large signature sizes (several kilobytes in most cases) and statefulness. Some algorithms are one-time signatures, so keys can only be used to safely sign a single message.</p>\n<p><a href=\"https://conduition.io/cryptography/quantum-hbs/#Upgrading-Bitcoin\" rel=\"noopener nofollow ugc\">At the end of the above article</a>, I describe a post-quantum upgrade plan I call “Digests as Secret Keys” (DASK). Instead of using BIP32 to derive a child key for a Bitcoin address, a DASK-supported wallet will do the following.</p>\n<ol>\n<li>From a seed value (e.g. BIP39), derive a secret key for a hash-based signature algorithm.</li>\n<li>Compute the corresponding HBS public key. If needed, hash the HBS public key into a 32-byte value (some HBS keys are already represented by a single hash).</li>\n<li>Interpret the HBS public key (hash) as an secp256k1 secret key.</li>\n<li>Compute the secp256k1 public key and use it for standard P2PKH/P2WPKH/P2TR spending</li>\n</ol>\n<p><img src=\"https://conduition.io/images/quantum-hbs/dask.svg\" width=\"662\" height=\"484\"></p>\n<p>When a viable QC is close at hand, the BItcoin network can activate a consensus rule change which disables ECDSA/Schnorr. Instead post-quantum bitcoin nodes would expect the spender to provide a signature using the <em>inner</em> HBS key, rather than the <em>outer</em> secp256k1 key.</p>\n<p>For more flexibility, the inner key will probably be used to <em>endorse</em> some other post-quantum signing key, which then signs the transaction using an algorithm which may not yet have been invented. As a result, the inner HBS key can use a one-time signature algorithm like <a href=\"https://conduition.io/cryptography/quantum-hbs/#Winternitz-One-Time-Signatures-WOTS\" rel=\"noopener nofollow ugc\">Winternitz OTS</a>, which has relatively small (1KB) signatures.</p>\n<p>The nice thing about the DASK approach is that we don’t need any consensus or scaling changes today. We kick the can down the road, giving cryptographers more time to design secure and efficient post-quantum algorithms, while retaining fallback authentication in case of sudden quantum advancements.</p>\n<p>Eventually yes, Bitcoin will need a first-class quantum-resistant address format for better scaling (HBS won’t work at large scale I think). But we shouldn’t standardize a PQ address format using one of today’s cutting-edge PQC algorithms, because the odds are that it will not age well through decades of attack and optimization.</p>\n<p>Instead we should use a tried and proven algorithm like WOTS as an emergency fallback, and choose a more efficient primary PQ signing scheme later, when it’s actually needed. The fallback HBS key format would need to be standardized today, but it would be only a client-side change with no consensus modifications needed until Q-Day.</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2024-10-22T19:51:57.030Z",
  "reply_count": 0,
  "reply_to_post_number": 2,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 5,
  "readers_count": 4,
  "score": 0.8,
  "yours": false,
  "topic_id": 956,
  "topic_slug": "proposing-a-p2qrh-bip-towards-a-quantum-resistant-soft-fork",
  "topic_title": "Proposing a P2QRH BIP towards a quantum resistant soft fork",
  "topic_html_title": "Proposing a P2QRH BIP towards a quantum resistant soft fork",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": "",
  "reply_to_user": {
    "username": "cryptoquick",
    "name": "Hunter Beast",
    "avatar_template": "/user_avatar/delvingbitcoin.org/cryptoquick/{size}/55_2.png"
  },
  "bookmarked": false,
  "raw": "Hi @cryptoquick. Thank you for pushing for quantum-resistance! This is an extremely important long-term problem and we need smart people thinking about it today.\n\nHowever, we would be jumping the gun if we designed a soft-fork for quantum resistant addresses using today's post-quantum signing algorithms. It seems likely to me that when a large-scale quantum computer eventually comes about, we will likely know much more about post-quantum signature schemes than we do today, even if that day comes as soon as 5 years from now (unlikely).\n\nI have an idea which I hope might help bitcoin users transition to post-quantum secure keys today, without any near-term consensus changes.\n\n[I spent the last month surveying the history and current landscape of hash-based signature (HBS) algorithms](https://conduition.io/cryptography/quantum-hbs/). HBS algorithms are the most conservative but also the least practical option for post-quantum signatures. They're conservative because HBS relies on even fewer cryptographic assumptions than Schnorr signatures, but they're impractical because of large signature sizes (several kilobytes in most cases) and statefulness. Some algorithms are one-time signatures, so keys can only be used to safely sign a single message.\n\n[At the end of the above article](https://conduition.io/cryptography/quantum-hbs/#Upgrading-Bitcoin), I describe a post-quantum upgrade plan I call \"Digests as Secret Keys\" (DASK). Instead of using BIP32 to derive a child key for a Bitcoin address, a DASK-supported wallet will do the following.\n\n1. From a seed value (e.g. BIP39), derive a secret key for a hash-based signature algorithm.\n2. Compute the corresponding HBS public key. If needed, hash the HBS public key into a 32-byte value (some HBS keys are already represented by a single hash).\n3. Interpret the HBS public key (hash) as an secp256k1 secret key.\n4. Compute the secp256k1 public key and use it for standard P2PKH/P2WPKH/P2TR spending\n\n<img src=\"https://conduition.io/images/quantum-hbs/dask.svg\">\n\nWhen a viable QC is close at hand, the BItcoin network can activate a consensus rule change which disables ECDSA/Schnorr. Instead post-quantum bitcoin nodes would expect the spender to provide a signature using the _inner_ HBS key, rather than the _outer_ secp256k1 key.\n\nFor more flexibility, the inner key will probably be used to _endorse_ some other post-quantum signing key, which then signs the transaction using an algorithm which may not yet have been invented. As a result, the inner HBS key can use a one-time signature algorithm like [Winternitz OTS](https://conduition.io/cryptography/quantum-hbs/#Winternitz-One-Time-Signatures-WOTS), which has relatively small (1KB) signatures. \n\nThe nice thing about the DASK approach is that we don't need any consensus or scaling changes today. We kick the can down the road, giving cryptographers more time to design secure and efficient post-quantum algorithms, while retaining fallback authentication in case of sudden quantum advancements.\n\nEventually yes, Bitcoin will need a first-class quantum-resistant address format for better scaling (HBS won't work at large scale I think). But we shouldn't standardize a PQ address format using one of today's cutting-edge PQC algorithms, because the odds are that it will not age well through decades of attack and optimization. \n\nInstead we should use a tried and proven algorithm like WOTS as an emergency fallback, and choose a more efficient primary PQ signing scheme later, when it's actually needed. The fallback HBS key format would need to be standardized today, but it would be only a client-side change with no consensus modifications needed until Q-Day.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 129,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}