{
  "id": 3331,
  "name": "Misha Komarov",
  "username": "MishaKomarov",
  "avatar_template": "/letter_avatar_proxy/v4/letter/m/e95f7d/{size}.png",
  "created_at": "2024-10-07T20:23:33.510Z",
  "cooked": "<h1><a name=\"p-3331-bitcoin-pipes-covenants-on-bitcoin-without-soft-fork-1\" class=\"anchor\" href=\"#p-3331-bitcoin-pipes-covenants-on-bitcoin-without-soft-fork-1\"></a><strong>Bitcoin PIPEs: Covenants on Bitcoin Without Soft Fork</strong></h1>\n<h2><a name=\"p-3331-introduction-2\" class=\"anchor\" href=\"#p-3331-introduction-2\"></a>Introduction</h2>\n<p>This post introduces Bitcoin PIPEs (covenants via Polynomial Inner Product Encryption (FH-MIPE)) as a practical approach to implementing covenants on for Bitcoin without requiring a soft fork.</p>\n<p>Covenants provide a way to enhance Bitcoin’s capabilities by allowing users to set specific rules on how their coins can be spent in the future.</p>\n<p>With covenants, Bitcoin can unlock a range of advanced features:</p>\n<ul>\n<li><strong>Advanced spending rules</strong>: Users could restrict coins to be spent only at specific addresses or after certain conditions, such as a delay in time.</li>\n<li><strong>New use cases</strong>: Covenants, for example, enable the native verification of Zero-Knowledge Proofs (ZKPs), native tokens with complex behaviors, and even restaking mechanisms to pool Bitcoin and help secure other networks.</li>\n</ul>\n<p>Covenants can make Bitcoin much more versatile but require upgrades to the network, making them increasingly unlikely.</p>\n<p><strong>Polynomial Inner Product Encryption (PIPE (FH-MIPE))</strong> is a cryptographic technique that enables developers to implement advanced covenants without altering Bitcoin’s core protocol. It is possible to emulate missing opcodes (e.g. <code>OP_CAT</code> or <code>OP_CTV</code>) via establishing a PIPE for a particular opcode desired, avoiding the need for a soft fork or the use of trusted solutions.</p>\n<p>With PIPEs, Bitcoin can support:</p>\n<ul>\n<li><strong>Complex transaction conditions</strong>: Enabling multiple steps or conditions before transaction is processed/funds are released.</li>\n<li><strong>Efficient batch transactions</strong>: Predefining transaction templates to save space and reduce fees.</li>\n<li><strong>Scalable cryptographic proofs</strong>: Facilitating Zero-Knowledge Proofs, which improve Bitcoin’s scalability and performance.</li>\n</ul>\n<p>Bitcoin PIPEs offer a way to introduce powerful new features to Bitcoin without the risks of a soft fork or changing its core protocol. We hope to open the door to a more advanced and functional era for Bitcoin.</p>\n<h2><a name=\"p-3331-preliminaries-3\" class=\"anchor\" href=\"#p-3331-preliminaries-3\"></a>Preliminaries</h2>\n<p>Bitcoin’s scripting language is known for its simplicity and security. However, this simplicity comes with limitations, particularly when it comes to handling complex transaction types or advanced cryptographic operations.</p>\n<p>To address these limitations, covenants have been proposed as a way to extend Bitcoin’s scripting capabilities. Covenants allow users to impose specific conditions on how bitcoins can be spent in the future, offering greater flexibility and control.</p>\n<p>Covenants enhance Bitcoin’s functionality by enabling more complex transaction rules, allowing for use cases that are currently impossible to implement with the existing scripting language.</p>\n<p>Covenants can be applied to various scenarios, both simple and complex, to enhance security, privacy, and functionality in the Bitcoin ecosystem.</p>\n<ul>\n<li><strong>Advanced Transaction Structuring with <code>OP_CAT</code>:</strong>  <code>OP_CAT</code>  allows for the concatenation of two or more elements on the stack, enabling more complex transaction structures. For example, <code>OP_CAT</code> could be used to combine a user’s address with a unique identifier, ensuring that the transaction is only valid if the combined data matches a specific pattern.</li>\n<li><strong>Batch Payments and Congestion Control with <code>OP_CTV</code>:</strong> The CheckTemplateVerify (<code>OP_CTV</code>) opcode allows users to predefine a specific set of transaction outputs, ensuring that a transaction can only be executed if it matches this predefined template. This reduces the need for multiple individual transactions, lowering fees and reducing network congestion.</li>\n<li><strong>Restaking Mechanisms:</strong> Covenants could be used to enable restaking, where users can lock up their bitcoins to participate in staking-like mechanisms without needing to move their funds off-chain. For example, a covenant could be designed to define a slashing condition for a protocol - a withdrawal can be enabled only in case the covenant is not satisfied.</li>\n<li><strong>ZKP Verification (zkRollup Support):</strong> Zero-Knowledge Rollups (zkRollups) are a scaling solution that aggregates many computations into a single proof, which is then submitted to the blockchain. Covenants could be designed to enforce that only transactions within a zkRollup are valid, ensuring that large numbers of transactions can be processed off-chain while maintaining security on-chain.</li>\n</ul>\n<h2><a name=\"p-3331-bitcoin-pipe-covenants-via-polynomial-inner-product-encryption-4\" class=\"anchor\" href=\"#p-3331-bitcoin-pipe-covenants-via-polynomial-inner-product-encryption-4\"></a><strong>Bitcoin PIPE: Covenants via Polynomial Inner Product Encryption</strong></h2>\n<p><strong>We present Polynomial Inner Product Encryption (PIPE) as an efficient solution to unlocking the benefits of covenants without requiring any changes to the network’s consensus rules.</strong></p>\n<p>One of the challenges in enhancing Bitcoin’s scripting capabilities is the absence of certain opcodes that would enable more complex and powerful transaction logic. Bitcoin PIPEs (Polynomial Inner Product Encryption) emulates these missing opcodes without requiring changes to Bitcoin’s core protocol, allowing developers to create sophisticated covenants without the need for soft forks or increased trust assumptions.</p>\n<h3><a name=\"p-3331-what-is-bitcoin-pipe-5\" class=\"anchor\" href=\"#p-3331-what-is-bitcoin-pipe-5\"></a>What is Bitcoin PIPE?</h3>\n<p>Polynomial Inner Product Encryption (PIPE) is a FH-MIPE (full-hiding multi-input inner product encryption) scheme that enables the creation of predicates - logical statements that can sign Bitcoin transactions using the encrypted signing key in case certain logic is satisfied without revealing the key itself.</p>\n<p>By embedding IPA-based proof system verifier inside of FH-MIPE inner product computation process, it is, for example, possible to enforce the execution of complex logic and emulate the behavior of missing opcodes, such as <code>OP_CAT</code> (which concatenates elements on the stack) or <code>OP_CTV</code> (which predefines specific transaction templates).</p>\n<p>Bitcoin PIPE allows transactions to be signed with Schnorr signatures (Taproot signatures), without the need for protocol upgrades or new opcodes in case the verification was completed successfully.</p>\n<p>Besides emulating opcodes, Bitcoin PIPEs can be defined to be much more complicated than trivial opcode’s logic:</p>\n<ul>\n<li><strong>Application-Specific Covenants</strong>: Through defining a PIPE, developers can craft covenants tailored to specific applications, like enforcing cryptographic proofs (e.g., zero-knowledge proofs) within transactions.</li>\n<li><strong>Enhancing Bitcoin’s Programmability</strong>: A key advantage of Bitcoin PIPEs is that it enhances the Bitcoin programmability without the need for protocol changes or additional trust assumptions. This means that developers can introduce more sophisticated logic and conditions into their transactions without waiting for consensus on new opcodes or the use of less secure solutions (sidechains).</li>\n</ul>\n<h3><a name=\"p-3331-bitcoin-pipes-architecture-6\" class=\"anchor\" href=\"#p-3331-bitcoin-pipes-architecture-6\"></a>Bitcoin PIPEs Architecture</h3>\n<p>Bitcoin PIPE acts as an off-chain FH-MIPE-based processor of an encrypted transaction signing key, which yields a signature in case the predicate logic is satisfied (e.g. a zk-proof is verified or a concatenation is done correctly).</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/1X/10fce2726de8dc6182868b9d9c0c412823896da3.jpeg\" data-download-href=\"https://delvingbitcoin.org/uploads/default/10fce2726de8dc6182868b9d9c0c412823896da3\" title=\"Screenshot 2024-10-07 at 4.24.59 PM\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/1X/10fce2726de8dc6182868b9d9c0c412823896da3_2_690x460.jpeg\" alt=\"Screenshot 2024-10-07 at 4.24.59 PM\" data-base62-sha1=\"2qhrpNtDuOATOQPEnKN97Wgu9Tt\" width=\"690\" height=\"460\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/1X/10fce2726de8dc6182868b9d9c0c412823896da3_2_690x460.jpeg, https://delvingbitcoin.org/uploads/default/optimized/1X/10fce2726de8dc6182868b9d9c0c412823896da3_2_1035x690.jpeg 1.5x, https://delvingbitcoin.org/uploads/default/optimized/1X/10fce2726de8dc6182868b9d9c0c412823896da3_2_1380x920.jpeg 2x\" data-dominant-color=\"3A3A3A\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">Screenshot 2024-10-07 at 4.24.59 PM</span><span class=\"informations\">1408×940 80.9 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p>Image 1: Usage Workflow</p>\n<h3><a name=\"p-3331-bitcoin-pipe-setup-7\" class=\"anchor\" href=\"#p-3331-bitcoin-pipe-setup-7\"></a>Bitcoin PIPE Setup</h3>\n<ol>\n<li>Define a functionality desired to be executed before the transaction happens.</li>\n<li>Create a zero-knowledge proof (ZKP) to prove execution of computations desired.</li>\n<li>Perform a DKG/Encryption phase for the address which a PIPE (Covenant) is supposed to restrict.</li>\n<li>Submit PIPE ciphertext as a Taproot transaction into Bitcoin (inscription-alike mechanics).</li>\n</ol>\n<h3><a name=\"p-3331-bitcoin-pipe-usage-8\" class=\"anchor\" href=\"#p-3331-bitcoin-pipe-usage-8\"></a>Bitcoin PIPE Usage</h3>\n<ol>\n<li>Retrieve a ciphertext and a decryption key from a PIPE inscription.</li>\n<li>Prepare the transaction data for signing.</li>\n<li>Put the transaction through the PIPE decryption functionality execution.</li>\n<li>If a transaction doesn’t violate the application logic desired, then a PIPE will produce a signed Taproot transaction.</li>\n<li>Submit the transaction to Bitcoin.</li>\n</ol>\n<p>A PIPE being set up this way (as an example) represents non-custodial storage for Bitcoin which allows withdrawals in case certain application logic conditions are satisfied.</p>\n<h3><a name=\"p-3331-security-assumptions-9\" class=\"anchor\" href=\"#p-3331-security-assumptions-9\"></a>Security Assumptions</h3>\n<p>Since existing conceptual frameworks for enhancing Bitcoin’s functionality and enabling complex, programmable transactions rely on trust-minimized (not fully trustless) systems or social consensus for protocol changes, it is important to further minimize trust assumptions for Bitcoin PIPEs.</p>\n<p>Given the need to eliminate trust assumptions as much as possible, Bitcoin PIPEs become effectively trustless after completion of a one-time trusted setup (DKG), which brings trust assumptions to 1-out-of-n for each new covenant creation. In other words, so long as one participant behaves honestly the system is secure. To clarify, Bitcoin PIPEs do not rely on moving assets off-chain (i.e. no required use of bridging or sidechains), custodians (or custodian chains), or multi-signatures.</p>\n<h2><a name=\"p-3331-conclusion-10\" class=\"anchor\" href=\"#p-3331-conclusion-10\"></a><strong>Conclusion</strong></h2>\n<p>Bitcoin covenants, made possible by PIPEs, represent a significant leap forward in Bitcoin’s evolution. This provides a method to introduce complex, secure, and flexible transaction rules without the need for consensus on new opcodes or soft forks. This approach not only preserves Bitcoin’s foundational principles, but also significantly broadens its functional horizon, making it ready for more advanced financial and contractual applications while maintaining its core security and simplicity.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-10-07T20:25:10.452Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 38,
  "reads": 6,
  "readers_count": 5,
  "score": 181.2,
  "yours": false,
  "topic_id": 1183,
  "topic_slug": "bitcoin-pipes-introducting-covenants-without-soft-forks",
  "topic_title": "Bitcoin PIPEs: Introducting Covenants without Soft Forks",
  "topic_html_title": "Bitcoin PIPEs: Introducting Covenants without Soft Forks",
  "category_id": 7,
  "display_username": "Misha Komarov",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "# **Bitcoin PIPEs: Covenants on Bitcoin Without Soft Fork**\n\n## Introduction\n\nThis post introduces Bitcoin PIPEs (covenants via Polynomial Inner Product Encryption (FH-MIPE)) as a practical approach to implementing covenants on for Bitcoin without requiring a soft fork.\n\nCovenants provide a way to enhance Bitcoin’s capabilities by allowing users to set specific rules on how their coins can be spent in the future.\n\nWith covenants, Bitcoin can unlock a range of advanced features:\n\n- **Advanced spending rules**: Users could restrict coins to be spent only at specific addresses or after certain conditions, such as a delay in time.\n- **New use cases**: Covenants, for example, enable the native verification of Zero-Knowledge Proofs (ZKPs), native tokens with complex behaviors, and even restaking mechanisms to pool Bitcoin and help secure other networks.\n\nCovenants can make Bitcoin much more versatile but require upgrades to the network, making them increasingly unlikely.\n\n**Polynomial Inner Product Encryption (PIPE (FH-MIPE))** is a cryptographic technique that enables developers to implement advanced covenants without altering Bitcoin’s core protocol. It is possible to emulate missing opcodes (e.g. `OP_CAT` or `OP_CTV`) via establishing a PIPE for a particular opcode desired, avoiding the need for a soft fork or the use of trusted solutions.\n\nWith PIPEs, Bitcoin can support:\n\n- **Complex transaction conditions**: Enabling multiple steps or conditions before transaction is processed/funds are released.\n- **Efficient batch transactions**: Predefining transaction templates to save space and reduce fees.\n- **Scalable cryptographic proofs**: Facilitating Zero-Knowledge Proofs, which improve Bitcoin's scalability and performance.\n\nBitcoin PIPEs offer a way to introduce powerful new features to Bitcoin without the risks of a soft fork or changing its core protocol. We hope to open the door to a more advanced and functional era for Bitcoin.\n\n## Preliminaries\n\nBitcoin’s scripting language is known for its simplicity and security. However, this simplicity comes with limitations, particularly when it comes to handling complex transaction types or advanced cryptographic operations. \n\nTo address these limitations, covenants have been proposed as a way to extend Bitcoin's scripting capabilities. Covenants allow users to impose specific conditions on how bitcoins can be spent in the future, offering greater flexibility and control.\n\nCovenants enhance Bitcoin's functionality by enabling more complex transaction rules, allowing for use cases that are currently impossible to implement with the existing scripting language. \n\nCovenants can be applied to various scenarios, both simple and complex, to enhance security, privacy, and functionality in the Bitcoin ecosystem.\n\n- **Advanced Transaction Structuring with `OP_CAT`:**  `OP_CAT`  allows for the concatenation of two or more elements on the stack, enabling more complex transaction structures. For example, `OP_CAT` could be used to combine a user’s address with a unique identifier, ensuring that the transaction is only valid if the combined data matches a specific pattern.\n- **Batch Payments and Congestion Control with `OP_CTV`:** The CheckTemplateVerify (`OP_CTV`) opcode allows users to predefine a specific set of transaction outputs, ensuring that a transaction can only be executed if it matches this predefined template. This reduces the need for multiple individual transactions, lowering fees and reducing network congestion.\n- **Restaking Mechanisms:** Covenants could be used to enable restaking, where users can lock up their bitcoins to participate in staking-like mechanisms without needing to move their funds off-chain. For example, a covenant could be designed to define a slashing condition for a protocol - a withdrawal can be enabled only in case the covenant is not satisfied.\n- **ZKP Verification (zkRollup Support):** Zero-Knowledge Rollups (zkRollups) are a scaling solution that aggregates many computations into a single proof, which is then submitted to the blockchain. Covenants could be designed to enforce that only transactions within a zkRollup are valid, ensuring that large numbers of transactions can be processed off-chain while maintaining security on-chain.\n\n## **Bitcoin PIPE: Covenants via Polynomial Inner Product Encryption**\n\n**We present Polynomial Inner Product Encryption (PIPE) as an efficient solution to unlocking the benefits of covenants without requiring any changes to the network’s consensus rules.**\n\nOne of the challenges in enhancing Bitcoin’s scripting capabilities is the absence of certain opcodes that would enable more complex and powerful transaction logic. Bitcoin PIPEs (Polynomial Inner Product Encryption) emulates these missing opcodes without requiring changes to Bitcoin’s core protocol, allowing developers to create sophisticated covenants without the need for soft forks or increased trust assumptions.\n\n### What is Bitcoin PIPE?\n\nPolynomial Inner Product Encryption (PIPE) is a FH-MIPE (full-hiding multi-input inner product encryption) scheme that enables the creation of predicates - logical statements that can sign Bitcoin transactions using the encrypted signing key in case certain logic is satisfied without revealing the key itself.\n\nBy embedding IPA-based proof system verifier inside of FH-MIPE inner product computation process, it is, for example, possible to enforce the execution of complex logic and emulate the behavior of missing opcodes, such as `OP_CAT` (which concatenates elements on the stack) or `OP_CTV` (which predefines specific transaction templates).\n\nBitcoin PIPE allows transactions to be signed with Schnorr signatures (Taproot signatures), without the need for protocol upgrades or new opcodes in case the verification was completed successfully.\n\nBesides emulating opcodes, Bitcoin PIPEs can be defined to be much more complicated than trivial opcode’s logic:\n\n- **Application-Specific Covenants**: Through defining a PIPE, developers can craft covenants tailored to specific applications, like enforcing cryptographic proofs (e.g., zero-knowledge proofs) within transactions.\n- **Enhancing Bitcoin's Programmability**: A key advantage of Bitcoin PIPEs is that it enhances the Bitcoin programmability without the need for protocol changes or additional trust assumptions. This means that developers can introduce more sophisticated logic and conditions into their transactions without waiting for consensus on new opcodes or the use of less secure solutions (sidechains).\n\n### Bitcoin PIPEs Architecture\n\nBitcoin PIPE acts as an off-chain FH-MIPE-based processor of an encrypted transaction signing key, which yields a signature in case the predicate logic is satisfied (e.g. a zk-proof is verified or a concatenation is done correctly).\n\n![Screenshot 2024-10-07 at 4.24.59 PM|690x460](upload://2qhrpNtDuOATOQPEnKN97Wgu9Tt.jpeg)\n\nImage 1: Usage Workflow\n\n### Bitcoin PIPE Setup\n\n1. Define a functionality desired to be executed before the transaction happens.\n2. Create a zero-knowledge proof (ZKP) to prove execution of computations desired.\n3. Perform a DKG/Encryption phase for the address which a PIPE (Covenant) is supposed to restrict.\n4. Submit PIPE ciphertext as a Taproot transaction into Bitcoin (inscription-alike mechanics).\n\n### Bitcoin PIPE Usage\n\n1. Retrieve a ciphertext and a decryption key from a PIPE inscription.\n2. Prepare the transaction data for signing.\n3. Put the transaction through the PIPE decryption functionality execution.\n4. If a transaction doesn’t violate the application logic desired, then a PIPE will produce a signed Taproot transaction.\n5. Submit the transaction to Bitcoin.\n\nA PIPE being set up this way (as an example) represents non-custodial storage for Bitcoin which allows withdrawals in case certain application logic conditions are satisfied.\n\n### Security Assumptions\n\nSince existing conceptual frameworks for enhancing Bitcoin’s functionality and enabling complex, programmable transactions rely on trust-minimized (not fully trustless) systems or social consensus for protocol changes, it is important to further minimize trust assumptions for Bitcoin PIPEs. \n\nGiven the need to eliminate trust assumptions as much as possible, Bitcoin PIPEs become effectively trustless after completion of a one-time trusted setup (DKG), which brings trust assumptions to 1-out-of-n for each new covenant creation. In other words, so long as one participant behaves honestly the system is secure. To clarify, Bitcoin PIPEs do not rely on moving assets off-chain (i.e. no required use of bridging or sidechains), custodians (or custodian chains), or multi-signatures.\n\n## **Conclusion**\n\nBitcoin covenants, made possible by PIPEs, represent a significant leap forward in Bitcoin's evolution. This provides a method to introduce complex, secure, and flexible transaction rules without the need for consensus on new opcodes or soft forks. This approach not only preserves Bitcoin's foundational principles, but also significantly broadens its functional horizon, making it ready for more advanced financial and contractual applications while maintaining its core security and simplicity.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 556,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}