{
  "id": 542,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/3_2.png",
  "created_at": "2023-12-02T09:22:53.113Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"ZmnSCPxj\" data-post=\"11\" data-topic=\"22\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/z/ee7513/48.png\" class=\"avatar\"> ZmnSCPxj:</div>\n<blockquote>\n<p>It does not make sense to me economically. Like, who is obligated to follow the government-mandated rate, and how is that exchange rate enforced within the economy?</p>\n</blockquote>\n</aside>\n<p>Depends how transactions are made. If you’re paying via lightning; you see an offer to sell for $5, your wallet translates that to 125 bits, you send a payment for that amount, and you receive a receipt acknowledging your purchase. If the merchant wants to use a different exchange rate, trying to pretend $5 actually means 180 bits, the only thing they can do is reject your payment.</p>\n<p>If you’re paying via visa/etc that’s based in dollars and hides all the BTC conversions from you, then it’s enforced by the bank, and both merchant and purchaser trust the bank to not cheat them too badly, pretty much same as they do today, with enforcement after the fact by the courts for breach of contract.</p>\n<p>But if you don’t want to price things in dollars, you don’t have to. And your lightning wallet can always translate prices in BTC (or euros, etc) to the equivalent in dollars just as a UI feature.</p>\n<aside class=\"quote no-group\" data-username=\"ZmnSCPxj\" data-post=\"11\" data-topic=\"22\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/z/ee7513/48.png\" class=\"avatar\"> ZmnSCPxj:</div>\n<blockquote>\n<p>Now today the government announces a change to 1250 USD / BTC. I show up with my BTC. Where do I get my USDs now? I</p>\n</blockquote>\n</aside>\n<p>There are no USDs, your BTC is just now worth 25% more than it was yesterday, and buys 25% more goods than it did yesterday, assuming those goods were priced in dollars, and their prices haven’t been increased overnight.</p>\n<aside class=\"quote no-group\" data-username=\"ZmnSCPxj\" data-post=\"11\" data-topic=\"22\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/z/ee7513/48.png\" class=\"avatar\"> ZmnSCPxj:</div>\n<blockquote>\n<p>There has to be <em>some</em> entity that is able to construct new USD (and destroy USD</p>\n</blockquote>\n</aside>\n<aside class=\"quote no-group quote-modified\" data-username=\"ZmnSCPxj\" data-post=\"11\" data-topic=\"22\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/z/ee7513/48.png\" class=\"avatar\"> ZmnSCPxj:</div>\n<blockquote>\n<p>I can still get economic advantage … by buying whichever one is going to become more valued,</p>\n</blockquote>\n</aside>\n<p>Again, in this model there is no physical (or digital) USD to be constructed or bought or sold; it’s just a different way of looking at BTC. Changing the exchange rate doesn’t create or destroy anything, it just changes the default pricing for future transactions.</p>\n<p>It’s certainly fair to criticise trying to set <a href=\"https://en.wikipedia.org/wiki/Fixed_exchange_rate_system#Disadvantages\">a fixed exchange rate</a> on a currency that you mint, and I agree with those criticisms; but it’s not what I’m talking about here.</p>\n<p>There are a bunch of completely fair criticisms of what I am talking about that could be made, eg:</p>\n<ul>\n<li>It’s entirely possible that such a scheme can’t be implemented (you need to know today’s exchange rate today, but will only have the CPI data you want to base that figure on after collating surveys in a few months’ time).</li>\n<li>It might be that even if it were implemented it would be subject to capture (eg, lenders corrupt the CPI data and manipulate it so that they make more income from BTC-denominated loans while their dollar-denominated expenses stay constant; or net-borrowers do the same in the other direction).</li>\n<li>It might be that nobody outside of macroeconmic theorists actually care that much about the problem this is solving, and post-hyperbitcoinization, people just price things in BTC directly and aren’t bothered by updating salaries/prices directly as the real value of BTC spikes or plummets.</li>\n<li>It might be that whether or not this is a real problem, the real motivation for a central bank managing inflation is the Cantillon effect, so anything that does away with that isn’t interesting anyway, no matter how well it solves other problems.</li>\n</ul>",
  "post_number": 12,
  "post_type": 1,
  "updated_at": "2023-12-02T09:22:53.113Z",
  "reply_count": 0,
  "reply_to_post_number": 11,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 2,
  "readers_count": 1,
  "score": 0.4,
  "yours": false,
  "topic_id": 22,
  "topic_slug": "deflationary-money-is-a-good-thing",
  "topic_title": "Deflationary money is a Good Thing",
  "topic_html_title": "Deflationary money is a Good Thing",
  "category_id": 5,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"ZmnSCPxj, post:11, topic:22\"]\nIt does not make sense to me economically. Like, who is obligated to follow the government-mandated rate, and how is that exchange rate enforced within the economy?\n[/quote]\n\nDepends how transactions are made. If you're paying via lightning; you see an offer to sell for $5, your wallet translates that to 125 bits, you send a payment for that amount, and you receive a receipt acknowledging your purchase. If the merchant wants to use a different exchange rate, trying to pretend $5 actually means 180 bits, the only thing they can do is reject your payment.\n\nIf you're paying via visa/etc that's based in dollars and hides all the BTC conversions from you, then it's enforced by the bank, and both merchant and purchaser trust the bank to not cheat them too badly, pretty much same as they do today, with enforcement after the fact by the courts for breach of contract.\n\nBut if you don't want to price things in dollars, you don't have to. And your lightning wallet can always translate prices in BTC (or euros, etc) to the equivalent in dollars just as a UI feature.\n\n[quote=\"ZmnSCPxj, post:11, topic:22\"]\nNow today the government announces a change to 1250 USD / BTC. I show up with my BTC. Where do I get my USDs now? I\n[/quote]\n\nThere are no USDs, your BTC is just now worth 25% more than it was yesterday, and buys 25% more goods than it did yesterday, assuming those goods were priced in dollars, and their prices haven't been increased overnight.\n\n[quote=\"ZmnSCPxj, post:11, topic:22\"]\nThere has to be *some* entity that is able to construct new USD (and destroy USD\n[/quote]\n\n[quote=\"ZmnSCPxj, post:11, topic:22\"]\nI can still get economic advantage ... by buying whichever one is going to become more valued,\n[/quote]\n\nAgain, in this model there is no physical (or digital) USD to be constructed or bought or sold; it's just a different way of looking at BTC. Changing the exchange rate doesn't create or destroy anything, it just changes the default pricing for future transactions.\n\nIt's certainly fair to criticise trying to set [a fixed exchange rate](https://en.wikipedia.org/wiki/Fixed_exchange_rate_system#Disadvantages) on a currency that you mint, and I agree with those criticisms; but it's not what I'm talking about here.\n\nThere are a bunch of completely fair criticisms of what I am talking about that could be made, eg:\n * It's entirely possible that such a scheme can't be implemented (you need to know today's exchange rate today, but will only have the CPI data you want to base that figure on after collating surveys in a few months' time).\n * It might be that even if it were implemented it would be subject to capture (eg, lenders corrupt the CPI data and manipulate it so that they make more income from BTC-denominated loans while their dollar-denominated expenses stay constant; or net-borrowers do the same in the other direction).\n * It might be that nobody outside of macroeconmic theorists actually care that much about the problem this is solving, and post-hyperbitcoinization, people just price things in BTC directly and aren't bothered by updating salaries/prices directly as the real value of BTC spikes or plummets.\n * It might be that whether or not this is a real problem, the real motivation for a central bank managing inflation is the Cantillon effect, so anything that does away with that isn't interesting anyway, no matter how well it solves other problems.",
  "actions_summary": [],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}