{
  "id": 852,
  "name": "Pieter Wuille",
  "username": "sipa",
  "avatar_template": "/user_avatar/delvingbitcoin.org/sipa/{size}/102_2.png",
  "created_at": "2023-12-22T19:37:48.740Z",
  "cooked": "<p>Interesting!</p>\n<p>When suggesting the “fee estimation should use chunk feerates”, I had imagined it would just use our mempool’s clusters/chunks to determine those values.</p>\n<p>But you’re right to point out that clustering/linearizing/chunking the block itself may yield different values. When cluster inclusion in a block doesn’t match “all chunks up to x” for some chunk x, the chunk feerates can differ. I’m not sure what to do about that.</p>\n<ul>\n<li>The miner may simply not have had the same mempool as us, and it might be incorrect to use our own prediction for their behavior.</li>\n<li>On the other hand, we also shouldn’t introduce a means for miners to influence our estimates unfairly - if they can cause our estimates to be off (significantly) by excluding some transactions, that may be an issue.</li>\n<li>As you point out, we may not be able to discern the clusters/chunks miners used. Our (re)linearization of the block’s clusters may differ from their (it could be worse, but it could be better too). And at least initially post-cluster-mempool we may make mistakes by treating blocks as being cluster-mempool-based while miners use older or custom logic.</li>\n</ul>\n<p>I think overall, it’s probably best to initially use our own (mempool) chunk feerate estimates (at the time the block is found). Our mempool is our best prediction of what the next block will be, so we should assume miners have access to it even though that’s not always exactly true.</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2023-12-22T19:37:48.740Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 2,
  "reads": 13,
  "readers_count": 12,
  "score": 27.6,
  "yours": false,
  "topic_id": 312,
  "topic_slug": "package-aware-fee-estimator-post-cluster-mempool",
  "topic_title": "Package aware Fee estimator post cluster mempool",
  "topic_html_title": "Package aware Fee estimator post cluster mempool",
  "category_id": 8,
  "display_username": "Pieter Wuille",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Interesting!\n\nWhen suggesting the \"fee estimation should use chunk feerates\", I had imagined it would just use our mempool's clusters/chunks to determine those values.\n\nBut you're right to point out that clustering/linearizing/chunking the block itself may yield different values. When cluster inclusion in a block doesn't match \"all chunks up to x\" for some chunk x, the chunk feerates can differ. I'm not sure what to do about that.\n* The miner may simply not have had the same mempool as us, and it might be incorrect to use our own prediction for their behavior.\n* On the other hand, we also shouldn't introduce a means for miners to influence our estimates unfairly - if they can cause our estimates to be off (significantly) by excluding some transactions, that may be an issue.\n* As you point out, we may not be able to discern the clusters/chunks miners used. Our (re)linearization of the block's clusters may differ from their (it could be worse, but it could be better too). And at least initially post-cluster-mempool we may make mistakes by treating blocks as being cluster-mempool-based while miners use older or custom logic.\n\nI think overall, it's probably best to initially use our own (mempool) chunk feerate estimates (at the time the block is found). Our mempool is our best prediction of what the next block will be, so we should assume miners have access to it even though that's not always exactly true.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 96,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false
}