{
  "id": 534,
  "name": "ZmnSCPxj jxPCSnmZ",
  "username": "ZmnSCPxj",
  "avatar_template": "/letter_avatar_proxy/v4/letter/z/ee7513/{size}.png",
  "created_at": "2023-12-01T14:44:59.078Z",
  "cooked": "<p>Currently, Lightning Network onion messages are intended to be rate-limited, possibly with backpressure.</p>\n<p>An issue is that OM is specified as being unreliable.  This means that it quite valid for a highly-pressured node to simply drop onion messages and never forward them. Now, OM has an advantage over Tor: individual messages are not necessarily correlatable with each other, whereas since Tor emulates a TCP tunnel, messages coming over the same TCP tunnel are correlatable by third parties (the entry and exit nodes) as belonging to the same underlying communications.  While you CAN reduce this with Tor, this requires that you open a new TCP-over-Tor tunnel, send a single message (and possibly wait for a single response) then close it, preferably changing circuits each time.</p>\n<p>With OM, a node that is a full routing participant on the LN can have many multiple paths to send OMs to anything it wants to talk to, and to get responses back.  In particular, in protocols that are naturally request-response, the response circuit can be different from the request circuit.</p>\n<p>However, consider the case where a node is a client of an LSP.  In this environment, usually the client only has channels (or promises of a channel, such as by a pending JIT channel open) with only that single LSP, because the whole point of the LSP/client divide is so that liquidity management is done by the LSP on behalf of the client.  But this implies that the client has limited access to send and receive OMs.  Yes, it could connect to a random node on the LN and send out an OM via that, but this is likely to get rate-limited or just dropped. and it certainly cannot receive over that random node.  If the client always sends out OMs via its sole LSP, then the LSP has all the information on the timing of OMs to and from that client, which the LSP may be able to correlate with other activity (for instance, if watchtowers are contacted over OM, the LSP might note if some client never sends out an OM and attempt to steal from them while they are offline).</p>\n<p>So I was wondering if random routing nodes can also provide OM-mixer services.  This is basically just an additional paid service by which a client can send an OM to a different routing node, hopefully one which has good OM-bandwidth with its peers.</p>\n<p>So an OM-mixer might provide tokens in a WabiSabi credential in exchange for money.  Then the client can connect to the OM-mixer (possibly with a different node ID and hopefully via a different IP(???)) and then spend some of the tokens in the WabiSabi credential, in order to send and receive messages (to receive messages, the client would register a short-lived synthetic SCID by which it can receive messages and which it can put in the <code>reply_path</code>).</p>\n<p>Additionally the OM-mixer might give hints to the client on which outgoing/incoming SCIDs are currently not getting used for OMs recently. As noted, the expectation is that nodes will rate-limit incoming OMs to be forwarded and thus the OM-mixer might have been used to forward some message over some common path, and the OM-mixer could advise the client “actually use this path out of me instead” to improve the chances that the client OM will reach its destination.  Similarly for receive paths, the OM-mixer could hint if some incoming path is currently not near the rate-limit the OM-server has, so that the client can build a <code>reply_path</code> that does not increase the rate at which OMs are received by the OM-server on some nodes.</p>\n<p>Currently, the OM system is intended for use with BOLT12.  I wonder if, with the help of such OM-mixer services, the OM system can be used for e.g. contacting watchtowers or dynamic channel state backup servers (CLN VLS, LDK VSS, et al.).  Those services are likely to have much higher rates of messages than BOLT12, I think.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2023-12-01T14:44:59.078Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 10,
  "readers_count": 9,
  "score": 1.8,
  "yours": false,
  "topic_id": 228,
  "topic_slug": "ln-om-mixer-services",
  "topic_title": "LN OM-mixer services",
  "topic_html_title": "LN OM-mixer services",
  "category_id": 7,
  "display_username": "ZmnSCPxj jxPCSnmZ",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Currently, Lightning Network onion messages are intended to be rate-limited, possibly with backpressure.\n\nAn issue is that OM is specified as being unreliable.  This means that it quite valid for a highly-pressured node to simply drop onion messages and never forward them. Now, OM has an advantage over Tor: individual messages are not necessarily correlatable with each other, whereas since Tor emulates a TCP tunnel, messages coming over the same TCP tunnel are correlatable by third parties (the entry and exit nodes) as belonging to the same underlying communications.  While you CAN reduce this with Tor, this requires that you open a new TCP-over-Tor tunnel, send a single message (and possibly wait for a single response) then close it, preferably changing circuits each time.\n\nWith OM, a node that is a full routing participant on the LN can have many multiple paths to send OMs to anything it wants to talk to, and to get responses back.  In particular, in protocols that are naturally request-response, the response circuit can be different from the request circuit.\n\nHowever, consider the case where a node is a client of an LSP.  In this environment, usually the client only has channels (or promises of a channel, such as by a pending JIT channel open) with only that single LSP, because the whole point of the LSP/client divide is so that liquidity management is done by the LSP on behalf of the client.  But this implies that the client has limited access to send and receive OMs.  Yes, it could connect to a random node on the LN and send out an OM via that, but this is likely to get rate-limited or just dropped. and it certainly cannot receive over that random node.  If the client always sends out OMs via its sole LSP, then the LSP has all the information on the timing of OMs to and from that client, which the LSP may be able to correlate with other activity (for instance, if watchtowers are contacted over OM, the LSP might note if some client never sends out an OM and attempt to steal from them while they are offline).\n\nSo I was wondering if random routing nodes can also provide OM-mixer services.  This is basically just an additional paid service by which a client can send an OM to a different routing node, hopefully one which has good OM-bandwidth with its peers.\n\nSo an OM-mixer might provide tokens in a WabiSabi credential in exchange for money.  Then the client can connect to the OM-mixer (possibly with a different node ID and hopefully via a different IP(???)) and then spend some of the tokens in the WabiSabi credential, in order to send and receive messages (to receive messages, the client would register a short-lived synthetic SCID by which it can receive messages and which it can put in the `reply_path`).\n\nAdditionally the OM-mixer might give hints to the client on which outgoing/incoming SCIDs are currently not getting used for OMs recently. As noted, the expectation is that nodes will rate-limit incoming OMs to be forwarded and thus the OM-mixer might have been used to forward some message over some common path, and the OM-mixer could advise the client \"actually use this path out of me instead\" to improve the chances that the client OM will reach its destination.  Similarly for receive paths, the OM-mixer could hint if some incoming path is currently not near the rate-limit the OM-server has, so that the client can build a `reply_path` that does not increase the rate at which OMs are received by the OM-server on some nodes.\n\nCurrently, the OM system is intended for use with BOLT12.  I wonder if, with the help of such OM-mixer services, the OM system can be used for e.g. contacting watchtowers or dynamic channel state backup servers (CLN VLS, LDK VSS, et al.).  Those services are likely to have much higher rates of messages than BOLT12, I think.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 104,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}