{
  "id": 620,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/3_2.png",
  "created_at": "2023-12-05T15:36:26.981Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"ZmnSCPxj\" data-post=\"13\" data-topic=\"22\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/z/ee7513/48.png\" class=\"avatar\"> ZmnSCPxj:</div>\n<blockquote>\n<p>If so, it looks like the USD is a third-party-adjustable view of the underlying Bitcoin if I and a second party ever enter a contract that is denominated in USD.</p>\n<p>It would be better for us to avoid the possibility of third parties messing with the intent of our contract by just denominating in BTC.</p>\n<p>So… I do not get the point?</p>\n</blockquote>\n</aside>\n<p>The standard argument from mainstream academic microeconomics why money should be inflationary is precisely that this causes existing contracts to automatically get repriced in real terms, and that this helps avoid the real impact of financial shocks on the economy, see <a href=\"https://en.wikipedia.org/wiki/Nominal_rigidity\" class=\"inline-onebox\">Nominal rigidity - Wikipedia</a> or <a href=\"https://en.wikipedia.org/wiki/Paradox_of_thrift\" class=\"inline-onebox\">Paradox of thrift - Wikipedia</a></p>\n<p>In practical terms, it’s just a coordination measure. If your central bank is boring, predictable, not compromised, and gives a regular, accurate report that tells you that “x BTC” is enough to feed a family of four for a week on average in your country, you might as well say “x BTC = $200”, and set your hourly consulting rate in dollar terms. Then you can spend your time actually working, not having to worry about halving your rates when BTC goes from $20k to $40k.</p>\n<p>Just denominating in BTC is certainly another option; whether it’s simpler depends a lot on how stable the real value of BTC is.</p>\n<p>The advantage of the approach is that it’s opt-in: if you think dollars are simpler, you use them; if you think BTC is simpler, use that; if you want to do one-off transactions with someone who thinks differently, it’s trivial. Of course if you want to commit to a long term contract with someone who thinks differently, you might have to do financing, which is no longer trivial, but also no worse than long-term international contracts today. And unlike today, in this model your actual savings aren’t being put at risk by bad central bank policies.</p>",
  "post_number": 14,
  "post_type": 1,
  "updated_at": "2023-12-05T15:36:26.981Z",
  "reply_count": 0,
  "reply_to_post_number": 13,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 4,
  "readers_count": 3,
  "score": 0.8,
  "yours": false,
  "topic_id": 22,
  "topic_slug": "deflationary-money-is-a-good-thing",
  "topic_title": "Deflationary money is a Good Thing",
  "topic_html_title": "Deflationary money is a Good Thing",
  "category_id": 5,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"ZmnSCPxj, post:13, topic:22\"]\nIf so, it looks like the USD is a third-party-adjustable view of the underlying Bitcoin if I and a second party ever enter a contract that is denominated in USD.\n\nIt would be better for us to avoid the possibility of third parties messing with the intent of our contract by just denominating in BTC.\n\nSo… I do not get the point?\n[/quote]\n\nThe standard argument from mainstream academic microeconomics why money should be inflationary is precisely that this causes existing contracts to automatically get repriced in real terms, and that this helps avoid the real impact of financial shocks on the economy, see https://en.wikipedia.org/wiki/Nominal_rigidity or https://en.wikipedia.org/wiki/Paradox_of_thrift \n\nIn practical terms, it's just a coordination measure. If your central bank is boring, predictable, not compromised, and gives a regular, accurate report that tells you that \"x BTC\" is enough to feed a family of four for a week on average in your country, you might as well say \"x BTC = $200\", and set your hourly consulting rate in dollar terms. Then you can spend your time actually working, not having to worry about halving your rates when BTC goes from $20k to $40k.\n\nJust denominating in BTC is certainly another option; whether it's simpler depends a lot on how stable the real value of BTC is.\n\nThe advantage of the approach is that it's opt-in: if you think dollars are simpler, you use them; if you think BTC is simpler, use that; if you want to do one-off transactions with someone who thinks differently, it's trivial. Of course if you want to commit to a long term contract with someone who thinks differently, you might have to do financing, which is no longer trivial, but also no worse than long-term international contracts today. And unlike today, in this model your actual savings aren't being put at risk by bad central bank policies.",
  "actions_summary": [],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}