{
  "id": 1378,
  "name": "Bastien Teinturier",
  "username": "t-bast",
  "avatar_template": "/user_avatar/delvingbitcoin.org/t-bast/{size}/98_2.png",
  "created_at": "2024-01-30T09:27:04.976Z",
  "cooked": "<p>This issue is already known among some people, but I couldn’t find any article about it and it took me a while to figure out the details, so it’s worth making a post for future reference.</p>\n<p>Layer 2 contracts require building transactions that include inputs from multiple participants that don’t trust each other. In most cases, participants pre-sign a refund transaction that can be used to get their funds back in case some of the other participants stop collaborating, to ensure their funds aren’t locked forever in the contract. It is important that the <code>txid</code> of the shared transaction cannot be malleated, because the refund transaction would otherwise become useless, exposing users to blackmail to get their funds back.</p>\n<p>We have this kind of usecase in lightning for interactive-tx transactions, used in dual-funding and splicing (<a href=\"https://github.com/lightning/bolts/pull/851\">https://github.com/lightning/bolts/pull/851</a>). I will focus on that specific feature to explain the issue.</p>\n<p>Each participant adds inputs to the transaction using the <code>tx_add_input</code> message. This message contains a <code>prevtx</code> field that contains the transaction the participant is spending from. The question is thus: why is that necessary? Can’t we simply transmit the corresponding <code>outpoint</code>, its <code>amount</code> and <code>scriptPubKey</code>?</p>\n<p>We unfortunately can’t, because that would let participants use non-segwit inputs, which allows them to malleate the <code>txid</code>. Let’s look at it in more details. Alice and Bob want to collaboratively fund a lightning channel without transmitting the whole <code>prevtx</code> in their <code>tx_add_input</code> messages:</p>\n<ol>\n<li>\n<p>Alice sends <code>tx_add_input</code> with <code>outpoint_A</code> and a p2wpkh <code>scriptPubKey</code></p>\n</li>\n<li>\n<p>Bob sends <code>tx_add_input</code> with <code>outpoint_B</code> and a p2wpkh <code>scriptPubKey</code></p>\n</li>\n<li>\n<p>Alice and Bob exchange signatures for the first commitment transaction spending that 2-inputs funding transaction</p>\n</li>\n<li>\n<p>Bob sends the witness data for his input of the funding transaction</p>\n</li>\n<li>\n<p>But Alice’s input was actually using p2pkh instead of p2wpkh: she signs her input and publishes the funding transaction</p>\n</li>\n</ol>\n<p>At that point the published funding transaction has a different <code>txid</code> than the one that was used for the commitment transaction, since the p2pkh signature is included in the transaction hash. The commitment transactions are thus useless, and Bob’s funds are stuck in a contract with Alice. Alice can then blackmail Bob if he wants to get his funds back.</p>\n<p>Alice was able to perform this attack because Bob’s signature doesn’t commit to the <code>scriptPubKey</code>s of the other inputs of the transaction. Bob’s signature was thus still valid, even though Alice lied about which <code>scriptPubKey</code> she was using.</p>\n<p>This changes with segwit v1: <a href=\"https://github.com/bitcoin/bips/blob/deae64bfd31f6938253c05392aa355bf6d7e7605/bip-0341.mediawiki#signature-validation-rules\">BIP 341</a> added the <code>amount</code>s and <code>scriptPubKey</code>s of all inputs of the transaction to the signed hash. But it doesn’t mean we can drop the <code>prevtx</code> in every case: participants are only protected <strong>if they include one of their own segwit v1 input to the transaction</strong>. In the example above, if Bob still uses a p2wpkh input, Alice could claim to use a segwit v1 input while still replacing it with a non-segwit input at broadcast time, and Bob would still be exposed.</p>\n<p>That means that for lightning, we should only drop the <code>prevtx</code> field if:</p>\n<ul>\n<li>\n<p>this is a splice transaction of a taproot channel (there is a shared input that uses taproot and requires signatures from both participants)</p>\n</li>\n<li>\n<p>or each participant adds at least one taproot input to the transaction</p>\n</li>\n</ul>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-01-30T09:32:10.184Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 7,
  "reads": 6,
  "readers_count": 5,
  "score": 36.2,
  "yours": false,
  "topic_id": 497,
  "topic_slug": "malleability-issues-when-creating-shared-transactions-with-segwit-v0",
  "topic_title": "Malleability issues when creating shared transactions with segwit v0",
  "topic_html_title": "Malleability issues when creating shared transactions with segwit v0",
  "category_id": 7,
  "display_username": "Bastien Teinturier",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "This issue is already known among some people, but I couldn't find any article about it and it took me a while to figure out the details, so it's worth making a post for future reference.\n\nLayer 2 contracts require building transactions that include inputs from multiple participants that don't trust each other. In most cases, participants pre-sign a refund transaction that can be used to get their funds back in case some of the other participants stop collaborating, to ensure their funds aren't locked forever in the contract. It is important that the `txid` of the shared transaction cannot be malleated, because the refund transaction would otherwise become useless, exposing users to blackmail to get their funds back.\n\nWe have this kind of usecase in lightning for interactive-tx transactions, used in dual-funding and splicing (https://github.com/lightning/bolts/pull/851). I will focus on that specific feature to explain the issue.\n\nEach participant adds inputs to the transaction using the `tx_add_input` message. This message contains a `prevtx` field that contains the transaction the participant is spending from. The question is thus: why is that necessary? Can't we simply transmit the corresponding `outpoint`, its `amount` and `scriptPubKey`?\n\nWe unfortunately can't, because that would let participants use non-segwit inputs, which allows them to malleate the `txid`. Let's look at it in more details. Alice and Bob want to collaboratively fund a lightning channel without transmitting the whole `prevtx` in their `tx_add_input` messages:\n\n1. Alice sends `tx_add_input` with `outpoint_A` and a p2wpkh `scriptPubKey`\n\n2. Bob sends `tx_add_input` with `outpoint_B` and a p2wpkh `scriptPubKey`\n\n3. Alice and Bob exchange signatures for the first commitment transaction spending that 2-inputs funding transaction\n\n4. Bob sends the witness data for his input of the funding transaction\n\n5. But Alice's input was actually using p2pkh instead of p2wpkh: she signs her input and publishes the funding transaction\n\nAt that point the published funding transaction has a different `txid` than the one that was used for the commitment transaction, since the p2pkh signature is included in the transaction hash. The commitment transactions are thus useless, and Bob's funds are stuck in a contract with Alice. Alice can then blackmail Bob if he wants to get his funds back.\n\nAlice was able to perform this attack because Bob's signature doesn't commit to the `scriptPubKey`s of the other inputs of the transaction. Bob's signature was thus still valid, even though Alice lied about which `scriptPubKey` she was using.\n\nThis changes with segwit v1: [BIP 341](https://github.com/bitcoin/bips/blob/deae64bfd31f6938253c05392aa355bf6d7e7605/bip-0341.mediawiki#signature-validation-rules) added the `amount`s and `scriptPubKey`s of all inputs of the transaction to the signed hash. But it doesn't mean we can drop the `prevtx` in every case: participants are only protected **if they include one of their own segwit v1 input to the transaction**. In the example above, if Bob still uses a p2wpkh input, Alice could claim to use a segwit v1 input while still replacing it with a non-segwit input at broadcast time, and Bob would still be exposed.\n\nThat means that for lightning, we should only drop the `prevtx` field if:\n\n- this is a splice transaction of a taproot channel (there is a shared input that uses taproot and requires signatures from both participants)\n\n- or each participant adds at least one taproot input to the transaction",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 101,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}