{
  "id": 1063,
  "name": "David A. Harding",
  "username": "harding",
  "avatar_template": "/user_avatar/delvingbitcoin.org/harding/{size}/6_2.png",
  "created_at": "2024-01-11T02:28:17.246Z",
  "cooked": "<blockquote>\n<p>I think we must accept that right now we do not have the ability to reach consensus.</p>\n</blockquote>\n<p>I strongly disagree with this viewpoint.  Technical consensus has been found on many subjects since taproot’s activation.  Examples: for many years, one developer vociferously opposed encrypted peer connections—now we have those in Bitcoin Core; other developers opposed even adding full RBF as an option—we have that too in Bitcoin Core; devs for a major LN implementation didn’t like onion messages and certain things built on them, yet support for onion messages and blinded paths are being added there as I write; miniscript seemed for a while like some weird Bitcoin Core science project, yet now hardware wallets are adding support; years of debate about how to solve channel jamming attacks are finally seeing experimentation with solutions; and (with a few current dissenters) there’s widespread agreement after 18+ months of work that v3 relay, ephemeral anchors, and cluster mempool are solid building blocks for future upgrades.  Heck, even with millions of dollars seeming to ride on continued controversy, there’s rough consensus among developers to avoid witness filtering.</p>\n<p>Technical consensus has also been found on many bad ideas, or ideas that were not compelling.  Mainly that happens by an idea simply not gaining traction.  Examples from Optech newsletters since taproot activation: two-digest BOLT11 invoices (<span class=\"hashtag-raw\">#256</span>), relay of annexes before a defined need (<span class=\"hashtag-raw\">#255</span>), LN QoS bit (<span class=\"hashtag-raw\">#239</span>), global LN reputation tokens (<span class=\"hashtag-raw\">#228</span>), (at least some versions of) LN capacity-dependent feerates (<span class=\"hashtag-raw\">#219</span>), perpetual subsidy (<span class=\"hashtag-raw\">#209</span>), and fee accounts (<span class=\"hashtag-raw\">#182</span>).</p>\n<p>If we don’t have technical consensus for what soft fork to perform yet, then I think the reason must be something besides our ability to form consensus.  One reason I would suggest for consideration is that none of the proposals so far has been compelling.  If a better proposal comes along, or if some of the existing proposals are made more compelling, then it’s possible that will attract reviewers and lead to eventual technical consensus.</p>\n<blockquote>\n<p>My proposal is that the bitcoin core project themselves begin publishing a client which supports validation of a variety of changes with separate signaling and let the signals fall where they may.</p>\n</blockquote>\n<p>Please, no.  A soft fork that not everyone agrees is active can create a chain split.  If a chain split is eventually healed, some miners are guaranteed to lose money.  If it’s not healed, Bitcoin’s economy fractures, harming users.  In either case, many poorly informed users, or users who wrongly predicted the outcome of the chain split, are likely to lose money.  Those who take precautions not to lose money will likely lose the ability to transact for part or all of the chain split.  It’s an all-around bad mechanism for making upgrades to the system.</p>\n<p>We can do better.  Or, if we can’t do better and putting Bitcoin at significant risk of a chain split is the only way to change the consensus rules, then sign me up for team Immediate Ossification.</p>",
  "post_number": 7,
  "post_type": 1,
  "updated_at": "2024-01-11T02:28:17.246Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 1,
  "reads": 18,
  "readers_count": 17,
  "score": 13.4,
  "yours": false,
  "topic_id": 334,
  "topic_slug": "on-consensus-changes-in-bitcoin-2024",
  "topic_title": "On consensus changes in bitcoin 2024",
  "topic_html_title": "On consensus changes in bitcoin 2024",
  "category_id": 5,
  "display_username": "David A. Harding",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "> I think we must accept that right now we do not have the ability to reach consensus.\n\nI strongly disagree with this viewpoint.  Technical consensus has been found on many subjects since taproot's activation.  Examples: for many years, one developer vociferously opposed encrypted peer connections---now we have those in Bitcoin Core; other developers opposed even adding full RBF as an option---we have that too in Bitcoin Core; devs for a major LN implementation didn't like onion messages and certain things built on them, yet support for onion messages and blinded paths are being added there as I write; miniscript seemed for a while like some weird Bitcoin Core science project, yet now hardware wallets are adding support; years of debate about how to solve channel jamming attacks are finally seeing experimentation with solutions; and (with a few current dissenters) there's widespread agreement after 18+ months of work that v3 relay, ephemeral anchors, and cluster mempool are solid building blocks for future upgrades.  Heck, even with millions of dollars seeming to ride on continued controversy, there's rough consensus among developers to avoid witness filtering.\n\nTechnical consensus has also been found on many bad ideas, or ideas that were not compelling.  Mainly that happens by an idea simply not gaining traction.  Examples from Optech newsletters since taproot activation: two-digest BOLT11 invoices (#256), relay of annexes before a defined need (#255), LN QoS bit (#239), global LN reputation tokens (#228), (at least some versions of) LN capacity-dependent feerates (#219), perpetual subsidy (#209), and fee accounts (#182).\n\nIf we don't have technical consensus for what soft fork to perform yet, then I think the reason must be something besides our ability to form consensus.  One reason I would suggest for consideration is that none of the proposals so far has been compelling.  If a better proposal comes along, or if some of the existing proposals are made more compelling, then it's possible that will attract reviewers and lead to eventual technical consensus.\n\n> My proposal is that the bitcoin core project themselves begin publishing a client which supports validation of a variety of changes with separate signaling and let the signals fall where they may. \n\nPlease, no.  A soft fork that not everyone agrees is active can create a chain split.  If a chain split is eventually healed, some miners are guaranteed to lose money.  If it's not healed, Bitcoin's economy fractures, harming users.  In either case, many poorly informed users, or users who wrongly predicted the outcome of the chain split, are likely to lose money.  Those who take precautions not to lose money will likely lose the ability to transact for part or all of the chain split.  It's an all-around bad mechanism for making upgrades to the system.\n\nWe can do better.  Or, if we can't do better and putting Bitcoin at significant risk of a chain split is the only way to change the consensus rules, then sign me up for team Immediate Ossification.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 6,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "clap",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false
}