{
  "id": 1366,
  "name": "Gregory Sanders",
  "username": "instagibbs",
  "avatar_template": "/user_avatar/delvingbitcoin.org/instagibbs/{size}/28_2.png",
  "created_at": "2024-01-29T15:04:37.171Z",
  "cooked": "<p>At a high level, each approach is attempting to answer the question:</p>\n<p>How do we make sure incentive compatible transactions can be mined without introducing transaction relay that isn’t “paid for”? This also known as the “free relay problem”.</p>\n<p>The “free relay problem” becomes a problem if people are able to make transactions that enter into everyone’s mempools, causing validation and bandwidth costs to everyone on the network. but then are ejected from the mempool later, resulting in <em>no fees</em> being paid for the privilege.</p>\n<p>To mitigate this problem, the current Bitcoin Core software makes attempts to minimize it:</p>\n<ol>\n<li>Replacement transactions have to pay for what they replace(“total fee”), plus “incremental fee”(today 1 sat/vbyte) to pay for the new bytes being gossiped around the network.</li>\n<li>mempool minfee: When the mempool gets to full and gets “trimmed” down to ~300MB by default, the “min fee” to enter the mempool is raised to the highest paying thing that was ejected, plus the 1 sat/vbyte incremental rate. This “raises the bar” for the next things to enter, and only in the worst case allows some temporary free relay which is paid for immediately after.</li>\n<li>timeout: After 2 weeks, the mempool ejects transactions as they aren’t expected to be mined. This is free relay, bound by long timescales.</li>\n</ol>\n<h2><a name=\"v3-relay-less-1\" class=\"anchor\" href=\"#v3-relay-less-1\"></a>“V3”: Relay Less</h2>\n<p>V3 is one attempt to get around pinning issues in an opt-in manner. If a transaction can commit to opting into a new policy, we can be more restrictive in a way that perhaps wouldn’t be generally acceptable to users.</p>\n<p>In essence, it restricts topology to avoid free relay, while mitigating pinning by restricting total size of portions of transactions. It’s a mitigation, not a complete fix, but also doesn’t allow new free relay avenues. <a href=\"https://delvingbitcoin.org/t/an-overview-of-the-cluster-mempool-proposal/393\">Future mempool updates</a> could likely allow this policy to evolve into something more incentive compatible and more pin resistant.</p>\n<h2><a name=\"replace-by-fee-rate-relay-more-2\" class=\"anchor\" href=\"#replace-by-fee-rate-relay-more-2\"></a>“Replace-by-Fee-Rate”: Relay More</h2>\n<p>In contrast, some have suggested that the free relay problem isn’t much of a problem at all, or that it’s an unsolved problem, and that since it cannot be stopped, we should just not worry about offering services that would use it.</p>\n<p>This is what Peter’s argument essentially boils down to: He claims miners can already induce some free relay by leaving fees on the table with transaction filters, so we should just bite the bullet and allow more, and let anyone do it.</p>\n<p>I’ll let people dive into the precise arguments themselves, but it’s important to note a few things:</p>\n<ol>\n<li>If free relay is a solvable problem(through say, smarter relay logic), should we really be offering a replacement policy we may revoke later?</li>\n<li>Is it really qualitatively the same if miners leaving fees on the table intentionally can do something, versus anyone on the network?</li>\n<li>It’s also important to note that pre-cluster mempool, reasoning about any of this is very hard to do. Peter’s first iteration of the idea was <a href=\"https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2024-January/022316.html\">broken</a>, allowing unlimited free relay. He claims he’s fixed it by hot-patching the idea with additional RBF restrictions, but like usual, reasoning about current RBF rules is very difficult, and maybe impossible. I think energy would be better focused on getting RBF incentives right, before giving up the idea of free relay protection entirely.</li>\n</ol>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2024-01-29T15:04:37.171Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 11,
  "readers_count": 10,
  "score": 2.2,
  "yours": false,
  "topic_id": 488,
  "topic_slug": "replace-by-fee-rate-vs-v3",
  "topic_title": "Replace-By-Fee-Rate vs V3",
  "topic_html_title": "Replace-By-Fee-Rate vs V3",
  "category_id": 7,
  "display_username": "Gregory Sanders",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "At a high level, each approach is attempting to answer the question:\n\nHow do we make sure incentive compatible transactions can be mined without introducing transaction relay that isn't \"paid for\"? This also known as the \"free relay problem\".\n\nThe \"free relay problem\" becomes a problem if people are able to make transactions that enter into everyone's mempools, causing validation and bandwidth costs to everyone on the network. but then are ejected from the mempool later, resulting in *no fees* being paid for the privilege. \n\nTo mitigate this problem, the current Bitcoin Core software makes attempts to minimize it:\n\n1) Replacement transactions have to pay for what they replace(\"total fee\"), plus \"incremental fee\"(today 1 sat/vbyte) to pay for the new bytes being gossiped around the network.\n2) mempool minfee: When the mempool gets to full and gets \"trimmed\" down to ~300MB by default, the \"min fee\" to enter the mempool is raised to the highest paying thing that was ejected, plus the 1 sat/vbyte incremental rate. This \"raises the bar\" for the next things to enter, and only in the worst case allows some temporary free relay which is paid for immediately after.\n3) timeout: After 2 weeks, the mempool ejects transactions as they aren't expected to be mined. This is free relay, bound by long timescales.\n\n\"V3\": Relay Less\n---\nV3 is one attempt to get around pinning issues in an opt-in manner. If a transaction can commit to opting into a new policy, we can be more restrictive in a way that perhaps wouldn't be generally acceptable to users.\n\nIn essence, it restricts topology to avoid free relay, while mitigating pinning by restricting total size of portions of transactions. It's a mitigation, not a complete fix, but also doesn't allow new free relay avenues. [Future mempool updates](https://delvingbitcoin.org/t/an-overview-of-the-cluster-mempool-proposal/393) could likely allow this policy to evolve into something more incentive compatible and more pin resistant.\n\n\"Replace-by-Fee-Rate\": Relay More\n---\nIn contrast, some have suggested that the free relay problem isn't much of a problem at all, or that it's an unsolved problem, and that since it cannot be stopped, we should just not worry about offering services that would use it.\n\nThis is what Peter's argument essentially boils down to: He claims miners can already induce some free relay by leaving fees on the table with transaction filters, so we should just bite the bullet and allow more, and let anyone do it.\n\nI'll let people dive into the precise arguments themselves, but it's important to note a few things:\n1) If free relay is a solvable problem(through say, smarter relay logic), should we really be offering a replacement policy we may revoke later?\n2) Is it really qualitatively the same if miners leaving fees on the table intentionally can do something, versus anyone on the network?\n3) It's also important to note that pre-cluster mempool, reasoning about any of this is very hard to do. Peter's first iteration of the idea was [broken](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2024-January/022316.html), allowing unlimited free relay. He claims he's fixed it by hot-patching the idea with additional RBF restrictions, but like usual, reasoning about current RBF rules is very difficult, and maybe impossible. I think energy would be better focused on getting RBF incentives right, before giving up the idea of free relay protection entirely.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 31,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}