{
  "id": 917,
  "name": "",
  "username": "roasbeef",
  "avatar_template": "/user_avatar/delvingbitcoin.org/roasbeef/{size}/160_2.png",
  "created_at": "2024-01-04T00:04:39.369Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"urza\" data-post=\"4\" data-topic=\"334\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/urza/48/234_2.png\" class=\"avatar\"> urza:</div>\n<blockquote>\n<p>“Devs propose. Miners activate. Users override.”</p>\n</blockquote>\n</aside>\n<p>That’s personally been my favorite conceptualization so far.</p>\n<p>I think where things are getting caught up is: devs propose + miners activate.</p>\n<p>These days there isn’t a sort of agreed upon process or mechanisms for the actual proposal portion. The <code>bitcoind</code> organization (imo) doesn’t have the same level of agency in this area (softfork consensus changes, lots of other stuff is moving along nicely) as it once did (there is no longer a unified voice for the org). In the face of that structural change, it isn’t clear what “proposal” actually looks like, nor what it actually takes for something to be “ready”. It’s all an emergent process at the end of the day, mechanisms that worked in the past aren’t guaranteed to work again, we’re all still tryna figure this thing out.</p>\n<p>Maybe we end up tending to a future where <code>bitcoind</code> never merges any soft-fork activation + validation logic until it’s well activated. At face value, one could perceive that as being more chaotic, as most ppl’s definition of “rough consensus” is that something is merged into <code>bitcoind</code> with devs proposing as a unified voice. Without that unified voice, there’s more uncertainty in the marketplace for the set of relevant economic actors. Ultimately, BIP 9/8 still allow for multiple soft-forks to be proposed in parallel, but the socio-economic system we have today hasn’t really embraced that for various reasons (coordination costs, review, etc).</p>\n<p>Maybe the in the future alternative implementations will actually be properly viable, which would give us another platform for proposals, but we aren’t quite there yet today. Other implementations are still years behind, and don’t even have 1% of the funding or dev power that <code>bitcoind</code> has, so they’re far too risky from the PoV of the most conservative market participants.</p>\n<p>On the “miners activate” front, depending on who you talk to, that statement is tantamount to blasphemy. Not everyone took home the same lessons after the segwit+block size drama. If you sample what seems to be the popular Twitter anon/pleb/taking-head sentiment, people actually seems to want hard forks in spirit, as they reject the notion of optional softforks that don’t require “everyone” to update.</p>\n<p>From my PoV <a href=\"https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2015-December/012014.html\" rel=\"noopener nofollow ugc\">soft-forks we originally engineered</a> to get around the impossibility of global coordination, as they enable optional upgrades, based on an agreement between developers and miners. However maybe the soft-fork window has now closed, somewhat more prematurely that most would have envisionsed.</p>",
  "post_number": 5,
  "post_type": 1,
  "updated_at": "2024-01-04T00:21:38.864Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 8,
  "reads": 5,
  "readers_count": 4,
  "score": 41.0,
  "yours": false,
  "topic_id": 334,
  "topic_slug": "on-consensus-changes-in-bitcoin-2024",
  "topic_title": "On consensus changes in bitcoin 2024",
  "topic_html_title": "On consensus changes in bitcoin 2024",
  "category_id": 5,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"urza, post:4, topic:334\"]\n“Devs propose. Miners activate. Users override.”\n[/quote]\n\nThat's personally been my favorite conceptualization so far. \n\nI think where things are getting caught up is: devs propose + miners activate.\n\nThese days there isn't a sort of agreed upon process or mechanisms for the actual proposal portion. The `bitcoind` organization (imo) doesn't have the same level of agency in this area (softfork consensus changes, lots of other stuff is moving along nicely) as it once did (there is no longer a unified voice for the org). In the face of that structural change, it isn't clear what \"proposal\" actually looks like, nor what it actually takes for something to be \"ready\". It's all an emergent process at the end of the day, mechanisms that worked in the past aren't guaranteed to work again, we're all still tryna figure this thing out. \n\nMaybe we end up tending to a future where `bitcoind` never merges any soft-fork activation + validation logic until it's well activated. At face value, one could perceive that as being more chaotic, as most ppl's definition of \"rough consensus\" is that something is merged into `bitcoind` with devs proposing as a unified voice. Without that unified voice, there's more uncertainty in the marketplace for the set of relevant economic actors. Ultimately, BIP 9/8 still allow for multiple soft-forks to be proposed in parallel, but the socio-economic system we have today hasn't really embraced that for various reasons (coordination costs, review, etc). \n\nMaybe the in the future alternative implementations will actually be properly viable, which would give us another platform for proposals, but we aren't quite there yet today. Other implementations are still years behind, and don't even have 1% of the funding or dev power that `bitcoind` has, so they're far too risky from the PoV of the most conservative market participants. \n\nOn the \"miners activate\" front, depending on who you talk to, that statement is tantamount to blasphemy. Not everyone took home the same lessons after the segwit+block size drama. If you sample what seems to be the popular Twitter anon/pleb/taking-head sentiment, people actually seems to want hard forks in spirit, as they reject the notion of optional softforks that don't require \"everyone\" to update. \n\nFrom my PoV [soft-forks we originally engineered](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2015-December/012014.html) to get around the impossibility of global coordination, as they enable optional upgrades, based on an agreement between developers and miners. However maybe the soft-fork window has now closed, somewhat more prematurely that most would have envisionsed.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 143,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}