{
  "id": 885,
  "name": "Brandon Black",
  "username": "reardencode",
  "avatar_template": "/user_avatar/delvingbitcoin.org/reardencode/{size}/27_2.png",
  "created_at": "2024-01-01T16:05:12.954Z",
  "cooked": "<p>There has been much conversation on X and elsewhere recently of how, if, and when bitcoin consensus rules should be changed. I will try to briefly summarize some of the viewpoints, open the question of how consensus changes to bitcoin should be selected, and then provide my own thoughts on that question.</p>\n<h2><a name=\"ways-to-change-consensus-1\" class=\"anchor\" href=\"#ways-to-change-consensus-1\"></a>Ways to change consensus</h2>\n<h3><a name=\"ossification-2\" class=\"anchor\" href=\"#ossification-2\"></a>Ossification</h3>\n<p>On the one hand, this perspective cannot be taken seriously, but it currently seems to hold sway with many in the bitcoin ecosystem.</p>\n<p>This is the view that bitcoin consensus rules are fine as they are. It’s perfect money already and does not require any improvements. There seem to be a few underlying reasons that some folks hold this view:</p>\n<ul>\n<li>Inscription/ordinal derangement: Some folks hold the opinion that previous changes to bitcoin enabled inscriptions/ordinals and that changes are therefore bad.</li>\n<li>General lack of understanding: For the non-technical, bitcoin seems to work by magic. Any change to a magical system could upset the delicate balance of magical properties that enable it.</li>\n</ul>\n<h3><a name=\"trusted-leaders-3\" class=\"anchor\" href=\"#trusted-leaders-3\"></a>Trusted Leaders</h3>\n<p>There seem to be a group of bitcoiners who will only consider a change to the bitcoin protocol if they are supported or proposed by the correct people. This view is essentially similar to the magical ossification view. Bitcoin is a delicately balanced magical system and only the anointed saints can make the correct decisions on its future.</p>\n<h3><a name=\"rough-consensus-4\" class=\"anchor\" href=\"#rough-consensus-4\"></a>Rough Consensus</h3>\n<p>This is the view that changes to bitcoin consensus should <em>roughly</em> follow the IETF rough consensus model. Here I’ll quote a few sentences from the <a href=\"https://datatracker.ietf.org/doc/html/rfc7282\" rel=\"noopener nofollow ugc\">IETF doc</a> on the topic:</p>\n<blockquote>\n<p>Requiring full consensus allows a single intransigent\nperson who simply keeps saying “No!” to stop the process cold.</p>\n</blockquote>\n<blockquote>\n<p>Consensus doesn’t require that\neveryone is happy and agrees that the chosen solution is the best\none.</p>\n</blockquote>\n<blockquote>\n<p>all that they’ve done is capitulated; they’ve simply given up\nby trying to appease the others.  That’s not coming to consensus […]\nEven worse is the “horse-trading” sort of compromise</p>\n</blockquote>\n<blockquote>\n<p>Rough consensus is achieved when all issues are addressed, but not\nnecessarily accommodated</p>\n</blockquote>\n<blockquote>\n<p>While counting\nheads might give a good guess as to what the rough consensus will be,\ndoing so can allow important minority views to get lost in the noise.</p>\n</blockquote>\n<h4><a name=\"how-would-rough-consensus-even-work-in-bitcoin-5\" class=\"anchor\" href=\"#how-would-rough-consensus-even-work-in-bitcoin-5\"></a>How would rough consensus even work in bitcoin?</h4>\n<p>In the rough consensus model there is always a chair for any specific change discussion, and it is this person’s responsibility to determine when rough consensus has been reached. We don’t have chairs (because we sold them all for sats), so we lack a critical element of the rough consensus process.</p>\n<h2><a name=\"how-_should_-consensus-changes-be-chosen-6\" class=\"anchor\" href=\"#how-_should_-consensus-changes-be-chosen-6\"></a>How <em>should</em> consensus changes be chosen?</h2>\n<p>Are there other ideas for how consensus changes should be chosen? Can we follow one of the above models? This seems to be the most pressing question in bitcoin development as we roll into 2024. Historically, bitcoin consensus changes have followed some mix of <em>Trusted Leaders</em> and <em>Rough Consensus</em>. Our trusted leaders have wisely chosen not to lead consensus changes any further, and it seems like rough consensus got a bad name when certain people tried to use it as a bludgeon during the blocksize war.</p>\n<h2><a name=\"where-to-7\" class=\"anchor\" href=\"#where-to-7\"></a>Where to?</h2>\n<p>First, I think we must accept that right now we do not have the ability to reach consensus. We lack Trusted Leaders and we lack Chairs. Without these we are afloat in our various pods of bias, preconception, personal history, etc. Not only can we not reach consensus, we don’t even have the ability to bring the various factions of bitcoin developer mindshare together to find out if there are technical objections to any particular change. Consensus changing code is rarely proposed, rarely reviewed, etc.</p>\n<p>Some have claimed that publishing or promoting a signaling / activation client for a consensus change is an attack on bitcoin, but I would counter that doing so may be the only way to discover consensus. An activation client makes the economic nodes the chairs of the rough consensus process. Each economic node, being their own chair, can evaluate whether consensus has been reached for themselves when deciding what software to run.</p>\n<p>I’d suggest that for bitcoin to continue along the massively successful path that it has walked to date we do need to discover how to continue developing consensus changes, and that this is an important focus in the year ahead.</p>\n<p>My proposal is that the bitcoin core project themselves begin publishing a client which supports validation of a variety of changes with separate signaling and let the signals fall where they may. Exact details of these activation clients are not my area of expertise, but I suspect that for this to be successful configuration options for signaling bits and lock-in on time would be necessary.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-01-01T16:05:12.954Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 62,
  "reads": 10,
  "readers_count": 9,
  "score": 307.0,
  "yours": false,
  "topic_id": 334,
  "topic_slug": "meta-on-consensus-changes-in-bitcoin-2024",
  "topic_title": "[Meta] On consensus changes in bitcoin 2024",
  "topic_html_title": "[Meta] On consensus changes in bitcoin 2024",
  "category_id": 7,
  "display_username": "Brandon Black",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "There has been much conversation on X and elsewhere recently of how, if, and when bitcoin consensus rules should be changed. I will try to briefly summarize some of the viewpoints, open the question of how consensus changes to bitcoin should be selected, and then provide my own thoughts on that question.\n\n## Ways to change consensus\n\n### Ossification\n\nOn the one hand, this perspective cannot be taken seriously, but it currently seems to hold sway with many in the bitcoin ecosystem.\n\nThis is the view that bitcoin consensus rules are fine as they are. It's perfect money already and does not require any improvements. There seem to be a few underlying reasons that some folks hold this view:\n\n* Inscription/ordinal derangement: Some folks hold the opinion that previous changes to bitcoin enabled inscriptions/ordinals and that changes are therefore bad.\n* General lack of understanding: For the non-technical, bitcoin seems to work by magic. Any change to a magical system could upset the delicate balance of magical properties that enable it.\n\n### Trusted Leaders\n\nThere seem to be a group of bitcoiners who will only consider a change to the bitcoin protocol if they are supported or proposed by the correct people. This view is essentially similar to the magical ossification view. Bitcoin is a delicately balanced magical system and only the anointed saints can make the correct decisions on its future.\n\n### Rough Consensus\n\nThis is the view that changes to bitcoin consensus should *roughly* follow the IETF rough consensus model. Here I'll quote a few sentences from the [IETF doc](https://datatracker.ietf.org/doc/html/rfc7282) on the topic:\n\n> Requiring full consensus allows a single intransigent\n   person who simply keeps saying \"No!\" to stop the process cold.\n\n> Consensus doesn't require that\n   everyone is happy and agrees that the chosen solution is the best\n   one.\n\n> all that they've done is capitulated; they've simply given up\n   by trying to appease the others.  That's not coming to consensus [...]\n> Even worse is the \"horse-trading\" sort of compromise\n\n> Rough consensus is achieved when all issues are addressed, but not\n    necessarily accommodated\n\n> While counting\n   heads might give a good guess as to what the rough consensus will be,\n   doing so can allow important minority views to get lost in the noise.\n\n#### How would rough consensus even work in bitcoin?\n\nIn the rough consensus model there is always a chair for any specific change discussion, and it is this person's responsibility to determine when rough consensus has been reached. We don't have chairs (because we sold them all for sats), so we lack a critical element of the rough consensus process.\n\n## How _should_ consensus changes be chosen?\n\nAre there other ideas for how consensus changes should be chosen? Can we follow one of the above models? This seems to be the most pressing question in bitcoin development as we roll into 2024. Historically, bitcoin consensus changes have followed some mix of *Trusted Leaders* and *Rough Consensus*. Our trusted leaders have wisely chosen not to lead consensus changes any further, and it seems like rough consensus got a bad name when certain people tried to use it as a bludgeon during the blocksize war.\n\n## Where to?\n\nFirst, I think we must accept that right now we do not have the ability to reach consensus. We lack Trusted Leaders and we lack Chairs. Without these we are afloat in our various pods of bias, preconception, personal history, etc. Not only can we not reach consensus, we don't even have the ability to bring the various factions of bitcoin developer mindshare together to find out if there are technical objections to any particular change. Consensus changing code is rarely proposed, rarely reviewed, etc.\n\nSome have claimed that publishing or promoting a signaling / activation client for a consensus change is an attack on bitcoin, but I would counter that doing so may be the only way to discover consensus. An activation client makes the economic nodes the chairs of the rough consensus process. Each economic node, being their own chair, can evaluate whether consensus has been reached for themselves when deciding what software to run.\n\nI'd suggest that for bitcoin to continue along the massively successful path that it has walked to date we do need to discover how to continue developing consensus changes, and that this is an important focus in the year ahead.\n\nMy proposal is that the bitcoin core project themselves begin publishing a client which supports validation of a variety of changes with separate signaling and let the signals fall where they may. Exact details of these activation clients are not my area of expertise, but I suspect that for this to be successful configuration options for signaling bits and lock-in on time would be necessary.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 30,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}