{
  "id": 1150,
  "name": "Matt Corallo",
  "username": "MattCorallo",
  "avatar_template": "/letter_avatar_proxy/v4/letter/m/e47c2d/{size}.png",
  "created_at": "2024-01-16T22:59:30.042Z",
  "cooked": "<p>I think what I wrote in 2020 is just as true today as it was then: <a href=\"https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2020-January/017547.html\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">[bitcoin-dev] Modern Soft Fork Activation</a>. There’s a set of goals we must define, and I think the 5 listed there basically summarize what the goals for the Bitcoin system should be (it doesn’t mention how this implicates Bitcoin Core at all). One of the key themes here is that we should avoid, in all the ways we can, chain splits and losing hashpower onto one fork or another. Its impossible to avoid in a general sense, but all the technical design decisions that go into the fork should attempt to ensure we do not lose hash power or users onto a fork where a decision can be made to do so.</p>\n<p>This also implies that ideas like “just ship code that lets users make uninformed decisions resulting in a fork” are right out. This also implies we must rely on users having upgraded by the time any activation happens, and have very high confidence that a vast majority of users will be using the new consensus logic by the time any activation happens. Miner signaling is useful, but as <a class=\"mention\" href=\"/u/harding\">@harding</a> points out, it is very, very far from sufficient.</p>\n<p>There’s a ton of ideas on philosophy out there on what roles different parties can or should take, but we shouldn’t lose sight of the fact that this is a production network protecting billions of dollars of other peoples’ money in a naive attempt to achieve some philosophically perfect outcome.</p>",
  "post_number": 11,
  "post_type": 1,
  "updated_at": "2024-01-16T23:05:10.299Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 6,
  "readers_count": 5,
  "score": 6.0,
  "yours": false,
  "topic_id": 334,
  "topic_slug": "on-consensus-changes-in-bitcoin-2024",
  "topic_title": "On consensus changes in bitcoin 2024",
  "topic_html_title": "On consensus changes in bitcoin 2024",
  "category_id": 5,
  "display_username": "Matt Corallo",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 4,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I think what I wrote in 2020 is just as true today as it was then: https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2020-January/017547.html. There's a set of goals we must define, and I think the 5 listed there basically summarize what the goals for the Bitcoin system should be (it doesn't mention how this implicates Bitcoin Core at all). One of the key themes here is that we should avoid, in all the ways we can, chain splits and losing hashpower onto one fork or another. Its impossible to avoid in a general sense, but all the technical design decisions that go into the fork should attempt to ensure we do not lose hash power or users onto a fork where a decision can be made to do so.\n\nThis also implies that ideas like \"just ship code that lets users make uninformed decisions resulting in a fork\" are right out. This also implies we must rely on users having upgraded by the time any activation happens, and have very high confidence that a vast majority of users will be using the new consensus logic by the time any activation happens. Miner signaling is useful, but as @harding points out, it is very, very far from sufficient.\n\nThere's a ton of ideas on philosophy out there on what roles different parties can or should take, but we shouldn't lose sight of the fact that this is a production network protecting billions of dollars of other peoples' money in a naive attempt to achieve some philosophically perfect outcome.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 50,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}