{
  "id": 1392,
  "name": "ZmnSCPxj jxPCSnmZ",
  "username": "ZmnSCPxj",
  "avatar_template": "/letter_avatar_proxy/v4/letter/z/ee7513/{size}.png",
  "created_at": "2024-01-31T06:52:48.570Z",
  "cooked": "<p>Here is a proposal for a new <code>SIGHASH</code> scheme.  The intent of this new scheme is to allow Poon-Dryja to defer feerate decisions later while paying from the in-channel funds (instead of requiring an extra UTXO and an artificial change output (“anchor”)), as well as to allow Decker-Russell-Osuntokun update transactions to be paid from in-channel funds (normally the requirement that the input amount == output amount prevents update transactions from paying their own fee and requiring an additional input to pay fee) in addition to letting feerate decisions be deferred later, as well.</p>\n<p>In a new Tapleaf version, the signature operand given to <code>OP_CHECKSIG</code>/<code>OP_CHECKSIG_VERIFY</code>/<code>OP_CHECKSIGADD</code> can be 84 bytes:</p>\n<ul>\n<li>1 byte: <code>SIGHASH</code> flags</li>\n<li>3 bytes: unsigned integer indicating a <code>vout_index</code></li>\n<li>8 bytes: signed integer indicating a difference, the <code>delta_min</code></li>\n<li>8 bytes: signed integer indicating a difference, the <code>delta_max</code></li>\n<li>64 bytes: Schnorr signature as defined by Taproot</li>\n</ul>\n<p>If so, the operation <code>OP_CHECKSIG</code>(<code>ADD</code>,`VERIFY), in addition to performing signature validation, also performs the following:</p>\n<ul>\n<li>Get the amount of the input this is spending as <code>input_amount</code>, a signed integer.</li>\n<li>Calculate: <code>min = input_amount - delta_min</code> (<code>delta_min</code> is signed so this can become an addition, if this would cause overflow, fail; the result can be negative and negative <code>min</code> is still valid)</li>\n<li>Calculate: <code>max = input_amount - delta_max</code> (ditto)</li>\n<li>Check <code>min &lt;= max</code>, if not, fail</li>\n<li>Get the amount of the output that is at <code>vout_index</code> as <code>output_amount</code>, a signed integer.</li>\n<li>Check <code>min &lt;= output_amount &lt;= max</code>, if not, fail.</li>\n</ul>\n<p>If the above validation succeeds, then the sighash function is also modified as follows:</p>\n<ul>\n<li>Instead of a 1-byte <code>SIGHASH</code>, use the first 20 bytes (ie. <code>SIGHASH|vout_index|delta_min|delta_max</code>)</li>\n<li>When getting the amount for this input, treat it as being 0 amount.</li>\n<li>When getting the amount for the output at <code>vout_index</code>, treat it as being 0 amount.</li>\n<li>Otherwise same as Taproot sighash.</li>\n</ul>\n<p>For example, suppose you have a tx with an input <code>txid1:vout1</code> with amount <code>100</code> and two outputs <code>(A, 42)</code> and <code>(B, 15)</code>, and you do a <code>SIGHASH_ALL</code> in the sighash byte while having a <code>SIGHASH_OUTPUTDELTABOUNDS</code> (i.e. using the above 84-byte blob instead of a 64-byte or 65-byte blob) with <code>vout=1</code>, <code>delta_min=90</code>,<code>delta_max=42</code>. Then you would sign as if the transaction had an input <code>txid1:vout1</code> with amount <code>0</code>, and outputs <code>(A, 42)</code> and <code>(B, 0)</code>.  The <code>OP_CHECKSIG</code> would also validate that the output <code>(B,15)</code> has an amount between <code>100 - 90 &lt;= output &lt;= 100 - 42</code>, which in this case would pass.</p>\n<p>The result of this is that a signature that signs for <code>SIGHASH_OUTPUTDELTABOUNDS</code> will impose bounds on a particular output, so that it is within some number of satoshis of the input being signed for.</p>\n<h1><a name=\"poon-dryja-1\" class=\"anchor\" href=\"#poon-dryja-1\"></a>Poon-Dryja</h1>\n<p>Let me propose an alternate Poon-Dryja-based protocol.  When exchanging signatures for commitment transactions, we send a signatures with <code>SIGHASH_ALL|SIGHASH_OUTPUTDELTABOUNDS</code> for the commitment transaction of the peer. As a concrete example, suppose the commitment transaction has the following state:</p>\n<ul>\n<li>channel funding input = 100</li>\n<li>output to A = 42</li>\n<li>output to B = 58</li>\n<li>No HTLCs</li>\n</ul>\n<p>As is typical, the channel funding output is a 2-of-2 between A and B.  In our case, it would have a tapleaf with version supporting <code>SIGHASH_OUTPUTDELTABOUNDS</code>, whose script is a trivial separate-signature 2-of-2 <code>&lt;A&gt; OP_CHECKSIGVERIFY &lt;B&gt; OP_CHECKSIG</code>.</p>\n<p>Suppose A is giving the signature for the commitment transaction held by B.  In that case, it creates a <code>SIGHASH_ALL|SIGHASH_OUTPUTDELTABOUNDS</code> with <code>vout_index=1</code> (the index of output to B), <code>delta_max=42</code> (the channel funding input minus the amount to B), and <code>delta_min=100</code> (the channel funding input).  This is a signature that commits spending the funding outpoint to the output set <code>(A, 42)</code> and <code>(B, 0)</code>, as it is <code>SIGHASH_ALL</code>.</p>\n<p>Now suppose after A gives that signature, A never comes online again.  In the meantime, cute dog webp images become popular on the blockchain, so that in order for B to get the commitment transaction confirmed, it needs to pay 43 units.  In that case, B constructs a commitment transaction that has outputs <code>(A,42)</code>, <code>(B, 15)</code> — total output = 57 and the channel funding input is 100, so the fee is 43.  B signs this version of the commitment with <code>SIGHASH_ALL</code>, and provides the signature it got from A, which is a <code>SIGHASH_ALL|SIGHASH_OUTPUTDELTABOUNDS(vout=1,delta_max=42,delta_min=100)</code>.  This validates, as the <code>delta_min</code> and <code>delta_max</code> bounds mean that the B output can be anywhere from <code>(B, 0)</code> to <code>(B, 58)</code>, and A still signs off on its output being <code>(A, 42)</code>.</p>\n<p>The net effect is that B is the one paying for the commitment transaction onchain fee using its in-channel funds.</p>\n<p>Similarly, second-stage HTLC transactions can use the same technique.  Suppose there was an HTLC offerred by B to A.  When A is signing for the second-stage HTLC transaction (an “HTLC-timeout” tx in BOLT 3 parlance), A would sign <code>SIGHASH_ALL|SIGHASH_OUTPUTDELTABOUNDS</code> with <code>vout_index=0</code>,<code>delta_max=0</code>,<code>delta_min=&lt;htlc_amount&gt;</code>.  This allows B to confirm this second-stage HTLC by spending up to the entire amount of the HTLC (<code>delta_min=&lt;htlc_amount&gt;</code>) into fees, or having very little fees (<code>delta_max=0</code>) if the mempool is empty.</p>\n<h1><a name=\"decker-russell-osuntokun-2\" class=\"anchor\" href=\"#decker-russell-osuntokun-2\"></a>Decker-Russell-Osuntokun</h1>\n<p>Now let us turn to Decker-Russell-Osuntokun.  A weakness of this scheme is that, because the update transaction MUST be spendable by another, later update transaction, the amount of the update transaction output MUST equal the amount of the channel funding outpoint.  This means that an update transaction CANNOT spend any in-channel funds to pay its own fees.  Instead, you are supposed to add on an extra input to pay for fees, and since it is very unlikely you have a coin that is exactly the fee you need, you also want to add on a change output for your input coin minus the fee you pay.  This means that most update transactions will be 2 inputs (1 = channel funding output OR previous update transaction output, 1 = your fee-paying input) and 2 outputs (1 = new update transaction output, 1 = change for your fee payment).</p>\n<p>Now suppose we instead used <code>SIGHASH_NOINPUT|SIGHASH_OUTPUTDELTABOUNDS</code>.  In such a case, all participants in the Decker-Russell-Osuntokun would need to agree on some “maximum fee” that an update transaction would pay.  However, we can then make update transactions 1-input 1-output, deducting fees from the shared funds of the mechanism.</p>\n<p>The reason why we have a “maximum fee” is that the output of the update transaction is still semantically a shared UTXO between all participants.  If one of the participants in the Decker-Russell-Osuntokun mechanism was secretly a miner, and there was no maximum fee, then the miner could set the output of the update transaction to 0 (or dust, whatever) and give all the amount to fee for itself.</p>\n<p>This maximum fee is then imposed by the <code>delta_min</code>, such that if the agreed-upon maximum fee is <code>maximum_update_tx_fee</code>, <code>delta_min=maximum_update_tx_fee</code> and <code>delta_max=0</code>.</p>\n<p>When participants are exchanging signatures for the update transactions, they sign with <code>SIGHASH_NOINPUT|SIGHASH_OUTPUTDELTABOUNDS(vout=0,delta_max=0,delta_min=maximum_update_tx_fee)</code>.</p>\n<p>When one of the participants needs to publish an update transaction, they add their signature with <code>SIGHASH_ALL</code> committing to a specific spent input and output amount, and thus indirectly commits to a specific fee deducted.   They also then use the signatures they received from the other participants in the mechanism, which bound how much of the total channel funds can be spent in a single update transaction.</p>\n<p>Since the amount of the update transaction is also variable now, the state transactions of the Decker-Russell-Osuntokun also need to be signed using <code>SIGHASH_OUTPUTDELTABOUNDS</code> in addition to <code>SIGHASH_NOINPUT</code>.  Further, each participants gets its own version of the state transaction.  In its own version, it can freely deduct its own output — the <code>SIGHASH_OUTPUT_DELTABOUNDS</code> points to “their” output as its <code>vout</code> — but cannot change the other outputs, which have fixed amounts committed to by <code>SIGHASH_NOINPUT</code>.  This is similar to the previous example of Poon-Dryja (where each participant has its own commitment tx), and generalizes to the state transaction of this variant of Decker-Russell-Osuntokun just as well (where instead of a common state transaction as in the original paper, we have each participant its own state transaction, with the rule that the signatures they hold allow them to only deduct from their own transaction output).  The net effect is that if a participant is the one that publishes its version of the state transaction, it is the one that pays for the fees of all the update transactions and the state transaction.</p>\n<h3><a name=\"multiple-update-transactions-oh-no-3\" class=\"anchor\" href=\"#multiple-update-transactions-oh-no-3\"></a>Multiple Update Transactions Oh No!</h3>\n<p>Now of course an edge case with Decker-Russell-Osuntokun is that the participants can do update transaction tennis, where if the latest state is N, one participant first publishes N - 1000, then another participant publishes N - 999, then another publishes N - 998, then another publishes N - 997 etc. until one participant finally publishes update transaction N.  Of course, each such update transaction will need to pay fees.</p>\n<p>If we are using <code>SIGHASH_OUTPUTDELTABOUNDS</code> then it means that each update transaction lowers the shared channel funding to pay for the fee, until none of the state transactions can be published because the final update transaction output amount is too small to pay for the state transaction.</p>\n<p>This is however a case of “Doctor, it hurts when I <em><strong>DO THIS</strong></em>” and the doctor says “<em><strong>EWW DO NOT DO THAT BAD THING I NEVER EVEN DID THAT TO THE CADAVERS I PLAYED WITH IN MED SCHOOL</strong></em>”.  That is: do not play update transaction tennis, always just honestly publish the latest update transaction to stop the bleeding of the shared mechanism funds into fees for update transactions.</p>\n<p>Of course, the problem is that <em>in practice</em>, what you <em>think</em> is the latest <em>might not</em> be the latest.</p>\n<p>The classic example is of course the naive Lightning Network operator who restores from a backup that was made 2 seconds ago, when the latest update to the channel happened 1 second ago.  But if your peer restores from an old backup — then just do not engage in update transaction tennis and publish the latest update transaction.</p>\n<p>Another and perhaps more problematic example is a sophisticated Lightning Network operator who distributes their updates among multiple watchtowers.  Suppose that the node has signed off on a new state and handed over signatures, but has not gotten around to sending its received signatures for the latest state to the watchtowers.  Worse, our sophisticated Lightning Network operator heard that one of its watchtowers was actually operated by furries, who everyone on the Internet hates because furries, so they stop sending their updates to that watchtower. And then their counterparty, who is a naive Lightning Network operator, restores from a backup that was made 5 seconds ago.  And now the sophisticated Lightning Network operator, while rage-tweeting about furry-run watchtowers on the platform formerly known as Twitter and now known as the X Windows System, accidentally kicks the power supply of the Raspberry Pi (like why is the Raspberry Pi USB-C receptacle so weak anyway???).  This causes the watchtower run by furries to publish the last update transaction it received from 4 seconds ago (because that is how recently the sophisticated Lightning Network operator learned that they were run by furries).  However, the Real Watchtower run by Real Men And Women And Definitely Not Furries was given an update transaction from 3 seconds ago, but because everyone was using it now because it is not run by furries, it had a bit longer latency to respond to the new block and can only publish the 3-seconds-ago update transaction after the furry-run watchtower.  (Un)Fortunately, the sophisticated Lightning Network operator has managed to bring the Raspberry Pi back online, which now publishes the REAL latest update transaction from 2 seconds ago, because it was 2 seconds ago that its power supply was kicked and it was just encrypting the packet it was going to send to the Real Watchtower run by Real Men And Women And Definitely Not Furries.</p>\n<p>On the other hand, we can argue that an accident like the above is unlikely.  As a mitigation, watchtowers of Decker-Russell-Osuntokun mechanisms using this <code>SIGHASH_OUTPUTDELTABOUNDS</code> can probably afford to wait a few blocks in case the “real” nodes come online to give the REAL latest update transaction, to help mitigate this comedy of errors that leads to an accidental update transaction tennis.</p>\n<h1><a name=\"generalizing-4\" class=\"anchor\" href=\"#generalizing-4\"></a>Generalizing</h1>\n<p>Of course, why settle for special signatures?</p>\n<p>Instead of “just” signatures, we could add new fields in the Taproot annex.  If so, we should probably TLV-encode the Taproot annex, so as to maximize the flexibility of the fields that the Taproot annex can contain in the future.  When can then define a special annex TLV type that contains the <code>vout_index|delta_min|delta_max</code> tuple.  If this annex TLV type exists, then the indicated output must be within <code>delta_max</code> to <code>delta_min</code> satoshis of the input the annex is on.</p>\n<p>We can then make <code>SIGHASH_OUTPUTDELTABOUNDS</code> a “real” <code>SIGHASH</code> that you can bitwise-OR, e.g. <code>0x40</code>.  If this flag is set, then the Taproot annex MUST contain the <code>vout_index|delta_min|delta_max</code> TLV type, AND the <code>SIGHASH</code> computes as if the input has 0 amount and the output at <code>vout_index</code> has 0 amount (to allow the input and output to vary).  The annex itself is committed to under most <code>SIGHASH</code> variants. This would be equivalent in power to the scheme initially described above.  This scheme may be “more correct” than the initially-described scheme.</p>\n<p>As an annex field, we can then add new opcodes that can introspect the <code>vout_index</code>, <code>delta_min</code> and <code>delta_max</code> for whatever covenanty goodness it might have.  This can be done in a later softfork.</p>\n<h3><a name=\"intuition-5\" class=\"anchor\" href=\"#intuition-5\"></a>Intuition</h3>\n<p>A signature with <code>SIGHASH_OUTPUTDELTABOUNDS</code> effectively says “I allow this input to contribute fees within these bounds — adjust the output at <code>vout_index</code> to pay for the fees”.</p>\n<p>If we go the annex way, then the annex says “this input contributes fees within these bounds — adjust the output at <code>vout_index</code> to pay for the fees”.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-01-31T06:52:48.570Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 7,
  "reads": 18,
  "readers_count": 17,
  "score": 33.2,
  "yours": false,
  "topic_id": 504,
  "topic_slug": "sighash-outputdeltabounds",
  "topic_title": "`sighash_outputdeltabounds`",
  "topic_html_title": "`sighash_outputdeltabounds`",
  "category_id": 7,
  "display_username": "ZmnSCPxj jxPCSnmZ",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Here is a proposal for a new `SIGHASH` scheme.  The intent of this new scheme is to allow Poon-Dryja to defer feerate decisions later while paying from the in-channel funds (instead of requiring an extra UTXO and an artificial change output (\"anchor\")), as well as to allow Decker-Russell-Osuntokun update transactions to be paid from in-channel funds (normally the requirement that the input amount == output amount prevents update transactions from paying their own fee and requiring an additional input to pay fee) in addition to letting feerate decisions be deferred later, as well.\n\nIn a new Tapleaf version, the signature operand given to `OP_CHECKSIG`/`OP_CHECKSIG_VERIFY`/`OP_CHECKSIGADD` can be 84 bytes:\n\n* 1 byte: `SIGHASH` flags\n* 3 bytes: unsigned integer indicating a `vout_index`\n* 8 bytes: signed integer indicating a difference, the `delta_min`\n* 8 bytes: signed integer indicating a difference, the `delta_max`\n* 64 bytes: Schnorr signature as defined by Taproot\n\nIf so, the operation `OP_CHECKSIG`(`ADD`,`VERIFY), in addition to performing signature validation, also performs the following:\n\n* Get the amount of the input this is spending as `input_amount`, a signed integer.\n* Calculate: `min = input_amount - delta_min` (`delta_min` is signed so this can become an addition, if this would cause overflow, fail; the result can be negative and negative `min` is still valid)\n* Calculate: `max = input_amount - delta_max` (ditto)\n* Check `min <= max`, if not, fail\n* Get the amount of the output that is at `vout_index` as `output_amount`, a signed integer.\n* Check `min <= output_amount <= max`, if not, fail.\n\nIf the above validation succeeds, then the sighash function is also modified as follows:\n\n* Instead of a 1-byte `SIGHASH`, use the first 20 bytes (ie. `SIGHASH|vout_index|delta_min|delta_max`)\n* When getting the amount for this input, treat it as being 0 amount.\n* When getting the amount for the output at `vout_index`, treat it as being 0 amount.\n* Otherwise same as Taproot sighash.\n\nFor example, suppose you have a tx with an input `txid1:vout1` with amount `100` and two outputs `(A, 42)` and `(B, 15)`, and you do a `SIGHASH_ALL` in the sighash byte while having a `SIGHASH_OUTPUTDELTABOUNDS` (i.e. using the above 84-byte blob instead of a 64-byte or 65-byte blob) with `vout=1`, `delta_min=90`,`delta_max=42`. Then you would sign as if the transaction had an input `txid1:vout1` with amount `0`, and outputs `(A, 42)` and `(B, 0)`.  The `OP_CHECKSIG` would also validate that the output `(B,15)` has an amount between `100 - 90 <= output <= 100 - 42`, which in this case would pass.\n\nThe result of this is that a signature that signs for `SIGHASH_OUTPUTDELTABOUNDS` will impose bounds on a particular output, so that it is within some number of satoshis of the input being signed for.\n\nPoon-Dryja\n=========\n\nLet me propose an alternate Poon-Dryja-based protocol.  When exchanging signatures for commitment transactions, we send a signatures with `SIGHASH_ALL|SIGHASH_OUTPUTDELTABOUNDS` for the commitment transaction of the peer. As a concrete example, suppose the commitment transaction has the following state:\n\n* channel funding input = 100\n* output to A = 42\n* output to B = 58\n* No HTLCs\n\nAs is typical, the channel funding output is a 2-of-2 between A and B.  In our case, it would have a tapleaf with version supporting `SIGHASH_OUTPUTDELTABOUNDS`, whose script is a trivial separate-signature 2-of-2 `<A> OP_CHECKSIGVERIFY <B> OP_CHECKSIG`.\n\nSuppose A is giving the signature for the commitment transaction held by B.  In that case, it creates a `SIGHASH_ALL|SIGHASH_OUTPUTDELTABOUNDS` with `vout_index=1` (the index of output to B), `delta_max=42` (the channel funding input minus the amount to B), and `delta_min=100` (the channel funding input).  This is a signature that commits spending the funding outpoint to the output set `(A, 42)` and `(B, 0)`, as it is `SIGHASH_ALL`.\n\nNow suppose after A gives that signature, A never comes online again.  In the meantime, cute dog webp images become popular on the blockchain, so that in order for B to get the commitment transaction confirmed, it needs to pay 43 units.  In that case, B constructs a commitment transaction that has outputs `(A,42)`, `(B, 15)` --- total output = 57 and the channel funding input is 100, so the fee is 43.  B signs this version of the commitment with `SIGHASH_ALL`, and provides the signature it got from A, which is a `SIGHASH_ALL|SIGHASH_OUTPUTDELTABOUNDS(vout=1,delta_max=42,delta_min=100)`.  This validates, as the `delta_min` and `delta_max` bounds mean that the B output can be anywhere from `(B, 0)` to `(B, 58)`, and A still signs off on its output being `(A, 42)`.\n\nThe net effect is that B is the one paying for the commitment transaction onchain fee using its in-channel funds.\n\nSimilarly, second-stage HTLC transactions can use the same technique.  Suppose there was an HTLC offerred by B to A.  When A is signing for the second-stage HTLC transaction (an \"HTLC-timeout\" tx in BOLT 3 parlance), A would sign `SIGHASH_ALL|SIGHASH_OUTPUTDELTABOUNDS` with `vout_index=0`,`delta_max=0`,`delta_min=<htlc_amount>`.  This allows B to confirm this second-stage HTLC by spending up to the entire amount of the HTLC (`delta_min=<htlc_amount>`) into fees, or having very little fees (`delta_max=0`) if the mempool is empty.\n\nDecker-Russell-Osuntokun\n==============\n\nNow let us turn to Decker-Russell-Osuntokun.  A weakness of this scheme is that, because the update transaction MUST be spendable by another, later update transaction, the amount of the update transaction output MUST equal the amount of the channel funding outpoint.  This means that an update transaction CANNOT spend any in-channel funds to pay its own fees.  Instead, you are supposed to add on an extra input to pay for fees, and since it is very unlikely you have a coin that is exactly the fee you need, you also want to add on a change output for your input coin minus the fee you pay.  This means that most update transactions will be 2 inputs (1 = channel funding output OR previous update transaction output, 1 = your fee-paying input) and 2 outputs (1 = new update transaction output, 1 = change for your fee payment).\n\nNow suppose we instead used `SIGHASH_NOINPUT|SIGHASH_OUTPUTDELTABOUNDS`.  In such a case, all participants in the Decker-Russell-Osuntokun would need to agree on some \"maximum fee\" that an update transaction would pay.  However, we can then make update transactions 1-input 1-output, deducting fees from the shared funds of the mechanism.\n\nThe reason why we have a \"maximum fee\" is that the output of the update transaction is still semantically a shared UTXO between all participants.  If one of the participants in the Decker-Russell-Osuntokun mechanism was secretly a miner, and there was no maximum fee, then the miner could set the output of the update transaction to 0 (or dust, whatever) and give all the amount to fee for itself.\n\nThis maximum fee is then imposed by the `delta_min`, such that if the agreed-upon maximum fee is `maximum_update_tx_fee`, `delta_min=maximum_update_tx_fee` and `delta_max=0`.\n\nWhen participants are exchanging signatures for the update transactions, they sign with `SIGHASH_NOINPUT|SIGHASH_OUTPUTDELTABOUNDS(vout=0,delta_max=0,delta_min=maximum_update_tx_fee)`.\n\nWhen one of the participants needs to publish an update transaction, they add their signature with `SIGHASH_ALL` committing to a specific spent input and output amount, and thus indirectly commits to a specific fee deducted.   They also then use the signatures they received from the other participants in the mechanism, which bound how much of the total channel funds can be spent in a single update transaction.\n\nSince the amount of the update transaction is also variable now, the state transactions of the Decker-Russell-Osuntokun also need to be signed using `SIGHASH_OUTPUTDELTABOUNDS` in addition to `SIGHASH_NOINPUT`.  Further, each participants gets its own version of the state transaction.  In its own version, it can freely deduct its own output --- the `SIGHASH_OUTPUT_DELTABOUNDS` points to \"their\" output as its `vout` --- but cannot change the other outputs, which have fixed amounts committed to by `SIGHASH_NOINPUT`.  This is similar to the previous example of Poon-Dryja (where each participant has its own commitment tx), and generalizes to the state transaction of this variant of Decker-Russell-Osuntokun just as well (where instead of a common state transaction as in the original paper, we have each participant its own state transaction, with the rule that the signatures they hold allow them to only deduct from their own transaction output).  The net effect is that if a participant is the one that publishes its version of the state transaction, it is the one that pays for the fees of all the update transactions and the state transaction.\n\n### Multiple Update Transactions Oh No!\n\nNow of course an edge case with Decker-Russell-Osuntokun is that the participants can do update transaction tennis, where if the latest state is N, one participant first publishes N - 1000, then another participant publishes N - 999, then another publishes N - 998, then another publishes N - 997 etc. until one participant finally publishes update transaction N.  Of course, each such update transaction will need to pay fees.\n\nIf we are using `SIGHASH_OUTPUTDELTABOUNDS` then it means that each update transaction lowers the shared channel funding to pay for the fee, until none of the state transactions can be published because the final update transaction output amount is too small to pay for the state transaction.\n\nThis is however a case of \"Doctor, it hurts when I ***DO THIS***\" and the doctor says \"***EWW DO NOT DO THAT BAD THING I NEVER EVEN DID THAT TO THE CADAVERS I PLAYED WITH IN MED SCHOOL***\".  That is: do not play update transaction tennis, always just honestly publish the latest update transaction to stop the bleeding of the shared mechanism funds into fees for update transactions.\n\nOf course, the problem is that *in practice*, what you *think* is the latest *might not* be the latest.\n\nThe classic example is of course the naive Lightning Network operator who restores from a backup that was made 2 seconds ago, when the latest update to the channel happened 1 second ago.  But if your peer restores from an old backup --- then just do not engage in update transaction tennis and publish the latest update transaction.\n\nAnother and perhaps more problematic example is a sophisticated Lightning Network operator who distributes their updates among multiple watchtowers.  Suppose that the node has signed off on a new state and handed over signatures, but has not gotten around to sending its received signatures for the latest state to the watchtowers.  Worse, our sophisticated Lightning Network operator heard that one of its watchtowers was actually operated by furries, who everyone on the Internet hates because furries, so they stop sending their updates to that watchtower. And then their counterparty, who is a naive Lightning Network operator, restores from a backup that was made 5 seconds ago.  And now the sophisticated Lightning Network operator, while rage-tweeting about furry-run watchtowers on the platform formerly known as Twitter and now known as the X Windows System, accidentally kicks the power supply of the Raspberry Pi (like why is the Raspberry Pi USB-C receptacle so weak anyway???).  This causes the watchtower run by furries to publish the last update transaction it received from 4 seconds ago (because that is how recently the sophisticated Lightning Network operator learned that they were run by furries).  However, the Real Watchtower run by Real Men And Women And Definitely Not Furries was given an update transaction from 3 seconds ago, but because everyone was using it now because it is not run by furries, it had a bit longer latency to respond to the new block and can only publish the 3-seconds-ago update transaction after the furry-run watchtower.  (Un)Fortunately, the sophisticated Lightning Network operator has managed to bring the Raspberry Pi back online, which now publishes the REAL latest update transaction from 2 seconds ago, because it was 2 seconds ago that its power supply was kicked and it was just encrypting the packet it was going to send to the Real Watchtower run by Real Men And Women And Definitely Not Furries.\n\nOn the other hand, we can argue that an accident like the above is unlikely.  As a mitigation, watchtowers of Decker-Russell-Osuntokun mechanisms using this `SIGHASH_OUTPUTDELTABOUNDS` can probably afford to wait a few blocks in case the \"real\" nodes come online to give the REAL latest update transaction, to help mitigate this comedy of errors that leads to an accidental update transaction tennis.\n\nGeneralizing\n==========\n\nOf course, why settle for special signatures?\n\nInstead of \"just\" signatures, we could add new fields in the Taproot annex.  If so, we should probably TLV-encode the Taproot annex, so as to maximize the flexibility of the fields that the Taproot annex can contain in the future.  When can then define a special annex TLV type that contains the `vout_index|delta_min|delta_max` tuple.  If this annex TLV type exists, then the indicated output must be within `delta_max` to `delta_min` satoshis of the input the annex is on.\n\nWe can then make `SIGHASH_OUTPUTDELTABOUNDS` a \"real\" `SIGHASH` that you can bitwise-OR, e.g. `0x40`.  If this flag is set, then the Taproot annex MUST contain the `vout_index|delta_min|delta_max` TLV type, AND the `SIGHASH` computes as if the input has 0 amount and the output at `vout_index` has 0 amount (to allow the input and output to vary).  The annex itself is committed to under most `SIGHASH` variants. This would be equivalent in power to the scheme initially described above.  This scheme may be \"more correct\" than the initially-described scheme.\n\nAs an annex field, we can then add new opcodes that can introspect the `vout_index`, `delta_min` and `delta_max` for whatever covenanty goodness it might have.  This can be done in a later softfork.\n\n### Intuition\n\nA signature with `SIGHASH_OUTPUTDELTABOUNDS` effectively says \"I allow this input to contribute fees within these bounds --- adjust the output at `vout_index` to pay for the fees\".\n\nIf we go the annex way, then the annex says \"this input contributes fees within these bounds --- adjust the output at `vout_index` to pay for the fees\".",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 104,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}