{
  "id": 1294,
  "name": "David Wong",
  "username": "mimoo",
  "avatar_template": "/letter_avatar_proxy/v4/letter/m/e95f7d/{size}.png",
  "created_at": "2024-01-23T02:42:25.946Z",
  "cooked": "<p>Hello hello.</p>\n<p>I guess this is my first post, just wanted to let you know that Ivan and I have been working for a few weeks on a minimal L2 that would allow people to build zkapps (zero-knowledge applications) on Bitcoin. It does not verify zero-knowledge proofs directly on Bitcoin (unless we have new opcodes it’s just not possible). Instead it relies on a multi-party computation between nodes to manage a wallet, which tracks on-chain zkapps and their state (in the case they are stateful). The nice thing about the design is that MPC nodes don’t need to know about the canonical chain, so they’re really light to run, and could even easily run in trusted execution environment to provide some more defense-in-depth. We’re looking for well-known ZK individuals to run nodes in order to maintain this service and have a large threshold parameter (the larger, the more nodes an attacker would need to compromise to compromise the L2). For now we’re just running on testnet. As far as I know something like this didn’t exist until today, so now you can use protocols like zkLogin or zkMail to lock your Bitcoin in zkapp and unlock them with a proof of login on Google or a proof that you received some email <img src=\"https://delvingbitcoin.org/uploads/default/original/1X/5aaddedce26377a1c157230f348187d7ba4d8e8f.gif\" alt=\"Smiley\" data-base62-sha1=\"cWbugZPJ3QDP63GwL2a9hWZe4HR\" width=\"15\" height=\"15\"></p>\n<p>You can check the CLI here: <a href=\"https://github.com/sigma0-xyz/zkbitcoin\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - sigma0-xyz/zkbitcoin: zkBitcoin: zero-knowledge proofs on Bitcoin!</a></p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-01-23T02:47:33.315Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 63,
  "reads": 18,
  "readers_count": 17,
  "score": 348.6,
  "yours": false,
  "topic_id": 464,
  "topic_slug": "zkbitcoin-zero-knowledge-proof-apps-on-bitcoin",
  "topic_title": "zkBitcoin: zero-knowledge proof apps on Bitcoin",
  "topic_html_title": "zkBitcoin: zero-knowledge proof apps on Bitcoin",
  "category_id": 7,
  "display_username": "David Wong",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Hello hello.\n\nI guess this is my first post, just wanted to let you know that Ivan and I have been working for a few weeks on a minimal L2 that would allow people to build zkapps (zero-knowledge applications) on Bitcoin. It does not verify zero-knowledge proofs directly on Bitcoin (unless we have new opcodes it's just not possible). Instead it relies on a multi-party computation between nodes to manage a wallet, which tracks on-chain zkapps and their state (in the case they are stateful). The nice thing about the design is that MPC nodes don't need to know about the canonical chain, so they're really light to run, and could even easily run in trusted execution environment to provide some more defense-in-depth. We're looking for well-known ZK individuals to run nodes in order to maintain this service and have a large threshold parameter (the larger, the more nodes an attacker would need to compromise to compromise the L2). For now we're just running on testnet. As far as I know something like this didn't exist until today, so now you can use protocols like zkLogin or zkMail to lock your Bitcoin in zkapp and unlock them with a proof of login on Google or a proof that you received some email ![Smiley](upload://cWbugZPJ3QDP63GwL2a9hWZe4HR.gif)\n\nYou can check the CLI here: https://github.com/sigma0-xyz/zkbitcoin",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 248,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "downloaded local copies of images",
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false
}