{
  "id": 1046,
  "name": "Suhas Daftuar",
  "username": "sdaftuar",
  "avatar_template": "/letter_avatar_proxy/v4/letter/s/0ea827/{size}.png",
  "created_at": "2024-01-09T17:45:37.198Z",
  "cooked": "<p>Last spring, <a class=\"mention\" href=\"/u/sipa\">@sipa</a> and I first floated a concept for a new mempool design to a group of Bitcoin Core contributors, which I later wrote up as a github issue (<a href=\"https://github.com/bitcoin/bitcoin/issues/27677\" class=\"inline-onebox\">Proposal for a new mempool design · Issue #27677 · bitcoin/bitcoin · GitHub</a>).  Over the course of the past year, the ideas have been refined, and I will use this post to provide an updated high level summary of the overall proposal – including the motivations and implications – for anyone looking to catch up on this topic.</p>\n<hr>\n<h1><a name=\"proposal-overview-in-brief-1\" class=\"anchor\" href=\"#proposal-overview-in-brief-1\"></a>Proposal overview in brief</h1>\n<p>Here is a summary of the mempool policy changes in the draft implementation (<a href=\"https://github.com/bitcoin/bitcoin/pull/28676\" class=\"inline-onebox\">[WIP] Cluster mempool implementation by sdaftuar · Pull Request #28676 · bitcoin/bitcoin · GitHub</a>) – note that all these terms and ideas are explained further below:</p>\n<ul>\n<li>\n<p>Enforce two new limits governing the size of <em>clusters</em> in the mempool, so that both the number of transactions in a cluster and the number of vbytes the transactions in the cluster take up are bounded.</p>\n</li>\n<li>\n<p>Drop the existing ancestor and descendant limits.</p>\n</li>\n<li>\n<p>Update the replace-by-fee rules, so that replacement transactions are accepted to the mempool if and only if they would result in a “strictly better feerate diagram” (explained below).</p>\n</li>\n</ul>\n<p>Note that adding a new restriction on the transaction graph immediately makes the existing “CPFP carveout” policy moot, so that is also removed.  See discussion below.</p>\n<p>Also, by bounding cluster sizes, we are able to achieve more optimal orderings of transactions in the mempool for mining (explained below), and so there are two additional behaviors that would be modified by this proposal:</p>\n<ul>\n<li>\n<p>Update the mining code to take advantage of the more optimal sorting that can be achieved with bounded cluster sizes, and–</p>\n</li>\n<li>\n<p>Update mempool eviction to always evict a set of transactions that would be the last ones to be selected by the mining algorithm.</p>\n</li>\n</ul>\n<hr>\n<h1><a name=\"background-and-motivation-2\" class=\"anchor\" href=\"#background-and-motivation-2\"></a>Background and motivation</h1>\n<p>The current mempool is designed around maintaining two different sort orders, where for each transaction we keep track of its position in an ancestor-feerate-sort and in a descendant-feerate-sort.</p>\n<blockquote>\n<p><strong>Note</strong>: By “ancestor feerate” of a transaction, we refer to the sum of fees divided by sum of vbytes of a transaction along with its unconfirmed ancestors, which represents the minimal set of transactions that would need to be included for the transaction to be valid in a block.  “Descendant feerate” is the analogous concept for a transaction with its in-mempool descendants, which represents the minimal set of transactions that would need to be evicted from the mempool in order for the target transaction to be evicted, in order to avoid orphan transactions from persisting in the mempool.</p>\n</blockquote>\n<p>We use these two sort orders in order to implement eviction and transaction selection (for mining). Whenever the mempool exceeds its size limit, we evict the transaction that has the lowest descendant-feerate, along with all of the transaction’s descendants.  We repeat until the mempool is below its size limit.</p>\n<p>When we select transactions during block template construction, we choose the transaction with the highest ancestor feerate, and select that transaction with all its ancestors to appear in the block. The ancestor scores of the remaining in-mempool transactions are updated to reflect these selections, and then we repeat by choosing the transaction with next highest-ancestor feerate, and so on until the block is full.</p>\n<p>Those algorithms are deficient in several ways. In particular, the eviction algorithm <strong>does not guarantee that the first transaction evicted would be the last transaction mined</strong>, and there exist situations where we could evict a transaction that would otherwise be mined in the next block (see below).</p>\n<p>Furthermore, the mining algorithm is more complex than the ancestor feerate sort we maintain, and it is insufficient to merely do lookups into our ancestor feerate index to determine which of two transactions will be mined from the mempool first. This lack of a total ordering on mempool transactions makes RBF calculations difficult to align with miner incentives, and creates distortions where we sometimes can replace transactions via RBF that would actually be better for a miner than the replacement.</p>\n<p>To solve all these problems, we can instead maintain a total ordering on mempool transactions, which is used to implement a mining and eviction algorithm that are symmetrically opposite and provide better RBF rules for determining when to allow a replacement to occur.</p>\n<h2><a name=\"example-eviction-and-mining-are-not-opposite-3\" class=\"anchor\" href=\"#example-eviction-and-mining-are-not-opposite-3\"></a>Example: Eviction and mining are not opposite</h2>\n<p>Consider the following transaction graph:</p>\n<pre data-code-height=\"233\" data-code-wrap=\"mermaid\"><code class=\"lang-mermaid\">graph TD;\n    A[\"A: 3 sat/vB\"]--&gt;B;\n    A--&gt;C;\n    A--&gt;E[\"E: 9 sat/vB\"];\n    B[\"B:1 sat/vB \"]--&gt;D[\"D 11 sat/vB\"];\n    C[\"C: 1 sat/vB\"]--&gt;D;\n</code></pre>\n<p>The transaction with lowest descendant feerate is tx A, at 5 sat/vB.  However, the transaction with highest ancestor feerate is tx E, at 6 sat/vB.  This means that our mining algorithm would select transaction E (along with A) to appear in the next block, but our eviction algorithm would select tx A and evict this whole transaction graph if we were above our size limit.</p>\n<blockquote>\n<p><strong>Note:</strong> A more complex example that exaggerates the difference between these feerates can be found <a href=\"https://github.com/bitcoin/bitcoin/issues/27677#eviction-mining-not-opposite\">here</a>.</p>\n</blockquote>\n<h2><a name=\"example-our-current-rbf-rules-are-not-always-incentive-compatible-4\" class=\"anchor\" href=\"#example-our-current-rbf-rules-are-not-always-incentive-compatible-4\"></a>Example: Our current RBF rules are not always incentive compatible</h2>\n<p>When a transaction is received that conflicts with some existing in-mempool transaction(s), Bitcoin Core uses policy rules that are (roughly) described in <a href=\"https://github.com/bitcoin/bips/blob/deae64bfd31f6938253c05392aa355bf6d7e7605/bip-0125.mediawiki\">BIP 125</a> in order to determine if the new transaction should be accepted (which requires evicting the conflicts from the mempool). However, there are many forms of incentive incompatibility that are part of those rules:</p>\n<ul>\n<li>The “no-new-parents” rule doesn’t consider the replacement transaction’s desirability to a miner – it might be better than all the to-be-replaced transactions, despite the new unconfirmed parent.</li>\n<li>The rule requiring that a new transaction pays a higher feerate than its direct conflicts is insufficient to ensure that the new transaction is more desirable than what is being evicted.</li>\n</ul>\n<p>To illustrate some specific incentive compatibility issues, consider this example, where A+B are already in the mempool, and transaction A’ arrives that conflicts with A:</p>\n<pre data-code-height=\"146\" data-code-wrap=\"mermaid\"><code class=\"lang-mermaid\">graph TD;\n    A[\"A: 1 sat/vB, size 100\"]--&gt;B;\n    B[\"B:99 sat/vB, size 100 \"]\n    A'[\"A': 3 sat/vB, size 10000\"]\n</code></pre>\n<p>Here, transaction B has an ancestor feerate of 50 sat/vB, while tx B is only paying 3 sat/vB.  Yet under BIP 125 rules we would evaluate A’ as a successful replacement of [A, B], because it pays a higher feerate than A (3 sat/vB vs 1 sat/vB) and pays a higher total fee than A+B (30,000 sats vs. 10,000 sats).</p>\n<p>Failure to accept incentive compatible replacements can also occur; consider this example, where A and B are already in the mempool, and B’ is a potential replacement of B:</p>\n<pre data-code-height=\"146\" data-code-wrap=\"mermaid\"><code class=\"lang-mermaid\">graph TD;\n    A[\"A: 1 sat/vB, size 10000\"]--&gt;B;\n    A-.-&gt;B'\n    B[\"B:100 sat/vB, size 100 \"]\n\n    B'[\"B': 49 sat/vB, size 10000\"]\n</code></pre>\n<p>B’ cannot replace B in the mempool under the BIP 125 rules, because it pays a lower feerate than B; however B’ has an ancestor feerate of 25 sat/vB, while B has an ancestor feerate of just under 2 sat/vB(!).</p>\n<p>Many other examples exist as well.</p>\n<hr>\n<h1><a name=\"designing-a-solution-5\" class=\"anchor\" href=\"#designing-a-solution-5\"></a>Designing a solution</h1>\n<h2><a name=\"maintaining-a-total-ordering-on-the-mempool-6\" class=\"anchor\" href=\"#maintaining-a-total-ordering-on-the-mempool-6\"></a>Maintaining a total ordering on the mempool</h2>\n<p>To fix the problem with eviction and mining, we start with the realization that those should be opposite operations on the mempool – when we need to evict, we should always evict the transactions that are least desirable to be mined.  The difficulty in achieving this with today’s mempool design is that we can’t easily calculate the last transaction that would be mined – the mining algorithm runs in time <span class=\"math\">O(dn \\log n)</span>, where <span class=\"math\">n</span> is the number of transactions in the mempool, and <span class=\"math\">d</span> is the descendant limit, so it is not currently feasible to run the algorithm on the entire mempool in order to calculate the transactions to evict first.</p>\n<p>However, that is exactly what we’d like to do – so a natural question to ask is, what bound could we add to the mempool in order to make it feasible to have a total ordering?  One way to see the answer to this question is to consider how many mempool transaction’s mining scores might be changed when a single new transaction is added – if we always maintained a full sort on the mempool, then this gives an idea of how much work might need to be done to update the mempool as transactions are added.</p>\n<p>The answer to this is that every transaction that is connected to a new transaction, via either parent or child relationships, might have its mining score changed. Consider this example (credit to <a class=\"mention\" href=\"/u/sipa\">@sipa</a>):</p>\n<pre data-code-height=\"108\" data-code-wrap=\"mermaid\"><code class=\"lang-mermaid\">graph TD;\n    A[\"A: 72 sat/vB\"]--&gt;B;\n    A--&gt;D[\"D: 78 sat/vB\"]\n    B[\"B:74 sat/vB\"]\n    C[\"C: 66 sat/vB\"]--&gt;D\n    C--&gt;F[\"F: 86 sat/vB\"]\n    E[\"E: 56 sat/vB\"]--&gt;F\n    E--&gt;H[\"H: 98 sat/vB\"]\n    G[\"G: 42sat/vB\"]--&gt;H\n    G--&gt;J[\"J: 114 sat/vB\"]\n    I[\"I: 24 sat/vB\"]--&gt;J\n    K[\"K: 2 sat/vB\"]--&gt;L[\"L: 134 sat/vB\"]\n    I--&gt;L\n</code></pre>\n<p>With some calculation, we can see that tx B has the highest ancestor feerate at 73 sat/vB.  Once it and tx A are selected for inclusion in a block, tx D would have the next highest ancestor feerate at 72 sat/vB, followed by tx D, tx F, tx H, tx J, and tx L.</p>\n<p>If a new transaction M were to arrive as follows:</p>\n<pre data-code-height=\"84\" data-code-wrap=\"mermaid\"><code class=\"lang-mermaid\">graph TD;\n    A[\"A: 72 sat/vB\"]--&gt;B;\n    A--&gt;D[\"D: 78 sat/vB\"]\n    B[\"B:74 sat/vB\"]\n    C[\"C: 66 sat/vB\"]--&gt;D\n    C--&gt;F[\"F: 86 sat/vB\"]\n    E[\"E: 56 sat/vB\"]--&gt;F\n    E--&gt;H[\"H: 98 sat/vB\"]\n    G[\"G: 42sat/vB\"]--&gt;H\n    G--&gt;J[\"J: 114 sat/vB\"]\n    I[\"I: 24 sat/vB\"]--&gt;J\n    K[\"K: 2 sat/vB\"]--&gt;L[\"L: 134 sat/vB\"]\n    I--&gt;L\n   K--&gt;M[\"M: 158 sat/vB\"]\n</code></pre>\n<p>Then the ancestor feerates get reversed(!).  The highest ancestor feerate is now tx M (80 sat/vB), followed by tx L (at 79 sat/vB, once tx K has been selected), and then J, H, F, D, and B – exactly in the reverse order as before transaction L arrived.</p>\n<p>This illustrates that to bound the work required to update mining scores when a new transaction is added, we must bound the size of connected components in the graph of transactions.  We refer to these connected components as <em>clusters</em>.</p>\n<h2><a name=\"implications-of-a-cluster-size-limit-7\" class=\"anchor\" href=\"#implications-of-a-cluster-size-limit-7\"></a>Implications of a cluster-size limit</h2>\n<h3><a name=\"we-can-keep-the-mempool-fully-sorted-at-all-times-8\" class=\"anchor\" href=\"#we-can-keep-the-mempool-fully-sorted-at-all-times-8\"></a>We can keep the mempool fully sorted at all times.</h3>\n<p>To fully sort the mempool, it suffices to (a) sort each cluster using some sorting/transaction selection algorithm (such as our existing ancestor-feerate algorithm), and (b) devising a way to merge sorted clusters together.</p>\n<p>For part (a), we can now realize that we might be able to do better than just use our ancestor feerate algorithm when sorting a cluster.  For very small clusters, we can use exponential run-time algorithms that select the optimal sort order across all possible topologically valid orderings of transactions.  For larger clusters, we can still fall back to using our ancestor feerate algorithm, or consider more advanced strategies, as long as we bound CPU usage to some reasonable value.</p>\n<blockquote>\n<p><strong>Note</strong>: we use the term <em>linearization</em> to refer to the process of producing a topologically valid ordering of transactions in a cluster.</p>\n</blockquote>\n<p>For part (b), merging sorted clusters together: this is straightforward.  Suppose we have two clusters, <span class=\"math\">C_1 = [tx_{a_1}, ..., tx_{a_n}]</span>, and <span class=\"math\">C_2 = [tx_{b_1}, ..., tx_{b_m}]</span>. To determine the optimal merge of these clusters into a single sort order, we want to find the highest feerate prefix of <span class=\"math\">C_1</span> and the highest feerate prefix of <span class=\"math\">C_2</span> and compare them; this best prefix should be the first set of transactions we would include in a block.  Then we’d remove those transactions from whichever cluster it came from, and repeat until all transactions are selected.</p>\n<blockquote>\n<p><strong>Note</strong>: we refer to the calculation of successive, highest-feerate-prefixes of a cluster as the <em>chunks</em> of a cluster.  We can calculate the chunks of a linearized cluster in linear time.</p>\n</blockquote>\n<p>For more information on these topics, and other related concepts, see <a class=\"mention\" href=\"/u/sipa\">@sipa</a>’s writeup <a href=\"https://delvingbitcoin.org/t/cluster-mempool-definitions-theory/202\">here</a>.</p>\n<h3><a name=\"with-a-fully-sorted-mempool-mining-transaction-selection-is-very-fast-9\" class=\"anchor\" href=\"#with-a-fully-sorted-mempool-mining-transaction-selection-is-very-fast-9\"></a>With a fully sorted mempool, mining transaction selection is very fast.</h3>\n<p>We simply iterate the clusters in descending chunk feerate order, and select transactions from each chunk, until the block is full.</p>\n<h3><a name=\"with-a-fully-sorted-mempool-eviction-is-the-opposite-of-mining-10\" class=\"anchor\" href=\"#with-a-fully-sorted-mempool-eviction-is-the-opposite-of-mining-10\"></a>With a fully sorted mempool, eviction is the opposite of mining.</h3>\n<p>To run the eviction algorithm when the mempool is full, we simply iterate the chunks in ascending chunk feerate order, and select chunks for eviction until the mempool is below its size limit.</p>\n<h3><a name=\"rbf-can-now-be-made-incentive-compatible-for-miners-11\" class=\"anchor\" href=\"#rbf-can-now-be-made-incentive-compatible-for-miners-11\"></a>RBF can now be made incentive compatible for miners.</h3>\n<p>The first question to ask is what “incentive compatible” should mean.  To consider what this should mean, consider the following example, where the mempool starts with these transactions (assume all transactions are 100 vB in size):</p>\n<pre data-code-height=\"146\" data-code-wrap=\"mermaid\"><code class=\"lang-mermaid\">graph TD;\n    A[Tx A: 1 sat/vB]--&gt;B[Tx B: 3.5 sat/vB];\n    A--&gt;C[Tx C: 5 sat/vB];\n    D[Tx D: 1 sat/vB];\n</code></pre>\n<p>And consider a potential replacement transaction E, which conflicts with tx C, and would produce the following mempool:</p>\n<pre data-code-height=\"146\" data-code-wrap=\"mermaid\"><code class=\"lang-mermaid\">graph TD;\n    A[Tx A: 1 sat/vB]--&gt;B[Tx B: 3.5 sat/vB];\n    D[Tx D: 1 sat/vB]--&gt;E[Tx E: 6 sat/vB];\n</code></pre>\n<p>How can we tell whether transaction E should be accepted?  Using the BIP 125 rules, we might say that E should be rejected because it brings in a new unconfirmed parent; or we might say that the unconfirmed parent rule is silly since we’re just replacing a parent with another parent of the exact same fee/size, and transaction E pays a strictly higher fee and feerate than C, so we should obviously take it.</p>\n<p>It turns out that neither of these explanations is wholly satisfactory.  Consider the total mempool sort order for the “old” mempool that contains tx C, and the “new” mempool that contains E instead.</p>\n<p>The optimal sort order for the “old” mempool is [A, B, C], [D] (brackets indicate chunks).  A miner who mined just the first chunk of that old mempool would collect 950 sats and have included 300 vB of size; a miner who mined the whole mempool would collect 1050 sats and included 400 vB of size.</p>\n<p>Meanwhile, the optimal sort of the new mempool would be: [D, E], [A, B]. A miner that included the first chunk would collect 700 sats in 200 vB of size; a miner including both chunks would collect 1150 sats in 400 vB of size.</p>\n<p>We can graph this data in what we have termed the “feerate diagram” of each mempool option, where on the x-axis we plot the size of the transactions included by a miner, and on the y-axis we plot the maximum fees that the miner can achieve at that size.  If we look at the feerate diagrams for this “old” and “new” mempool, we get the following:</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/1X/1c2a247ebb45bc3a930e83d0e900d19c741e8ca6.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/1c2a247ebb45bc3a930e83d0e900d19c741e8ca6\" title=\"Figure_1\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/1X/1c2a247ebb45bc3a930e83d0e900d19c741e8ca6_2_690x428.png\" alt=\"Figure_1\" data-base62-sha1=\"419ERV2azSMD2X1vcJOmTZenlRQ\" width=\"690\" height=\"428\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/1X/1c2a247ebb45bc3a930e83d0e900d19c741e8ca6_2_690x428.png, https://delvingbitcoin.org/uploads/default/original/1X/1c2a247ebb45bc3a930e83d0e900d19c741e8ca6.png 1.5x, https://delvingbitcoin.org/uploads/default/original/1X/1c2a247ebb45bc3a930e83d0e900d19c741e8ca6.png 2x\" data-dominant-color=\"FCFCFC\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">Figure_1</span><span class=\"informations\">1014×630 26.3 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p>Note that the (300, 950) point from the first diagram lies outside the diagram for the new mempool!  What this tells is that there are sizes at which the old mempool is better than the new one; and similarly in this example there are sizes for which the new mempool is better than the old one.</p>\n<p>We would say that these feerate diagrams are “incomparable”, meaning that neither one is strictly better than the other, and they are also not equivalent.  If the red line were greater than or equal to the blue line everywhere, and strictly better at least at one point, then we’d say that the new mempool was “strictly better” than the old one. This would mean that no matter how much size was selected from the mempool, that – ignoring the tail effects from when a block is nearly full – a miner would always be better off by selecting transactions from the “new” mempool rather than the old one.</p>\n<p>This graph shows why various heuristics for whether a replacement should be taken are unsatisfactory.  Instead, to ensure that a replacement is always better for miners, we propose making the RBF validation rule be that the mempool must get “strictly better” using this feerate diagram check in order to be accepted.</p>\n<blockquote>\n<p><strong>Note</strong>: To guard against free relay (an anti-DoS concern), we still will require that the total fee of the new transaction exceed the total fee of the conflicting transactions by at least as much as the min-relay-feerate * size of the new transaction.  However this is a small effect, since the incentive compatibility rule described above already requires that the total fee cannot go down – this just bumps that value up slightly.</p>\n</blockquote>\n<h3><a name=\"the-cpfp-carveout-rule-can-no-longer-be-supported-12\" class=\"anchor\" href=\"#the-cpfp-carveout-rule-can-no-longer-be-supported-12\"></a>The CPFP carveout rule can no longer be supported.</h3>\n<p>The CPFP carveout rule in Bitcoin Core currently allows the mempool to exceed the limit on the number of descendant transactions that a given transaction has, in a specific case that is relevant to the lightning protocol.</p>\n<p>The background here is that by default, our mempool policy is to reject an incoming transaction if it would cause some existing mempool transaction to have more than 25 descendant transactions.  In some lightning use case, as I understand it, two parties might both have spendable outputs from some parent transaction.  One of the parties might have an incentive to “pin” the transaction at a low feerate in the mempool by creating child spends that fill up the 25 permitted descendants, but don’t effectively bump the feerate to a significant value.  Meanwhile, the other party might wish to use CPFP to fee bump the parent, but be unable to do so because of this descendant limit having already been hit.</p>\n<p>The CPFP carveout rule specifically allows the mempool to exceed the descendant limit by exactly 1 transaction in the case where an incoming transaction has exactly 1 in-mempool ancestor (and where the incoming transaction has some small bounded size in vbytes).  The implication is that in a 2-party protocol where each party has a single spendable output from some shared transaction, that either party should always be able to add a child transaction that can bump the fee of the parent.  For more background and thoughts on this, see the mailing list <a href=\"https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2018-November/016518.html\">thread</a>.</p>\n<p>However, this CPFP carveout only makes sense because there are no other topology restrictions other than the descendant limit which can prevent a new transaction from being accepted.  By proposing the addition of a new cluster size limit, the CPFP carveout ceases to be helpful – an adversary can utilize the cluster size limit to prevent the other party from being able to attach a child transaction to the shared parent.  Moreover, because cluster limits are not a property of a particular transaction (the way that the descendant limit is), there is no straightforward way to introduce a new carveout that would apply to allow bypassing this limit in a bounded way.</p>\n<p>So the conclusion here is that the carveout rule must be dropped, and projects like lightning that currently rely on it would need to have some other mechanism to bypass this issue.  The <a href=\"https://delvingbitcoin.org/t/v3-transaction-policy-for-anti-pinning/340/1\">v3 transaction proposal</a> is one attempt to provide such a mechanism.</p>\n<hr>\n<h1><a name=\"considerations-13\" class=\"anchor\" href=\"#considerations-13\"></a>Considerations</h1>\n<h2><a name=\"is-it-reasonable-to-bound-cluster-sizes-14\" class=\"anchor\" href=\"#is-it-reasonable-to-bound-cluster-sizes-14\"></a>Is it reasonable to bound cluster sizes?</h2>\n<p>A fair question to raise is whether usage patterns on the network are inconsistent with the idea of a cluster size limit; specifically, if it is fair or if it’s a bad design that other participants on the network can attach children to a transaction in a way that interferes with someone’s ability to (say) attach their own child transaction to an unconfirmed parent.</p>\n<p>For this specific concern, I don’t believe that the cluster size limits are materially different in character than the existing descendant size limits.  In particular, any scenario where an adversary can attach transactions that would cause the cluster size to be reached (thus preventing an additional spend) is also a scenario where that same adversary could cause a descendant limit to be reached today.</p>\n<p>So my belief is that there’s nothing fundamentally worse about cluster size limits than descendant size limits (provided that we can set the cluster size limits to be at least as large as the current default descendant limit, which I expect should be the case).</p>\n<h2><a name=\"why-is-there-a-bound-on-cluster-size-in-vbytes-15\" class=\"anchor\" href=\"#why-is-there-a-bound-on-cluster-size-in-vbytes-15\"></a>Why is there a bound on cluster size in vbytes?</h2>\n<p>This is for exactly the same reason that we have a bound on the ancestor and descendant sizes – it provides a bound on how poorly transaction selection can work when we use a greedy algorithm, in situations where the knapsack problem is what we need to solve.  Specifically, by limiting ancestor sizes to approximately 10% of the size of a block, our greedy transaction selection algorithm will always be within 90% of the maximum fee that we’d achieve if we had a knapsack solver instead.</p>\n<p>Similarly, by bounding descendant sizes we also bound the small amount of free relay that can occur when mempool eviction happens.</p>\n<p>To achieve the same effect in cluster mempool, we need to bound chunk sizes.  The simplest way to do that is to bound a cluster size (since a cluster might consist of a single chunk).  While it may be theoretically possible to bound chunk sizes at a smaller value than the cluster size limit, this would create more theoretical questions that we’d need to resolve, which may not be worth the effort and complexity (as no longer would it be the case that chunk feerates within a cluster are monotonically decreasing).</p>\n<h2><a name=\"why-are-ancestor-and-descendant-limits-being-dropped-16\" class=\"anchor\" href=\"#why-are-ancestor-and-descendant-limits-being-dropped-16\"></a>Why are ancestor and descendant limits being dropped?</h2>\n<p>One benefit of the cluster mempool approach is that we no longer need to maintain ancestor and descendant feerate state, which means that we no longer need to iterate over ancestors/descendants when updating the mempool as transactions are added and removed, or when blocks are found.  This means that we no longer need to enforce limits on ancestor and descendant count in order to bound CPU usage.</p>\n<hr>\n<h1><a name=\"next-steps-17\" class=\"anchor\" href=\"#next-steps-17\"></a>Next steps</h1>\n<p>A draft implementation against a recent version of the Bitcoin Core master branch is available <a href=\"https://github.com/bitcoin/bitcoin/pull/28676\">here</a>.  The implementation details are still being improved upon, and the particular choices of parameters for cluster size limits and RBF will be determined after further benchmarking of the code and analysis of the effects of this logic on historical transaction data.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-01-09T18:42:59.707Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 9,
  "reads": 11,
  "readers_count": 10,
  "score": 47.2,
  "yours": false,
  "topic_id": 393,
  "topic_slug": "an-overview-of-the-cluster-mempool-proposal",
  "topic_title": "An overview of the cluster mempool proposal",
  "topic_html_title": "An overview of the cluster mempool proposal",
  "category_id": 8,
  "display_username": "Suhas Daftuar",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 4,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Last spring, @sipa and I first floated a concept for a new mempool design to a group of Bitcoin Core contributors, which I later wrote up as a github issue (https://github.com/bitcoin/bitcoin/issues/27677).  Over the course of the past year, the ideas have been refined, and I will use this post to provide an updated high level summary of the overall proposal -- including the motivations and implications -- for anyone looking to catch up on this topic.\n\n----------\n\n# Proposal overview in brief\n\nHere is a summary of the mempool policy changes in the draft implementation (https://github.com/bitcoin/bitcoin/pull/28676) -- note that all these terms and ideas are explained further below:\n\n* Enforce two new limits governing the size of *clusters* in the mempool, so that both the number of transactions in a cluster and the number of vbytes the transactions in the cluster take up are bounded.\n\n* Drop the existing ancestor and descendant limits.\n\n* Update the replace-by-fee rules, so that replacement transactions are accepted to the mempool if and only if they would result in a \"strictly better feerate diagram\" (explained below).\n\nNote that adding a new restriction on the transaction graph immediately makes the existing \"CPFP carveout\" policy moot, so that is also removed.  See discussion below.\n\nAlso, by bounding cluster sizes, we are able to achieve more optimal orderings of transactions in the mempool for mining (explained below), and so there are two additional behaviors that would be modified by this proposal:\n\n* Update the mining code to take advantage of the more optimal sorting that can be achieved with bounded cluster sizes, and--\n\n* Update mempool eviction to always evict a set of transactions that would be the last ones to be selected by the mining algorithm.\n----------\n# Background and motivation\n\nThe current mempool is designed around maintaining two different sort orders, where for each transaction we keep track of its position in an ancestor-feerate-sort and in a descendant-feerate-sort.\n\n> **Note**: By \"ancestor feerate\" of a transaction, we refer to the sum of fees divided by sum of vbytes of a transaction along with its unconfirmed ancestors, which represents the minimal set of transactions that would need to be included for the transaction to be valid in a block.  \"Descendant feerate\" is the analogous concept for a transaction with its in-mempool descendants, which represents the minimal set of transactions that would need to be evicted from the mempool in order for the target transaction to be evicted, in order to avoid orphan transactions from persisting in the mempool.\n\nWe use these two sort orders in order to implement eviction and transaction selection (for mining). Whenever the mempool exceeds its size limit, we evict the transaction that has the lowest descendant-feerate, along with all of the transaction's descendants.  We repeat until the mempool is below its size limit.\n\nWhen we select transactions during block template construction, we choose the transaction with the highest ancestor feerate, and select that transaction with all its ancestors to appear in the block. The ancestor scores of the remaining in-mempool transactions are updated to reflect these selections, and then we repeat by choosing the transaction with next highest-ancestor feerate, and so on until the block is full.\n\nThose algorithms are deficient in several ways. In particular, the eviction algorithm **does not guarantee that the first transaction evicted would be the last transaction mined**, and there exist situations where we could evict a transaction that would otherwise be mined in the next block (see below).\n\nFurthermore, the mining algorithm is more complex than the ancestor feerate sort we maintain, and it is insufficient to merely do lookups into our ancestor feerate index to determine which of two transactions will be mined from the mempool first. This lack of a total ordering on mempool transactions makes RBF calculations difficult to align with miner incentives, and creates distortions where we sometimes can replace transactions via RBF that would actually be better for a miner than the replacement.\n\nTo solve all these problems, we can instead maintain a total ordering on mempool transactions, which is used to implement a mining and eviction algorithm that are symmetrically opposite and provide better RBF rules for determining when to allow a replacement to occur.\n\n## Example: Eviction and mining are not opposite\n\nConsider the following transaction graph:\n\n```mermaid height=233,auto\ngraph TD;\n    A[\"A: 3 sat/vB\"]-->B;\n    A-->C;\n    A-->E[\"E: 9 sat/vB\"];\n    B[\"B:1 sat/vB \"]-->D[\"D 11 sat/vB\"];\n    C[\"C: 1 sat/vB\"]-->D;\n```\n\nThe transaction with lowest descendant feerate is tx A, at 5 sat/vB.  However, the transaction with highest ancestor feerate is tx E, at 6 sat/vB.  This means that our mining algorithm would select transaction E (along with A) to appear in the next block, but our eviction algorithm would select tx A and evict this whole transaction graph if we were above our size limit.\n\n> **Note:** A more complex example that exaggerates the difference between these feerates can be found [here](https://github.com/bitcoin/bitcoin/issues/27677#eviction-mining-not-opposite).\n\n## Example: Our current RBF rules are not always incentive compatible\n\nWhen a transaction is received that conflicts with some existing in-mempool transaction(s), Bitcoin Core uses policy rules that are (roughly) described in [BIP 125](https://github.com/bitcoin/bips/blob/deae64bfd31f6938253c05392aa355bf6d7e7605/bip-0125.mediawiki) in order to determine if the new transaction should be accepted (which requires evicting the conflicts from the mempool). However, there are many forms of incentive incompatibility that are part of those rules:\n\n* The \"no-new-parents\" rule doesn't consider the replacement transaction's desirability to a miner -- it might be better than all the to-be-replaced transactions, despite the new unconfirmed parent.\n* The rule requiring that a new transaction pays a higher feerate than its direct conflicts is insufficient to ensure that the new transaction is more desirable than what is being evicted. \n\nTo illustrate some specific incentive compatibility issues, consider this example, where A+B are already in the mempool, and transaction A' arrives that conflicts with A:\n\n```mermaid height=146,auto\ngraph TD;\n    A[\"A: 1 sat/vB, size 100\"]-->B;\n    B[\"B:99 sat/vB, size 100 \"]\n    A'[\"A': 3 sat/vB, size 10000\"]\n```\n\nHere, transaction B has an ancestor feerate of 50 sat/vB, while tx B is only paying 3 sat/vB.  Yet under BIP 125 rules we would evaluate A' as a successful replacement of [A, B], because it pays a higher feerate than A (3 sat/vB vs 1 sat/vB) and pays a higher total fee than A+B (30,000 sats vs. 10,000 sats).\n\nFailure to accept incentive compatible replacements can also occur; consider this example, where A and B are already in the mempool, and B' is a potential replacement of B:\n\n```mermaid height=146,auto\ngraph TD;\n    A[\"A: 1 sat/vB, size 10000\"]-->B;\n    A-.->B'\n    B[\"B:100 sat/vB, size 100 \"]\n\n    B'[\"B': 49 sat/vB, size 10000\"]\n```\n\nB' cannot replace B in the mempool under the BIP 125 rules, because it pays a lower feerate than B; however B' has an ancestor feerate of 25 sat/vB, while B has an ancestor feerate of just under 2 sat/vB(!).\n\nMany other examples exist as well.\n\n----------\n# Designing a solution\n\n## Maintaining a total ordering on the mempool\n\nTo fix the problem with eviction and mining, we start with the realization that those should be opposite operations on the mempool -- when we need to evict, we should always evict the transactions that are least desirable to be mined.  The difficulty in achieving this with today's mempool design is that we can't easily calculate the last transaction that would be mined -- the mining algorithm runs in time $O(dn \\log n)$, where $n$ is the number of transactions in the mempool, and $d$ is the descendant limit, so it is not currently feasible to run the algorithm on the entire mempool in order to calculate the transactions to evict first.\n\nHowever, that is exactly what we'd like to do -- so a natural question to ask is, what bound could we add to the mempool in order to make it feasible to have a total ordering?  One way to see the answer to this question is to consider how many mempool transaction's mining scores might be changed when a single new transaction is added -- if we always maintained a full sort on the mempool, then this gives an idea of how much work might need to be done to update the mempool as transactions are added.\n\nThe answer to this is that every transaction that is connected to a new transaction, via either parent or child relationships, might have its mining score changed. Consider this example (credit to @sipa):\n\n```mermaid height=108,auto\ngraph TD;\n    A[\"A: 72 sat/vB\"]-->B;\n    A-->D[\"D: 78 sat/vB\"]\n    B[\"B:74 sat/vB\"]\n    C[\"C: 66 sat/vB\"]-->D\n    C-->F[\"F: 86 sat/vB\"]\n    E[\"E: 56 sat/vB\"]-->F\n    E-->H[\"H: 98 sat/vB\"]\n    G[\"G: 42sat/vB\"]-->H\n    G-->J[\"J: 114 sat/vB\"]\n    I[\"I: 24 sat/vB\"]-->J\n    K[\"K: 2 sat/vB\"]-->L[\"L: 134 sat/vB\"]\n    I-->L\n```\nWith some calculation, we can see that tx B has the highest ancestor feerate at 73 sat/vB.  Once it and tx A are selected for inclusion in a block, tx D would have the next highest ancestor feerate at 72 sat/vB, followed by tx D, tx F, tx H, tx J, and tx L.\n\nIf a new transaction M were to arrive as follows:\n```mermaid height=84,auto\ngraph TD;\n    A[\"A: 72 sat/vB\"]-->B;\n    A-->D[\"D: 78 sat/vB\"]\n    B[\"B:74 sat/vB\"]\n    C[\"C: 66 sat/vB\"]-->D\n    C-->F[\"F: 86 sat/vB\"]\n    E[\"E: 56 sat/vB\"]-->F\n    E-->H[\"H: 98 sat/vB\"]\n    G[\"G: 42sat/vB\"]-->H\n    G-->J[\"J: 114 sat/vB\"]\n    I[\"I: 24 sat/vB\"]-->J\n    K[\"K: 2 sat/vB\"]-->L[\"L: 134 sat/vB\"]\n    I-->L\n   K-->M[\"M: 158 sat/vB\"]\n```\n\nThen the ancestor feerates get reversed(!).  The highest ancestor feerate is now tx M (80 sat/vB), followed by tx L (at 79 sat/vB, once tx K has been selected), and then J, H, F, D, and B -- exactly in the reverse order as before transaction L arrived.\n\nThis illustrates that to bound the work required to update mining scores when a new transaction is added, we must bound the size of connected components in the graph of transactions.  We refer to these connected components as *clusters*.\n\n## Implications of a cluster-size limit\n\n### We can keep the mempool fully sorted at all times.\n\nTo fully sort the mempool, it suffices to (a) sort each cluster using some sorting/transaction selection algorithm (such as our existing ancestor-feerate algorithm), and (b) devising a way to merge sorted clusters together.\n\nFor part (a), we can now realize that we might be able to do better than just use our ancestor feerate algorithm when sorting a cluster.  For very small clusters, we can use exponential run-time algorithms that select the optimal sort order across all possible topologically valid orderings of transactions.  For larger clusters, we can still fall back to using our ancestor feerate algorithm, or consider more advanced strategies, as long as we bound CPU usage to some reasonable value.  \n\n> **Note**: we use the term *linearization* to refer to the process of producing a topologically valid ordering of transactions in a cluster.\n\nFor part (b), merging sorted clusters together: this is straightforward.  Suppose we have two clusters, $C_1 = [tx_{a_1}, ..., tx_{a_n}]$, and $C_2 = [tx_{b_1}, ..., tx_{b_m}]$. To determine the optimal merge of these clusters into a single sort order, we want to find the highest feerate prefix of $C_1$ and the highest feerate prefix of $C_2$ and compare them; this best prefix should be the first set of transactions we would include in a block.  Then we'd remove those transactions from whichever cluster it came from, and repeat until all transactions are selected.\n\n> **Note**: we refer to the calculation of successive, highest-feerate-prefixes of a cluster as the *chunks* of a cluster.  We can calculate the chunks of a linearized cluster in linear time.  \n\nFor more information on these topics, and other related concepts, see @sipa's writeup [here](https://delvingbitcoin.org/t/cluster-mempool-definitions-theory/202).\n\n### With a fully sorted mempool, mining transaction selection is very fast.\n\nWe simply iterate the clusters in descending chunk feerate order, and select transactions from each chunk, until the block is full.\n\n### With a fully sorted mempool, eviction is the opposite of mining.\n\nTo run the eviction algorithm when the mempool is full, we simply iterate the chunks in ascending chunk feerate order, and select chunks for eviction until the mempool is below its size limit.\n\n### RBF can now be made incentive compatible for miners.\n\nThe first question to ask is what \"incentive compatible\" should mean.  To consider what this should mean, consider the following example, where the mempool starts with these transactions (assume all transactions are 100 vB in size):\n\n```mermaid height=146,auto\ngraph TD;\n    A[Tx A: 1 sat/vB]-->B[Tx B: 3.5 sat/vB];\n    A-->C[Tx C: 5 sat/vB];\n    D[Tx D: 1 sat/vB];\n```\n\nAnd consider a potential replacement transaction E, which conflicts with tx C, and would produce the following mempool:\n\n```mermaid height=146,auto\ngraph TD;\n    A[Tx A: 1 sat/vB]-->B[Tx B: 3.5 sat/vB];\n    D[Tx D: 1 sat/vB]-->E[Tx E: 6 sat/vB];\n```\n\nHow can we tell whether transaction E should be accepted?  Using the BIP 125 rules, we might say that E should be rejected because it brings in a new unconfirmed parent; or we might say that the unconfirmed parent rule is silly since we're just replacing a parent with another parent of the exact same fee/size, and transaction E pays a strictly higher fee and feerate than C, so we should obviously take it.\n\nIt turns out that neither of these explanations is wholly satisfactory.  Consider the total mempool sort order for the \"old\" mempool that contains tx C, and the \"new\" mempool that contains E instead.  \n\nThe optimal sort order for the \"old\" mempool is [A, B, C], [D] (brackets indicate chunks).  A miner who mined just the first chunk of that old mempool would collect 950 sats and have included 300 vB of size; a miner who mined the whole mempool would collect 1050 sats and included 400 vB of size.\n\nMeanwhile, the optimal sort of the new mempool would be: [D, E], [A, B]. A miner that included the first chunk would collect 700 sats in 200 vB of size; a miner including both chunks would collect 1150 sats in 400 vB of size.\n\nWe can graph this data in what we have termed the \"feerate diagram\" of each mempool option, where on the x-axis we plot the size of the transactions included by a miner, and on the y-axis we plot the maximum fees that the miner can achieve at that size.  If we look at the feerate diagrams for this \"old\" and \"new\" mempool, we get the following:\n\n![Figure_1](upload://419ERV2azSMD2X1vcJOmTZenlRQ)\n\nNote that the (300, 950) point from the first diagram lies outside the diagram for the new mempool!  What this tells is that there are sizes at which the old mempool is better than the new one; and similarly in this example there are sizes for which the new mempool is better than the old one.  \n\nWe would say that these feerate diagrams are \"incomparable\", meaning that neither one is strictly better than the other, and they are also not equivalent.  If the red line were greater than or equal to the blue line everywhere, and strictly better at least at one point, then we'd say that the new mempool was \"strictly better\" than the old one. This would mean that no matter how much size was selected from the mempool, that -- ignoring the tail effects from when a block is nearly full -- a miner would always be better off by selecting transactions from the \"new\" mempool rather than the old one.\n\nThis graph shows why various heuristics for whether a replacement should be taken are unsatisfactory.  Instead, to ensure that a replacement is always better for miners, we propose making the RBF validation rule be that the mempool must get \"strictly better\" using this feerate diagram check in order to be accepted.\n\n> **Note**: To guard against free relay (an anti-DoS concern), we still will require that the total fee of the new transaction exceed the total fee of the conflicting transactions by at least as much as the min-relay-feerate * size of the new transaction.  However this is a small effect, since the incentive compatibility rule described above already requires that the total fee cannot go down -- this just bumps that value up slightly.\n\n### The CPFP carveout rule can no longer be supported.\n\nThe CPFP carveout rule in Bitcoin Core currently allows the mempool to exceed the limit on the number of descendant transactions that a given transaction has, in a specific case that is relevant to the lightning protocol.\n\nThe background here is that by default, our mempool policy is to reject an incoming transaction if it would cause some existing mempool transaction to have more than 25 descendant transactions.  In some lightning use case, as I understand it, two parties might both have spendable outputs from some parent transaction.  One of the parties might have an incentive to \"pin\" the transaction at a low feerate in the mempool by creating child spends that fill up the 25 permitted descendants, but don't effectively bump the feerate to a significant value.  Meanwhile, the other party might wish to use CPFP to fee bump the parent, but be unable to do so because of this descendant limit having already been hit.\n\nThe CPFP carveout rule specifically allows the mempool to exceed the descendant limit by exactly 1 transaction in the case where an incoming transaction has exactly 1 in-mempool ancestor (and where the incoming transaction has some small bounded size in vbytes).  The implication is that in a 2-party protocol where each party has a single spendable output from some shared transaction, that either party should always be able to add a child transaction that can bump the fee of the parent.  For more background and thoughts on this, see the mailing list [thread](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2018-November/016518.html).\n\nHowever, this CPFP carveout only makes sense because there are no other topology restrictions other than the descendant limit which can prevent a new transaction from being accepted.  By proposing the addition of a new cluster size limit, the CPFP carveout ceases to be helpful -- an adversary can utilize the cluster size limit to prevent the other party from being able to attach a child transaction to the shared parent.  Moreover, because cluster limits are not a property of a particular transaction (the way that the descendant limit is), there is no straightforward way to introduce a new carveout that would apply to allow bypassing this limit in a bounded way.\n\nSo the conclusion here is that the carveout rule must be dropped, and projects like lightning that currently rely on it would need to have some other mechanism to bypass this issue.  The [v3 transaction proposal](https://delvingbitcoin.org/t/v3-transaction-policy-for-anti-pinning/340/1) is one attempt to provide such a mechanism.\n\n----------\n# Considerations\n\n## Is it reasonable to bound cluster sizes?\n\nA fair question to raise is whether usage patterns on the network are inconsistent with the idea of a cluster size limit; specifically, if it is fair or if it's a bad design that other participants on the network can attach children to a transaction in a way that interferes with someone's ability to (say) attach their own child transaction to an unconfirmed parent.\n\nFor this specific concern, I don't believe that the cluster size limits are materially different in character than the existing descendant size limits.  In particular, any scenario where an adversary can attach transactions that would cause the cluster size to be reached (thus preventing an additional spend) is also a scenario where that same adversary could cause a descendant limit to be reached today. \n\nSo my belief is that there's nothing fundamentally worse about cluster size limits than descendant size limits (provided that we can set the cluster size limits to be at least as large as the current default descendant limit, which I expect should be the case).\n\n## Why is there a bound on cluster size in vbytes?\n\nThis is for exactly the same reason that we have a bound on the ancestor and descendant sizes -- it provides a bound on how poorly transaction selection can work when we use a greedy algorithm, in situations where the knapsack problem is what we need to solve.  Specifically, by limiting ancestor sizes to approximately 10% of the size of a block, our greedy transaction selection algorithm will always be within 90% of the maximum fee that we'd achieve if we had a knapsack solver instead.  \n\nSimilarly, by bounding descendant sizes we also bound the small amount of free relay that can occur when mempool eviction happens.\n\nTo achieve the same effect in cluster mempool, we need to bound chunk sizes.  The simplest way to do that is to bound a cluster size (since a cluster might consist of a single chunk).  While it may be theoretically possible to bound chunk sizes at a smaller value than the cluster size limit, this would create more theoretical questions that we'd need to resolve, which may not be worth the effort and complexity (as no longer would it be the case that chunk feerates within a cluster are monotonically decreasing).\n\n## Why are ancestor and descendant limits being dropped?\n\nOne benefit of the cluster mempool approach is that we no longer need to maintain ancestor and descendant feerate state, which means that we no longer need to iterate over ancestors/descendants when updating the mempool as transactions are added and removed, or when blocks are found.  This means that we no longer need to enforce limits on ancestor and descendant count in order to bound CPU usage.\n\n----------\n# Next steps\n\nA draft implementation against a recent version of the Bitcoin Core master branch is available [here](https://github.com/bitcoin/bitcoin/pull/28676).  The implementation details are still being improved upon, and the particular choices of parameters for cluster size limits and RBF will be determined after further benchmarking of the code and analysis of the effects of this logic on historical transaction data.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 95,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "rocket",
      "type": "emoji",
      "count": 4
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 4,
  "current_user_used_main_reaction": false
}