{
  "id": 1171,
  "name": "Michael Folkson",
  "username": "michaelfolkson",
  "avatar_template": "/letter_avatar_proxy/v4/letter/m/90db22/{size}.png",
  "created_at": "2024-01-17T20:20:44.934Z",
  "cooked": "<p>The signaling is signaling readiness not signaling (or voting) to support the activation attempt. There should be no signaling until there is consensus on the soft fork. Embarking on an activation process should only be done once there’s consensus to activate the soft fork in the first place.</p>\n<p>This is all assuming you want to avoid a chain split and essentially avoid another “war” on what the consensus rules for Bitcoin are. If you want another 1-2 years of headaches and unproductivity with everyone having to divert from what they are currently focusing on and instead working out on which side of the chain split they need to be and attempt to preserve that side then you’ll do whatever you can to cause as much chaos as possible.</p>\n<p>If you weren’t around for it then perhaps you can read about it <a href=\"https://www.amazon.com/Blocksize-War-Control-Bitcoins-Protocol/dp/B096CLR1SS/\" rel=\"noopener nofollow ugc\">here</a> but the block size war was not an enjoyable, productive time to work on software projects. Perhaps the Twitterati and the journalists enjoyed it but to everyone here it was just a massive seemingly never ending headache.</p>",
  "post_number": 14,
  "post_type": 1,
  "updated_at": "2024-01-17T20:20:44.934Z",
  "reply_count": 0,
  "reply_to_post_number": 12,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 1,
  "readers_count": 0,
  "score": 0.2,
  "yours": false,
  "topic_id": 334,
  "topic_slug": "on-consensus-changes-in-bitcoin-2024",
  "topic_title": "On consensus changes in bitcoin 2024",
  "topic_html_title": "On consensus changes in bitcoin 2024",
  "category_id": 5,
  "display_username": "Michael Folkson",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "reardencode",
    "name": "Brandon Black",
    "avatar_template": "/user_avatar/delvingbitcoin.org/reardencode/{size}/27_2.png"
  },
  "bookmarked": false,
  "raw": "The signaling is signaling readiness not signaling (or voting) to support the activation attempt. There should be no signaling until there is consensus on the soft fork. Embarking on an activation process should only be done once there's consensus to activate the soft fork in the first place. \n\nThis is all assuming you want to avoid a chain split and essentially avoid another \"war\" on what the consensus rules for Bitcoin are. If you want another 1-2 years of headaches and unproductivity with everyone having to divert from what they are currently focusing on and instead working out on which side of the chain split they need to be and attempt to preserve that side then you'll do whatever you can to cause as much chaos as possible. \n\nIf you weren't around for it then perhaps you can read about it [here](https://www.amazon.com/Blocksize-War-Control-Bitcoins-Protocol/dp/B096CLR1SS/) but the block size war was not an enjoyable, productive time to work on software projects. Perhaps the Twitterati and the journalists enjoyed it but to everyone here it was just a massive seemingly never ending headache.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 210,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}