{
  "id": 4636,
  "name": "",
  "username": "josh",
  "avatar_template": "/user_avatar/delvingbitcoin.org/josh/{size}/95_2.png",
  "created_at": "2025-03-27T02:49:13.270Z",
  "cooked": "<blockquote>\n<p>Tweaking keys works on all address types, which use OP_CHECKSIG in that way or another. You can even tweak some DER signature for P2PK, if you really want. Later, when the private key will be compromised, people could always make new signatures, but couldn’t go back in the chain, and change previous commitments.</p>\n</blockquote>\n<p>I see. Just to clarify, you’re talking about tweaking signatures in the input(s), correct? Not data embedded in the UTXO itself.</p>\n<p>My understanding is that a P2TR UTXO is the only type of UTXO where a commitment can be made <em>in the output script</em>. It sounds like you’re suggesting users instead commit to quantum-resistant public keys by tweaking signatures in the inputs, for backing up outputs created in the same transaction, or outputs that exist elsewhere.</p>\n<p>That’s an interesting idea. It could work. It doesn’t matter where the commitment exists, as long as the earliest provable commitment is used as a UTXO’s proof of ownership.</p>\n<blockquote>\n<p>I think the main problem is not related to technically doing it, but rather to standardizing it correctly, so when the community will want to upgrade the rules, the new code will handle all commitments correctly.</p>\n</blockquote>\n<p>I agree 100%. This is a social problem, not a technical one. If there existed a “standard” way to commit to a quantum-resistant backup public key, for any existing or newly created UTXO, users and investors would probably feel more comfortable with the “quantum risk,” since a fallback plan exists.</p>\n<p>Whether we like it or not, perception matters. If Bitcoin is perceived as less risky, its purchasing power in real terms will naturally rise.</p>",
  "post_number": 5,
  "post_type": 1,
  "updated_at": "2025-03-27T02:49:13.270Z",
  "reply_count": 1,
  "reply_to_post_number": 4,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 13,
  "readers_count": 12,
  "score": 7.4,
  "yours": false,
  "topic_id": 1537,
  "topic_slug": "is-there-a-social-approach-to-the-quantum-problem",
  "topic_title": "Is there a social approach to the quantum problem?",
  "topic_html_title": "Is there a social approach to the quantum problem?",
  "category_id": 5,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "garlonicon",
    "name": "Garlo Nicon",
    "avatar_template": "/letter_avatar_proxy/v4/letter/g/278dde/{size}.png"
  },
  "bookmarked": false,
  "raw": "> Tweaking keys works on all address types, which use OP_CHECKSIG in that way or another. You can even tweak some DER signature for P2PK, if you really want. Later, when the private key will be compromised, people could always make new signatures, but couldn’t go back in the chain, and change previous commitments.\n\nI see. Just to clarify, you're talking about tweaking signatures in the input(s), correct? Not data embedded in the UTXO itself.\n\nMy understanding is that a P2TR UTXO is the only type of UTXO where a commitment can be made *in the output script*. It sounds like you're suggesting users instead commit to quantum-resistant public keys by tweaking signatures in the inputs, for backing up outputs created in the same transaction, or outputs that exist elsewhere.\n\nThat's an interesting idea. It could work. It doesn't matter where the commitment exists, as long as the earliest provable commitment is used as a UTXO's proof of ownership.\n\n> I think the main problem is not related to technically doing it, but rather to standardizing it correctly, so when the community will want to upgrade the rules, the new code will handle all commitments correctly.\n\nI agree 100%. This is a social problem, not a technical one. If there existed a \"standard\" way to commit to a quantum-resistant backup public key, for any existing or newly created UTXO, users and investors would probably feel more comfortable with the \"quantum risk,\" since a fallback plan exists.\n\nWhether we like it or not, perception matters. If Bitcoin is perceived as less risky, its purchasing power in real terms will naturally rise.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 98,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}