{
  "id": 4642,
  "name": "David A. Harding",
  "username": "harding",
  "avatar_template": "/user_avatar/delvingbitcoin.org/harding/{size}/925_2.png",
  "created_at": "2025-03-28T21:16:38.799Z",
  "cooked": "<aside class=\"quote no-group quote-modified\" data-username=\"stevenroose\" data-post=\"1\" data-topic=\"1528\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/stevenroose/48/1087_2.png\" class=\"avatar\"> stevenroose:</div>\n<blockquote>\n<p><strong>Receiving Lightning payments</strong> in Ark […] the user notify the server that it is expecting an inbound payment, the server will accept the HTLC as a hodl HTLC and issue an HTLC for the user in a vtxo in the next round. The user can then reveal the preimage which grants him the vtxo fully and allows the server to claim the hodl HTLC. (With various anti-abuse measures in place.) Without CTV the receiver would have to participate in a round in order to receive his HTLC, but <strong>receivers participating in rounds is vulnerable to DoS attacks</strong>, so this is not possible.</p>\n</blockquote>\n</aside>\n<p>Can you go into detail about how CTV helps in this case and what the anti-abuse measures might be?</p>\n<p>You describe the potential for abuse from a receiver participating in a round without having anything at stake, which I agree is fixed by CTV eliminating the need for receiver participation.  However, for HTLCs, it seems to me that the same potential for abuse exists from a receiver who fails to reveal a preimage, and the risk and consequences of that seems to be the same whether multisig or CTV is used.</p>\n<p>My understanding is that the risk of non-revelation applies today to current <a href=\"https://bitcoinops.org/en/topics/jit-channels/\">JIT channels</a> and it’s <a href=\"https://bitcoinops.org/en/newsletters/2023/06/21/#just-in-time-jit-channels\">handled</a> in two ways:</p>\n<ul>\n<li>\n<p><em>Big trust in the LSP:</em> the receiver discloses their preimage before the channel funding transaction has been confirmed.  This makes it technically easy for the LSP to steal the full payment amount prior to confirmation (but, after suitable confirmation, the LSP can no longer steal).</p>\n</li>\n<li>\n<p><em>Small trust in the LSP:</em> the spender pays two invoices, one for the payment itself and one a prepayment for signing a funding transaction.  The receiver releases the prepayment preimage upon receipt of an (unconfirmed) funding transaction, later releasing the payment preimage after the funding transaction has been confirmed to a suitable depth.  This still allows the LSP to steal the amount of the prepayment invoice but prevents them from being able to steal the amount of the payment invoice (which is probably the far larger amount).</p>\n</li>\n</ul>\n<p>It seems to me that CTV doesn’t change that situation for Ark.  Either method can be used today to allow clArk to receive LN payments, as both give the user funds at stake (in <em>big trust</em>, the server can take up to 100% of the payment amount; in <em>small trust</em>, the server can take up to the prepayment amount).  If the user has value at stake, they can participate in a round without creating a DoS risk, and their participation (signature) will ensure that their received funds can’t be stolen by the Ark server after a round is confirmed to suitable depth.  Either method can also be used with CTV (with the same trust tradeoffs).  If neither method is used with CTV, and no alternative method is used, then an abuser who fails to disclose a preimage can lock up server liquidity for the duration of the round.</p>",
  "post_number": 8,
  "post_type": 1,
  "updated_at": "2025-03-28T21:16:38.799Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 10,
  "readers_count": 9,
  "score": 1.8,
  "yours": false,
  "topic_id": 1528,
  "topic_slug": "the-ark-case-for-ctv",
  "topic_title": "The Ark case for CTV",
  "topic_html_title": "The Ark case for CTV",
  "category_id": 7,
  "display_username": "David A. Harding",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"stevenroose, post:1, topic:1528\"]\n**Receiving Lightning payments** in Ark [...] the user notify the server that it is expecting an inbound payment, the server will accept the HTLC as a hodl HTLC and issue an HTLC for the user in a vtxo in the next round. The user can then reveal the preimage which grants him the vtxo fully and allows the server to claim the hodl HTLC. (With various anti-abuse measures in place.) Without CTV the receiver would have to participate in a round in order to receive his HTLC, but **receivers participating in rounds is vulnerable to DoS attacks**, so this is not possible.\n[/quote]\n\nCan you go into detail about how CTV helps in this case and what the anti-abuse measures might be?\n\nYou describe the potential for abuse from a receiver participating in a round without having anything at stake, which I agree is fixed by CTV eliminating the need for receiver participation.  However, for HTLCs, it seems to me that the same potential for abuse exists from a receiver who fails to reveal a preimage, and the risk and consequences of that seems to be the same whether multisig or CTV is used.\n\nMy understanding is that the risk of non-revelation applies today to current [JIT channels](https://bitcoinops.org/en/topics/jit-channels/) and it's [handled](https://bitcoinops.org/en/newsletters/2023/06/21/#just-in-time-jit-channels) in two ways:\n\n- *Big trust in the LSP:* the receiver discloses their preimage before the channel funding transaction has been confirmed.  This makes it technically easy for the LSP to steal the full payment amount prior to confirmation (but, after suitable confirmation, the LSP can no longer steal).\n\n- *Small trust in the LSP:* the spender pays two invoices, one for the payment itself and one a prepayment for signing a funding transaction.  The receiver releases the prepayment preimage upon receipt of an (unconfirmed) funding transaction, later releasing the payment preimage after the funding transaction has been confirmed to a suitable depth.  This still allows the LSP to steal the amount of the prepayment invoice but prevents them from being able to steal the amount of the payment invoice (which is probably the far larger amount).\n\nIt seems to me that CTV doesn't change that situation for Ark.  Either method can be used today to allow clArk to receive LN payments, as both give the user funds at stake (in _big trust_, the server can take up to 100% of the payment amount; in _small trust_, the server can take up to the prepayment amount).  If the user has value at stake, they can participate in a round without creating a DoS risk, and their participation (signature) will ensure that their received funds can't be stolen by the Ark server after a round is confirmed to suitable depth.  Either method can also be used with CTV (with the same trust tradeoffs).  If neither method is used with CTV, and no alternative method is used, then an abuser who fails to disclose a preimage can lock up server liquidity for the duration of the round.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 6,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}