{
  "id": 4433,
  "name": "Brh28",
  "username": "brh28",
  "avatar_template": "/user_avatar/delvingbitcoin.org/brh28/{size}/836_2.png",
  "created_at": "2025-03-08T20:26:32.753Z",
  "cooked": "<p>Hey all,</p>\n<p>In my view, pathfinding still seems to be one of the biggest pain-points of lightning today, but I haven’t seen much discussion about it at the protocol level. I’m not a protocol dev so I’m hoping someone simply point me right in the direction. Otherwise, I’m hoping this can be a starting point.</p>\n<h4><a name=\"p-4433-background-1\" class=\"anchor\" href=\"#p-4433-background-1\"></a>Background</h4>\n<p>To route a payment on the Lightning Network, a sender must have a path to the destination using channels which contain sufficient liquidity and forwarding fees. At present, only channel topology and routing fees are shared to nodes on the network via the gossip protocol. Channel balance, however, is not shared with the network. Therefore, when constructing a route, a sender has an incomplete set of data required to construct a feasible path, leaving them instead to probe the network (i.e guess-and-check) for a functional path. Additionally, fee updates are rate-limited, which is a constraint that reduces a routing nodes ability to influence the flow of liquidity through their channels. Finally, nodes must constantly sync the current state of the network, and even then, may not have the benefit of historical data to inform them of channel reliability.</p>\n<p>At it’s root, these issues stem from the source node’s dependence on received gossip data. The gossip protocol works by flooding the network to ensure everyone receives each message. Due to the global nature of this protocol, messages are public and must be limited in count.</p>\n<p>In short, pathfinding with gossip data is unreliable, especially as the network grows. When channels are unreliable, network participants are incentivized to outsource node operations to larger (likely custodial) nodes who have more liquidity and more transaction volume to probe the network.</p>\n<h4><a name=\"p-4433-solution-nodes-ask-channel-peers-for-a-path-to-the-destination-2\" class=\"anchor\" href=\"#p-4433-solution-nodes-ask-channel-peers-for-a-path-to-the-destination-2\"></a>Solution - Nodes ask channel peers for a path to the destination.</h4>\n<p>As far as I know, this isn’t entirely a novel idea and it’s actually what Phoenix does today with their Acinq node, but outside of the lightning protocol. Yes, a node reveals their destination to their channel peer, but they get a much better payment reliability while preserving custody of their funds.</p>\n<p>Now, let’s say we extend these query messages to all nodes on the network and that, as an example, Alice is completing an invoice to Dave. Rather than requiring Alice to construct a path using her own map of the network, Alice can ask her channel peer (Bob) for a path to Dave. Bob knows he has liquidity through Carol, so he asks Carol for a path. This process repeats until we reach Dave. With zero knowledge of the graph, the sender (Alice) can find a feasible path to Dave without requiring nodes to gossip their channel balances. It also (potentially) allows nodes to set their routing fees on a per transaction basis, or at least at a more granular level.</p>\n<p>It should also be noted that this approach scales much better as nodes do not require full knowledge of the graph to send payments.</p>\n<p>Of course, the primary cost of such a scheme is privacy as a sender reveals their destination to their channel peer, but I think:</p>\n<ol>\n<li>the current evolution of the network (“Lightning-as-a-Service”) shows many/most participants prefer reliability over privacy.</li>\n<li>Those that are privacy focused could still rely exclusively on gossip data for path-finding.</li>\n<li>Emergence of trampoline &amp; blinded paths suggest destination could be concealed with higher-level routing. This approach seems to resemble other networks with reliability at the base and privacy built on top.</li>\n</ol>\n<p>Would love to hear some thoughts.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2025-03-08T20:43:53.454Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 2,
  "reads": 12,
  "readers_count": 11,
  "score": 12.2,
  "yours": false,
  "topic_id": 1503,
  "topic_slug": "revisiting-pathfinding",
  "topic_title": "Revisiting pathfinding",
  "topic_html_title": "Revisiting pathfinding",
  "category_id": 7,
  "display_username": "Brh28",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Hey all,\n\nIn my view, pathfinding still seems to be one of the biggest pain-points of lightning today, but I haven't seen much discussion about it at the protocol level. I'm not a protocol dev so I'm hoping someone simply point me right in the direction. Otherwise, I'm hoping this can be a starting point.  \n\n#### Background\n\nTo route a payment on the Lightning Network, a sender must have a path to the destination using channels which contain sufficient liquidity and forwarding fees. At present, only channel topology and routing fees are shared to nodes on the network via the gossip protocol. Channel balance, however, is not shared with the network. Therefore, when constructing a route, a sender has an incomplete set of data required to construct a feasible path, leaving them instead to probe the network (i.e guess-and-check) for a functional path. Additionally, fee updates are rate-limited, which is a constraint that reduces a routing nodes ability to influence the flow of liquidity through their channels. Finally, nodes must constantly sync the current state of the network, and even then, may not have the benefit of historical data to inform them of channel reliability.\n\nAt it's root, these issues stem from the source node's dependence on received gossip data. The gossip protocol works by flooding the network to ensure everyone receives each message. Due to the global nature of this protocol, messages are public and must be limited in count. \n\nIn short, pathfinding with gossip data is unreliable, especially as the network grows. When channels are unreliable, network participants are incentivized to outsource node operations to larger (likely custodial) nodes who have more liquidity and more transaction volume to probe the network.\n\n#### Solution - Nodes ask channel peers for a path to the destination. \n\nAs far as I know, this isn't entirely a novel idea and it's actually what Phoenix does today with their Acinq node, but outside of the lightning protocol. Yes, a node reveals their destination to their channel peer, but they get a much better payment reliability while preserving custody of their funds.\n\nNow, let's say we extend these query messages to all nodes on the network and that, as an example, Alice is completing an invoice to Dave. Rather than requiring Alice to construct a path using her own map of the network, Alice can ask her channel peer (Bob) for a path to Dave. Bob knows he has liquidity through Carol, so he asks Carol for a path. This process repeats until we reach Dave. With zero knowledge of the graph, the sender (Alice) can find a feasible path to Dave without requiring nodes to gossip their channel balances. It also (potentially) allows nodes to set their routing fees on a per transaction basis, or at least at a more granular level.   \n\nIt should also be noted that this approach scales much better as nodes do not require full knowledge of the graph to send payments.\n\nOf course, the primary cost of such a scheme is privacy as a sender reveals their destination to their channel peer, but I think:\n1. the current evolution of the network (\"Lightning-as-a-Service\") shows many/most participants prefer reliability over privacy.  \n2. Those that are privacy focused could still rely exclusively on gossip data for path-finding. \n3. Emergence of trampoline & blinded paths suggest destination could be concealed with higher-level routing. This approach seems to resemble other networks with reliability at the base and privacy built on top.\n\nWould love to hear some thoughts.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 558,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}