{
  "id": 4568,
  "name": "David A. Harding",
  "username": "harding",
  "avatar_template": "/user_avatar/delvingbitcoin.org/harding/{size}/925_2.png",
  "created_at": "2025-03-18T15:11:31.870Z",
  "cooked": "<p>I don’t think this proposal addresses the main criticism of past proposals.  <a href=\"https://diyhpl.us/~bryan/irc/bitcoin/bitcoin-dev/linuxfoundation-pipermail/lightning-dev/2023-July/004033.txt\">Quoting</a> <a class=\"mention\" href=\"/u/clarashk\">@ClaraShk</a>:</p>\n<blockquote>\n<p>[T]he ?holy grail? is indeed charging fees as a\nfunction of the time the HTLC was held. As for now, we are not aware of a\nreasonable way to do this. There is no universal clock, and there is no way\nfor me to prove that a message was sent to you, and you decided to pretend\nyou didn’t. It can easily happen that the fee for a two-week unresolved\nHTLC is higher than the fee for a quickly resolving one.</p>\n</blockquote>\n<p>Specifically, what stops a downstream node from ignoring an incoming HTLC and thus forcing its upstream peer to pay hold fees until they broadcast a force close transaction and get it confirmed to a certain depth?</p>\n<p>For example, Bob forwards a half-signed HTLC to Mallory (with burn output).  Mallory doesn’t reply with either acceptance or rejection.  Now Bob can’t safely cancel the HTLC unless he force closes the channel.  Bob will probably need to pay onchain transaction fees to force close the channel, so he’ll be incentivized to wait a bit and to use a non-urgent fee estimation—but until the channel confirms to a depth he finds sufficient to prevent double spending, he’ll be liable for hold fees.</p>\n<p>In this situation, Bob gains an upfront fee (presumably small compared to 6+ blocks of hold fees), he pays hold fees to his upstream node (which might be controlled by Mallory), and he loses onchain transaction fees to close the channel.  He does not earn a success fee.</p>\n<p>A more specific example includes two nodes controlled by Mallory (M0, M1) and Bob’s node.  M0 forwards funds through Bob to M1.  M0 pays Bob an upfront fee, Bob pays M0 a hold fee that’s greater than than the upfront fee, and Bob pays the onchain transaction fee to force close.</p>\n<p>M1 may have had to pay an onchain transaction fee to open the channel with Bob, but that could have been inexpensive compared to amount of money M0 will earn from several blocks of hold fees—and potentially <em>very</em> inexpensive compared to Bob’s total losses as victim of this attack.</p>\n<p>I’ll also note that any sort of hold fees seems fraught if LSPs continue offering <a href=\"https://bitcoinops.org/en/topics/jit-channels/\">JIT channels</a>.  Mallory can forward a payment through an LSP to a fake customer, who neither accepts nor rejects the HTLC.  The LSP is liable for paying hold fees to Mallory until they can double spend the channel opening transaction and it confirms to a sufficient depth.  Mallory’s only cost in this case is upfront fee.</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2025-03-18T15:11:31.870Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 16,
  "readers_count": 15,
  "score": 3.0,
  "yours": false,
  "topic_id": 1524,
  "topic_slug": "fee-based-spam-prevention-for-lightning",
  "topic_title": "Fee-Based Spam Prevention For Lightning",
  "topic_html_title": "Fee-Based Spam Prevention For Lightning",
  "category_id": 7,
  "display_username": "David A. Harding",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I don't think this proposal addresses the main criticism of past proposals.  [Quoting](https://diyhpl.us/~bryan/irc/bitcoin/bitcoin-dev/linuxfoundation-pipermail/lightning-dev/2023-July/004033.txt) @ClaraShk:\n\n> [T]he ?holy grail? is indeed charging fees as a\nfunction of the time the HTLC was held. As for now, we are not aware of a\nreasonable way to do this. There is no universal clock, and there is no way\nfor me to prove that a message was sent to you, and you decided to pretend\nyou didn't. It can easily happen that the fee for a two-week unresolved\nHTLC is higher than the fee for a quickly resolving one.\n\nSpecifically, what stops a downstream node from ignoring an incoming HTLC and thus forcing its upstream peer to pay hold fees until they broadcast a force close transaction and get it confirmed to a certain depth?\n\nFor example, Bob forwards a half-signed HTLC to Mallory (with burn output).  Mallory doesn't reply with either acceptance or rejection.  Now Bob can't safely cancel the HTLC unless he force closes the channel.  Bob will probably need to pay onchain transaction fees to force close the channel, so he'll be incentivized to wait a bit and to use a non-urgent fee estimation---but until the channel confirms to a depth he finds sufficient to prevent double spending, he'll be liable for hold fees.\n\nIn this situation, Bob gains an upfront fee (presumably small compared to 6+ blocks of hold fees), he pays hold fees to his upstream node (which might be controlled by Mallory), and he loses onchain transaction fees to close the channel.  He does not earn a success fee.\n\nA more specific example includes two nodes controlled by Mallory (M0, M1) and Bob's node.  M0 forwards funds through Bob to M1.  M0 pays Bob an upfront fee, Bob pays M0 a hold fee that's greater than than the upfront fee, and Bob pays the onchain transaction fee to force close.\n\nM1 may have had to pay an onchain transaction fee to open the channel with Bob, but that could have been inexpensive compared to amount of money M0 will earn from several blocks of hold fees---and potentially _very_ inexpensive compared to Bob's total losses as victim of this attack.\n\nI'll also note that any sort of hold fees seems fraught if LSPs continue offering [JIT channels](https://bitcoinops.org/en/topics/jit-channels/).  Mallory can forward a payment through an LSP to a fake customer, who neither accepts nor rejects the HTLC.  The LSP is liable for paying hold fees to Mallory until they can double spend the channel opening transaction and it confirms to a sufficient depth.  Mallory's only cost in this case is upfront fee.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 6,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}