{
  "id": 4474,
  "name": "Brandon Black",
  "username": "reardencode",
  "avatar_template": "/user_avatar/delvingbitcoin.org/reardencode/{size}/27_2.png",
  "created_at": "2025-03-11T17:03:03.653Z",
  "cooked": "<p>I support this effort, as reflected in my <a href=\"https://x.com/reardencode/status/1871343039123452340\" rel=\"noopener nofollow ugc\">pinned post</a> on X.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/9/9b0670781b2bb2b7fb92f76a8614146e4edae851.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/9b0670781b2bb2b7fb92f76a8614146e4edae851\" title=\"image\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/9/9b0670781b2bb2b7fb92f76a8614146e4edae851_2_690x353.png\" alt=\"image\" data-base62-sha1=\"m7pNR3NmzBQGDpvYTnXZdFdxAhX\" width=\"690\" height=\"353\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/9/9b0670781b2bb2b7fb92f76a8614146e4edae851_2_690x353.png, https://delvingbitcoin.org/uploads/default/original/2X/9/9b0670781b2bb2b7fb92f76a8614146e4edae851.png 1.5x, https://delvingbitcoin.org/uploads/default/original/2X/9/9b0670781b2bb2b7fb92f76a8614146e4edae851.png 2x\" data-dominant-color=\"0F1010\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">image</span><span class=\"informations\">876×449 56.6 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p>To slightly expand on why specifically CTV+CSFS(and IKEY+PC?):</p>\n<p>IKEY: <a href=\"https://github.com/bitcoin/bips/blob/050d422b2ac24d8221edab0ff0053e0f585409f7/bip-0349.md\" rel=\"noopener nofollow ugc\">INTERNALKEY</a>\nPC: <a href=\"https://github.com/bitcoin/bips/pull/1699\" rel=\"noopener nofollow ugc\">PAIRCOMMIT</a></p>\n<p>There’s a tension between “only change bitcoin consensus in gravest extremity” and “upgrade bitcoin whenever there’s a clear improvement to be had”. Team Slow and Steady (as promoted by <a class=\"mention\" href=\"/u/ajtowns\">@ajtowns</a>, <a class=\"mention\" href=\"/u/moneyball\">@moneyball</a>, and others) is a proposed middle of the road that aligns well with the CTV+CSFS upgrade.</p>\n<p>While there are many, <a class=\"mention\" href=\"/u/antoinep\">@AntoineP</a> included, who are in a fourth camp of “only change bitcoin consensus when there is a strong and clear reason”, that standard is simply not realizable while navigating the delicately balanced space between “only in gravest extremity” and “slow and steady”. Any upgrade that would add sufficient capabilities to show such a strong and clear reason will necessarily also raise the specter of potentially weakening the incentives which are necessary for bitcoin’s continued success. While I personally am confident that an upgrade such as CAT, Simplicity, or Lisp would not harm the incentive structure, that is difficult (I think impossible) to defend to Team Slow and Steady.</p>\n<p>Therefore, we are left not with a choice of “CTV+CSFS now or something with stronger justification later” but rather “CTV+CSFS at some point, or nothing until solving the 2106 timestamp overflow”.</p>\n<hr>\n<p>Lastly, I’d like to expand on why I think CTV+CSFS alone may need IKEY and PC to reach activation.</p>\n<p>There was some debate during the development over the exclusion of a keyless spend. This was resolved with the justification that nearly all protocols have a cooperative n-of-n case that will dominate over whatever uncooperative cases. While this is broadly true, for some of these protocols, success would mean that the cooperative case itself is rarely broadcast which would then imply that uncooperative cases are the main spend seen in blocks. For those protocols, IKEY largely mitigates the cost of the mandatory key spend. Without IKEY, those potentially dominant spends are 32WU larger for no reason.</p>\n<p>Thanks to <a class=\"mention\" href=\"/u/jeremyrubin\">@JeremyRubin</a>’s <a href=\"https://rubin.io/bitcoin/2024/12/02/csfs-ctv-rekey-symmetry/\" rel=\"noopener nofollow ugc\">key laddering concept</a>, we know that CSFS alone enables Merkle-tree-ish commitments by using sigops to ladder keys which then commit to items. Given this, and the usefulness of such multi-commitments, I think it would be poor stewardship to add CSFS to bitcoin without also enabling multi-commitments directly. If we do so then protocol developers will use sigops instead, pushing up validation costs (not above current worst cases but simply unnecessarily). When I was developing the CSFS BIP, I briefly explored the idea of using magic keys of small sizes to specify additional items from the stack to sign over. In the end, I concluded that that functionality belongs in a separate opcode. <a class=\"mention\" href=\"/u/moonsettler\">@moonsettler</a> developed PC as that opcode.</p>\n<hr>\n<p>To tie this all together: While CAT would also enable multi-commitments for CSFS, CAT also violates the “slow and steady” ethos by introducing many capabilities with difficult to reason about incentive implications. PC is ideally situated to be everything we need to maintain incentive alignment between nodes and application protocol developers in a post-CSFS world, without introducing additional capabilities beyond those already added by CSFS itself.</p>",
  "post_number": 9,
  "post_type": 1,
  "updated_at": "2025-03-11T17:19:12.897Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 30,
  "reads": 19,
  "readers_count": 18,
  "score": 153.6,
  "yours": false,
  "topic_id": 1509,
  "topic_slug": "ctv-csfs-can-we-reach-consensus-on-a-first-step-towards-covenants",
  "topic_title": "CTV+CSFS: Can we reach consensus on a first step towards covenants?",
  "topic_html_title": "CTV+CSFS: Can we reach consensus on a first step towards covenants?",
  "category_id": 7,
  "display_username": "Brandon Black",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 3,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I support this effort, as reflected in my [pinned post](https://x.com/reardencode/status/1871343039123452340\n) on X.\n\n![image|690x353](upload://m7pNR3NmzBQGDpvYTnXZdFdxAhX.png)\n\nTo slightly expand on why specifically CTV+CSFS(and IKEY+PC?):\n\nIKEY: [INTERNALKEY](https://github.com/bitcoin/bips/blob/050d422b2ac24d8221edab0ff0053e0f585409f7/bip-0349.md)\nPC: [PAIRCOMMIT](https://github.com/bitcoin/bips/pull/1699)\n\nThere's a tension between \"only change bitcoin consensus in gravest extremity\" and \"upgrade bitcoin whenever there's a clear improvement to be had\". Team Slow and Steady (as promoted by @ajtowns, @moneyball, and others) is a proposed middle of the road that aligns well with the CTV+CSFS upgrade.\n\nWhile there are many, @AntoineP included, who are in a fourth camp of \"only change bitcoin consensus when there is a strong and clear reason\", that standard is simply not realizable while navigating the delicately balanced space between \"only in gravest extremity\" and \"slow and steady\". Any upgrade that would add sufficient capabilities to show such a strong and clear reason will necessarily also raise the specter of potentially weakening the incentives which are necessary for bitcoin's continued success. While I personally am confident that an upgrade such as CAT, Simplicity, or Lisp would not harm the incentive structure, that is difficult (I think impossible) to defend to Team Slow and Steady.\n\nTherefore, we are left not with a choice of \"CTV+CSFS now or something with stronger justification later\" but rather \"CTV+CSFS at some point, or nothing until solving the 2106 timestamp overflow\".\n\n----\n\nLastly, I'd like to expand on why I think CTV+CSFS alone may need IKEY and PC to reach activation.\n\nThere was some debate during the development over the exclusion of a keyless spend. This was resolved with the justification that nearly all protocols have a cooperative n-of-n case that will dominate over whatever uncooperative cases. While this is broadly true, for some of these protocols, success would mean that the cooperative case itself is rarely broadcast which would then imply that uncooperative cases are the main spend seen in blocks. For those protocols, IKEY largely mitigates the cost of the mandatory key spend. Without IKEY, those potentially dominant spends are 32WU larger for no reason.\n\nThanks to @JeremyRubin's [key laddering concept](https://rubin.io/bitcoin/2024/12/02/csfs-ctv-rekey-symmetry/), we know that CSFS alone enables Merkle-tree-ish commitments by using sigops to ladder keys which then commit to items. Given this, and the usefulness of such multi-commitments, I think it would be poor stewardship to add CSFS to bitcoin without also enabling multi-commitments directly. If we do so then protocol developers will use sigops instead, pushing up validation costs (not above current worst cases but simply unnecessarily). When I was developing the CSFS BIP, I briefly explored the idea of using magic keys of small sizes to specify additional items from the stack to sign over. In the end, I concluded that that functionality belongs in a separate opcode. @moonsettler developed PC as that opcode.\n\n---\n\nTo tie this all together: While CAT would also enable multi-commitments for CSFS, CAT also violates the \"slow and steady\" ethos by introducing many capabilities with difficult to reason about incentive implications. PC is ideally situated to be everything we need to maintain incentive alignment between nodes and application protocol developers in a post-CSFS world, without introducing additional capabilities beyond those already added by CSFS itself.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 30,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}