{
  "id": 4644,
  "name": "",
  "username": "josh",
  "avatar_template": "/user_avatar/delvingbitcoin.org/josh/{size}/95_2.png",
  "created_at": "2025-03-29T01:48:16.029Z",
  "cooked": "<h3><a name=\"p-4644-tldr-1\" class=\"anchor\" href=\"#p-4644-tldr-1\"></a>TLDR</h3>\n<p>This post presents a game-theoretic argument for why bitcoin will emerge as the optimal unit of account in equilibrium. The argument is based upon the observation that a generally agreed upon unit of account that represents a constant share of total wealth (equal to the totality of all other economic utility) will naturally create price signals that passively stabilize the macroeconomy, without requiring external interventi­on.</p>\n<p>Bitcoin’s unique properties (finite supply, inertness, fungibility, accessibility, and ownership history) position it as the leading candidate to emerge as this unit.</p>\n<h3><a name=\"p-4644-introduction-2\" class=\"anchor\" href=\"#p-4644-introduction-2\"></a>Introduction</h3>\n<p>Bitcoin’s present valuation has been justified through multiple frameworks, but I would like to present a perspective that focuses solely on bitcoin’s game-theoretic valuation in the terminal equilibrium.</p>\n<p>Money serves three functions: store of value, medium of exchange, and unit of account. While economists often focus on the medium-of-exchange function to justify money’s utility, all three are equally important. Bitcoin discussions frequently center around the store-of-value and medium-of-exchange functions, but I believe that the unit-of-account function provides perhaps the most compelling basis upon which to value bitcoin at the terminal equilibrium.</p>\n<h3><a name=\"p-4644-the-historical-role-of-units-of-account-3\" class=\"anchor\" href=\"#p-4644-the-historical-role-of-units-of-account-3\"></a>The Historical Role of Units of Account</h3>\n<p>The unit-of-account function of money is the function most explicitly backed by the use of force. As David Graeber documented in <em>Debt: The First 5,000 Years</em>, the evolution of money is intertwined with the state as the enforcer of contracts and debts. This relationship extends beyond state-citizen obligations to include contractual agreements between individuals, households, and businesses.</p>\n<p>Some in the bitcoin community dismiss credit as an artifact of the \"fiat economy,” but contracts and debts exist in all economic systems. Employment agreements, trade credit, and similar time-based credit agreements are fundamental to human economic activity. Furthermore, debt financing serves important functions in entrepreneurship, by aligning incentives between managers, majority shareholders, and minority investors, who face imperfect information and principal-agent conflict.</p>\n<h3><a name=\"p-4644-the-optimal-unit-of-account-4\" class=\"anchor\" href=\"#p-4644-the-optimal-unit-of-account-4\"></a>The Optimal Unit of Account</h3>\n<p>My central hypothesis is that the optimal unit of account represents a constant generally agreed upon share of total wealth, equating to the totality of all other economic utility.</p>\n<p>I do not use the word <em>optimal</em> lightly. There are very few problems for which we can say a solution is optimal. Most arise in the realms of mathematics and computer science, like the fastest possible way to sort, with respect to the worst-case running time.</p>\n<p>Proving optimality requires first establishing clear objectives. Traditional economic theory states that monetary policy serves two primary goals:</p>\n<ol>\n<li>\n<p>Price stability</p>\n</li>\n<li>\n<p>Maximum employment</p>\n</li>\n</ol>\n<p>The two goals are intertwined, insofar as highly unstable prices make it difficult for households and businesses to plan, save, and invest, but these goals are a means to an end. The fundamental objective is to moderate the business cycle and achieve prosperity through macroeconomic stability, by creating price signals that help economic actors respond effectively to changing conditions.</p>\n<h3><a name=\"p-4644-the-problem-with-existing-monetary-units-5\" class=\"anchor\" href=\"#p-4644-the-problem-with-existing-monetary-units-5\"></a>The Problem with Existing Monetary Units</h3>\n<p>Price stability, with respect to some basket of goods and services, is the primary objective of monetary authorities, like the Federal Reserve, but this objective can inadvertently create macroeconomic instability. Consider the following scenarios:</p>\n<ol>\n<li>\n<p><strong>During economic overheating</strong>: When the economy overheats during a speculative bubble, wealth <span class=\"math\">W</span> tends to grow faster than income <span class=\"math\">I</span>, and debts denominated in a unit tied to a basket of goods and services become <em>easier</em> to service. This creates a perverse incentive, as it generates a price signal that tells households and businesses to increase spending and investment, rather than act with restraint.</p>\n</li>\n<li>\n<p><strong>During economic contraction</strong>: When bubbles collapse and wealth falls faster than income, debts become <em>harder</em> to service precisely when they should become easier. This triggers layoffs and bankruptcies, risking potential depression.</p>\n</li>\n</ol>\n<p>This inherent instability led to Keynesian economics, which attempts to counteract these signals and their effects through a patchwork of fiscal and monetary government intervention. However, implementing perfect Keynesian policy faces numerous challenges: timing issues, political incentives against unpopular preemptive measures, uneven distributional effects, etc.</p>\n<h3><a name=\"p-4644-bitcoin-as-a-solution-6\" class=\"anchor\" href=\"#p-4644-bitcoin-as-a-solution-6\"></a>Bitcoin as a Solution</h3>\n<p>Bitcoin offers a potential alternative: a unit representing a generally agreed upon share of total wealth which could provide price stability with respect to <em>asset prices</em> rather than goods and services.</p>\n<p>While bitcoin does not yet serve this function, it possesses the necessary properties to do so:</p>\n<ol>\n<li>\n<p>Inert and digital, with no explicit cash flows</p>\n</li>\n<li>\n<p>Fungible and accessible</p>\n</li>\n<li>\n<p>A known finite supply</p>\n</li>\n<li>\n<p>A unique ownership history based on explicit and implicit proof-of-work</p>\n</li>\n</ol>\n<p>This creates the potential for social consensus to emerge assigning it a constant amount of utility relative to total wealth.</p>\n<h3><a name=\"p-4644-the-self-stabilizing-mechanism-7\" class=\"anchor\" href=\"#p-4644-the-self-stabilizing-mechanism-7\"></a>The Self-Stabilizing Mechanism</h3>\n<p>Suppose that we had a unit of relative wealth, which represents a constant share of the total wealth of the economy. With contracts and debts denominated in a unit of relative wealth, the economy would passively self-stabilize:</p>\n<ol>\n<li>\n<p><strong>During economic overheating</strong>: When wealth <span class=\"math\">W</span> grows faster than income <span class=\"math\">I</span>, debts denominated in this unit become proportionally <em>harder</em> to service. This creates a natural price signal restraining investment and spending.</p>\n</li>\n<li>\n<p><strong>During economic contraction</strong>: When wealth falls faster than income, debts become proportionally <em>easier</em> to service, leaving more money in people’s pockets to spend and invest and helping the economy recover.</p>\n</li>\n</ol>\n<p>In this way, a generally agreed upon unit of relative wealth has a passive stabilizing effect on the macroeconomy, without requiring external intervention. Macroeconomic stability is in the interest of all members of society, so if a unit of relative wealth can be agreed upon, it is in the self-interest of all members of society to do so.</p>\n<h3><a name=\"p-4644-on-deflation-8\" class=\"anchor\" href=\"#p-4644-on-deflation-8\"></a>On Deflation</h3>\n<p>It’s worth acknowledging the implications of a unit of account that provides price stability with respect to <em>asset prices</em> rather than goods and services. Under such a unit, goods and services that become cheaper and cheaper over time relative to all other assets will see their price naturally fall. Likewise, goods and services that become more expensive relative to all other assets will see their price naturally rise. Both of these are perfectly natural price signals, as they help adjust supply and demand.</p>\n<p>Concerns about “deflation” are only valid insofar as they pertain to a currency that tends to appreciate relative to all other assets during an economic crisis, which makes debts harder to service and creates further instability, risking economic depression. These concerns do not apply to a generally agreed upon unit that already reflects the totality of all other economic utility.</p>\n<p>In short, if economic actors already value this unit at the maximal extent, there is no risk that the unit appreciates during an economic crisis, making debts suddenly more difficult to pay off.</p>\n<p>Do long-run productivity-driven “deflationary” expectations have an effect on employment and economic behavior? The Lucas Critique would suggest not. Penned by Robert Lucas in the mid-1970s, the Lucas Critique famously challenged the then-prevailing Phillips Curve, a macroeconomic model that suggested that inflation would reduce unemployment and deflation would increase it. The implication is that in the long run, an economy can operate optimally even under “deflationary” expectations.</p>\n<h3><a name=\"p-4644-the-game-theory-of-bitcoins-terminal-valuation-9\" class=\"anchor\" href=\"#p-4644-the-game-theory-of-bitcoins-terminal-valuation-9\"></a>The Game Theory of Bitcoin’s Terminal Valuation</h3>\n<p>Game-theoretically, economic actors should converge on some finite-supply, inert, fungible, digital asset to serve as a unit of relative wealth, reflecting the totality of all other economic utility. This implies that bitcoin would represent 50% of total wealth in the terminal equilibrium, serving as the primary monetary asset against which all other assets are valued.</p>\n<p>Not only is a maximalist valuation the only path to a unit that cannot appreciate, it is arguably the only valuation that economic actors can mutually agree on. Valuation is inherently subjective. Each economic actor has their own utility function with unique preferences and ordering. Not all actors will agree on the relative “value” or utility of real assets in the economy, nor is it possible for economic actors to communicate the absolute utility that they assign. Utility is a relative concept.</p>\n<p>Therefore, we can conclude:</p>\n<ol>\n<li>\n<p>If it is in the self-interest of all economic actors to choose a mutually agreed upon unit of relative wealth, the only natural Schelling point is for each actor to assign it the maximal utility.</p>\n</li>\n<li>\n<p>The maximal utility that an observer can assign to an inert digital asset is the utility of all other assets, since it cannot be worth more than what can be purchased.</p>\n</li>\n<li>\n<p>If all observers assign utility to an inert digital asset equal to that of all other assets, the asset will represent exactly 50% of total wealth <span class=\"math\">W</span>.</p>\n</li>\n</ol>\n<p>Only at this maximalist Schelling point can all participants achieve consensus without incentives to defect.</p>\n<h3><a name=\"p-4644-implementation-and-transition-10\" class=\"anchor\" href=\"#p-4644-implementation-and-transition-10\"></a>Implementation and Transition</h3>\n<p>The path to this Schelling point involves gradual, voluntary coordination and, ultimately, legal recognition. We already see this process beginning, but we’re still in the early innings:</p>\n<ol>\n<li>\n<p>Some hedge funds, VC firms, and public companies are already benchmarking their performance against bitcoin.</p>\n</li>\n<li>\n<p>The financial media is increasingly referencing bitcoin as a performance baseline.</p>\n</li>\n<li>\n<p>However, there is limited adoption of bitcoin as a unit of account for debts and contracts, even among those active in the bitcoin economy.</p>\n</li>\n</ol>\n<p>For legal contracts to emerge denominated in bitcoin, you must first find parties on both sides who benchmark against the asset. One of these parties must then be willing to give up some value today in exchange for the expectation of more value, in bitcoin terms, in the future. Few such contracts exist today, but bitcoin-denominated liquidation preferences, for bitcoin startups raising funding from bitcoin-only venture funds, may be an ideal place to start.</p>\n<p>While the transition involves volatility and uncertainty, similar to historical monetary transitions, the gravity pulling humanity toward this self-reinforcing equilibrium is immense, as it would benefit society writ large through greater economic stability. Early adopters benefit as well, but the invisible hand of society chooses the degree of the benefit, by choosing the speed at which terminal equilibrium is approached.</p>\n<p>At longer time horizons (100+ or 500+ years), concerns about bitcoin’s concentrated initial distribution will become increasingly less relevant. What matters is selecting the asset humanity will ultimately choose given the game-theoretic benefits of making some choice.</p>\n<h3><a name=\"p-4644-conclusion-11\" class=\"anchor\" href=\"#p-4644-conclusion-11\"></a>Conclusion</h3>\n<p>This analysis provides a game-theoretic approach to bitcoin’s adoption as money and its appropriate final valuation. Bitcoin’s properties make it the leading candidate to serve as a generally agreed upon unit of relative wealth, reflecting the totality of all other economic utility. This end-state represents a self-reinforcing equilibrium in which bitcoin comprises 50% of total wealth. While the transition requires time, informal coordination, and legal recognition, game-theoretic gravity dictates its seeming inevitability. The opportunity to eliminate monetary-induced instability is simply too great to ignore.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2025-03-29T01:48:16.029Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 3,
  "readers_count": 2,
  "score": 0.6,
  "yours": false,
  "topic_id": 1547,
  "topic_slug": "a-game-theoretic-approach-to-bitcoin-s-valuation-in-equilibrium",
  "topic_title": "A Game-Theoretic Approach to Bitcoin’s Valuation in Equilibrium",
  "topic_html_title": "A Game-Theoretic Approach to Bitcoin’s Valuation in Equilibrium",
  "category_id": 6,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "### TLDR\n\nThis post presents a game-theoretic argument for why bitcoin will emerge as the optimal unit of account in equilibrium. The argument is based upon the observation that a generally agreed upon unit of account that represents a constant share of total wealth (equal to the totality of all other economic utility) will naturally create price signals that passively stabilize the macroeconomy, without requiring external interventi­on.\n\nBitcoin's unique properties (finite supply, inertness, fungibility, accessibility, and ownership history) position it as the leading candidate to emerge as this unit. \n\n### Introduction\n\nBitcoin's present valuation has been justified through multiple frameworks, but I would like to present a perspective that focuses solely on bitcoin's game-theoretic valuation in the terminal equilibrium.\n\nMoney serves three functions: store of value, medium of exchange, and unit of account. While economists often focus on the medium-of-exchange function to justify money's utility, all three are equally important. Bitcoin discussions frequently center around the store-of-value and medium-of-exchange functions, but I believe that the unit-of-account function provides perhaps the most compelling basis upon which to value bitcoin at the terminal equilibrium.\n\n### The Historical Role of Units of Account\n\nThe unit-of-account function of money is the function most explicitly backed by the use of force. As David Graeber documented in *Debt: The First 5,000 Years*, the evolution of money is intertwined with the state as the enforcer of contracts and debts. This relationship extends beyond state-citizen obligations to include contractual agreements between individuals, households, and businesses.\n\nSome in the bitcoin community dismiss credit as an artifact of the \"fiat economy,” but contracts and debts exist in all economic systems. Employment agreements, trade credit, and similar time-based credit agreements are fundamental to human economic activity. Furthermore, debt financing serves important functions in entrepreneurship, by aligning incentives between managers, majority shareholders, and minority investors, who face imperfect information and principal-agent conflict.\n\n### The Optimal Unit of Account\n\nMy central hypothesis is that the optimal unit of account represents a constant generally agreed upon share of total wealth, equating to the totality of all other economic utility.\n\nI do not use the word *optimal* lightly. There are very few problems for which we can say a solution is optimal. Most arise in the realms of mathematics and computer science, like the fastest possible way to sort, with respect to the worst-case running time.\n\nProving optimality requires first establishing clear objectives. Traditional economic theory states that monetary policy serves two primary goals:\n\n1. Price stability\n\n2. Maximum employment\n \nThe two goals are intertwined, insofar as highly unstable prices make it difficult for households and businesses to plan, save, and invest, but these goals are a means to an end. The fundamental objective is to moderate the business cycle and achieve prosperity through macroeconomic stability, by creating price signals that help economic actors respond effectively to changing conditions.\n\n### The Problem with Existing Monetary Units\n\nPrice stability, with respect to some basket of goods and services, is the primary objective of monetary authorities, like the Federal Reserve, but this objective can inadvertently create macroeconomic instability. Consider the following scenarios:\n\n1. **During economic overheating**: When the economy overheats during a speculative bubble, wealth $W$ tends to grow faster than income $I$, and debts denominated in a unit tied to a basket of goods and services become *easier* to service. This creates a perverse incentive, as it generates a price signal that tells households and businesses to increase spending and investment, rather than act with restraint.\n\n2. **During economic contraction**: When bubbles collapse and wealth falls faster than income, debts become *harder* to service precisely when they should become easier. This triggers layoffs and bankruptcies, risking potential depression.\n\nThis inherent instability led to Keynesian economics, which attempts to counteract these signals and their effects through a patchwork of fiscal and monetary government intervention. However, implementing perfect Keynesian policy faces numerous challenges: timing issues, political incentives against unpopular preemptive measures, uneven distributional effects, etc.\n\n### Bitcoin as a Solution\n\nBitcoin offers a potential alternative: a unit representing a generally agreed upon share of total wealth which could provide price stability with respect to *asset prices* rather than goods and services.\n\nWhile bitcoin does not yet serve this function, it possesses the necessary properties to do so:\n\n1. Inert and digital, with no explicit cash flows\n\n2. Fungible and accessible\n\n3. A known finite supply\n\n4. A unique ownership history based on explicit and implicit proof-of-work\n\nThis creates the potential for social consensus to emerge assigning it a constant amount of utility relative to total wealth.\n\n### The Self-Stabilizing Mechanism\n\nSuppose that we had a unit of relative wealth, which represents a constant share of the total wealth of the economy. With contracts and debts denominated in a unit of relative wealth, the economy would passively self-stabilize:\n\n1. **During economic overheating**: When wealth $W$ grows faster than income $I$, debts denominated in this unit become proportionally *harder* to service. This creates a natural price signal restraining investment and spending.\n\n2. **During economic contraction**: When wealth falls faster than income, debts become proportionally *easier* to service, leaving more money in people’s pockets to spend and invest and helping the economy recover.\n\nIn this way, a generally agreed upon unit of relative wealth has a passive stabilizing effect on the macroeconomy, without requiring external intervention. Macroeconomic stability is in the interest of all members of society, so if a unit of relative wealth can be agreed upon, it is in the self-interest of all members of society to do so.\n\n### On Deflation\n\nIt's worth acknowledging the implications of a unit of account that provides price stability with respect to *asset prices* rather than goods and services. Under such a unit, goods and services that become cheaper and cheaper over time relative to all other assets will see their price naturally fall. Likewise, goods and services that become more expensive relative to all other assets will see their price naturally rise. Both of these are perfectly natural price signals, as they help adjust supply and demand.\n\nConcerns about \"deflation\" are only valid insofar as they pertain to a currency that tends to appreciate relative to all other assets during an economic crisis, which makes debts harder to service and creates further instability, risking economic depression. These concerns do not apply to a generally agreed upon unit that already reflects the totality of all other economic utility.\n\nIn short, if economic actors already value this unit at the maximal extent, there is no risk that the unit appreciates during an economic crisis, making debts suddenly more difficult to pay off.\n\nDo long-run productivity-driven \"deflationary\" expectations have an effect on employment and economic behavior? The Lucas Critique would suggest not. Penned by Robert Lucas in the mid-1970s, the Lucas Critique famously challenged the then-prevailing Phillips Curve, a macroeconomic model that suggested that inflation would reduce unemployment and deflation would increase it. The implication is that in the long run, an economy can operate optimally even under \"deflationary\" expectations.\n\n### The Game Theory of Bitcoin's Terminal Valuation\n\nGame-theoretically, economic actors should converge on some finite-supply, inert, fungible, digital asset to serve as a unit of relative wealth, reflecting the totality of all other economic utility. This implies that bitcoin would represent 50% of total wealth in the terminal equilibrium, serving as the primary monetary asset against which all other assets are valued.\n\nNot only is a maximalist valuation the only path to a unit that cannot appreciate, it is arguably the only valuation that economic actors can mutually agree on. Valuation is inherently subjective. Each economic actor has their own utility function with unique preferences and ordering. Not all actors will agree on the relative \"value\" or utility of real assets in the economy, nor is it possible for economic actors to communicate the absolute utility that they assign. Utility is a relative concept.\n\nTherefore, we can conclude:\n1. If it is in the self-interest of all economic actors to choose a mutually agreed upon unit of relative wealth, the only natural Schelling point is for each actor to assign it the maximal utility.\n\n2. The maximal utility that an observer can assign to an inert digital asset is the utility of all other assets, since it cannot be worth more than what can be purchased.\n\n3. If all observers assign utility to an inert digital asset equal to that of all other assets, the asset will represent exactly 50% of total wealth $W$.\n\nOnly at this maximalist Schelling point can all participants achieve consensus without incentives to defect.\n\n### Implementation and Transition\n\nThe path to this Schelling point involves gradual, voluntary coordination and, ultimately, legal recognition. We already see this process beginning, but we’re still in the early innings:\n\n1. Some hedge funds, VC firms, and public companies are already benchmarking their performance against bitcoin.\n\n2. The financial media is increasingly referencing bitcoin as a performance baseline.\n\n3. However, there is limited adoption of bitcoin as a unit of account for debts and contracts, even among those active in the bitcoin economy.\n\nFor legal contracts to emerge denominated in bitcoin, you must first find parties on both sides who benchmark against the asset. One of these parties must then be willing to give up some value today in exchange for the expectation of more value, in bitcoin terms, in the future. Few such contracts exist today, but bitcoin-denominated liquidation preferences, for bitcoin startups raising funding from bitcoin-only venture funds, may be an ideal place to start.\n\nWhile the transition involves volatility and uncertainty, similar to historical monetary transitions, the gravity pulling humanity toward this self-reinforcing equilibrium is immense, as it would benefit society writ large through greater economic stability. Early adopters benefit as well, but the invisible hand of society chooses the degree of the benefit, by choosing the speed at which terminal equilibrium is approached.\n\nAt longer time horizons (100+ or 500+ years), concerns about bitcoin's concentrated initial distribution will become increasingly less relevant. What matters is selecting the asset humanity will ultimately choose given the game-theoretic benefits of making some choice.\n\n### Conclusion\n\nThis analysis provides a game-theoretic approach to bitcoin's adoption as money and its appropriate final valuation. Bitcoin's properties make it the leading candidate to serve as a generally agreed upon unit of relative wealth, reflecting the totality of all other economic utility. This end-state represents a self-reinforcing equilibrium in which bitcoin comprises 50% of total wealth. While the transition requires time, informal coordination, and legal recognition, game-theoretic gravity dictates its seeming inevitability. The opportunity to eliminate monetary-induced instability is simply too great to ignore.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 98,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}