{
  "id": 4547,
  "name": "",
  "username": "gmaxwell",
  "avatar_template": "/letter_avatar_proxy/v4/letter/g/fbc32d/{size}.png",
  "created_at": "2025-03-16T04:49:47.409Z",
  "cooked": "<p>There are a number of very long term abusers that are probably wasting a majority of the network’s total non-ibd bandwidth usage on identifiable networks.</p>\n<p>It might be useful to break out those networks in any further reporting for them because they have different implications.  E.g. they won’t benefit from erlay gains… and probably the only way to mitigate them is to start shipping a list of subnets that are relegated to blocks only by default or similar.</p>\n<p>In terms of listening nodes-- the term you want is archive nodes or listening archive nodes, ones that have the complete chain and accept connections.  There are plenty of listening pruned nodes.</p>\n<p>Probably the biggest improvement in bandwidth usage for listening archive nodes is to try to get more nodes that don’t mind the bandwidth into that state:  if we say 10% of archive nodes are listening today (largely as a result of a lack of nat traversal) then each that is will be seeing something like 10x the total transfer that they’d see if all listened.</p>\n<p>You can get ~25% reduction by transferring blocks using a more efficient encoding, there had been some mailing list posts on an alternative encoding that I think is similar to that used by the blockstream satellite stuff. See <a href=\"https://github.com/bitcoin/bips/blob/00c13baff0dc4a3a250d9725129b0d2c8d0be6a9/bip-0337.mediawiki\" rel=\"noopener nofollow ugc\">BIP337</a>  As a bonus it’s perfectly reasonable to use that encoding on disk and get the savings there too.</p>\n<p>A useful metric I think is also to measure the frequency you see of fetches of blocks e.g. 100k to 110k  vs  10k from the tip to 20k from the tip… which would estimate how much bandwidth is being wasted on syncs that don’t complete.</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2025-03-16T05:01:54.614Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 1,
  "reads": 18,
  "readers_count": 17,
  "score": 7.8,
  "yours": false,
  "topic_id": 1490,
  "topic_slug": "bitcoin-node-p2p-traffic-analysis",
  "topic_title": "Bitcoin node P2P traffic analysis",
  "topic_html_title": "Bitcoin node P2P traffic analysis",
  "category_id": 8,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 4,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "There are a number of very long term abusers that are probably wasting a majority of the network's total non-ibd bandwidth usage on identifiable networks.\n\nIt might be useful to break out those networks in any further reporting for them because they have different implications.  E.g. they won't benefit from erlay gains... and probably the only way to mitigate them is to start shipping a list of subnets that are relegated to blocks only by default or similar.\n\nIn terms of listening nodes-- the term you want is archive nodes or listening archive nodes, ones that have the complete chain and accept connections.  There are plenty of listening pruned nodes.\n\nProbably the biggest improvement in bandwidth usage for listening archive nodes is to try to get more nodes that don't mind the bandwidth into that state:  if we say 10% of archive nodes are listening today (largely as a result of a lack of nat traversal) then each that is will be seeing something like 10x the total transfer that they'd see if all listened.\n\nYou can get ~25% reduction by transferring blocks using a more efficient encoding, there had been some mailing list posts on an alternative encoding that I think is similar to that used by the blockstream satellite stuff. See [BIP337](https://github.com/bitcoin/bips/blob/00c13baff0dc4a3a250d9725129b0d2c8d0be6a9/bip-0337.mediawiki)  As a bonus it's perfectly reasonable to use that encoding on disk and get the savings there too.\n\nA useful metric I think is also to measure the frequency you see of fetches of blocks e.g. 100k to 110k  vs  10k from the tip to 20k from the tip... which would estimate how much bandwidth is being wasted on syncs that don't complete.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 699,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}