{
  "id": 4590,
  "name": "Steven Roose",
  "username": "stevenroose",
  "avatar_template": "/user_avatar/delvingbitcoin.org/stevenroose/{size}/1087_2.png",
  "created_at": "2025-03-22T19:12:19.635Z",
  "cooked": "<p>Yes. But only partially yes. There are other benefits from the arkoor model. Like I mention in my previous reply, the liquidity cost for the server (and hence the liquidity fee paid by the user) to refresh a VTXO is proportional with the time remaining until the expiration of the VTXO. Hence, the arkoor model gives the receiver of a VTXO the choice which side of the trade-off he wants to take.</p>\n<p>If he wants full trustless ownership of the VTXO, but pay a higher liquidity fee, he can refresh the VTXO. If he is ok with the arkoor trust assumption for another 15-30 days (on average half the expiration time), he can save on fees.</p>\n<p>We imagine that people that are holding significant amounts in their VTXOs, and receive them from unknown third parties, will be more inclined to refresh their VTXOs early. While users that are doing smaller day-to-day payments will probably prefer to save on fees.</p>\n<p>But to reply to your root question: yes, the interactivity requirement of the round is pretty strong. Moreso, it is also <strong>very vulnerable to denial-of-service attacks</strong>. The round can only finish if all the participating users do their part correctly, so f.e. it is possible for an attacker to participate in the round with multiple “users”, and each attempt fail a single one, hence forcing the entire round to be retried as many times as he has identities.</p>\n<p>The way we mitigate these DoS problems is first of all banning non-cooperative users from the next attempt, this is an obvious step. Every time a round needs to be re-attempted, only the participants that provided their signatures are allowed in the next attempt.</p>\n<p>But second, we also penalize the VTXOs of the participants. And here there is a very big difference between a sender and a receiver. A sender submits a VTXO as input to the round. If he abandons the round, we can slash his VTXO a little bit (basically reducing it’s value in our books by a few sats). This means that each time he abandons a round, he loses some money. (They can always unilaterally exit to get the full amount but exits also have an on-chain cost.)</p>\n<p>Receivers, on the other hand, are not associated with an existing VTXO. So they can’t be penalized and have nothing to lose in performing a DoS attack on the round. Therefore, even if the interactivity would be minimal, we can’t actually have receivers participate in rounds. (That’s why LN receives are difficult without CTV, a receiver would only be able to receive a LN payment if they would already have an existing VTXO they can sign overship for and we’d slash that one.)</p>",
  "post_number": 5,
  "post_type": 1,
  "updated_at": "2025-03-22T19:12:19.635Z",
  "reply_count": 0,
  "reply_to_post_number": 3,
  "quote_count": 0,
  "incoming_link_count": 2,
  "reads": 3,
  "readers_count": 2,
  "score": 10.6,
  "yours": false,
  "topic_id": 1528,
  "topic_slug": "the-ark-case-for-ctv",
  "topic_title": "The Ark case for CTV",
  "topic_html_title": "The Ark case for CTV",
  "category_id": 7,
  "display_username": "Steven Roose",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "neha",
    "name": "Neha",
    "avatar_template": "/user_avatar/delvingbitcoin.org/neha/{size}/169_2.png"
  },
  "bookmarked": false,
  "raw": "Yes. But only partially yes. There are other benefits from the arkoor model. Like I mention in my previous reply, the liquidity cost for the server (and hence the liquidity fee paid by the user) to refresh a VTXO is proportional with the time remaining until the expiration of the VTXO. Hence, the arkoor model gives the receiver of a VTXO the choice which side of the trade-off he wants to take. \n\nIf he wants full trustless ownership of the VTXO, but pay a higher liquidity fee, he can refresh the VTXO. If he is ok with the arkoor trust assumption for another 15-30 days (on average half the expiration time), he can save on fees.\n\nWe imagine that people that are holding significant amounts in their VTXOs, and receive them from unknown third parties, will be more inclined to refresh their VTXOs early. While users that are doing smaller day-to-day payments will probably prefer to save on fees.\n\nBut to reply to your root question: yes, the interactivity requirement of the round is pretty strong. Moreso, it is also **very vulnerable to denial-of-service attacks**. The round can only finish if all the participating users do their part correctly, so f.e. it is possible for an attacker to participate in the round with multiple \"users\", and each attempt fail a single one, hence forcing the entire round to be retried as many times as he has identities.\n\nThe way we mitigate these DoS problems is first of all banning non-cooperative users from the next attempt, this is an obvious step. Every time a round needs to be re-attempted, only the participants that provided their signatures are allowed in the next attempt.\n\nBut second, we also penalize the VTXOs of the participants. And here there is a very big difference between a sender and a receiver. A sender submits a VTXO as input to the round. If he abandons the round, we can slash his VTXO a little bit (basically reducing it's value in our books by a few sats). This means that each time he abandons a round, he loses some money. (They can always unilaterally exit to get the full amount but exits also have an on-chain cost.)\n\nReceivers, on the other hand, are not associated with an existing VTXO. So they can't be penalized and have nothing to lose in performing a DoS attack on the round. Therefore, even if the interactivity would be minimal, we can't actually have receivers participate in rounds. (That's why LN receives are difficult without CTV, a receiver would only be able to receive a LN payment if they would already have an existing VTXO they can sign overship for and we'd slash that one.)",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 76,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}