{
  "id": 4480,
  "name": "Antoine Riard",
  "username": "ariard",
  "avatar_template": "/letter_avatar_proxy/v4/letter/a/c67d28/{size}.png",
  "created_at": "2025-03-12T01:11:30.356Z",
  "cooked": "<p>Thanks Steven for introducing this subject.</p>\n<p>This is indeed a really compelling question if the community of bitcoin technical experts is in measure or not to reach consensus on covenants. Even if I disagree with a lot of the positions asserted within, this is always valuable to have that kind of conversation with the most dispassionate and disinterested minds.</p>\n<p><em>First and foremost</em>, I strong believe we should abstain ourselves to use expressions like “<em>we as a community felt</em>”, who is we ? who is that community ? and if you go to read any treatise on psychology, biological emotions and as such expressing “feelings” is one of the most subjective experience that one can have as a human being. The domain of subjective psychology is not necessarily the most compelling lexical fields when you have to argue on objective criterias for an audience who is geographically spread around the world.</p>\n<p><em>Secondly</em>, I strongly also believe we should abstain ourselves to use expressions like \"<em>Bitcoin soft-forks are clearly a unique technical and political challenge</em>,”.</p>\n<p>As said in reply to James on the mailing list which is still pending moderation, <strong>science and engineering != politics</strong>. The old bitcoin motto is \"<em>Vires in numeris</em>”, which for the ones less used with Latin means “<em>Trust the Numbers</em>”, i.e all the cryptographic assumptions backing Bitcoin as a protocol and a network (Discreet Log problem, preimage-collision resistance for SHA256, Hashcash as a cryptographic protocol, etc).</p>\n<p>That changing the Bitcoin consensus involves discussions, arguments and palavers with other human beings, yes this is a reality and otherwise there would be no one else with whom you could exchange few scarce sats of your stack. However, this is a social activity, e.g like a group of people who would play the different instruments of a musical orchestra, but it’s not a political activity, as it’s understood in humanities (e.g in postmodern theories, science has always been a unique object of its own).</p>\n<p>If my memory is correct, myself I’ve only used the “political” adjectives 2 in my more than half-a-decade Bitcoin career, and the 2 times it was to denounce the kind of horse-trading show we often see on bitcoin core, where contributor A goes to review PR <span class=\"hashtag-raw\">#1</span> in exchange of another contributor B going to review PR <span class=\"hashtag-raw\">#2</span> (— they mutually benefit of merged PRs for their funding renewal, afterall…), under all very questionable technical criteria. Horse-trading show more or less documented in IETF RFC 7282, pointing this is not technically sound \"rough consensus”.</p>\n<p>Of course, that historically in Bitcoin some people involved at the crux of the development process of <code>bitcoind</code>, the original client, have tacken at times, or been deliberately ambiguous with trying to establish any sound guidelines, while at the same time having massive commercial interests on a specific technical outcome has been seriously detrimental for the <em>credibility</em> of the process of consensus changes.</p>\n<p>Let’s remember the example of Blockstream, where folks have gone to raise venture capitals for $21M, publishing a sidechain with a proposed Bitcoin Script (e.g <code>OP_SIDECHAINPROOFVERIFY</code>) while the names on the paper had work experience with Mozilla and few other non-profits. At Mozilla, the Foundation is dissociated from Mozilla Corporation, and this was already true at the time in 2014.</p>\n<p>I don’t remember that Satoshi ever announced the venture capitalist funding of the Bitcoin whitepaper on TechCrunch.</p>\n<p>Instead the Blockstream people (Sipa, Gmax, Adam Back, Austin Hill), especially the engineers could have instead focus their time nurturing initiatives like Bitcoin Optech and its online-ressources and in-person workshops, or ensuring the old bitcoin mailing list hosted by the Linux foundation was moderated on neutral grounds, or building up on the work of Amir Taaki in maintaining the BIPs. All community activities building bridges in matters of consensus changes…</p>\n<p>But no what we had instead is a <a href=\"https://laanwj.github.io/2016/05/06/hostility-scams-and-moving-forward.html\">kick-out</a> of Gavin Andresen of its maintenance rights in 2016 (cf. laanwj’s blog post). Gavin Andresen and Mike Hearn, whatever all others judgements we can have on them, were technical builders and building communities. Somehow it turns out that Mike Hearn’s bitcoinj micropayment channels, which was Satoshi’s idea and of which the Lightning Network is only a sophisticated iteration, is what is certainly the most decentralized used second-layers, compared to “federated” side-chains.</p>\n<p>All that said I wasn’t active in Bitcoin protocol development during the early days of the Block Size War. I wasn’t in Blockstream folks shoes and I might judge them harshly retrospectively without all the facts in mind. However, as said the adage \"<em>Error humanum est, perseverare diabolicum</em>”.</p>\n<p>So I understood Jeremy’s “hot take” at the time of CTV 1st activation attempt in 2022 when he was jooking on one of his blog post (I can’t remind which one exactly…) that current Bitcoin consensus change is like getting the blessing of a “<em>Grey Beards Committee</em>”. One thing about unaccountable committee, you’ll always find people to join them and <em>do nothing</em>, just here to take the periodic financial reward associated with the committed seat…</p>\n<p><em>Thirdly</em>, saying proposal OP_MNO or proposal OP_IJK has “funding”, be it for-profit, non-profit, commercial venture, whatever is very short-sighted. Bitcoin as a protocol is first a complex scientific endeavor and let reminds <a href=\"https://en.wikipedia.org/wiki/Theranos\">Theranos</a> in matters of results on a highly-funded, scientifically deficient venture (cf. Theranos wikipedia page). W.r.t to non-profit sources of funding which can be driven with a more scientific perspective, if we exclude Jeremy the only independent names I’m aware off I’ve never contributed to bitcoin script code, themselves, even less on covenants, as far as I can remember.</p>\n<p><em>Fourthly</em>, on the statement that “<em>while the opcodes in question are well-studied so the risk of unforeseen side-effects is small</em>”, this is factually wrong.</p>\n<p>As Gleb Naumenko researched in the past and I pointed out this research on the mailing list, extending the bitcoin script can break the current UTXO model and enable to have tx-withhold risks of time-sensitive transactions.</p>\n<p>Here the blog post, drawing from Ethereum academic literature actually:\n</p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://blog.bitmex.com/txwithhold-smart-contracts/\">\n  <header class=\"source\">\n      <img src=\"https://delvingbitcoin.org/uploads/default/original/2X/4/48ce46d8d143993c51f51eec8370ca317b0fe81d.png\" class=\"site-icon\" data-dominant-color=\"892F80\" width=\"32\" height=\"32\">\n\n      <a href=\"https://blog.bitmex.com/txwithhold-smart-contracts/\" target=\"_blank\" rel=\"noopener\" title=\"01:00AM - 28 June 2022\">BitMEX Blog – 28 Jun 22</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:600/338;\"><img src=\"https://delvingbitcoin.org/uploads/default/original/2X/4/427a827e1b53c708ab0698ed1fac2195d6c45b98.jpeg\" class=\"thumbnail\" data-dominant-color=\"FFFFFF\" width=\"200\" height=\"200\"></div>\n\n<h3><a href=\"https://blog.bitmex.com/txwithhold-smart-contracts/\" target=\"_blank\" rel=\"noopener\">TxWithhold Smart Contracts by Gleb Naumenko | BitMEX Blog</a></h3>\n\n  <p>This article is also available on Gleb’s personal blog here. In this article, we attempt to design smart contracts encouraging miners to withhold a certain transaction, to better understand how practical such smart contracts are. Better understanding...</p>\n\n  <p>\n    <span class=\"label1\">Est. reading time: 13 minutes</span>\n  </p>\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>To put it plainly, an attacker could (1) set a tx-withhold UTXO with a time-sensitive txid and (2) have this UTXO paying out miners for each block or sequence of blocks the txid is not confirmed in the UTXO set and (3) double-spend the funding UTXO of a LN channel as “honest” lightning transactions have been withheld.</p>\n<p><em>Fifthly</em>, <em>CheckTemplateVerify</em> and its iterations has been around since more than ~6 years, it has been broken few times at least there was a change to integrate input in the template to avoid <em><strong>\"half-spend”</strong></em> issues, as Gmax pointed out. Very strict template is easier to reason on if it does enable some kind of change in the UTXO model.</p>\n<p><em>Sixthly</em>, for the Taproot there was an extended evaluation phase, with more than ~ 2 years and half between the proposition of BIP116 (<code>OP_MERKLEBRANCHVERIFY</code>) and BIP117 (Tail Call Execution Semantics), the original Taproot proposition in 2018 and the open-to-all on IRC review process over a span of weeks. This does not make Taproot perfect, as few people noticed after the code was merged for payment pools, there was no commitment to the script-path internal pubkey oddness <em>in the control block c</em>. Everyone is free to come to point out defects that could arise from Taproot consensus code, existing consensus code even made for Satoshi has its own issue, as the dummy element for <code>OP_CHECKMULTISIG</code> taught it.</p>\n<p><em>Seventhly</em>, on the “<em>Is it working perfectly and should it only be changed if its security is endangered?</em>”. See the point above about <em><strong>tx-withholding risk</strong></em> and the <em><strong>\"half-spend” issue</strong></em> that was found in the past about CTV. If bringing covenants in bitcoin is a real security risk, we should do no soft-fork, or delay until they have been more studied. Personally, if bitcoin dies next week, I’m lucky to have access to a wide range of other options to preserve my financial autonomy, even better than the average fiat billionaire.</p>\n<p>This is not the case of a lot of people in war zones, in developing countries or who cannot access the mainstream 24 / 7 banking system because they are discriminated due to a social factor (e.g they have an exotic name), etc. <em>Bitcoin is an alternative for the ones who need it.</em></p>\n<p><em>edited: to correct my own english and add missing link.</em></p>",
  "post_number": 13,
  "post_type": 1,
  "updated_at": "2025-03-12T01:20:13.412Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 28,
  "readers_count": 27,
  "score": 5.6,
  "yours": false,
  "topic_id": 1509,
  "topic_slug": "ctv-csfs-can-we-reach-consensus-on-a-first-step-towards-covenants",
  "topic_title": "CTV+CSFS: Can we reach consensus on a first step towards covenants?",
  "topic_html_title": "CTV+CSFS: Can we reach consensus on a first step towards covenants?",
  "category_id": 7,
  "display_username": "Antoine Riard",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Thanks Steven for introducing this subject.\n\nThis is indeed a really compelling question if the community of bitcoin technical experts is in measure or not to reach consensus on covenants. Even if I disagree with a lot of the positions asserted within, this is always valuable to have that kind of conversation with the most dispassionate and disinterested minds.\n\n*First and foremost*, I strong believe we should abstain ourselves to use expressions like \"*we as a community felt*\", who is we ? who is that community ? and if you go to read any treatise on psychology, biological emotions and as such expressing \"feelings\" is one of the most subjective experience that one can have as a human being. The domain of subjective psychology is not necessarily the most compelling lexical fields when you have to argue on objective criterias for an audience who is geographically spread around the world.\n\n*Secondly*, I strongly also believe we should abstain ourselves to use expressions like \"*Bitcoin soft-forks are clearly a unique technical and political challenge*,”.\n\nAs said in reply to James on the mailing list which is still pending moderation, **science and engineering != politics**. The old bitcoin motto is \"*Vires in numeris*”, which for the ones less used with Latin means \"*Trust the Numbers*\", i.e all the cryptographic assumptions backing Bitcoin as a protocol and a network (Discreet Log problem, preimage-collision resistance for SHA256, Hashcash as a cryptographic protocol, etc).\n\nThat changing the Bitcoin consensus involves discussions, arguments and palavers with other human beings, yes this is a reality and otherwise there would be no one else with whom you could exchange few scarce sats of your stack. However, this is a social activity, e.g like a group of people who would play the different instruments of a musical orchestra, but it's not a political activity, as it’s understood in humanities (e.g in postmodern theories, science has always been a unique object of its own).\n\nIf my memory is correct, myself I've only used the \"political\" adjectives 2 in my more than half-a-decade Bitcoin career, and the 2 times it was to denounce the kind of horse-trading show we often see on bitcoin core, where contributor A goes to review PR #1 in exchange of another contributor B going to review PR #2 (— they mutually benefit of merged PRs for their funding renewal, afterall...), under all very questionable technical criteria. Horse-trading show more or less documented in IETF RFC 7282, pointing this is not technically sound \"rough consensus”.\n\nOf course, that historically in Bitcoin some people involved at the crux of the development process of `bitcoind`, the original client, have tacken at times, or been deliberately ambiguous with trying to establish any sound guidelines, while at the same time having massive commercial interests on a specific technical outcome has been seriously detrimental for the *credibility* of the process of consensus changes.\n\nLet's remember the example of Blockstream, where folks have gone to raise venture capitals for $21M, publishing a sidechain with a proposed Bitcoin Script (e.g `OP_SIDECHAINPROOFVERIFY`) while the names on the paper had work experience with Mozilla and few other non-profits. At Mozilla, the Foundation is dissociated from Mozilla Corporation, and this was already true at the time in 2014.\n\nI don't remember that Satoshi ever announced the venture capitalist funding of the Bitcoin whitepaper on TechCrunch.\n\nInstead the Blockstream people (Sipa, Gmax, Adam Back, Austin Hill), especially the engineers could have instead focus their time nurturing initiatives like Bitcoin Optech and its online-ressources and in-person workshops, or ensuring the old bitcoin mailing list hosted by the Linux foundation was moderated on neutral grounds, or building up on the work of Amir Taaki in maintaining the BIPs. All community activities building bridges in matters of consensus changes…\n\nBut no what we had instead is a [kick-out](https://laanwj.github.io/2016/05/06/hostility-scams-and-moving-forward.html) of Gavin Andresen of its maintenance rights in 2016 (cf. laanwj’s blog post). Gavin Andresen and Mike Hearn, whatever all others judgements we can have on them, were technical builders and building communities. Somehow it turns out that Mike Hearn's bitcoinj micropayment channels, which was Satoshi's idea and of which the Lightning Network is only a sophisticated iteration, is what is certainly the most decentralized used second-layers, compared to \"federated\" side-chains.\n\nAll that said I wasn't active in Bitcoin protocol development during the early days of the Block Size War. I wasn't in Blockstream folks shoes and I might judge them harshly retrospectively without all the facts in mind. However, as said the adage \"*Error humanum est, perseverare diabolicum*”.\n\nSo I understood Jeremy's \"hot take\" at the time of CTV 1st activation attempt in 2022 when he was jooking on one of his blog post (I can't remind which one exactly…) that current Bitcoin consensus change is like getting the blessing of a \"*Grey Beards Committee*\". One thing about unaccountable committee, you'll always find people to join them and _do nothing_, just here to take the periodic financial reward associated with the committed seat…\n\n*Thirdly*, saying proposal OP_MNO or proposal OP_IJK has \"funding\", be it for-profit, non-profit, commercial venture, whatever is very short-sighted. Bitcoin as a protocol is first a complex scientific endeavor and let reminds [Theranos](https://en.wikipedia.org/wiki/Theranos) in matters of results on a highly-funded, scientifically deficient venture (cf. Theranos wikipedia page). W.r.t to non-profit sources of funding which can be driven with a more scientific perspective, if we exclude Jeremy the only independent names I'm aware off I've never contributed to bitcoin script code, themselves, even less on covenants, as far as I can remember.\n\n*Fourthly*, on the statement that \"*while the opcodes in question are well-studied so the risk of unforeseen side-effects is small*\", this is factually wrong.\n\nAs Gleb Naumenko researched in the past and I pointed out this research on the mailing list, extending the bitcoin script can break the current UTXO model and enable to have tx-withhold risks of time-sensitive transactions.\n\nHere the blog post, drawing from Ethereum academic literature actually:\nhttps://blog.bitmex.com/txwithhold-smart-contracts/\n\nTo put it plainly, an attacker could (1) set a tx-withhold UTXO with a time-sensitive txid and (2) have this UTXO paying out miners for each block or sequence of blocks the txid is not confirmed in the UTXO set and (3) double-spend the funding UTXO of a LN channel as \"honest\" lightning transactions have been withheld.\n\n*Fifthly*, *CheckTemplateVerify* and its iterations has been around since more than ~6 years, it has been broken few times at least there was a change to integrate input in the template to avoid ***\"half-spend”*** issues, as Gmax pointed out. Very strict template is easier to reason on if it does enable some kind of change in the UTXO model.\n\n*Sixthly*, for the Taproot there was an extended evaluation phase, with more than ~ 2 years and half between the proposition of BIP116 (`OP_MERKLEBRANCHVERIFY`) and BIP117 (Tail Call Execution Semantics), the original Taproot proposition in 2018 and the open-to-all on IRC review process over a span of weeks. This does not make Taproot perfect, as few people noticed after the code was merged for payment pools, there was no commitment to the script-path internal pubkey oddness *in the control block c*. Everyone is free to come to point out defects that could arise from Taproot consensus code, existing consensus code even made for Satoshi has its own issue, as the dummy element for `OP_CHECKMULTISIG` taught it.\n\n*Seventhly*, on the \"*Is it working perfectly and should it only be changed if its security is endangered?*\". See the point above about ***tx-withholding risk*** and the ***\"half-spend” issue*** that was found in the past about CTV. If bringing covenants in bitcoin is a real security risk, we should do no soft-fork, or delay until they have been more studied. Personally, if bitcoin dies next week, I'm lucky to have access to a wide range of other options to preserve my financial autonomy, even better than the average fiat billionaire.\n\nThis is not the case of a lot of people in war zones, in developing countries or who cannot access the mainstream 24 / 7 banking system because they are discriminated due to a social factor (e.g they have an exotic name), etc. *Bitcoin is an alternative for the ones who need it.*\n\n*edited: to correct my own english and add missing link.*",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 5,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "-1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false
}