{
  "id": 4421,
  "name": "Antoine Riard",
  "username": "ariard",
  "avatar_template": "/letter_avatar_proxy/v4/letter/a/c67d28/{size}.png",
  "created_at": "2025-03-06T22:18:23.847Z",
  "cooked": "<p>I think the purpose of this thread asks for clarification, if the advocates of OP_CTV are only eager to discuss the technical merits of OP_CTV, or if it’s for a combination with multiple primitives (as actually said so in <span class=\"hashtag-raw\">#31989</span>’s OP).</p>\n<p>As a historical reminder, there has been few previous iterations with OP_CHECKOUTPUTHASHVERIFY, OP_SECURETHEBAG, until we got OP_CHECKTEMPLATEVERIFY, where a reduced expressivity was actually one of the argument made by its original author, Jeremy Rubin, to progressively bring covenants in the Bitcoin space. If my memory is correct, there has been even change few times of the templates to make it committed to all inputs or to have a fixed template size, to avoid wider disruptive side-effects.</p>\n<p>By bringing back on the table the combination with other primitives for a common activation, I believe one can say it’s a regression on the idea to progressively bring covenants back in bitcoin. Now, one can argue there is no cost in this regression, problem it’s not the case.</p>\n<p>As explained on the mailing list, there is the old idea of <a href=\"https://blog.bitmex.com/txwithhold-smart-contracts/\">TxWithhold</a> by Gleb Naumenko, i.e costless bribes to mess up with time-sensitive protocols (i.e I believe all bitcoin L2s I’ve seen so far as even federated side-chains have timelocks for emergency paths) or even in the hypothetical worst-case miners’s <code>COINBASE_MATURITY.</code></p>\n<p>The reasoning in <em><strong>TxWithhold</strong></em> have come from surveying the academic literature at the time on the ill scientifically-defined idea of MEVs in the Ethereum space, before it was actually cool to do so, and in some ways transposing the analysis for the specificities of the Bitcoin space, to see what was similar and what was not.</p>\n<p>As far as I can tell, though “prove me wrong” very welcome, OP_CHECKTEMPLATEVERIFY\nalone do not facilitate or extend <em><strong>TxWithhold</strong></em> attacks against time-sensitive protocols, or even major components of the Bitcoin network as block mining and its corresponding rewards. I think this is not true, as soon as you combine it with other primitives, such as OP_CSFS.</p>\n<p>Of course, one can point out that one can do evil <em><strong>TxWithhold</strong></em> construction today with <em>Bitvm</em> or <em>ColliderScript</em> style of techniques. Though as far as I understand the former assume significant witness size in terms of feerate cost and the latter assume non-existent hardware designs and significant energy ressources. So I reasonably believe they shouldn’t be that much a concern for the covenant toolchain built on top of either bitvm or colliderscript to be used for <em><strong>TxWithhold</strong></em> attacks.</p>\n<p>If <em><strong>TxWithhold</strong></em>-style of attacks are plausible, in the meantime it’s questionnable to go for bitcoin script primitives extension, at the very least without thinking more if mitigations for lightning or bitcoin mining shouldn’t be devised or deployed, <em>first</em>. What if tomorrow if one can design a OP_CSFS-powered <em><strong>TxWithhold</strong></em> on-chain contract to make bitcoin script native trust-minimized bribe payouts to the majority of miners to prevent the commitment tx of its chan counterparties to confirm…</p>\n<p>If this thread is only to talk about the merits of OP_CTV, IMHO this is a far lesser set of technical issues and long-term risks to be concerned of.</p>\n<p>Personally, I’m an investor in bitcoin the hard currency, though only a reasonable one and with limited exposure as it’s a novel class of asset with historically limited track record (-- this is not financial advice). Unforeseen MEVs due to ill-designed script primitives could start to irrevocably mess up bitcoin the network of miners and their corresponding incentives until leading to a slow decline. As we can observe in other cryptocurrencies playing the casino slot machine with their consensus changes. If that happens, that’s fine I’ll go back to my pre-bitcoin career, i.e having fun with kernel security.</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2025-03-06T22:19:10.503Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 1,
  "reads": 13,
  "readers_count": 12,
  "score": 7.4,
  "yours": false,
  "topic_id": 1494,
  "topic_slug": "bip-119-op-checktemplateverify-no-activation",
  "topic_title": "BIP-119 (OP_CHECKTEMPLATEVERIFY) (no activation)",
  "topic_html_title": "BIP-119 (OP_CHECKTEMPLATEVERIFY) (no activation)",
  "category_id": 8,
  "display_username": "Antoine Riard",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I think the purpose of this thread asks for clarification, if the advocates of OP_CTV are only eager to discuss the technical merits of OP_CTV, or if it's for a combination with multiple primitives (as actually said so in #31989's OP).\n\nAs a historical reminder, there has been few previous iterations with OP_CHECKOUTPUTHASHVERIFY, OP_SECURETHEBAG, until we got OP_CHECKTEMPLATEVERIFY, where a reduced expressivity was actually one of the argument made by its original author, Jeremy Rubin, to progressively bring covenants in the Bitcoin space. If my memory is correct, there has been even change few times of the templates to make it committed to all inputs or to have a fixed template size, to avoid wider disruptive side-effects.\n\nBy bringing back on the table the combination with other primitives for a common activation, I believe one can say it's a regression on the idea to progressively bring covenants back in bitcoin. Now, one can argue there is no cost in this regression, problem it's not the case.\n\nAs explained on the mailing list, there is the old idea of [TxWithhold](https://blog.bitmex.com/txwithhold-smart-contracts/) by Gleb Naumenko, i.e costless bribes to mess up with time-sensitive protocols (i.e I believe all bitcoin L2s I've seen so far as even federated side-chains have timelocks for emergency paths) or even in the hypothetical worst-case miners’s `COINBASE_MATURITY.`\n\nThe reasoning in ***TxWithhold*** have come from surveying the academic literature at the time on the ill scientifically-defined idea of MEVs in the Ethereum space, before it was actually cool to do so, and in some ways transposing the analysis for the specificities of the Bitcoin space, to see what was similar and what was not.\n\nAs far as I can tell, though \"prove me wrong\" very welcome, OP_CHECKTEMPLATEVERIFY\nalone do not facilitate or extend ***TxWithhold*** attacks against time-sensitive protocols, or even major components of the Bitcoin network as block mining and its corresponding rewards. I think this is not true, as soon as you combine it with other primitives, such as OP_CSFS.\n\nOf course, one can point out that one can do evil ***TxWithhold*** construction today with *Bitvm* or *ColliderScript* style of techniques. Though as far as I understand the former assume significant witness size in terms of feerate cost and the latter assume non-existent hardware designs and significant energy ressources. So I reasonably believe they shouldn't be that much a concern for the covenant toolchain built on top of either bitvm or colliderscript to be used for ***TxWithhold*** attacks.\n\nIf ***TxWithhold***-style of attacks are plausible, in the meantime it's questionnable to go for bitcoin script primitives extension, at the very least without thinking more if mitigations for lightning or bitcoin mining shouldn't be devised or deployed, *first*. What if tomorrow if one can design a OP_CSFS-powered ***TxWithhold*** on-chain contract to make bitcoin script native trust-minimized bribe payouts to the majority of miners to prevent the commitment tx of its chan counterparties to confirm…\n\nIf this thread is only to talk about the merits of OP_CTV, IMHO this is a far lesser set of technical issues and long-term risks to be concerned of.\n\nPersonally, I'm an investor in bitcoin the hard currency, though only a reasonable one and with limited exposure as it's a novel class of asset with historically limited track record (-- this is not financial advice). Unforeseen MEVs due to ill-designed script primitives could start to irrevocably mess up bitcoin the network of miners and their corresponding incentives until leading to a slow decline. As we can observe in other cryptocurrencies playing the casino slot machine with their consensus changes. If that happens, that’s fine I'll go back to my pre-bitcoin career, i.e having fun with kernel security.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 5,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}