{
  "id": 4400,
  "name": "Antoine Poinsot",
  "username": "AntoineP",
  "avatar_template": "/user_avatar/delvingbitcoin.org/antoinep/{size}/483_2.png",
  "created_at": "2025-03-01T20:20:24.486Z",
  "cooked": "<p><a class=\"mention\" href=\"/u/harding\">@harding</a> thanks for your response. In your message you push back against my characterization of Bitcoin Core users being all Bitcoin users, and argue end users running full nodes are key to the security of the network and therefore making this more accessible should be a priority of the Core project.</p>\n<p>With regard to the former, it seems pretty clear all users of Bitcoin are indirectly affected by the quality of the Bitcoin software. I don’t think users interacting directly with the software should be prioritized over those interacting with the network in a different manner. You could even stretch this to say all Bitcoin users are Core users, only some use the private RPC interface and others the public P2P interface. Instead of basing priorities on how users interface with the software i think we should consider stakes. The Core GUI is potentially important to a handful of non-technical users to be able to use Bitcoin at all. The Core wallet is potentially <em>very</em> important to a non-trivial share of Bitcoin users, whether to make payments (6% of all transactions nowadays may be crafted by the Core wallet<sup class=\"footnote-ref\"><a href=\"#footnote-4400-1\" id=\"footnote-ref-4400-1\">[1]</a></sup>) or to store value (as the oldest wallet and probably the one with the strongest compatibility guarantees). The Core node is critically important to every single Bitcoin user. Given the size of the network today, it’s pretty clear the stakes for the Core node are so high as to dwarf those of the two other components. This is <em>not</em> to say the wallet and GUI are not important. But it should be clear that they are order of magnitudes less so than the network itself.</p>\n<p>I wholeheartedly agree with your other point. Making running a full node accessible to end users is a key component to the security of the network. However:</p>\n<ol>\n<li>The Core GUI is not that. It has barely seen any development <a href=\"https://github.com/bitcoin-core/gui/pulls?q=is%3Apr+is%3Amerged+\">in years</a>. It is extremely inconvenient to use and people largely prefer to it other GUI interfacing with <code>bitcoind</code> directly, such as Sparrow. In fact it’s not even been usable out of the box on newer Mac for a while now<sup class=\"footnote-ref\"><a href=\"#footnote-4400-2\" id=\"footnote-ref-4400-2\">[2]</a></sup>. As to the other non-technical end user platform, we <a href=\"https://github.com/bitcoin/bitcoin/pull/31284\">disabled automated unit testing on Windows</a> after years of flaky CI and hours of maintainers’ time sunk to keep it running, as nobody stepped up to help unbreak it. I wish Core’s GUI was the one stop for non-technical end users to just “download and run Bitcoin”, but it is not.</li>\n<li>It should not come at the expense of development of the Core node, as per the previous point on the respective stakes of each project. Keeping the code for the wallet and GUI imposes significant costs on the node project, which really cannot afford it right now. Sure, if Core had unlimited resources we could tackle all important issues in Bitcoin<sup class=\"footnote-ref\"><a href=\"#footnote-4400-3\" id=\"footnote-ref-4400-3\">[3]</a></sup>. But we do not therefore we have to focus on the most important one first.</li>\n</ol>\n<p>Splitting the GUI and wallet in their own projects gives you point 2. As i argued in my blog post they also provide an opportunity to make better progress on these projects and possibly resolve point 1.</p>\n<p>Now some comments on the specifics.</p>\n<aside class=\"quote no-group\" data-username=\"harding\" data-post=\"10\" data-topic=\"1470\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/harding/48/925_2.png\" class=\"avatar\"> harding:</div>\n<blockquote>\n<p>I think it’s weird and non-obvious to define your users as including people who don’t directly use your software.</p>\n</blockquote>\n</aside>\n<p>I do not think it’s weird to define your users by who is impacted by your software.</p>\n<aside class=\"quote no-group\" data-username=\"harding\" data-post=\"10\" data-topic=\"1470\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/harding/48/925_2.png\" class=\"avatar\"> harding:</div>\n<blockquote>\n<p>My ISP presumably uses a bunch of software to manage the network that connects my home to the Internet. Providing connectivity to me, and thousands of customers like me, is the ultimate purpose of that software—but its user is the ISP.</p>\n</blockquote>\n</aside>\n<p>I do not think it’s a good analogy. Your ISP is a company providing you a service. Bitcoin is a public consensus system. If your ISP runs buggy software it may prevent you and other customers from accessing the Internet, but not other Internet users. If Bitcoin Core releases buggy software, it will likely impact Phoenix users.</p>\n<aside class=\"quote no-group\" data-username=\"harding\" data-post=\"10\" data-topic=\"1470\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/harding/48/925_2.png\" class=\"avatar\"> harding:</div>\n<blockquote>\n<p>That distinction is important because when that software forces a choice between tradeoffs onto my ISP, they <em>as the user</em> will make the choice that’s best for them and not necessarily for me.</p>\n</blockquote>\n</aside>\n<p>Besides disagreeing with the analogy i also disagree with this statement in isolation. Surely your ISP’s software provider would prioritize “not breaking Internet access to my client’s clients” over “shiny new way of my direct user to interface with my software”.</p>\n<aside class=\"quote no-group\" data-username=\"harding\" data-post=\"10\" data-topic=\"1470\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/harding/48/925_2.png\" class=\"avatar\"> harding:</div>\n<blockquote>\n<p>Similarly, if an industrial full node operator who serves data to customers is forced to choose, they will make the choice that’s best for them and not necessarily for their customers.</p>\n</blockquote>\n</aside>\n<p>This is an additional concern about this<sup class=\"footnote-ref\"><a href=\"#footnote-4400-4\" id=\"footnote-ref-4400-4\">[4]</a></sup>. I think people falling pray to <a href=\"https://x.com/jamesob/status/1857049961235403101\">demagogy that feeds on some of these truths</a> to reach dangerous conclusions, could lead to a significant part of the network running significantly less qualitative software, or worse.</p>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"footnote-4400-1\" class=\"footnote-item\"><p>Based on transaction fingerprinting. I have heard this number from reputable sources but have not checked it for myself. <a href=\"#footnote-ref-4400-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-4400-2\" class=\"footnote-item\"><p>Since the binaries of all previous releases are not notarized, to run the software users would have to self-sign the binary themselves from the command line (see the 6 years old issue <a href=\"https://github.com/bitcoin/bitcoin/issues/15774\">here</a>). Hardly something we can expect non-technical users to do. This might get fixed before the upcoming 30.0 release, see <a href=\"https://github.com/bitcoin/bitcoin/pull/31407\">this PR</a>. <a href=\"#footnote-ref-4400-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-4400-3\" class=\"footnote-item\"><p>Cf the first two paragraphs of the <a href=\"https://antoinep.com/posts/stating_the_obvious\">second post</a> in my series. <a href=\"#footnote-ref-4400-3\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-4400-4\" class=\"footnote-item\"><p>Cf the next to last paragraph of the <a href=\"https://antoinep.com/posts/stating_the_obvious\">same post</a>. <a href=\"#footnote-ref-4400-4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>",
  "post_number": 14,
  "post_type": 1,
  "updated_at": "2025-03-01T20:51:16.570Z",
  "reply_count": 0,
  "reply_to_post_number": 10,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 8,
  "readers_count": 7,
  "score": 1.4,
  "yours": false,
  "topic_id": 1470,
  "topic_slug": "antoine-poinsot-on-bitcoin-cores-priorities",
  "topic_title": "Antoine Poinsot on Bitcoin Core's Priorities",
  "topic_html_title": "Antoine Poinsot on Bitcoin Core&rsquo;s Priorities",
  "category_id": 8,
  "display_username": "Antoine Poinsot",
  "primary_group_name": null,
  "flair_name": "wg-consensus-cleanup",
  "flair_url": "/uploads/default/original/1X/856d779f9ec58484f3a96285a21a813538b689f6.png",
  "flair_bg_color": "",
  "flair_color": "",
  "flair_group_id": 43,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": "Regular",
  "title_is_group": false,
  "bookmarked": false,
  "raw": "@harding thanks for your response. In your message you push back against my characterization of Bitcoin Core users being all Bitcoin users, and argue end users running full nodes are key to the security of the network and therefore making this more accessible should be a priority of the Core project.\n\nWith regard to the former, it seems pretty clear all users of Bitcoin are indirectly affected by the quality of the Bitcoin software. I don't think users interacting directly with the software should be prioritized over those interacting with the network in a different manner. You could even stretch this to say all Bitcoin users are Core users, only some use the private RPC interface and others the public P2P interface. Instead of basing priorities on how users interface with the software i think we should consider stakes. The Core GUI is potentially important to a handful of non-technical users to be able to use Bitcoin at all. The Core wallet is potentially *very* important to a non-trivial share of Bitcoin users, whether to make payments (6% of all transactions nowadays may be crafted by the Core wallet[^0]) or to store value (as the oldest wallet and probably the one with the strongest compatibility guarantees). The Core node is critically important to every single Bitcoin user. Given the size of the network today, it's pretty clear the stakes for the Core node are so high as to dwarf those of the two other components. This is *not* to say the wallet and GUI are not important. But it should be clear that they are order of magnitudes less so than the network itself.\n\nI wholeheartedly agree with your other point. Making running a full node accessible to end users is a key component to the security of the network. However:\n1. The Core GUI is not that. It has barely seen any development [in years](https://github.com/bitcoin-core/gui/pulls?q=is%3Apr+is%3Amerged+). It is extremely inconvenient to use and people largely prefer to it other GUI interfacing with `bitcoind` directly, such as Sparrow. In fact it's not even been usable out of the box on newer Mac for a while now[^1]. As to the other non-technical end user platform, we [disabled automated unit testing on Windows](https://github.com/bitcoin/bitcoin/pull/31284) after years of flaky CI and hours of maintainers' time sunk to keep it running, as nobody stepped up to help unbreak it. I wish Core's GUI was the one stop for non-technical end users to just \"download and run Bitcoin\", but it is not.\n2. It should not come at the expense of development of the Core node, as per the previous point on the respective stakes of each project. Keeping the code for the wallet and GUI imposes significant costs on the node project, which really cannot afford it right now. Sure, if Core had unlimited resources we could tackle all important issues in Bitcoin[^2]. But we do not therefore we have to focus on the most important one first.\n\nSplitting the GUI and wallet in their own projects gives you point 2. As i argued in my blog post they also provide an opportunity to make better progress on these projects and possibly resolve point 1.\n\nNow some comments on the specifics.\n\n[quote=\"harding, post:10, topic:1470\"]\nI think it’s weird and non-obvious to define your users as including people who don’t directly use your software.\n[/quote]\n\nI do not think it's weird to define your users by who is impacted by your software.\n\n[quote=\"harding, post:10, topic:1470\"]\nMy ISP presumably uses a bunch of software to manage the network that connects my home to the Internet. Providing connectivity to me, and thousands of customers like me, is the ultimate purpose of that software—but its user is the ISP.\n[/quote]\n\nI do not think it's a good analogy. Your ISP is a company providing you a service. Bitcoin is a public consensus system. If your ISP runs buggy software it may prevent you and other customers from accessing the Internet, but not other Internet users. If Bitcoin Core releases buggy software, it will likely impact Phoenix users.\n\n[quote=\"harding, post:10, topic:1470\"]\nThat distinction is important because when that software forces a choice between tradeoffs onto my ISP, they *as the user* will make the choice that’s best for them and not necessarily for me.\n[/quote]\n\nBesides disagreeing with the analogy i also disagree with this statement in isolation. Surely your ISP's software provider would prioritize \"not breaking Internet access to my client's clients\" over \"shiny new way of my direct user to interface with my software\".\n\n[quote=\"harding, post:10, topic:1470\"]\nSimilarly, if an industrial full node operator who serves data to customers is forced to choose, they will make the choice that’s best for them and not necessarily for their customers.\n[/quote]\n\nThis is an additional concern about this[^3]. I think people falling pray to [demagogy that feeds on some of these truths](https://x.com/jamesob/status/1857049961235403101) to reach dangerous conclusions, could lead to a significant part of the network running significantly less qualitative software, or worse.\n\n[^0]: Based on transaction fingerprinting. I have heard this number from reputable sources but have not checked it for myself.\n[^1]: Since the binaries of all previous releases are not notarized, to run the software users would have to self-sign the binary themselves from the command line (see the 6 years old issue [here](https://github.com/bitcoin/bitcoin/issues/15774)). Hardly something we can expect non-technical users to do. This might get fixed before the upcoming 30.0 release, see [this PR](https://github.com/bitcoin/bitcoin/pull/31407).\n[^2]: Cf the first two paragraphs of the [second post](https://antoinep.com/posts/stating_the_obvious) in my series.\n[^3]: Cf the next to last paragraph of the [same post](https://antoinep.com/posts/stating_the_obvious).",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 12,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}