{
  "id": 3280,
  "name": "",
  "username": "andyschroder",
  "avatar_template": "/letter_avatar_proxy/v4/letter/a/c57346/{size}.png",
  "created_at": "2024-09-29T04:13:00.299Z",
  "cooked": "<h2><a name=\"p-3280-summary-1\" class=\"anchor\" href=\"#p-3280-summary-1\"></a>Summary</h2>\n<p>Now that BOLT12 has been merged (<a href=\"https://github.com/lightning/bolts/pull/798\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Offers by rustyrussell · Pull Request #798 · lightning/bolts · GitHub</a>) and we are starting to get some implementations out in the wild, I’m wondering where the discussion is on further improvements of it? Should certain extensions be added to BLIPs and certain changes be made to the BOLT? Is there an active discussion forum for BOLT12 somewhere else besides this site?</p>\n<h2><a name=\"p-3280-other-known-proposed-changes-2\" class=\"anchor\" href=\"#p-3280-other-known-proposed-changes-2\"></a>Other Known Proposed Changes</h2>\n<p>One thing I’ve noticed in BOLT12 is that an <code>invoice_request</code> writer must copy all fields from the <code>offer</code> (including unknown fields) and an <code>invoice</code> writer must copy all non-signature fields from the <code>invoice_request</code> (including unknown fields). This seems like we have some flexibility to in a potentially backwards compatible way add more fields as desired?</p>\n<p>So far, I’ve found a mention of a new <code>user</code> field in the <code>invoice_request</code> that has been suggested (<a href=\"https://github.com/lightning/blips/blob/b6c3e8c17028926f7c5ae254f419456fe3c4bf13/blip-0032.md?plain=1#L86\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">blips/blip-0032.md at b6c3e8c17028926f7c5ae254f419456fe3c4bf13 · lightning/blips · GitHub</a>).</p>\n<p>Is there anything else besides <code>user</code> that has already been proposed to add to BOLT12? I have some other things I’d like to bring up:</p>\n<h2><a name=\"p-3280-automatic-refunds-3\" class=\"anchor\" href=\"#p-3280-automatic-refunds-3\"></a>Automatic Refunds</h2>\n<p>I’d like to propose for <code>offer</code> writers is an optional boolean field of <code>refund_invoice_required</code> and if exists and set to true, <code>invoice_request</code> writers are required to include a <code>refund_invoice</code> field with an encoded (<a href=\"https://github.com/lightning/bolts/blob/247e83d528a2a380e533e89f31918d7b0ce6a0c1/12-offer-encoding.md?plain=1#L73\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">bolts/12-offer-encoding.md at 247e83d528a2a380e533e89f31918d7b0ce6a0c1 · lightning/bolts · GitHub</a>) refund invoice included in it (there seems to be no human-readable prefix defined for invoices in BOLT12, so I’m proposing the prefix <code>lni</code>). If the <code>invoice_request</code> writer does not include the <code>refund_invoice</code> field, the <code>offer</code> issuer does not necessarily have to issue an <code>invoice</code>.</p>\n<p>The logic behind these proposed fields is that a merchant may want to implement (and potentially require) an automatic refund workflow without needing to go through the “merchant-pays-user flow” QR/NFC/link cycle with the other party. Potentially, the point of sale device only has a static offer printed on a sticker and no screen at all to provide an <code>invoice_request</code> for a refund.</p>\n<p>Alternatively, rather than providing an encoded refund <code>invoice</code> in the original <code>invoice_request</code>, an encoded refund <code>invoice_request</code> could be included in the <code>invoice</code> instead and the refund <code>invoice</code> could be sent when buyer wants their refund issued.</p>\n<h2><a name=\"p-3280-maximum-invoice_request-amount-4\" class=\"anchor\" href=\"#p-3280-maximum-invoice_request-amount-4\"></a>Maximum <code>invoice_request</code> amount</h2>\n<p>We also have <code>offer_amount</code> as the minimum amount required for successful payment (<a href=\"https://github.com/lightning/bolts/blob/247e83d528a2a380e533e89f31918d7b0ce6a0c1/12-offer-encoding.md?plain=1#L241\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">bolts/12-offer-encoding.md at 247e83d528a2a380e533e89f31918d7b0ce6a0c1 · lightning/bolts · GitHub</a>). There are use cases where we might want to enforce a maximum amount. For that, I’d like to propose <code>offer_max_amount</code> in the <code>offer</code>. A few examples for why I think this could be useful:</p>\n<ol>\n<li>You have a variable amount of product to sell, but you don’t want to commit to selling more than you actually have.</li>\n<li>You know you don’t have enough inbound liquidity to sell beyond a certain quantity of product.</li>\n<li>You are using HOLD invoices and don’t want them to be too large. If the buyer wants more product, they will need to make multiple payments instead.</li>\n<li>You are not sure if you like your customer yet and you don’t want to “imply” that you are committing to some large business deal with them by accepting much more from them without having further interactions to determine they are a good customer.</li>\n<li>You want to accept only an exact amount in order for the customer to communicate a clear and finite scope to the business deal.</li>\n</ol>\n<p>This maximum amount could be enforced by the offerer, they could just not provide an invoice if the invoice_request is for an amount that is too high for them, but it would be good to be able to communicate this in advance. This still might not be totally enforcable since HTLC acceptance just requires a minimum be met (I don’t think the HTLC enforce a maximum amount), but it could at least avoid many situations where the merchant may want to discourage accepting more than a certain amount.</p>\n<h2><a name=\"p-3280-invoice_request-expiration-5\" class=\"anchor\" href=\"#p-3280-invoice_request-expiration-5\"></a><code>invoice_request</code> expiration</h2>\n<p>I’m wondering about with BOLT12, why is there no expiry in an <code>invoice_request</code> like we have on <code>offer</code> and <code>invoice</code>? With the merchant-pays-user flow, the <code>invoice_request</code> seems like it should be able to expire after a certain point. Just like an invoice can be canceled, surely, this can be enforced on the node end (just don’t pay an invoice if received), but it seems like there should be a way to communicate this in advance to the other party that may send the invoice. Also, if an offerer is too slow to respond with an <code>invoice</code> in response to an <code>invoice_request</code>, might we want to let them know don’t even bother sending me a <code>invoice</code> anymore.</p>\n<h2><a name=\"p-3280-conclusion-6\" class=\"anchor\" href=\"#p-3280-conclusion-6\"></a>Conclusion</h2>\n<p>I look forward to your feedback.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-09-29T04:18:33.934Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 58,
  "reads": 5,
  "readers_count": 4,
  "score": 291.0,
  "yours": false,
  "topic_id": 1167,
  "topic_slug": "expanding-on-bolt12",
  "topic_title": "Expanding on BOLT12",
  "topic_html_title": "Expanding on BOLT12",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "## Summary\n\nNow that BOLT12 has been merged (https://github.com/lightning/bolts/pull/798) and we are starting to get some implementations out in the wild, I'm wondering where the discussion is on further improvements of it? Should certain extensions be added to BLIPs and certain changes be made to the BOLT? Is there an active discussion forum for BOLT12 somewhere else besides this site?\n\n## Other Known Proposed Changes\n\nOne thing I've noticed in BOLT12 is that an `invoice_request` writer must copy all fields from the `offer` (including unknown fields) and an `invoice` writer must copy all non-signature fields from the `invoice_request` (including unknown fields). This seems like we have some flexibility to in a potentially backwards compatible way add more fields as desired?\n\nSo far, I've found a mention of a new `user` field in the `invoice_request` that has been suggested (https://github.com/lightning/blips/blob/b6c3e8c17028926f7c5ae254f419456fe3c4bf13/blip-0032.md?plain=1#L86).\n\nIs there anything else besides `user` that has already been proposed to add to BOLT12? I have some other things I'd like to bring up:\n\n\n## Automatic Refunds\n\nI'd like to propose for `offer` writers is an optional boolean field of `refund_invoice_required` and if exists and set to true, `invoice_request` writers are required to include a `refund_invoice` field with an encoded (https://github.com/lightning/bolts/blob/247e83d528a2a380e533e89f31918d7b0ce6a0c1/12-offer-encoding.md?plain=1#L73) refund invoice included in it (there seems to be no human-readable prefix defined for invoices in BOLT12, so I'm proposing the prefix `lni`). If the `invoice_request` writer does not include the `refund_invoice` field, the `offer` issuer does not necessarily have to issue an `invoice`.\n\nThe logic behind these proposed fields is that a merchant may want to implement (and potentially require) an automatic refund workflow without needing to go through the \"merchant-pays-user flow\" QR/NFC/link cycle with the other party. Potentially, the point of sale device only has a static offer printed on a sticker and no screen at all to provide an `invoice_request` for a refund.\n\nAlternatively, rather than providing an encoded refund `invoice` in the original `invoice_request`, an encoded refund `invoice_request` could be included in the `invoice` instead and the refund `invoice` could be sent when buyer wants their refund issued.\n\n\n\n## Maximum `invoice_request` amount\n\nWe also have `offer_amount` as the minimum amount required for successful payment (https://github.com/lightning/bolts/blob/247e83d528a2a380e533e89f31918d7b0ce6a0c1/12-offer-encoding.md?plain=1#L241). There are use cases where we might want to enforce a maximum amount. For that, I'd like to propose `offer_max_amount` in the `offer`. A few examples for why I think this could be useful:\n\n1. You have a variable amount of product to sell, but you don't want to commit to selling more than you actually have.\n2. You know you don't have enough inbound liquidity to sell beyond a certain quantity of product.\n3. You are using HOLD invoices and don't want them to be too large. If the buyer wants more product, they will need to make multiple payments instead.\n4. You are not sure if you like your customer yet and you don't want to \"imply\" that you are committing to some large business deal with them by accepting much more from them without having further interactions to determine they are a good customer.\n5. You want to accept only an exact amount in order for the customer to communicate a clear and finite scope to the business deal.\n\nThis maximum amount could be enforced by the offerer, they could just not provide an invoice if the invoice_request is for an amount that is too high for them, but it would be good to be able to communicate this in advance. This still might not be totally enforcable since HTLC acceptance just requires a minimum be met (I don't think the HTLC enforce a maximum amount), but it could at least avoid many situations where the merchant may want to discourage accepting more than a certain amount.\n\n\n\n\n## `invoice_request` expiration\n\nI'm wondering about with BOLT12, why is there no expiry in an `invoice_request` like we have on `offer` and `invoice`? With the merchant-pays-user flow, the `invoice_request` seems like it should be able to expire after a certain point. Just like an invoice can be canceled, surely, this can be enforced on the node end (just don't pay an invoice if received), but it seems like there should be a way to communicate this in advance to the other party that may send the invoice. Also, if an offerer is too slow to respond with an `invoice` in response to an `invoice_request`, might we want to let them know don't even bother sending me a `invoice` anymore.\n\n## Conclusion\n\nI look forward to your feedback.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 532,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}