{
  "id": 3234,
  "name": "Adam Gibson",
  "username": "AdamISZ",
  "avatar_template": "/user_avatar/delvingbitcoin.org/adamisz/{size}/418_2.png",
  "created_at": "2024-09-19T16:20:40.253Z",
  "cooked": "<p>Sorry for necroposting here but I only just noticed this thread.</p>\n<p>So, yes you basically have it right, of course, Joinmarket never “solved” the centralized <strong>communication</strong> coordinator problem (see slight caveat below). Certainly, not as cleanly as your earlier Coinshuffle work did.</p>\n<p>The only caveat is: the “directory node” concept, offering a service on *.onion, was intended to partially solve it, because its intention was to shift the role from communication coordinator to only a peer discovery service.</p>\n<p>I say “intention” because, mainly because of difficulties in using ephemeral tor onion services, it has proved not to work very well in practice. We did have a period shortly after we added that feature, when we could happily say there were coinjoins of larger size being coordinated, and also since most of the communication occurred p2p (the idea was that makers also ran their own onion services, so that the taker would go to the directory node to advertise, then after choosing makers, it would talk to them directly), it reduced the centralization element very significantly.</p>\n<p>But even if that did, or will, work perfectly, it still does not achieve what a protocol like Coinshuffle achieves in that regard.</p>",
  "post_number": 13,
  "post_type": 1,
  "updated_at": "2024-09-19T16:21:53.074Z",
  "reply_count": 0,
  "reply_to_post_number": 9,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 9,
  "readers_count": 8,
  "score": 1.8,
  "yours": false,
  "topic_id": 934,
  "topic_slug": "who-will-run-the-coinjoin-coordinators",
  "topic_title": "Who will run the CoinJoin coordinators?",
  "topic_html_title": "Who will run the CoinJoin coordinators?",
  "category_id": 5,
  "display_username": "Adam Gibson",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "real-or-random",
    "name": "Tim Ruffing",
    "avatar_template": "/user_avatar/delvingbitcoin.org/real-or-random/{size}/413_2.png"
  },
  "bookmarked": false,
  "raw": "Sorry for necroposting here but I only just noticed this thread.\n\nSo, yes you basically have it right, of course, Joinmarket never \"solved\" the centralized **communication** coordinator problem (see slight caveat below). Certainly, not as cleanly as your earlier Coinshuffle work did.\n\nThe only caveat is: the \"directory node\" concept, offering a service on *.onion, was intended to partially solve it, because its intention was to shift the role from communication coordinator to only a peer discovery service.\n\nI say \"intention\" because, mainly because of difficulties in using ephemeral tor onion services, it has proved not to work very well in practice. We did have a period shortly after we added that feature, when we could happily say there were coinjoins of larger size being coordinated, and also since most of the communication occurred p2p (the idea was that makers also ran their own onion services, so that the taker would go to the directory node to advertise, then after choosing makers, it would talk to them directly), it reduced the centralization element very significantly.\n\nBut even if that did, or will, work perfectly, it still does not achieve what a protocol like Coinshuffle achieves in that regard.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 343,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}