{
  "id": 3149,
  "name": "",
  "username": "virtu",
  "avatar_template": "/user_avatar/delvingbitcoin.org/virtu/{size}/540_2.png",
  "created_at": "2024-09-10T08:25:35.516Z",
  "cooked": "<p>Since darknet-only nodes cannot use DNS seeds<sup class=\"footnote-ref\"><a href=\"#footnote-3149-1\" id=\"footnote-ref-3149-1\">[1]</a></sup> to learn about addresses of Bitcoin nodes to connect to, I wanted to get a feel on how such nodes fare on hardcoded-seed data. To this end, I created some statistics on hardcoded seed nodes<sup class=\"footnote-ref\"><a href=\"#footnote-3149-2\" id=\"footnote-ref-3149-2\">[2]</a></sup> to investigate how fast the number of reachable seeds decreases over time.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/1X/5f65c25bbbdb7f20dc2132326e0de7a900cf8d41.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/5f65c25bbbdb7f20dc2132326e0de7a900cf8d41\" title=\"hardcoded_seeds\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/1X/5f65c25bbbdb7f20dc2132326e0de7a900cf8d41_2_690x343.png\" alt=\"hardcoded_seeds\" data-base62-sha1=\"dBVnqgb1Pp2mnUNtdZx7haPAyWt\" width=\"690\" height=\"343\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/1X/5f65c25bbbdb7f20dc2132326e0de7a900cf8d41_2_690x343.png, https://delvingbitcoin.org/uploads/default/optimized/1X/5f65c25bbbdb7f20dc2132326e0de7a900cf8d41_2_1035x514.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/1X/5f65c25bbbdb7f20dc2132326e0de7a900cf8d41_2_1380x686.png 2x\" data-dominant-color=\"3F2D31\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">hardcoded_seeds</span><span class=\"informations\">4674×2330 421 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p>Each chart shows the number of reachable hardcoded seeds over time for a particular network type (I excluded Cjdns because I’ve only been collecting this data for a couple of weeks) and includes data for the last four Bitcoin Core releases (red lines correspond to release dates).</p>\n<p>Some observations:</p>\n<ul>\n<li>Despite IPv4 appearing to be the most “short-lived” network type, of the seed nodes hardcoded around 21 months ago into v24 still ~50 are reachable.</li>\n<li>I2P nodes seem to be the most “long-lived” ones (the sharp drop shortly after v27 release in April 24 was due to a <a href=\"https://geti2p.net/de/blog/post/2024/04/25/stormy_weather\">DoS attack on the I2P network</a>).</li>\n<li>It looks like there was an oversight during the v26 release to include new seed nodes.</li>\n<li>Before v27, the number of Onion and I2P seed nodes was rather low (nodes for these networks were manually curated up until recently, and the number of nodes included depended on the data source).</li>\n</ul>\n<p>To answer my original question about darknet-only nodes: they should be doing fine. Still I wondered, why they’re excluded from taking advantage of the DNS seed-mechanism, which has several advantages: for one, DNS seeds provide more up-to-date on reachable nodes, increasing the probability of quickly finding a reachable address; for another, they might improve privacy by advertising from a larger pool of nodes, thus reducing the likelihood of a hardcoded seed collecting statistics about bootstrapping nodes; etc.</p>\n<p>In an old GitHub comment I read that darknet addresses are too large for seeding, it would be unnecessary and it’s not practical to access DNS over these networks. I’d like to address the first and last points with a <a href=\"https://github.com/virtu/darkseed\">PoC darknet seeder</a> I wrote which is capable of serving Onion, I2P and Cjdns addresses using a BIP155-like encoding and is reachable via IPv4 and Cjdns (DNS/UDP) as well as Onion and I2P (DNS/TCP).</p>\n<p>The point about necessity is one I don’t feel qualified to answer. If most people are running mixed clearnet-darknet nodes, there’s no necessity. For darknet-only nodes, it might be worth the effort (~100 loc to create custom DNS <code>NULL</code> queries in Bitcoin Core since right now we conveniently use <code>getaddrinfo</code> which does not require any low-level DNS functionality). Happy about feedback before taking this any further!</p>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"footnote-3149-1\" class=\"footnote-item\"><p>For those who don’t know, DNS seeds are used by a new Bitcoin node as the default way to learn about Bitcoin nodes it can connect to. The node sends a DNS query to one or more of the DNS seeds whose addresses are hardcoded into the binary, and receive a DNS reply containing a number of IPv4 and IPv6 addresses of nodes believed to be reachable. The node then connects to one or more of these addresses, sends a <code>getaddr</code> message to the node it connected to and (ideally) receives an <code>addr</code> reply from the node containing around 1000 addresses of other Bitcoin nodes. <a href=\"#footnote-ref-3149-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-3149-2\" class=\"footnote-item\"><p>For those in need of a refresher, hardcoded seeds are used as a fallback when a new node who doesn’t know about any peers fails to solicit peer addresses via DNS seeds; for such instances, the Bitcoin Core binary contains a number of hardcoded addresses which the node can connect to and ask for other nodes’ addresses by sending a <code>getaddr</code> message. <a href=\"#footnote-ref-3149-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-09-10T08:42:24.774Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 40,
  "reads": 13,
  "readers_count": 12,
  "score": 222.6,
  "yours": false,
  "topic_id": 1123,
  "topic_slug": "hardcoded-seeds-dns-seeds-and-darknet-nodes",
  "topic_title": "Hardcoded seeds, DNS seeds and Darknet nodes",
  "topic_html_title": "Hardcoded seeds, DNS seeds and Darknet nodes",
  "category_id": 8,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Since darknet-only nodes cannot use DNS seeds[^1] to learn about addresses of Bitcoin nodes to connect to, I wanted to get a feel on how such nodes fare on hardcoded-seed data. To this end, I created some statistics on hardcoded seed nodes[^2] to investigate how fast the number of reachable seeds decreases over time.\n\n![hardcoded_seeds|690x343, 100%](upload://dBVnqgb1Pp2mnUNtdZx7haPAyWt.png)\n\nEach chart shows the number of reachable hardcoded seeds over time for a particular network type (I excluded Cjdns because I've only been collecting this data for a couple of weeks) and includes data for the last four Bitcoin Core releases (red lines correspond to release dates).\n\nSome observations:\n- Despite IPv4 appearing to be the most \"short-lived\" network type, of the seed nodes hardcoded around 21 months ago into v24 still ~50 are reachable.\n- I2P nodes seem to be the most \"long-lived\" ones (the sharp drop shortly after v27 release in April 24 was due to a [DoS attack on the I2P network](https://geti2p.net/de/blog/post/2024/04/25/stormy_weather)).\n- It looks like there was an oversight during the v26 release to include new seed nodes.\n- Before v27, the number of Onion and I2P seed nodes was rather low (nodes for these networks were manually curated up until recently, and the number of nodes included depended on the data source).\n\nTo answer my original question about darknet-only nodes: they should be doing fine. Still I wondered, why they're excluded from taking advantage of the DNS seed-mechanism, which has several advantages: for one, DNS seeds provide more up-to-date on reachable nodes, increasing the probability of quickly finding a reachable address; for another, they might improve privacy by advertising from a larger pool of nodes, thus reducing the likelihood of a hardcoded seed collecting statistics about bootstrapping nodes; etc.\n\nIn an old GitHub comment I read that darknet addresses are too large for seeding, it would be unnecessary and it's not practical to access DNS over these networks. I'd like to address the first and last points with a [PoC darknet seeder](https://github.com/virtu/darkseed) I wrote which is capable of serving Onion, I2P and Cjdns addresses using a BIP155-like encoding and is reachable via IPv4 and Cjdns (DNS/UDP) as well as Onion and I2P (DNS/TCP).\n\nThe point about necessity is one I don't feel qualified to answer. If most people are running mixed clearnet-darknet nodes, there's no necessity. For darknet-only nodes, it might be worth the effort (~100 loc to create custom DNS `NULL` queries in Bitcoin Core since right now we conveniently use `getaddrinfo` which does not require any low-level DNS functionality). Happy about feedback before taking this any further!\n\n[^1]: For those who don't know, DNS seeds are used by a new Bitcoin node as the default way to learn about Bitcoin nodes it can connect to. The node sends a DNS query to one or more of the DNS seeds whose addresses are hardcoded into the binary, and receive a DNS reply containing a number of IPv4 and IPv6 addresses of nodes believed to be reachable. The node then connects to one or more of these addresses, sends a `getaddr` message to the node it connected to and (ideally) receives an `addr` reply from the node containing around 1000 addresses of other Bitcoin nodes.\n[^2]: For those in need of a refresher, hardcoded seeds are used as a fallback when a new node who doesn't know about any peers fails to solicit peer addresses via DNS seeds; for such instances, the Bitcoin Core binary contains a number of hardcoded addresses which the node can connect to and ask for other nodes' addresses by sending a `getaddr` message.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 91,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false
}