{
  "id": 3165,
  "name": "Jaswanth",
  "username": "Jassu7082",
  "avatar_template": "/user_avatar/delvingbitcoin.org/jassu7082/{size}/809_2.png",
  "created_at": "2024-09-12T05:08:09.213Z",
  "cooked": "<p>Hello everyone, I’m Jaswanth, a computer science student currently working on a project aimed at improving reward mechanics in mining pools to defend against Fork After Withholding (FAW) attacks.</p>\n<p>Block withholding is a type of attack similar to selfish mining, where a pool member withholds a mined block to undermine the pool’s revenue while submitting shares consisting of PPoWs rather than FPoWs, creating the miner’s dilemma. In an FAW attack, an attacker joins a Bitcoin mining pool and submits FPoWs when a non-target miner generates a block. If the pool manager accepts the FPoW, it results in a blockchain fork, potentially selecting the attacker’s block. This causes the target pool to receive rewards, shared with the attacker. The FAW attack can yield rewards up to four times greater than the BWH attack in large pools</p>\n<p>Countermeasures:</p>\n<p>The idea is to have the pool manager track each user’s reputation by monitoring metrics like Proof of Partial Work (PPOW). If a block submitted by a user leads to a fork, their reputation would decrease accordingly.I have a solid theoretical understanding of blockchain but lack practical experience. I’d appreciate any guidance on how to implement this in mining pools. Are there any simulation tools or resources that could help me get started?\nref:<a href=\"https://dl.acm.org/doi/abs/10.1145/3133956.3134019\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Be Selfish and Avoid Dilemmas | Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security</a>\nThanks in advance!</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-09-12T05:08:09.213Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 4,
  "readers_count": 3,
  "score": 0.8,
  "yours": false,
  "topic_id": 1128,
  "topic_slug": "fork-withholding-attack",
  "topic_title": "Fork withholding attack",
  "topic_html_title": "Fork withholding attack",
  "category_id": 8,
  "display_username": "Jaswanth",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Hello everyone, I'm Jaswanth, a computer science student currently working on a project aimed at improving reward mechanics in mining pools to defend against Fork After Withholding (FAW) attacks.\n\nBlock withholding is a type of attack similar to selfish mining, where a pool member withholds a mined block to undermine the pool's revenue while submitting shares consisting of PPoWs rather than FPoWs, creating the miner's dilemma. In an FAW attack, an attacker joins a Bitcoin mining pool and submits FPoWs when a non-target miner generates a block. If the pool manager accepts the FPoW, it results in a blockchain fork, potentially selecting the attacker's block. This causes the target pool to receive rewards, shared with the attacker. The FAW attack can yield rewards up to four times greater than the BWH attack in large pools\n\nCountermeasures:\n\nThe idea is to have the pool manager track each user's reputation by monitoring metrics like Proof of Partial Work (PPOW). If a block submitted by a user leads to a fork, their reputation would decrease accordingly.I have a solid theoretical understanding of blockchain but lack practical experience. I'd appreciate any guidance on how to implement this in mining pools. Are there any simulation tools or resources that could help me get started? \nref:https://dl.acm.org/doi/abs/10.1145/3133956.3134019\nThanks in advance!",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 530,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}