{
  "id": 3265,
  "name": "",
  "username": "andyschroder",
  "avatar_template": "/letter_avatar_proxy/v4/letter/a/c57346/{size}.png",
  "created_at": "2024-09-24T21:22:11.521Z",
  "cooked": "<p>Tangential to\n</p><aside class=\"quote quote-modified\" data-post=\"1\" data-topic=\"1134\">\n  <div class=\"title\">\n    <div class=\"quote-controls\"></div>\n    <img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/a/c57346/48.png\" class=\"avatar\">\n    <a href=\"https://delvingbitcoin.org/t/privately-sending-payments-while-offline-with-bolt12/1134\">Privately sending payments while offline with BOLT12</a> <a class=\"badge-category__wrapper \" href=\"/c/protocol-design/7\"><span data-category-id=\"7\" style=\"--category-badge-color: #0088CC; --category-badge-text-color: #FFFFFF;\" data-drop-close=\"true\" class=\"badge-category \" title=\"Bitcoin-related protocol proposals, or analysis or discussion thereof. For example, new P2P messages, new wallet techniques, methods for coinjoins or payment channels, etc.\"><span class=\"badge-category__name\">Protocol Design</span></span></a>\n  </div>\n  <blockquote>\n    <a name=\"p-3185-overview-1\" class=\"anchor\" href=\"#p-3185-overview-1\"></a>Overview\nI have an idea for devices to authorize payments from their remote online node while the device authorizing the payment has no direct internet connection. The receiver needs their node to be online though. I think we would need a slight adjustment to the BOLT12 invoice for this approach to be secure. \nI’d appreciate any thoughts and criticism you may have! \n<a name=\"p-3185-consider-this-scenario-2\" class=\"anchor\" href=\"#p-3185-consider-this-scenario-2\"></a>Consider this scenario\n\nBuyer is at home with their phone phone connected to the internet (say it is running a Zeus wallet connecte…\n  </blockquote>\n</aside>\n\n<p>I’d like to make another proposal: <code>Lightning Cheques</code>. <code>Lightning Cheques</code> are a paper instrument where the front side is a BOLT12 <code>invoice_request</code> for a predetermined amount of satoshi and the back side is an <code>offer</code>.</p>\n<p>The idea is that you could have some software at home that connects to your always on lightning node and generates a bunch of <code>invoice_request</code> before you leave home and then formats them automatically into a QR code that stores a URI in the form of <code>bitcoin:?lnr=lnrXXXXXXXXXX</code>. The back side has a QR code that stores a URI in the form of <code>bitcoin:?lno=lno1XXXXXXXX</code>. Many of these can be printed on a standard sheet and a paper cutter can be used to cut them all out.</p>\n<p>A merchant can withdraw from your lightning node using the <code>invoice_request</code> and then return change to you back using the <code>offer</code> on the back side. Just like paper money, these can be denominated in different units. You risk that the merchant will actually give you change, but the same thing happens with paper money. The main drawback with <code>Lightning Cheques</code> is you don’t necessarily know if you’ve been ripped off and never got the change until you go back home.</p>\n<p>Because you can create as many of these as you want, you can create a number of denominations and then pay a merchant with the closest combination of <code>Lightning Cheques</code> to minimize risk that you won’t actually be paid your change. You can overprint <code>Lightning Cheques</code> just so that you can ensure that you have a closer combination of denominations for many purchases.</p>\n<p>After a <code>Lightning Cheque</code> is used, it is worthless and it can be discarded. At any time, you can also destroy <code>Lightning Cheques</code> if you are worried they could be stolen. When you are back home, you can also invalidate a <code>Lightning Cheque</code> if you lost it.</p>\n<p><code>Lightning Cheque</code> could also be written to cheap NFC cards and reused, but I’m not sure if you could place the refund offer on the same card, you may need a separate card for that. Also, you may only want to transport them in a Faraday Bag.</p>\n<p>You can use <code>Lightning Cheques</code> as a way to gift money, for young kids to pay for their lunch at school, as a backup when traveling in case you get robbed or your phone gets smashed, or if you just don’t like mobile phones or can’t afford one.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-09-24T21:23:53.189Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 60,
  "reads": 9,
  "readers_count": 8,
  "score": 301.8,
  "yours": false,
  "topic_id": 1162,
  "topic_slug": "lightning-cheques",
  "topic_title": "Lightning Cheques",
  "topic_html_title": "Lightning Cheques",
  "category_id": 8,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Tangential to \nhttps://delvingbitcoin.org/t/privately-sending-payments-while-offline-with-bolt12/1134\n\nI'd like to make another proposal: `Lightning Cheques`. `Lightning Cheques` are a paper instrument where the front side is a BOLT12 `invoice_request` for a predetermined amount of satoshi and the back side is an `offer`.\n\nThe idea is that you could have some software at home that connects to your always on lightning node and generates a bunch of `invoice_request` before you leave home and then formats them automatically into a QR code that stores a URI in the form of `bitcoin:?lnr=lnrXXXXXXXXXX`. The back side has a QR code that stores a URI in the form of `bitcoin:?lno=lno1XXXXXXXX`. Many of these can be printed on a standard sheet and a paper cutter can be used to cut them all out.\n\nA merchant can withdraw from your lightning node using the `invoice_request` and then return change to you back using the `offer` on the back side. Just like paper money, these can be denominated in different units. You risk that the merchant will actually give you change, but the same thing happens with paper money. The main drawback with `Lightning Cheques` is you don't necessarily know if you've been ripped off and never got the change until you go back home.\n\nBecause you can create as many of these as you want, you can create a number of denominations and then pay a merchant with the closest combination of `Lightning Cheques` to minimize risk that you won't actually be paid your change. You can overprint `Lightning Cheques` just so that you can ensure that you have a closer combination of denominations for many purchases.\n\nAfter a `Lightning Cheque` is used, it is worthless and it can be discarded. At any time, you can also destroy `Lightning Cheques` if you are worried they could be stolen. When you are back home, you can also invalidate a `Lightning Cheque` if you lost it.\n\n\n`Lightning Cheque` could also be written to cheap NFC cards and reused, but I'm not sure if you could place the refund offer on the same card, you may need a separate card for that. Also, you may only want to transport them in a Faraday Bag.\n\nYou can use `Lightning Cheques` as a way to gift money, for young kids to pay for their lunch at school, as a backup when traveling in case you get robbed or your phone gets smashed, or if you just don't like mobile phones or can't afford one.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 532,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}