{
  "id": 3197,
  "name": "ZmnSCPxj jxPCSnmZ",
  "username": "ZmnSCPxj",
  "avatar_template": "/letter_avatar_proxy/v4/letter/z/ee7513/{size}.png",
  "created_at": "2024-09-16T20:08:19.856Z",
  "cooked": "<p>Subject: SuperScalar: Laddered Timeout-Tree-Structured Decker-Wattenhofer Factories</p>\n<h1><a name=\"p-3197-introduction-1\" class=\"anchor\" href=\"#p-3197-introduction-1\"></a>Introduction</h1>\n<p>We introduce the LSP Last-Mile Problem:</p>\n<ul>\n<li>New users receiving their first ever Bitcoins over the Lightning Network must pay for incoming liquidity.\n<ul>\n<li>The cost of blockchain operations to get that liquidity must be amortized across multiple new users to keep the cost of each one low.</li>\n</ul>\n</li>\n</ul>\n<p>In addition to the above problem, our solutions must also have the following constraints:</p>\n<ul>\n<li>We must ensure that the LSP cannot steal funds, i.e. it is not sufficient to have one-honest-member security assumption, unless every end-user can be their own single honest member.</li>\n<li>We must do so without any blockchain consensus changes.\n<ul>\n<li>The Bitcoin blockchain has ossified in practice. Due to the scheduled halvening every 4 years causing a sudden increase in Bitcoin price, leading to a sudden increase in interest in Bitcoin, large batches of new users join the set of entities with an interest in Bitcoin consensus. As the previous batch becomes convinced of some consensus change, the new batch enters Bitcoin, which must itself be convinced of the same consensus change. If a consensus change cannot achieve practical consensus within a time shorter than a halvening period, it will not ever happen, thus leading to ossification in practice (smaller and more easily-digestible changes may still push through, but more complex changes, like covenants, will never reach consensus).</li>\n</ul>\n</li>\n<li>We must be resilient against some or a few end-users being offline when the LSP has to reallocate funds.\n<ul>\n<li>As the number of users sharing a single UTXO increases, the probability of one or more of them being offline increases. Thus, when scaling to large numbers of end-users, resilience against some of the end-users not being able to come online is a necessity.</li>\n<li>It turns out that software running on mobile phones can be made to come online via Android or iOS application notification mechanisms, thus in practice the onlineness of mobile clients can be reasonably high. Nevertheless, mobile phones may occassionally drop off network at times, so their uptime is still not as good as non-mobile devices. Thus, the mechanism should be resilient against a few users being offline.</li>\n</ul>\n</li>\n</ul>\n<p>All of the above constraints immediately rule out Ark and BitVM2 bridges. Both have a one-honest-member security assumption without covenants, and covenants will not achieve consensus in practice, as pointed out above (<code>OP_CTV</code> was largely finalized in 2020, and has not achieved consensus in 2024, thus will never achieve consensus due to exceeding the halvening period; <code>SIGHASH_NOINPUT</code> has even worse prognosis). Both can get around the one-honest-member assumption only if all end-users are simultaneously online at the moment at which an LSP needs to reallocate funds, which breaks the final constraint above.</p>\n<p>In this writeup, I provide a construction, SuperScalar, which is effectively laddered timeout-tree-structured Decker-Wattenhofer channel factories.</p>\n<h1><a name=\"p-3197-the-ingredients-2\" class=\"anchor\" href=\"#p-3197-the-ingredients-2\"></a>The Ingredients</h1>\n<p>First, I provide a hopefully gentle introduction to the three different components I combine to form this single construction:</p>\n<ol>\n<li>Decker-Wattenhofer decrementing-<code>nSequence</code> offchain mechanisms.</li>\n<li>Timeout trees, particularly the variant that uses everyone-signs to emulate <code>OP_CTV</code>, which I call timeout-sig-trees.</li>\n<li>Laddering.</li>\n</ol>\n<p>Feel free to skip sections you are already familiar with.</p>\n<h2><a name=\"p-3197-decker-wattenhofer-3\" class=\"anchor\" href=\"#p-3197-decker-wattenhofer-3\"></a>Decker-Wattenhofer</h2>\n<p>The Decker-Wattenhofer decrementing-<code>nSequence</code> mechanism is an offchain cryptocurrency system which allows for a set of interested users to get consensus on some state change, without requiring that each state change be published on the blockchain layer (hence “offchain”). This is like the Poon-Dryja mechanism, however with the following differences:</p>\n<ul>\n<li>Number of parties:\n<ul>\n<li>Poon-Dryja is strictly two-party.</li>\n<li>Decker-Wattenhofer decrementing-<code>nSequence</code> can have any number of parties.</li>\n</ul>\n</li>\n<li>Number of state changes:\n<ul>\n<li>Poon-Dryja can theoretically have an infinite number of state changes (practical deployments, as in the BOLT specification of the Lightning Network, have a limit on number of state changes, but the limit is in the billions, thus practically unlimited).</li>\n<li>Decker-Wattenhofer decrementing-<code>nSequence</code> have a small number of state changes. Single unchained constructions would be able to provide a small number of state changes each (less than 100, and practically, 4 or 2 per chained mechanism). The typical proposal is to chain multiple such constructions together, effectively multiplying the number of available state changes for each chained construction (e.g. chaining 3 constructions with 4 state changes each will get 4 x 4 x 4 = 64 state changes).</li>\n</ul>\n</li>\n<li>Size and convenience of unilateral closure:\n<ul>\n<li>Poon-Dryja only requires a single commitment transaction for unilateral closure, as well as additional transactions to reclaim funds. The time delay until funds can be recovered is constant.</li>\n<li>Decker-Wattenhofer decrementing-<code>nSequence</code> have one kickoff transaction to begin the unilateral closure process, and one delayed transaction per layer. Increasing the number of state changes by chaining multiple layers of this construction will increase the number of additional transactions, so that the blockspace is practically O(log N) where N is the number of state changes supported. Each layer transaction has varying time delay until funds can be recovered.</li>\n</ul>\n</li>\n</ul>\n<p>Both Decker-Wattenhofer and Poon-Dryja are implementable in current Bitcoin without consensus changes.</p>\n<p>Like Poon-Dryja, Decker-Wattenhofer decrementing-<code>nSequence</code> mechanisms have an onchain UTXO that serves as the “funding outpoint”. The outpoint is a simple n-of-n multisignature of all signatories who sign off on state changes.</p>\n<p>For a single-layer Decker-Wattenhofer decrementing-<code>nSequence</code> mechanism, there are two transactions:</p>\n<ol>\n<li>A “kickoff” transaction, spending the funding outpoint, and outputting to a n-of-n multisignature.</li>\n<li>A “state” transaction, spending the output of the kickoff transaction, and which has an <code>nSequence</code> that requires a specific relative locktime. Its outputs are the state that is agreed upon by the consensus signatories.</li>\n</ol>\n<p>For the initial state, the “state” transaction has an <code>nSequence</code> that is the maximum designed relative locktime. For instance, for a 4-state design, it would be reasonable to start with 432 blocks of relative delay.</p>\n<p>When the state is changed, and a new state is agreed upon by the signatories, a new state transaction spending the kickoff output is created, with a smaller <code>nSequence</code> relative delay. For example, for a 4-state design:</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>State Index</th>\n<th>Relative Locktime (Blocks)</th>\n<th>Comment</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>0</td>\n<td>432</td>\n<td>Initial state</td>\n</tr>\n<tr>\n<td>1</td>\n<td>288</td>\n<td></td>\n</tr>\n<tr>\n<td>2</td>\n<td>144</td>\n<td></td>\n</tr>\n<tr>\n<td>3</td>\n<td>0</td>\n<td>Final; mechanism can only be closed</td>\n</tr>\n</tbody>\n</table>\n</div><p>Thus, it is called a “decrementing-<code>nSequence</code>” mechanism; each time a new state is ratified by the signatories, the new state transaction has a smaller <code>nSequence</code>, until it reaches an <code>nSequence</code> encoding 0.</p>\n<p>Because the latest state has a lower relative locktime than any previous state, it can confirm earlier than earlier states. This mechanism ensures that, assuming the blockchain layer is not congested, the latest state is the one that gets confirmed in a unilateral exit case.</p>\n<p>The difference in <code>nSequence</code> relative locktimes should be large enough that it is reasonable to assume that, even in congestion situations, the latest state can confirm before the previous state could potentially be confirmed. Thus, the example above uses a step of 144 blocks between states.</p>\n<p>A single such mechanism, as demonstrated above, has a very limited number of state changes before it reaches the “final” state and has to be closed. Decker-Wattenhofer thus practically recommends chaining multiple such mechanisms. The first mechanism in the chain has a single output, which is an n-of-n of the signatories, which serves as the input to the next mechanism, and so on. Only the last mechanism has the state transaction have multiple outputs, the actual final state of the funds in the mechanism.</p>\n<p>When chaining Decker-Wattenhofer mechanisms, only the “state” transactions need to be duplicated; the “state” transaction of the first in the chain serves as the “kickoff” transaction for the next mechanism in the chain. For example, if we chain 3 Decker-Wattenhofer mechanisms, we have a single “kickoff” transaction, plus 3 “state” transactions, for a total of 4 transactions for a unilateral close.</p>\n<p>In effect, the “state” transaction of the previous mechanism is cut-through with the “kickoff” transaction of the next mechanism.</p>\n<p>Chained Decker-Wattenhofer mechanisms work similarly to multi-digit countdown counters. Whenever a new state is ratified, the last chained mechanism -– the one furthest from the funding transaction -– gets decremented. However, if the last “digit” has counted down to 0, then the second-to-the-last one is decremented instead, and the last one is reset to the maximum <code>nSequence</code>. Similarly, if the second-to-the-last mechanism has counted down to 0, then the third-to-the-last is decremented and the succeeding mechanisms are reset to the maximum <code>nSequence</code>. And so on.</p>\n<p>In effect, the last mechanism in the chain is the most likely to be changed whenever state is updated (it is always changed at each state update), while the first mechanism is the least likely to be changed at a state update.</p>\n<pre><code class=\"lang-auto\">Initial state\n                         nSequence        nSequence\n           +----+------+   +-----+------+   +-----+-----------+\nfunding --&gt;|    |n-of-n|--&gt;| 432 |n-of-n|--&gt;| 432 |...state...|\n           +----+------+   +-----+------+   +-----+-----------+\n            kickoff tx       state tx          state tx\n\n======&gt;\n                         nSequence        nSequence\n           +----+------+   +-----+------+   +-----+-----------+\nfunding --&gt;|    |n-of-n|--&gt;| 432 |n-of-n|--&gt;| 288 |...state...|\n           +----+------+   +-----+------+   +-----+-----------+\n            kickoff tx       state tx          state tx\n\n======&gt;\n                         nSequence        nSequence\n           +----+------+   +-----+------+   +-----+-----------+\nfunding --&gt;|    |n-of-n|--&gt;| 432 |n-of-n|--&gt;| 144 |...state...|\n           +----+------+   +-----+------+   +-----+-----------+\n            kickoff tx       state tx          state tx\n\n======&gt;\n                         nSequence        nSequence\n           +----+------+   +-----+------+   +-----+-----------+\nfunding --&gt;|    |n-of-n|--&gt;| 432 |n-of-n|--&gt;|  0  |...state...|\n           +----+------+   +-----+------+   +-----+-----------+\n            kickoff tx       state tx          state tx\n\n======&gt;\n                         nSequence        nSequence\n           +----+------+   +-----+------+   +-----+-----------+\nfunding --&gt;|    |n-of-n|--&gt;| 288 |n-of-n|--&gt;| 432 |...state...|\n           +----+------+   +-----+------+   +-----+-----------+\n            kickoff tx       state tx          state tx\n</code></pre>\n<h2><a name=\"p-3197-timeout-trees-4\" class=\"anchor\" href=\"#p-3197-timeout-trees-4\"></a>Timeout Trees</h2>\n<p>Timeout trees are a mechanism that combines <code>OP_CTV</code>-trees with a timeout.</p>\n<p>Without <code>OP_CTV</code>, a variant can be created where the <code>OP_CTV</code> covenant is enforced by consensus signing of all participants. This variant (which I call timeout-sig-trees) is what I will focus on here. In addition, we consider the case where a singular LSP provides such a mechanism to its clients.</p>\n<p>In timeout-sig-trees, an LSP <code>L</code> provides Lightning channels to a set of clients. A single confirmed onchain UTXO backs multiple channels to different clients.</p>\n<p>On construction, the LSP creates a tree of transactions. Non-leaf nodes have outputs where the clients involved in the branch of that tree, plus the LSP, have an n-of-n multisignature. This is standard tree transaction structures, but timeout trees also add an alternative spending condition: the LSP can spend by itself after a particular timeout. The same alternative condition also exists on the funding outpoint.</p>\n<p>For example, if the LSP <code>L</code> has 8 clients <code>A</code> to <code>H</code>, then it might form a timeout tree. The funding outpoint, which is confirmed onchain, would have the conditions:</p>\n<ol>\n<li><code>A &amp; B &amp;</code>…<code>&amp; H &amp; L</code></li>\n<li><code>L &amp; CLTV</code></li>\n</ol>\n<p>Then the tree would look like this:</p>\n<pre><code class=\"lang-auto\">                                              +--+---+\n                                              |  |A&amp;L| LN channel\n                                            +&gt;|  +---+\n                                            | |  |B&amp;L| LN channel\n                            +--+----------+ | +--+---+\n                            |  |  (A&amp;B&amp;L) |-+ \n                            |  |or(L&amp;CLTV)|   +--+---+\n                          +&gt;|  +----------+   |  |C&amp;L| LN channel\n          +--+----------+ | |  |  (C&amp;D&amp;L) |--&gt;|  +---+\n          |  |(A&amp;..&amp;D&amp;L)| | |  |or(L&amp;CLTV)|   |  |D&amp;L| LN channel\n          |  |or(L&amp;CLTV)|-+ +--+----------+   +--+---+\nfunding--&gt;|  +----------+\n          |  |(E&amp;..&amp;H&amp;L)|-+ +--+----------+   +--+---+\n          |  |or(L&amp;CLTV)| | |  |  (E&amp;F&amp;L) |   |  |E&amp;L| LN channel\n          +--+----------+ | |  |or(L&amp;CLTV)|--&gt;|  +---+\n                          +&gt;|  +----------+   |  |F&amp;L| LN channel\n                            |  |  (G&amp;H&amp;L) |   +--+---+\n                            |  |or(L&amp;CLTV)|-+\n                            +--+----------+ | +--+---+\n                                            | |  |G&amp;L| LN channel\n                                            +&gt;|  +---+\n                                              |  |H&amp;L| LN channel\n                                              +--+---+\n</code></pre>\n<p>The timeout condition forces all clients to come online before the timeout and exit the mechanism. Exit can be unilateral or with cooperation of the LSP.</p>\n<p>In a cooperative exit, the client simply sends out all its funds in the channel hosted inside the timeout tree over Lightning, possibly using a swap service to get onchain funds, or to a new timeout tree with the same LSP, or to another LSP.</p>\n<p>A unilateral exit simply means publishing the path from the root to their Lightning channel output, then unilaterally exiting the Lightning channel (expected to be a Poon-Dryja) as well.</p>\n<p>The advantage of using a tree is that unilateral exit is small; it is only O(log N) transactions for a single client to exit, and most of the other clients can remain in the tree. If not using a tree, then a single client performing a unilateral exit would cause all clients to perform unilateral exits.</p>\n<p>The advantage of the timeout condition is that it encourages all clients to exit simultaneously, hopefully cooperatively, and the LSP only needs to perform a simple single-input transaction to recover the funds from the construction, via the <code>L &amp; CLTV</code> spending condition on the funding outpoint. Even if some clients also perform unilateral exit, much of the funds can be recovered via the <code>L &amp; CLTV</code> spending conditions on each intermediate output.</p>\n<h2><a name=\"p-3197-laddering-5\" class=\"anchor\" href=\"#p-3197-laddering-5\"></a>Laddering</h2>\n<p>Many financial institutions offer a kind of financial contract wherein a depositor puts funds into a contract, and cannot withdraw, even partially, until some specific future date, at which point the depositor is given the original funds, plus an interest payment. The contract is also non-transferable. Such contracts are known by various names:</p>\n<ul>\n<li>Certificate of Deposit (United States)</li>\n<li>Guaranteed Investment Certificates (Canada)</li>\n<li>Term Deposit or Time Deposit (other countries)</li>\n</ul>\n<p>Such contracts are inflexible; as noted, it is impossible to withdraw or transfer the contract until the end of its term. However, savvy investors instead split up their investable funds into multiple such contracts, set up so that their termination dates are staggered by one month or one year to each other. This technique is called “laddering”.</p>\n<p>For example, an investor might have three such contracts, terminating in December 2024, December 2025, and December 2026. On December 2024, the first contract terminates, and the investor may decide to withdraw part of the funds and re-invest the remaining in a new contract that terminates on December 2027, or to add more funds to invest in the new contract, or to start closing the ladder by not starting a new contract.</p>\n<p>Laddering provides investors the ability to change the amount of investment, and to add or reduce their investment into these contracts, once a month or once a year, depending on the laddering. Thus, even though the base contracts are inflexible, laddering allows investors to regain a little bit of flexibility, while retaining the advantages of long-term certificates of deposit.</p>\n<h1><a name=\"p-3197-the-superscalar-mechanism-6\" class=\"anchor\" href=\"#p-3197-the-superscalar-mechanism-6\"></a>The SuperScalar Mechanism</h1>\n<p>Laddered timeout-tree-structured Decker-Wattenhofer channel factories are simply the combination of the above three ingredients.</p>\n<h2><a name=\"p-3197-timeout-tree-structured-decker-wattenhofer-7\" class=\"anchor\" href=\"#p-3197-timeout-tree-structured-decker-wattenhofer-7\"></a>Timeout-tree-structured Decker-Wattenhofer</h2>\n<p>First, let me demonstrate the combination of the first two ingredients; we shall add laddering in a separate subsection later.</p>\n<p>Suppose an LSP, <code>L</code> has 8 clients, <code>A</code> to <code>H</code>. The funding outpoint then has the following two alternative spend conditions:</p>\n<ol>\n<li><code>A &amp; B &amp;</code>…<code>&amp; H &amp; L</code></li>\n<li><code>L &amp; CLTV</code></li>\n</ol>\n<p>When setting up the mechanism, the LSP arrange the following transactions to be signed, with the funding transaction being an n-of-n of <code>A</code>…<code>H</code> and <code>L</code>:</p>\n<pre><code class=\"lang-auto\">                                                         nSequence\n                                                           +---+---+\n                                                           |   |A&amp;L| LN channel\n                                                           |   +---+\n                                                       +--&gt;|432|B&amp;L| LN channel\n                                                       |   |   +---+\n                                                       |   |   | L |\n                                                       |   +---+---+\n                                                       |\n                                                       |   +---+---+\n                                                       |   |   |C&amp;L| LN channel\n                                            +--+-----+ |   |   +---+\n                       nSequence            |  |A&amp;B&amp;L|-+ +&gt;|432|D&amp;L| LN channel\n                         +---+----------+ +&gt;|  +-----+   | |   +---+\n                         |   |(A&amp;..&amp;D&amp;L)| | |  |C&amp;D&amp;L|---+ |   | L |\n         +--+---------+  |   |or(L&amp;CLTV)|-+ +--+-----+     +---+---+\nfunding-&gt;|  |A&amp;...&amp;H&amp;L|-&gt;|432+----------+\n         +--+---------+  |   |(E&amp;..&amp;H&amp;L)|-+ +--+-----+     +---+---+\n          kickoff tx     |   |or(L&amp;CLTV)| | |  |E&amp;F&amp;L|---+ |   |E&amp;L| LN channel\n                         +---+----------+ +&gt;|  +-----+   | |   +---+\n                          state tx          |  |G&amp;H&amp;L|-+ +&gt;|432|F&amp;L| LN channel\n                                            +--+-----+ |   |   +---+\n                                             kickoff   |   |   | L |\n                                             tx        |   +---+---+\n                                                       |\n                                                       |   +---+---+\n                                                       |   |   |G&amp;L| LN channel\n                                                       |   |   +---+\n                                                       +--&gt;|432|H&amp;L| LN channel\n                                                           |   +---+\n                                                           |   | L |\n                                                           +---+---+\n                                                            state tx\n</code></pre>\n<p>Basically, the rules for building the tree from a set of clients, using a leaf-to-root construction order, are:</p>\n<ol>\n<li>First, distribute the clients into leaf nodes, where multiple clients go into leaf nodes, according to arity (in the above example, arity is 2).\n<ul>\n<li>Their outputs are a channel between the LSP <code>L</code> and the respective client, and also an additional fund that is owned only by <code>L</code>.</li>\n</ul>\n</li>\n<li>Leaf nodes are always state transactions.\n<ul>\n<li>They have decrementing <code>nSequence</code>.</li>\n</ul>\n</li>\n<li>Create parent nodes to the trees being built, depending on the desired arity.\n<ul>\n<li>Parents of state transactions are kickoff transactions.\n<ul>\n<li>Their outputs are simply the owners in the respective child in an n-of-n.</li>\n</ul>\n</li>\n<li>Parents of kickoff transactions are state transactions.\n<ul>\n<li>State transaction outputs have an <code>or (L &amp; CLTV)</code> alternate condition in addition to the n-of-n of the owners in that branch.</li>\n<li>State transaction inputs have decrementing <code>nSequence</code>.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Repeat 3 until you get a single root node.</li>\n<li>If the resulting single root node is a state transaction, add a single-input single-output kickoff transaction. Otherwise, just use the root directly as the first kickoff transaction.\n<ul>\n<li>This rule is true for the above example where the tree arity is 2 and the number of clients is 8.</li>\n<li>If the number of clients in the example were increased to 16, then the number of transactions needed in a unilateral close would still be 4 transactions, plus the Poon-Dryja unilateral close transaction.</li>\n</ul>\n</li>\n</ol>\n<p>The reason for alternating kickoff transaction layers of the tree with state transaction layers of the tree will be given in a later subsection.</p>\n<h2><a name=\"p-3197-a-needs-inbound-liquidity-badly-8\" class=\"anchor\" href=\"#p-3197-a-needs-inbound-liquidity-badly-8\"></a><code>A</code> Needs Inbound Liquidity, Badly!</h2>\n<p>Suppose <code>A</code> runs out of inbound liquidity in the <code>A</code> and <code>L</code> channel that is funded in the above tree structure. What can the LSP <code>L</code> do to provide inbound liquidity to <code>A</code>, without having to drop onchain?</p>\n<p>The LSP can wake up <code>B</code> -– and only <code>B</code> (presumably <code>A</code> is already awake if it is requesting for more inbound liquidity) -– in order to update the leaf node containing the <code>A&amp;L</code> and <code>B&amp;L</code> channels. Because the leaf node only contains funds owned by <code>A</code>, <code>B</code>, and <code>L</code>, only those three participants need to be online; thus, the mechanism is more resilient to some participants not being online at the time that <code>A</code> needs additional inbound liquidity.</p>\n<p>Of course, if <code>B</code> cannot come online, the LSP does have to fall back to alternate methods, such as onchain. This can lead to onchain fees needing to be paid, which the LSP would pass on to <code>A</code>.</p>\n<p>Suppose <code>B</code> does come online. In that case, <code>L</code> can move funds from the <code>L</code>-only output to the <code>A &amp; L</code> channel, without requiring that clients <code>C</code> to <code>H</code> be online.</p>\n<p>Of course, it is possible that the <code>L</code>-only output has been depleted, or the final state change (i.e. <code>nSequence = 0</code>) has been reached. In that case, the LSP can move up the tree to the next higher state transaction, waking up more clients in an effort to move funds from the other <code>L</code>-only outputs to <code>A</code>, and reset the <code>nSequence</code> of the nodes until the leaf nodes. This increases the number of clients that need to be online at that time, but does not necessarily require that <em>all</em> clients are online.</p>\n<p>In effect, whenever some client runs out of inbound liquidity, the leafmost state transactions are the ones that are more likely to be updated. However, if the <code>L</code>-only outputs have been depleted, then earlier state transactions would also need to be updated, to allow the LSP <code>L</code> to move liquidity from other leaf nodes to <code>A</code>.</p>\n<h2><a name=\"p-3197-tank-a-needs-an-exit-9\" class=\"anchor\" href=\"#p-3197-tank-a-needs-an-exit-9\"></a>Tank, <code>A</code> Needs An Exit!</h2>\n<p>Suppose that <code>A</code> decides to unilaterally exit. This may occur for any number of reasons; the important thing is that any arbitrary client of the LSP is capable of performing unilateral exit, and for the effect of unilateral exit to be minimized. This assurance prevents the LSP from being able to rug clients, and assures their sovereignty and control of their money.</p>\n<p>In order for <code>A</code> to exit, it must first have the <code>A &amp; L</code> channel funding outpoint confirmed, then finally exit the <code>A &amp; L</code> channel using standard Poon-Dryja unilateral exit. Thus, <code>A</code> must publish the path to its channel below:</p>\n<pre><code class=\"lang-auto\">                                                         nSequence\n                                                           +---+---+\n                                                           |   |A&amp;L| LN channel\n                                                           |   +---+\n                                                       +--&gt;|432|B&amp;L| LN channel\n                                                       |   |   +---+\n                                                       |   |   | L |\n                                                       |   +---+---+\n                                                       |    state tx\n                                                       |\n                                                       |\n                                            +--+-----+ |\n                       nSequence            |  |A&amp;B&amp;L|-+\n                         +---+----------+ +&gt;|  +-----+\n                         |   |(A&amp;..&amp;D&amp;L)| | |  |C&amp;D&amp;L|\n         +--+---------+  |   |or(L&amp;CLTV)|-+ +--+-----+\nfunding-&gt;|  |A&amp;...&amp;H&amp;L|-&gt;|432+----------+    kickoff\n         +--+---------+  |   |(E&amp;..&amp;H&amp;L)|    tx\n          kickoff tx     |   |or(L&amp;CLTV)|\n                         +---+----------+\n                          state tx\n</code></pre>\n<p>However, we should also take note that any outputs of a confirmed kickoff transaction <em><strong>MUST</strong></em> be consumed by a state transaction that gets confirmed. This is because state transactions with smaller <code>nSequence</code> relative delays need to be confirmed first before those with larger <code>nSequence</code> relative delays, or else the Decker-Wattenhofer mechanism gets broken (older states may get confirmed instead).</p>\n<p>Thus, in the case that <code>A</code> wants to exit, not only are the clients on the same leaf transaction (<code>B</code>) are inadvertently exited, but also sibling clients on the next higher level, <code>C</code> and <code>D</code>.</p>\n<pre><code class=\"lang-auto\">                                                         nSequence\n                                                           +---+---+\n                                                           |   |A&amp;L| LN channel\n                                                           |   +---+\n                                                       +--&gt;|432|B&amp;L| LN channel\n                                                       |   |   +---+\n                                                       |   |   | L |\n                                                       |   +---+---+\n                                                       |\n                                                       |   +---+---+\n                                                       |   |   |C&amp;L| LN channel\n                                            +--+-----+ |   |   +---+\n                       nSequence            |  |A&amp;B&amp;L|-+ +&gt;|432|D&amp;L| LN channel\n                         +---+----------+ +&gt;|  +-----+   | |   +---+\n                         |   |(A&amp;..&amp;D&amp;L)| | |  |C&amp;D&amp;L|---+ |   | L |\n         +--+---------+  |   |or(L&amp;CLTV)|-+ +--+-----+     +---+---+\nfunding-&gt;|  |A&amp;...&amp;H&amp;L|-&gt;|432+----------+    kickoff        state tx\n         +--+---------+  |   |(E&amp;..&amp;H&amp;L)|    tx\n          kickoff tx     |   |or(L&amp;CLTV)|\n                         +---+----------+\n                          state tx\n</code></pre>\n<p>This also explains why our layers of nodes need to alternate between “state” transactions and “kickoff” transactions, unlike the plain Decker-Wattenhofer where only the very first transaction is the “kickoff”. If we imitated that in our scheme, then if any single client needed to exit, all the downstream state transactions, which have varying <code>nSequence</code> relative delays, <em><strong>MUST</strong></em> be published also, or else the Decker-Wattenhofer mechanisms risks being broken. The layers of “kickoff” transactions serve as a backstop, ensuring that a single participant doing unilateral exit only publishes O(log N) transactions, and not the entire O(N) tree.</p>\n<p>This is also the reason why the outputs of kickoff transactions do not need the timeout branch <code>L &amp; CLTV</code>. A kickoff transaction output <em><strong>MUST</strong></em> be consumed by the latest state transaction for that output, and the state transactions would have the timeout branch anyway.</p>\n<p>In the above example, <code>B</code>, <code>C</code>, and <code>D</code> can still transact HTLCs on their respective channels, but can no longer cheaply purchase additional inbound liquidity from <code>L</code>. Instead, <code>L</code> would need to splice in additional inbound liquidity onchain, which would be more expensive. (i.e. a single participant exiting does not cause <em>all</em> participants to exit; it still causes <em>some</em> other participants to partially exit, in that their channels remain open, but the ability to cheaply get inbound is lost)</p>\n<p>However, the remaining clients <code>E</code> through <code>H</code> would still be able to purchase cheap inbound liquidity from inside the mechanism, as their part of the tree is not yet published onchain and can still be updated offchain. In addition, once the timeout period ends and the clients <code>E</code> through <code>H</code> have performed a cooperative exit over the Lightning Network (and have no more in-Lightning funds in their respective channels) then <code>L</code> can reap their output on the state transaction via the <code>L &amp; CLTV</code> branch, in order to recycle those funds.</p>\n<h2><a name=\"p-3197-laddering-10\" class=\"anchor\" href=\"#p-3197-laddering-10\"></a>Laddering</h2>\n<p>I now add the third ingredient.</p>\n<p>From the point of view of the LSP <code>L</code>, the above mechanism is an investment. The hope of the LSP <code>L</code> is that it can earn a return on this investment, from various means, including:</p>\n<ul>\n<li>Lightning Network routing fees.</li>\n<li>Selling of cheaper offchain liquidity.</li>\n<li>Fees for maintenance of the overall mechanism.</li>\n</ul>\n<p>In addition, because of the timeout branches, the LSP cannot easily recover its funds until the end of the term.</p>\n<p>Thus, a single timeout-tree-structured Decker-Wattenhofer mechanism is very much like a term deposit, from the point of view of the LSP.</p>\n<p>And as I pointed out earlier, savvy investors use laddering of multiple term deposit contracts in order to get a little more flexibility in how they allocate their funds.</p>\n<p>The LSP itself can run multiple timeout-tree-structured Decker-Wattenhofer mechanisms, with different sets of clients, and with overlapping terms, as in a ladder of term deposits in traditional finance. As the term of one mechanism ends, the LSP can start a new mechanism, inviting the clients in the terminating mechanism to transfer their funds to the new mechanism, including charges for the transfer. Then the LSP can recover the funds from the terminating mechanism via the timeout branch, onchain. The LSP gets earnings from routing fees, selling offchain liquidity, and the privelege of transferring to a new mechanism, and those earnings remain in Lightning-locked funds.</p>\n<p>For example, the LSP can run 30 such mechanisms, all expiring on different days. When one of the mechanisms is about to expire, the LSP can invite the clients on that mechanism into a new mechanism. The LSP funds the new mechanism from the mechanism that expires today, creating a new 30-day mechanism. Then, the clients can move their funds from the dying mechanism to the new mechanism. Once all clients have exited the dying mechanism, on the completion of the term, the LSP can simply claim the entire UTXO, resulting in a single output being spent.</p>\n<p>In the concrete example below, the LSP has a ladder of 9 timeout-tree-structured Decker-Wattenhofer factories.  Each ladder has an “active period” of 7 days, and a “dying period” of 2 days.  During the dying period, clients can join one of the 2 factories built on the 2 days of the dying period, and transfer their funds to a new channel inside the new factory.  This allows clients a little leeway; if they miss the first day they can transfer, they have another chance on the succeeding day.  In actual deployments, I would mildly suggest an active period of 30 days and a dying period of 3 days; an LSP would then need to maintain 33 different factories at any time.  Ideally, there would be a single 1-input 1-output transaction per day, although if a client never comes online, the LSP would need to publish the path to its output, which increases the number of transactions needed onchain.</p>\n<pre><code class=\"lang-auto\">Legend: ===== Active Period\n        ::::: Dying Period\n\nDay | 01 | 02 | 03 | 04 | 05 | 06 | 07 | 08 | 09 | 10 | 11 | 12 | 13 | 14 | 15 | 16\n       ===================================::::::::::   &lt;---- each of this a factory\n            ===================================::::::::::\n                 ===================================::::::::::\n                      ===================================::::::::::\n                           ===================================::::::::::\n                                ===================================::::::::::\n                                     ===================================::::::::::\n                                          ===================================::::::::::\n               Client can move            ^    ===================================::::::::::\n              funds from first -----------+----^    ===================================::::::::::\n             factory to either of                   ^\n                these two new                LSP uses the funds of the\n                 factories                       first factory to\n                                                build this factory\n</code></pre>\n<p>Unfortunately, due to a lack of covenants, clients need to come online on the specific times that the LSP is constructing the new factory.  If they miss the exact time, they need to try on the next day of the dying period; if they miss the last day of the dying period they <em><strong>MUST</strong></em> exit the mechanism, with all the costs implied by the exit.  <code>OP_CTV</code> would allow LSPs to preemptively add the client to the new factory without the client needing to be online immediately (the client can come online at <em>any</em> time within the dying period, unlike the non-covenants style where the client has to come at <em>one</em> of the specific times a channel is opened within the dying period).  However, this has the drawback that if the client actually <em>does</em> exit instead of going to the new factory, the LSP is forced to lock up its funds for the next active period, and since the client has left the LSP, will not be able to get a signature needed to reallocate funds inside the offchain mechanism, impacting neighboring clients in the tree (i.e. the <em>other</em> clients in the same tree cannot buy cheap liquidity offchain either, due to the LSP preemptively adding the client but the client exited the LSP and presumably wants nothing to do with the LSP or its service).</p>\n<p>The requirement to move funds regularly from old factories to new ones also provides a convenient cadence for charging fees for managing liquidity to the client.</p>\n<p>The longer the dying period, the more extra funds the LSP has to dedicate to the construction.  These funds need to earn, thus increasing the dying period requires increasing the fees the LSP charges to clients, due to expected return on investment.  This is a simple convenience-vs-cost consideration.</p>\n<p>To reduce the chance of a client having to fall back to unilateral exit, the LSP can offer a mutual exit where the client swaps funds inside the mechanism for onchain funds using standard HTLCs, i.e. a perfectly normal offchain-to-onchain swap.  This allows a client to exit to onchain without having to publish the unilateral exit; unilateral exits cause more UTXOs to be pushed onchain, which increases the cost on the LSP to manage onchain funds once the factory dies after its dying period.</p>\n<h1><a name=\"p-3197-practical-considerations-11\" class=\"anchor\" href=\"#p-3197-practical-considerations-11\"></a>Practical Considerations</h1>\n<p>Now that I have hopefully given you a conceptual grasp of the laddered timeout-tree-structured Decker-Wattenhofer channel factory construction, let us now turn to practical considerations for this mechanism.</p>\n<h2><a name=\"p-3197-why-take-the-l-12\" class=\"anchor\" href=\"#p-3197-why-take-the-l-12\"></a>Why Take The <code>L</code>?</h2>\n<p>In the proposal, each leaf has an output that is owned only by the LSP <code>L</code>, from which new inbound liquidity to clients can be dynamically allocated.</p>\n<p>This brings up the thought: can we remove the <code>L</code> output?</p>\n<p>For example, suppose that all leaves consist only of the channels. So <code>A</code> and <code>B</code> would have a leaf transaction that contains the channels <code>A &amp; L</code> and <code>B &amp; L</code>.</p>\n<p>Suppose that <code>A &amp; L</code> runs out of inbound liquidity towards <code>A</code>, but the channel <code>B &amp; L</code> has inbound liquidity. Then the LSP can move that liquidity from the channel with <code>B</code> to the channel with <code>A</code>.</p>\n<p>The problem here is that this is not incentive-compatible. <code>B</code> has no incentive to actually participate in the signing of the new state, because it loses something valuable: inbound liquidity!</p>\n<p>Suppose that <code>A</code> and <code>B</code> are both users with high volume of Lightning payments in both directions. If <code>B</code> signs off on the loss of inbound liquidity, simply because it had a spike of outgoing payments, and then later it gets a spike of incoming payments, then <code>B</code> has to buy more inbound liquidity from the LSP. If <code>A</code> has already used up the inbound liquidity it already got from that change, then the LSP has to go up the tree to get more liquidity from other clients. This requires more other clients to come online, which increases the chance that one of those clients cannot come online, forcing an expensive onchain fallback to get more inbound liquidity for <code>B</code>. Obviously, the higher expenses will be passed by the LSP to its client.</p>\n<p>Now, perhaps you might propose that the LSP can simply pay <code>B</code> for the inbound liquidity it loses.</p>\n<p>The problem with that is that the inbound liquidity was purchased by <code>B</code> from the LSP in the first place. The LSP paying <code>B</code> for the inbound liquidity towards <code>B</code> is effectively a refund of already-sold product. As you can imagine, a refund is always a bad customer interaction; as a seller of inbound liquidity, the LSP wants that ideally 100% of sold inbound liquidity remains sold and never refunded, just as any seller wants to never have to refund already-sold goods.</p>\n<p>In particular, if each unit of inbound liquidity has a price, and the price is the same for <code>A</code> and <code>B</code>, then any refund for the inbound liquidity coming from <code>B</code> would be the same price that <code>A</code> pays for the same inbound liquidity. This means that the LSP itself has no incentive to even set up this kind of mechanism, because it cannot earn from selling inbound liquidity to <code>A</code> if it has to refund the price of inbound liquidity of <code>B</code> for the same unit of inbound liquidity.</p>\n<p>If LSP pays <code>B</code> less than the price it charges for reselling that inbound liquidity to <code>A</code>, so that it can actually earn from the difference, then it forces <code>B</code> into a bad economic partnership. If <code>B</code> later needs to rebuy liquidity, then if the LSP charges the same, higher price, <code>B</code> effectively loses money in refunding its liquidity and then rebuying it later. This is simply a zero-sum game which none of the participants can win.</p>\n<p>Thus, the only way for the LSP to provide actual inbound liquidity is to lock up funds in an <code>L</code>-only output, effectively the “sales stock” of liquidity.</p>\n<p>The important part is that <code>B</code> would never participate in a scheme where it loses inbound liquidity.</p>\n<p>An alternative is for the LSP to <em><strong>not</strong></em> sell inbound liquidity towards clients; i.e. instead of the model “LSP sells inbound liquidity, charges 0 LN routing fees to clients” we use the model “the LSP charges non-0 LN routing fees to clients, and determines where to point its liquidity”.  The latter is less ideal, as the clients presumably have more information on when they need inbound liquidity; for instance, a merchant that has some sales promotion, or a new product on sale, can expect to have to need more inbound liquidity, and this information can be signalled by buying inbound liquidity explicitly from the LSP prior to the event occurring; the client can wait around for all fellow clients in its part of the tree to come online in that case.</p>\n<h2><a name=\"p-3197-incentivizing-onlineness-13\" class=\"anchor\" href=\"#p-3197-incentivizing-onlineness-13\"></a>Incentivizing Onlineness</h2>\n<p>Even with the separate <code>L</code> output that serves as the “inbound liquidity stock for sale”, as <code>B</code> is required to come online, <code>B</code> should still be compensated somehow.</p>\n<p>The most straightforward is that, for simply participating, <code>B</code> can be paid some small fraction of the price that the LSP charges for selling liquidity to <code>A</code>.</p>\n<p>Alternatively, the LSP can simply offer a small amount of free inbound liquidity to <code>B</code>. Both are largely equivalent, as inbound liquidity is valuable, but the advantage here is that <code>B</code> can pre-emptively get more inbound liquidity while both it and <code>A</code> are online. Later, <code>A</code> may fail to come online when <code>B</code> needs inbound liquidity, forcing <code>B</code> to fall back to expensive onchain operations to get inbound liquidity, so <code>B</code> may prefer to get a little free inbound liquidity now (when it is sure <code>A</code> is online) as opposed to later (when <code>A</code> might have gone offline).</p>\n<h2><a name=\"p-3197-client-grouping-14\" class=\"anchor\" href=\"#p-3197-client-grouping-14\"></a>Client Grouping</h2>\n<p>It is likely that some clients are powered off at some regularly daily schedule (e.g. local nighttime).</p>\n<p>The LSP can monitor the uptime of clients, and bin them according to what time of a 24-hour day they are most likely to be online. Then, when constructing trees for a new timeout-tree-structured Decker-Wattenhofer mechanism, the LSP can group clients with similar “most active” times together in the same leaf nodes and in adjacent leaf nodes.</p>\n<p>This makes it more likely that if any particular client needs to get inbound liquidity, other clients in the same leaf node are also online, and even if the leaf node runs out of <code>L</code>-only funds, nearby leaf nodes have clients that are also likely to be online.</p>\n<p>In particular, if an LSP has clients globally, grouping them by timezone would be helpful, as clients near each other by timezone are more likely to be simultaneously online as well.</p>\n<h2><a name=\"p-3197-arity-and-tree-structuring-decisions-15\" class=\"anchor\" href=\"#p-3197-arity-and-tree-structuring-decisions-15\"></a>Arity and Tree Structuring Decisions</h2>\n<p>The best arity for leaf nodes is 2, as this means that leaf nodes can be updated with only three online participants: the two clients on the leaf, and the LSP. This makes such operations more reliable.</p>\n<p>Kickoff nodes may also have an arity of 1. Since all outputs of a kickoff transaction <em><strong>MUST</strong></em> be spent if the kickoff transaction is spent, this reduces the number of affected clients if one client wants to unilaterally exit. This also reduces the number of clients that have to be awoken in case a leaf node has run out of <code>L</code>-only funds for funding liquidity.</p>\n<p>Unfortunately, low arity implies greater tree height:</p>\n<ul>\n<li>Greater tree height means more transactions published onchain in a unilateral exit case.</li>\n<li>Greater tree height means more <code>nSequence</code> relative locktime delays before funds can be recovered in a unilateral exit case.\n<ul>\n<li>The relative locktime delay involved also forces HTLCs terminating at the client to have their minimum final CLTV delta (<code>min_final_cltv_expiry_delta</code> in BOLT11) be higher by the largest possible <code>nSequence</code> delay along the path to their channel than what the client would deem “safe” for itself. Thus, this delay is very important to keep low, as this delay is also the worst case that an HTLC on the public network ends up locking funds on unresolved HTLCs, reducing public network capacity.</li>\n</ul>\n</li>\n</ul>\n<p>To mitigate these:</p>\n<ul>\n<li>The tree can have low arity near the leaves, then increase the arity when building nodes a few levels away from the leaves.\n<ul>\n<li>If a leaf update is unable to provide additional inbound liquidity to a client, then the LSP would need to “go up a level” and wake up more clients anyway.</li>\n<li>“Going up a level” means multiplying the number of clients that have to be online, proportionally to the node arity.</li>\n<li>If the group that needs to be awoken is big enough, the probability all of them come online is low enough that you could double or quadruple the size of that group with little impact -– the chances all of them are online is low enough that you would not bet on it anyway and would just fall back to onchain.</li>\n</ul>\n</li>\n<li>Beyond a few layers away from the leaves, we could entirely remove state transactions (i.e. those with decrementing <code>nSequence</code>s). In effect, it would be a root timeout-sig-tree that backs multiple timeout-tree-structured Decker-Wattenhofer mechanisms, which itself backs actual channels to clients.\n<ul>\n<li>Again, if the LSP has to actually “go up a level” by more than one or two state tx layers from the leaves, then the group of clients that need to be awoken can be large enough that it is very unlikely all of them are online anyway, so you may as well reduce the delays of unilateral delay by not having more than a few layers of state transactions.</li>\n<li>Transactions that are not state transactions do not have a relative timelock, thus would not cause additional time delays in exit.</li>\n</ul>\n</li>\n<li>The LSP can group together clients with high uptime and put them into higher-arity nodes.\n<ul>\n<li>Such clients would get better service (they would be grouped with other high-uptime clients which would be likely to be online as well when they need inbound liquidity) and cheaper and shorter unilateral exits (higher arity implies lower tree height implies less transactions on unilateral exit).</li>\n<li>Low-uptime and new clients would have to get more arity 2 and arity 1 nodes, increasing the cost of their unilateral exits, but this also gives better isolation against their sibling clients being offline.</li>\n</ul>\n</li>\n</ul>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-09-16T20:08:19.856Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 253,
  "reads": 25,
  "readers_count": 24,
  "score": 1290.0,
  "yours": false,
  "topic_id": 1143,
  "topic_slug": "superscalar-laddered-timeout-tree-structured-decker-wattenhofer-factories",
  "topic_title": "SuperScalar: Laddered Timeout-Tree-Structured Decker-Wattenhofer Factories",
  "topic_html_title": "SuperScalar: Laddered Timeout-Tree-Structured Decker-Wattenhofer Factories",
  "category_id": 7,
  "display_username": "ZmnSCPxj jxPCSnmZ",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Subject: SuperScalar: Laddered Timeout-Tree-Structured Decker-Wattenhofer Factories\n\n# Introduction\n\nWe introduce the LSP Last-Mile Problem:\n\n* New users receiving their first ever Bitcoins over the Lightning Network must pay for incoming liquidity.  \n  - The cost of blockchain operations to get that liquidity must be amortized across multiple new users to keep the cost of each one low.\n\nIn addition to the above problem, our solutions must also have the following constraints:\n\n* We must ensure that the LSP cannot steal funds, i.e. it is not sufficient to have one-honest-member security assumption, unless every end-user can be their own single honest member.  \n* We must do so without any blockchain consensus changes.  \n  - The Bitcoin blockchain has ossified in practice. Due to the scheduled halvening every 4 years causing a sudden increase in Bitcoin price, leading to a sudden increase in interest in Bitcoin, large batches of new users join the set of entities with an interest in Bitcoin consensus. As the previous batch becomes convinced of some consensus change, the new batch enters Bitcoin, which must itself be convinced of the same consensus change. If a consensus change cannot achieve practical consensus within a time shorter than a halvening period, it will not ever happen, thus leading to ossification in practice (smaller and more easily-digestible changes may still push through, but more complex changes, like covenants, will never reach consensus).  \n* We must be resilient against some or a few end-users being offline when the LSP has to reallocate funds.  \n  - As the number of users sharing a single UTXO increases, the probability of one or more of them being offline increases. Thus, when scaling to large numbers of end-users, resilience against some of the end-users not being able to come online is a necessity.  \n  - It turns out that software running on mobile phones can be made to come online via Android or iOS application notification mechanisms, thus in practice the onlineness of mobile clients can be reasonably high. Nevertheless, mobile phones may occassionally drop off network at times, so their uptime is still not as good as non-mobile devices. Thus, the mechanism should be resilient against a few users being offline.\n\nAll of the above constraints immediately rule out Ark and BitVM2 bridges. Both have a one-honest-member security assumption without covenants, and covenants will not achieve consensus in practice, as pointed out above (`OP_CTV` was largely finalized in 2020, and has not achieved consensus in 2024, thus will never achieve consensus due to exceeding the halvening period; `SIGHASH_NOINPUT` has even worse prognosis). Both can get around the one-honest-member assumption only if all end-users are simultaneously online at the moment at which an LSP needs to reallocate funds, which breaks the final constraint above.\n\nIn this writeup, I provide a construction, SuperScalar, which is effectively laddered timeout-tree-structured Decker-Wattenhofer channel factories.\n\n# The Ingredients\n\nFirst, I provide a hopefully gentle introduction to the three different components I combine to form this single construction:\n\n1. Decker-Wattenhofer decrementing-`nSequence` offchain mechanisms.  \n2. Timeout trees, particularly the variant that uses everyone-signs to emulate `OP_CTV`, which I call timeout-sig-trees.  \n3. Laddering.\n\nFeel free to skip sections you are already familiar with.\n\n## Decker-Wattenhofer\n\nThe Decker-Wattenhofer decrementing-`nSequence` mechanism is an offchain cryptocurrency system which allows for a set of interested users to get consensus on some state change, without requiring that each state change be published on the blockchain layer (hence \"offchain\"). This is like the Poon-Dryja mechanism, however with the following differences:\n\n* Number of parties:  \n  - Poon-Dryja is strictly two-party.  \n  - Decker-Wattenhofer decrementing-`nSequence` can have any number of parties.  \n* Number of state changes:  \n  - Poon-Dryja can theoretically have an infinite number of state changes (practical deployments, as in the BOLT specification of the Lightning Network, have a limit on number of state changes, but the limit is in the billions, thus practically unlimited).  \n  - Decker-Wattenhofer decrementing-`nSequence` have a small number of state changes. Single unchained constructions would be able to provide a small number of state changes each (less than 100, and practically, 4 or 2 per chained mechanism). The typical proposal is to chain multiple such constructions together, effectively multiplying the number of available state changes for each chained construction (e.g. chaining 3 constructions with 4 state changes each will get 4 x 4 x 4 \\= 64 state changes).  \n* Size and convenience of unilateral closure:  \n  - Poon-Dryja only requires a single commitment transaction for unilateral closure, as well as additional transactions to reclaim funds. The time delay until funds can be recovered is constant.  \n  - Decker-Wattenhofer decrementing-`nSequence` have one kickoff transaction to begin the unilateral closure process, and one delayed transaction per layer. Increasing the number of state changes by chaining multiple layers of this construction will increase the number of additional transactions, so that the blockspace is practically O(log N) where N is the number of state changes supported. Each layer transaction has varying time delay until funds can be recovered.\n\nBoth Decker-Wattenhofer and Poon-Dryja are implementable in current Bitcoin without consensus changes.\n\nLike Poon-Dryja, Decker-Wattenhofer decrementing-`nSequence` mechanisms have an onchain UTXO that serves as the \"funding outpoint\". The outpoint is a simple n-of-n multisignature of all signatories who sign off on state changes.\n\nFor a single-layer Decker-Wattenhofer decrementing-`nSequence` mechanism, there are two transactions:\n\n1. A \"kickoff\" transaction, spending the funding outpoint, and outputting to a n-of-n multisignature.  \n2. A \"state\" transaction, spending the output of the kickoff transaction, and which has an `nSequence` that requires a specific relative locktime. Its outputs are the state that is agreed upon by the consensus signatories.\n\nFor the initial state, the \"state\" transaction has an `nSequence` that is the maximum designed relative locktime. For instance, for a 4-state design, it would be reasonable to start with 432 blocks of relative delay.\n\nWhen the state is changed, and a new state is agreed upon by the signatories, a new state transaction spending the kickoff output is created, with a smaller `nSequence` relative delay. For example, for a 4-state design:\n\n| State Index  | Relative Locktime (Blocks) | Comment                             |\n|--------------|----------------------------|-------------------------------------|  \n| 0            | 432                        | Initial state                       |  \n| 1            | 288                        |                                     |  \n| 2            | 144                        |                                     |  \n| 3            | 0                          | Final; mechanism can only be closed |\n\nThus, it is called a \"decrementing-`nSequence`\" mechanism; each time a new state is ratified by the signatories, the new state transaction has a smaller `nSequence`, until it reaches an `nSequence` encoding 0\\.\n\nBecause the latest state has a lower relative locktime than any previous state, it can confirm earlier than earlier states. This mechanism ensures that, assuming the blockchain layer is not congested, the latest state is the one that gets confirmed in a unilateral exit case.\n\nThe difference in `nSequence` relative locktimes should be large enough that it is reasonable to assume that, even in congestion situations, the latest state can confirm before the previous state could potentially be confirmed. Thus, the example above uses a step of 144 blocks between states.\n\nA single such mechanism, as demonstrated above, has a very limited number of state changes before it reaches the \"final\" state and has to be closed. Decker-Wattenhofer thus practically recommends chaining multiple such mechanisms. The first mechanism in the chain has a single output, which is an n-of-n of the signatories, which serves as the input to the next mechanism, and so on. Only the last mechanism has the state transaction have multiple outputs, the actual final state of the funds in the mechanism.\n\nWhen chaining Decker-Wattenhofer mechanisms, only the \"state\" transactions need to be duplicated; the \"state\" transaction of the first in the chain serves as the \"kickoff\" transaction for the next mechanism in the chain. For example, if we chain 3 Decker-Wattenhofer mechanisms, we have a single \"kickoff\" transaction, plus 3 \"state\" transactions, for a total of 4 transactions for a unilateral close.\n\nIn effect, the \"state\" transaction of the previous mechanism is cut-through with the \"kickoff\" transaction of the next mechanism.\n\nChained Decker-Wattenhofer mechanisms work similarly to multi-digit countdown counters. Whenever a new state is ratified, the last chained mechanism \\--- the one furthest from the funding transaction \\--- gets decremented. However, if the last \"digit\" has counted down to 0, then the second-to-the-last one is decremented instead, and the last one is reset to the maximum `nSequence`. Similarly, if the second-to-the-last mechanism has counted down to 0, then the third-to-the-last is decremented and the succeeding mechanisms are reset to the maximum `nSequence`. And so on.\n\nIn effect, the last mechanism in the chain is the most likely to be changed whenever state is updated (it is always changed at each state update), while the first mechanism is the least likely to be changed at a state update.\n\n```\nInitial state\n                         nSequence        nSequence\n           +----+------+   +-----+------+   +-----+-----------+\nfunding -->|    |n-of-n|-->| 432 |n-of-n|-->| 432 |...state...|\n           +----+------+   +-----+------+   +-----+-----------+\n            kickoff tx       state tx          state tx\n\n======>\n                         nSequence        nSequence\n           +----+------+   +-----+------+   +-----+-----------+\nfunding -->|    |n-of-n|-->| 432 |n-of-n|-->| 288 |...state...|\n           +----+------+   +-----+------+   +-----+-----------+\n            kickoff tx       state tx          state tx\n\n======>\n                         nSequence        nSequence\n           +----+------+   +-----+------+   +-----+-----------+\nfunding -->|    |n-of-n|-->| 432 |n-of-n|-->| 144 |...state...|\n           +----+------+   +-----+------+   +-----+-----------+\n            kickoff tx       state tx          state tx\n\n======>\n                         nSequence        nSequence\n           +----+------+   +-----+------+   +-----+-----------+\nfunding -->|    |n-of-n|-->| 432 |n-of-n|-->|  0  |...state...|\n           +----+------+   +-----+------+   +-----+-----------+\n            kickoff tx       state tx          state tx\n\n======>\n                         nSequence        nSequence\n           +----+------+   +-----+------+   +-----+-----------+\nfunding -->|    |n-of-n|-->| 288 |n-of-n|-->| 432 |...state...|\n           +----+------+   +-----+------+   +-----+-----------+\n            kickoff tx       state tx          state tx\n```\n\n## Timeout Trees\n\nTimeout trees are a mechanism that combines `OP_CTV`\\-trees with a timeout.\n\nWithout `OP_CTV`, a variant can be created where the `OP_CTV` covenant is enforced by consensus signing of all participants. This variant (which I call timeout-sig-trees) is what I will focus on here. In addition, we consider the case where a singular LSP provides such a mechanism to its clients.\n\nIn timeout-sig-trees, an LSP `L` provides Lightning channels to a set of clients. A single confirmed onchain UTXO backs multiple channels to different clients.\n\nOn construction, the LSP creates a tree of transactions. Non-leaf nodes have outputs where the clients involved in the branch of that tree, plus the LSP, have an n-of-n multisignature. This is standard tree transaction structures, but timeout trees also add an alternative spending condition: the LSP can spend by itself after a particular timeout. The same alternative condition also exists on the funding outpoint.\n\nFor example, if the LSP `L` has 8 clients `A` to `H`, then it might form a timeout tree. The funding outpoint, which is confirmed onchain, would have the conditions:\n\n1. `A & B &`...`& H & L`  \n2. `L & CLTV`\n\nThen the tree would look like this:\n\n```\n                                              +--+---+\n                                              |  |A&L| LN channel\n                                            +>|  +---+\n                                            | |  |B&L| LN channel\n                            +--+----------+ | +--+---+\n                            |  |  (A&B&L) |-+ \n                            |  |or(L&CLTV)|   +--+---+\n                          +>|  +----------+   |  |C&L| LN channel\n          +--+----------+ | |  |  (C&D&L) |-->|  +---+\n          |  |(A&..&D&L)| | |  |or(L&CLTV)|   |  |D&L| LN channel\n          |  |or(L&CLTV)|-+ +--+----------+   +--+---+\nfunding-->|  +----------+\n          |  |(E&..&H&L)|-+ +--+----------+   +--+---+\n          |  |or(L&CLTV)| | |  |  (E&F&L) |   |  |E&L| LN channel\n          +--+----------+ | |  |or(L&CLTV)|-->|  +---+\n                          +>|  +----------+   |  |F&L| LN channel\n                            |  |  (G&H&L) |   +--+---+\n                            |  |or(L&CLTV)|-+\n                            +--+----------+ | +--+---+\n                                            | |  |G&L| LN channel\n                                            +>|  +---+\n                                              |  |H&L| LN channel\n                                              +--+---+\n```\n\nThe timeout condition forces all clients to come online before the timeout and exit the mechanism. Exit can be unilateral or with cooperation of the LSP.\n\nIn a cooperative exit, the client simply sends out all its funds in the channel hosted inside the timeout tree over Lightning, possibly using a swap service to get onchain funds, or to a new timeout tree with the same LSP, or to another LSP.\n\nA unilateral exit simply means publishing the path from the root to their Lightning channel output, then unilaterally exiting the Lightning channel (expected to be a Poon-Dryja) as well.\n\nThe advantage of using a tree is that unilateral exit is small; it is only O(log N) transactions for a single client to exit, and most of the other clients can remain in the tree. If not using a tree, then a single client performing a unilateral exit would cause all clients to perform unilateral exits.\n\nThe advantage of the timeout condition is that it encourages all clients to exit simultaneously, hopefully cooperatively, and the LSP only needs to perform a simple single-input transaction to recover the funds from the construction, via the `L & CLTV` spending condition on the funding outpoint. Even if some clients also perform unilateral exit, much of the funds can be recovered via the `L & CLTV` spending conditions on each intermediate output.\n\n## Laddering\n\nMany financial institutions offer a kind of financial contract wherein a depositor puts funds into a contract, and cannot withdraw, even partially, until some specific future date, at which point the depositor is given the original funds, plus an interest payment. The contract is also non-transferable. Such contracts are known by various names:\n\n* Certificate of Deposit (United States)  \n* Guaranteed Investment Certificates (Canada)  \n* Term Deposit or Time Deposit (other countries)\n\nSuch contracts are inflexible; as noted, it is impossible to withdraw or transfer the contract until the end of its term. However, savvy investors instead split up their investable funds into multiple such contracts, set up so that their termination dates are staggered by one month or one year to each other. This technique is called \"laddering\".\n\nFor example, an investor might have three such contracts, terminating in December 2024, December 2025, and December 2026\\. On December 2024, the first contract terminates, and the investor may decide to withdraw part of the funds and re-invest the remaining in a new contract that terminates on December 2027, or to add more funds to invest in the new contract, or to start closing the ladder by not starting a new contract.\n\nLaddering provides investors the ability to change the amount of investment, and to add or reduce their investment into these contracts, once a month or once a year, depending on the laddering. Thus, even though the base contracts are inflexible, laddering allows investors to regain a little bit of flexibility, while retaining the advantages of long-term certificates of deposit.\n\n# The SuperScalar Mechanism\n\nLaddered timeout-tree-structured Decker-Wattenhofer channel factories are simply the combination of the above three ingredients.\n\n## Timeout-tree-structured Decker-Wattenhofer\n\nFirst, let me demonstrate the combination of the first two ingredients; we shall add laddering in a separate subsection later.\n\nSuppose an LSP, `L` has 8 clients, `A` to `H`. The funding outpoint then has the following two alternative spend conditions:\n\n1. `A & B &`...`& H & L`  \n2. `L & CLTV`\n\nWhen setting up the mechanism, the LSP arrange the following transactions to be signed, with the funding transaction being an n-of-n of `A`..`H` and `L`:\n\n```\n                                                         nSequence\n                                                           +---+---+\n                                                           |   |A&L| LN channel\n                                                           |   +---+\n                                                       +-->|432|B&L| LN channel\n                                                       |   |   +---+\n                                                       |   |   | L |\n                                                       |   +---+---+\n                                                       |\n                                                       |   +---+---+\n                                                       |   |   |C&L| LN channel\n                                            +--+-----+ |   |   +---+\n                       nSequence            |  |A&B&L|-+ +>|432|D&L| LN channel\n                         +---+----------+ +>|  +-----+   | |   +---+\n                         |   |(A&..&D&L)| | |  |C&D&L|---+ |   | L |\n         +--+---------+  |   |or(L&CLTV)|-+ +--+-----+     +---+---+\nfunding->|  |A&...&H&L|->|432+----------+\n         +--+---------+  |   |(E&..&H&L)|-+ +--+-----+     +---+---+\n          kickoff tx     |   |or(L&CLTV)| | |  |E&F&L|---+ |   |E&L| LN channel\n                         +---+----------+ +>|  +-----+   | |   +---+\n                          state tx          |  |G&H&L|-+ +>|432|F&L| LN channel\n                                            +--+-----+ |   |   +---+\n                                             kickoff   |   |   | L |\n                                             tx        |   +---+---+\n                                                       |\n                                                       |   +---+---+\n                                                       |   |   |G&L| LN channel\n                                                       |   |   +---+\n                                                       +-->|432|H&L| LN channel\n                                                           |   +---+\n                                                           |   | L |\n                                                           +---+---+\n                                                            state tx\n```\n\nBasically, the rules for building the tree from a set of clients, using a leaf-to-root construction order, are:\n\n1. First, distribute the clients into leaf nodes, where multiple clients go into leaf nodes, according to arity (in the above example, arity is 2).  \n   - Their outputs are a channel between the LSP `L` and the respective client, and also an additional fund that is owned only by `L`.  \n2. Leaf nodes are always state transactions.  \n   - They have decrementing `nSequence`.  \n3. Create parent nodes to the trees being built, depending on the desired arity.  \n   - Parents of state transactions are kickoff transactions.  \n     - Their outputs are simply the owners in the respective child in an n-of-n.  \n   - Parents of kickoff transactions are state transactions.  \n     - State transaction outputs have an `or (L & CLTV)` alternate condition in addition to the n-of-n of the owners in that branch.  \n     - State transaction inputs have decrementing `nSequence`.  \n4. Repeat 3 until you get a single root node.  \n5. If the resulting single root node is a state transaction, add a single-input single-output kickoff transaction. Otherwise, just use the root directly as the first kickoff transaction.  \n   - This rule is true for the above example where the tree arity is 2 and the number of clients is 8\\.  \n   - If the number of clients in the example were increased to 16, then the number of transactions needed in a unilateral close would still be 4 transactions, plus the Poon-Dryja unilateral close transaction.\n\nThe reason for alternating kickoff transaction layers of the tree with state transaction layers of the tree will be given in a later subsection.\n\n## `A` Needs Inbound Liquidity, Badly\\!\n\nSuppose `A` runs out of inbound liquidity in the `A` and `L` channel that is funded in the above tree structure. What can the LSP `L` do to provide inbound liquidity to `A`, without having to drop onchain?\n\nThe LSP can wake up `B` \\--- and only `B` (presumably `A` is already awake if it is requesting for more inbound liquidity) \\--- in order to update the leaf node containing the `A&L` and `B&L` channels. Because the leaf node only contains funds owned by `A`, `B`, and `L`, only those three participants need to be online; thus, the mechanism is more resilient to some participants not being online at the time that `A` needs additional inbound liquidity.\n\nOf course, if `B` cannot come online, the LSP does have to fall back to alternate methods, such as onchain. This can lead to onchain fees needing to be paid, which the LSP would pass on to `A`.\n\nSuppose `B` does come online. In that case, `L` can move funds from the `L`\\-only output to the `A & L` channel, without requiring that clients `C` to `H` be online.\n\nOf course, it is possible that the `L`\\-only output has been depleted, or the final state change (i.e. `nSequence = 0`) has been reached. In that case, the LSP can move up the tree to the next higher state transaction, waking up more clients in an effort to move funds from the other `L`\\-only outputs to `A`, and reset the `nSequence` of the nodes until the leaf nodes. This increases the number of clients that need to be online at that time, but does not necessarily require that *all* clients are online.\n\nIn effect, whenever some client runs out of inbound liquidity, the leafmost state transactions are the ones that are more likely to be updated. However, if the `L`\\-only outputs have been depleted, then earlier state transactions would also need to be updated, to allow the LSP `L` to move liquidity from other leaf nodes to `A`.\n\n## Tank, `A` Needs An Exit\\!\n\nSuppose that `A` decides to unilaterally exit. This may occur for any number of reasons; the important thing is that any arbitrary client of the LSP is capable of performing unilateral exit, and for the effect of unilateral exit to be minimized. This assurance prevents the LSP from being able to rug clients, and assures their sovereignty and control of their money.\n\nIn order for `A` to exit, it must first have the `A & L` channel funding outpoint confirmed, then finally exit the `A & L` channel using standard Poon-Dryja unilateral exit. Thus, `A` must publish the path to its channel below:\n\n```\n                                                         nSequence\n                                                           +---+---+\n                                                           |   |A&L| LN channel\n                                                           |   +---+\n                                                       +-->|432|B&L| LN channel\n                                                       |   |   +---+\n                                                       |   |   | L |\n                                                       |   +---+---+\n                                                       |    state tx\n                                                       |\n                                                       |\n                                            +--+-----+ |\n                       nSequence            |  |A&B&L|-+\n                         +---+----------+ +>|  +-----+\n                         |   |(A&..&D&L)| | |  |C&D&L|\n         +--+---------+  |   |or(L&CLTV)|-+ +--+-----+\nfunding->|  |A&...&H&L|->|432+----------+    kickoff\n         +--+---------+  |   |(E&..&H&L)|    tx\n          kickoff tx     |   |or(L&CLTV)|\n                         +---+----------+\n                          state tx\n```\n\nHowever, we should also take note that any outputs of a confirmed kickoff transaction ***MUST*** be consumed by a state transaction that gets confirmed. This is because state transactions with smaller `nSequence` relative delays need to be confirmed first before those with larger `nSequence` relative delays, or else the Decker-Wattenhofer mechanism gets broken (older states may get confirmed instead).\n\nThus, in the case that `A` wants to exit, not only are the clients on the same leaf transaction (`B`) are inadvertently exited, but also sibling clients on the next higher level, `C` and `D`.\n\n```\n                                                         nSequence\n                                                           +---+---+\n                                                           |   |A&L| LN channel\n                                                           |   +---+\n                                                       +-->|432|B&L| LN channel\n                                                       |   |   +---+\n                                                       |   |   | L |\n                                                       |   +---+---+\n                                                       |\n                                                       |   +---+---+\n                                                       |   |   |C&L| LN channel\n                                            +--+-----+ |   |   +---+\n                       nSequence            |  |A&B&L|-+ +>|432|D&L| LN channel\n                         +---+----------+ +>|  +-----+   | |   +---+\n                         |   |(A&..&D&L)| | |  |C&D&L|---+ |   | L |\n         +--+---------+  |   |or(L&CLTV)|-+ +--+-----+     +---+---+\nfunding->|  |A&...&H&L|->|432+----------+    kickoff        state tx\n         +--+---------+  |   |(E&..&H&L)|    tx\n          kickoff tx     |   |or(L&CLTV)|\n                         +---+----------+\n                          state tx\n```\n\nThis also explains why our layers of nodes need to alternate between \"state\" transactions and \"kickoff\" transactions, unlike the plain Decker-Wattenhofer where only the very first transaction is the \"kickoff\". If we imitated that in our scheme, then if any single client needed to exit, all the downstream state transactions, which have varying `nSequence` relative delays, ***MUST*** be published also, or else the Decker-Wattenhofer mechanisms risks being broken. The layers of \"kickoff\" transactions serve as a backstop, ensuring that a single participant doing unilateral exit only publishes O(log N) transactions, and not the entire O(N) tree.\n\nThis is also the reason why the outputs of kickoff transactions do not need the timeout branch `L & CLTV`. A kickoff transaction output ***MUST*** be consumed by the latest state transaction for that output, and the state transactions would have the timeout branch anyway.\n\nIn the above example, `B`, `C`, and `D` can still transact HTLCs on their respective channels, but can no longer cheaply purchase additional inbound liquidity from `L`. Instead, `L` would need to splice in additional inbound liquidity onchain, which would be more expensive. (i.e. a single participant exiting does not cause *all* participants to exit; it still causes *some* other participants to partially exit, in that their channels remain open, but the ability to cheaply get inbound is lost)\n\nHowever, the remaining clients `E` through `H` would still be able to purchase cheap inbound liquidity from inside the mechanism, as their part of the tree is not yet published onchain and can still be updated offchain. In addition, once the timeout period ends and the clients `E` through `H` have performed a cooperative exit over the Lightning Network (and have no more in-Lightning funds in their respective channels) then `L` can reap their output on the state transaction via the `L & CLTV` branch, in order to recycle those funds.\n\n## Laddering\n\nI now add the third ingredient.\n\nFrom the point of view of the LSP `L`, the above mechanism is an investment. The hope of the LSP `L` is that it can earn a return on this investment, from various means, including:\n\n* Lightning Network routing fees.  \n* Selling of cheaper offchain liquidity.  \n* Fees for maintenance of the overall mechanism.\n\nIn addition, because of the timeout branches, the LSP cannot easily recover its funds until the end of the term.\n\nThus, a single timeout-tree-structured Decker-Wattenhofer mechanism is very much like a term deposit, from the point of view of the LSP.\n\nAnd as I pointed out earlier, savvy investors use laddering of multiple term deposit contracts in order to get a little more flexibility in how they allocate their funds.\n\nThe LSP itself can run multiple timeout-tree-structured Decker-Wattenhofer mechanisms, with different sets of clients, and with overlapping terms, as in a ladder of term deposits in traditional finance. As the term of one mechanism ends, the LSP can start a new mechanism, inviting the clients in the terminating mechanism to transfer their funds to the new mechanism, including charges for the transfer. Then the LSP can recover the funds from the terminating mechanism via the timeout branch, onchain. The LSP gets earnings from routing fees, selling offchain liquidity, and the privelege of transferring to a new mechanism, and those earnings remain in Lightning-locked funds.\n\nFor example, the LSP can run 30 such mechanisms, all expiring on different days. When one of the mechanisms is about to expire, the LSP can invite the clients on that mechanism into a new mechanism. The LSP funds the new mechanism from the mechanism that expires today, creating a new 30-day mechanism. Then, the clients can move their funds from the dying mechanism to the new mechanism. Once all clients have exited the dying mechanism, on the completion of the term, the LSP can simply claim the entire UTXO, resulting in a single output being spent.\n\nIn the concrete example below, the LSP has a ladder of 9 timeout-tree-structured Decker-Wattenhofer factories.  Each ladder has an \"active period\" of 7 days, and a \"dying period\" of 2 days.  During the dying period, clients can join one of the 2 factories built on the 2 days of the dying period, and transfer their funds to a new channel inside the new factory.  This allows clients a little leeway; if they miss the first day they can transfer, they have another chance on the succeeding day.  In actual deployments, I would mildly suggest an active period of 30 days and a dying period of 3 days; an LSP would then need to maintain 33 different factories at any time.  Ideally, there would be a single 1-input 1-output transaction per day, although if a client never comes online, the LSP would need to publish the path to its output, which increases the number of transactions needed onchain.\n\n```\nLegend: ===== Active Period\n        ::::: Dying Period\n\nDay | 01 | 02 | 03 | 04 | 05 | 06 | 07 | 08 | 09 | 10 | 11 | 12 | 13 | 14 | 15 | 16\n       ===================================::::::::::   <---- each of this a factory\n            ===================================::::::::::\n                 ===================================::::::::::\n                      ===================================::::::::::\n                           ===================================::::::::::\n                                ===================================::::::::::\n                                     ===================================::::::::::\n                                          ===================================::::::::::\n               Client can move            ^    ===================================::::::::::\n              funds from first -----------+----^    ===================================::::::::::\n             factory to either of                   ^\n                these two new                LSP uses the funds of the\n                 factories                       first factory to\n                                                build this factory\n```\n\nUnfortunately, due to a lack of covenants, clients need to come online on the specific times that the LSP is constructing the new factory.  If they miss the exact time, they need to try on the next day of the dying period; if they miss the last day of the dying period they ***MUST*** exit the mechanism, with all the costs implied by the exit.  `OP_CTV` would allow LSPs to preemptively add the client to the new factory without the client needing to be online immediately (the client can come online at *any* time within the dying period, unlike the non-covenants style where the client has to come at *one* of the specific times a channel is opened within the dying period).  However, this has the drawback that if the client actually *does* exit instead of going to the new factory, the LSP is forced to lock up its funds for the next active period, and since the client has left the LSP, will not be able to get a signature needed to reallocate funds inside the offchain mechanism, impacting neighboring clients in the tree (i.e. the *other* clients in the same tree cannot buy cheap liquidity offchain either, due to the LSP preemptively adding the client but the client exited the LSP and presumably wants nothing to do with the LSP or its service).\n\nThe requirement to move funds regularly from old factories to new ones also provides a convenient cadence for charging fees for managing liquidity to the client.\n\nThe longer the dying period, the more extra funds the LSP has to dedicate to the construction.  These funds need to earn, thus increasing the dying period requires increasing the fees the LSP charges to clients, due to expected return on investment.  This is a simple convenience-vs-cost consideration.\n\nTo reduce the chance of a client having to fall back to unilateral exit, the LSP can offer a mutual exit where the client swaps funds inside the mechanism for onchain funds using standard HTLCs, i.e. a perfectly normal offchain-to-onchain swap.  This allows a client to exit to onchain without having to publish the unilateral exit; unilateral exits cause more UTXOs to be pushed onchain, which increases the cost on the LSP to manage onchain funds once the factory dies after its dying period.\n\n# Practical Considerations\n\nNow that I have hopefully given you a conceptual grasp of the laddered timeout-tree-structured Decker-Wattenhofer channel factory construction, let us now turn to practical considerations for this mechanism.\n\n## Why Take The `L`?\n\nIn the proposal, each leaf has an output that is owned only by the LSP `L`, from which new inbound liquidity to clients can be dynamically allocated.\n\nThis brings up the thought: can we remove the `L` output?\n\nFor example, suppose that all leaves consist only of the channels. So `A` and `B` would have a leaf transaction that contains the channels `A & L` and `B & L`.\n\nSuppose that `A & L` runs out of inbound liquidity towards `A`, but the channel `B & L` has inbound liquidity. Then the LSP can move that liquidity from the channel with `B` to the channel with `A`.\n\nThe problem here is that this is not incentive-compatible. `B` has no incentive to actually participate in the signing of the new state, because it loses something valuable: inbound liquidity\\!\n\nSuppose that `A` and `B` are both users with high volume of Lightning payments in both directions. If `B` signs off on the loss of inbound liquidity, simply because it had a spike of outgoing payments, and then later it gets a spike of incoming payments, then `B` has to buy more inbound liquidity from the LSP. If `A` has already used up the inbound liquidity it already got from that change, then the LSP has to go up the tree to get more liquidity from other clients. This requires more other clients to come online, which increases the chance that one of those clients cannot come online, forcing an expensive onchain fallback to get more inbound liquidity for `B`. Obviously, the higher expenses will be passed by the LSP to its client.\n\nNow, perhaps you might propose that the LSP can simply pay `B` for the inbound liquidity it loses.\n\nThe problem with that is that the inbound liquidity was purchased by `B` from the LSP in the first place. The LSP paying `B` for the inbound liquidity towards `B` is effectively a refund of already-sold product. As you can imagine, a refund is always a bad customer interaction; as a seller of inbound liquidity, the LSP wants that ideally 100% of sold inbound liquidity remains sold and never refunded, just as any seller wants to never have to refund already-sold goods.\n\nIn particular, if each unit of inbound liquidity has a price, and the price is the same for `A` and `B`, then any refund for the inbound liquidity coming from `B` would be the same price that `A` pays for the same inbound liquidity. This means that the LSP itself has no incentive to even set up this kind of mechanism, because it cannot earn from selling inbound liquidity to `A` if it has to refund the price of inbound liquidity of `B` for the same unit of inbound liquidity.\n\nIf LSP pays `B` less than the price it charges for reselling that inbound liquidity to `A`, so that it can actually earn from the difference, then it forces `B` into a bad economic partnership. If `B` later needs to rebuy liquidity, then if the LSP charges the same, higher price, `B` effectively loses money in refunding its liquidity and then rebuying it later. This is simply a zero-sum game which none of the participants can win.\n\nThus, the only way for the LSP to provide actual inbound liquidity is to lock up funds in an `L`\\-only output, effectively the \"sales stock\" of liquidity.\n\nThe important part is that `B` would never participate in a scheme where it loses inbound liquidity.\n\nAn alternative is for the LSP to ***not*** sell inbound liquidity towards clients; i.e. instead of the model \"LSP sells inbound liquidity, charges 0 LN routing fees to clients\" we use the model \"the LSP charges non-0 LN routing fees to clients, and determines where to point its liquidity\".  The latter is less ideal, as the clients presumably have more information on when they need inbound liquidity; for instance, a merchant that has some sales promotion, or a new product on sale, can expect to have to need more inbound liquidity, and this information can be signalled by buying inbound liquidity explicitly from the LSP prior to the event occurring; the client can wait around for all fellow clients in its part of the tree to come online in that case.\n\n## Incentivizing Onlineness\n\nEven with the separate `L` output that serves as the \"inbound liquidity stock for sale\", as `B` is required to come online, `B` should still be compensated somehow.\n\nThe most straightforward is that, for simply participating, `B` can be paid some small fraction of the price that the LSP charges for selling liquidity to `A`.\n\nAlternatively, the LSP can simply offer a small amount of free inbound liquidity to `B`. Both are largely equivalent, as inbound liquidity is valuable, but the advantage here is that `B` can pre-emptively get more inbound liquidity while both it and `A` are online. Later, `A` may fail to come online when `B` needs inbound liquidity, forcing `B` to fall back to expensive onchain operations to get inbound liquidity, so `B` may prefer to get a little free inbound liquidity now (when it is sure `A` is online) as opposed to later (when `A` might have gone offline).\n\n## Client Grouping\n\nIt is likely that some clients are powered off at some regularly daily schedule (e.g. local nighttime).\n\nThe LSP can monitor the uptime of clients, and bin them according to what time of a 24-hour day they are most likely to be online. Then, when constructing trees for a new timeout-tree-structured Decker-Wattenhofer mechanism, the LSP can group clients with similar \"most active\" times together in the same leaf nodes and in adjacent leaf nodes.\n\nThis makes it more likely that if any particular client needs to get inbound liquidity, other clients in the same leaf node are also online, and even if the leaf node runs out of `L`\\-only funds, nearby leaf nodes have clients that are also likely to be online.\n\nIn particular, if an LSP has clients globally, grouping them by timezone would be helpful, as clients near each other by timezone are more likely to be simultaneously online as well.\n\n## Arity and Tree Structuring Decisions\n\nThe best arity for leaf nodes is 2, as this means that leaf nodes can be updated with only three online participants: the two clients on the leaf, and the LSP. This makes such operations more reliable.\n\nKickoff nodes may also have an arity of 1. Since all outputs of a kickoff transaction ***MUST*** be spent if the kickoff transaction is spent, this reduces the number of affected clients if one client wants to unilaterally exit. This also reduces the number of clients that have to be awoken in case a leaf node has run out of `L`\\-only funds for funding liquidity.\n\nUnfortunately, low arity implies greater tree height:\n\n* Greater tree height means more transactions published onchain in a unilateral exit case.  \n* Greater tree height means more `nSequence` relative locktime delays before funds can be recovered in a unilateral exit case.  \n  - The relative locktime delay involved also forces HTLCs terminating at the client to have their minimum final CLTV delta (`min_final_cltv_expiry_delta` in BOLT11) be higher by the largest possible `nSequence` delay along the path to their channel than what the client would deem \"safe\" for itself. Thus, this delay is very important to keep low, as this delay is also the worst case that an HTLC on the public network ends up locking funds on unresolved HTLCs, reducing public network capacity.\n\nTo mitigate these:\n\n* The tree can have low arity near the leaves, then increase the arity when building nodes a few levels away from the leaves.  \n  - If a leaf update is unable to provide additional inbound liquidity to a client, then the LSP would need to \"go up a level\" and wake up more clients anyway.  \n  - \"Going up a level\" means multiplying the number of clients that have to be online, proportionally to the node arity.  \n  - If the group that needs to be awoken is big enough, the probability all of them come online is low enough that you could double or quadruple the size of that group with little impact \\--- the chances all of them are online is low enough that you would not bet on it anyway and would just fall back to onchain.  \n* Beyond a few layers away from the leaves, we could entirely remove state transactions (i.e. those with decrementing `nSequence`s). In effect, it would be a root timeout-sig-tree that backs multiple timeout-tree-structured Decker-Wattenhofer mechanisms, which itself backs actual channels to clients.  \n  - Again, if the LSP has to actually \"go up a level\" by more than one or two state tx layers from the leaves, then the group of clients that need to be awoken can be large enough that it is very unlikely all of them are online anyway, so you may as well reduce the delays of unilateral delay by not having more than a few layers of state transactions.  \n  - Transactions that are not state transactions do not have a relative timelock, thus would not cause additional time delays in exit.  \n* The LSP can group together clients with high uptime and put them into higher-arity nodes.  \n  - Such clients would get better service (they would be grouped with other high-uptime clients which would be likely to be online as well when they need inbound liquidity) and cheaper and shorter unilateral exits (higher arity implies lower tree height implies less transactions on unilateral exit).  \n  - Low-uptime and new clients would have to get more arity 2 and arity 1 nodes, increasing the cost of their unilateral exits, but this also gives better isolation against their sibling clients being offline.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 104,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    },
    {
      "id": "clap",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false
}