{
  "id": 3185,
  "name": "",
  "username": "andyschroder",
  "avatar_template": "/letter_avatar_proxy/v4/letter/a/c57346/{size}.png",
  "created_at": "2024-09-14T07:01:38.506Z",
  "cooked": "<h1><a name=\"p-3185-overview-1\" class=\"anchor\" href=\"#p-3185-overview-1\"></a>Overview</h1>\n<p>I have an idea for devices to authorize payments from their remote online node while the device authorizing the payment has no direct internet connection. The receiver needs their node to be online though. I think we would need a slight adjustment to the BOLT12 <code>invoice</code> for this approach to be secure.</p>\n<p>I’d appreciate any thoughts and criticism you may have!</p>\n<h1><a name=\"p-3185-consider-this-scenario-2\" class=\"anchor\" href=\"#p-3185-consider-this-scenario-2\"></a>Consider this scenario</h1>\n<ol>\n<li>Buyer is at home with their phone phone connected to the internet (say it is running a Zeus wallet connected to a remote node).</li>\n<li>Buyer requests many <code>invreq_payer_id</code> and <code>invreq_paths</code> to be pre-computed on the node and stores them on the phone along with the secret keys corresponding to all of the <code>invreq_payer_id</code>. Each <code>invreq_payer_id</code> is assigned a validity time and budget and can be manually revoked later (in case the phone gets stolen).</li>\n<li>Buyer leaves home with their phone.</li>\n<li>Buyer’s node remains at home connected to the internet.</li>\n<li>Buyer arrives in a foreign land and can no longer connect to the internet.</li>\n<li>Buyer gets hungry</li>\n<li>Buyer finds a seller of food.</li>\n<li>Buyer needs to make payment for the food.</li>\n<li>Seller’s point of sale device wants to accept payment and has an internet connection.</li>\n<li>Buyer’s node back at home still has an internet connection.</li>\n<li>Seller’s point of sale provides a BOLT12 <code>offer</code> over NFC or QR.</li>\n<li>Buyer’s device reads the <code>offer</code> and responds with a signed <code>invoice_request</code> over NFC, QR, or bluetooth using some of the <code>invreq_payer_id</code> and <code>invreq_paths</code> it pre-computed before leaving home. It ignores the <code>offer_paths</code> or <code>offer_issuer_id</code> fields of the offer since it is not sending the reply as an onion message. It also sends a <code>reply_path</code> for sending an <code>invoice</code> back as an onion message.</li>\n<li>Seller’s point of sale device receives the <code>invoice_request</code>.</li>\n<li>Seller’s point of sale device responds with an onion message <code>invoice</code> back to the buyer’s node over the internet.</li>\n<li>Buyer’s node back at home receives the onion message <code>invoice</code> and pays the <code>invoice</code>.</li>\n<li>Seller’s point of sale device receives the payment and seller provides food.</li>\n<li>Buyer eats.</li>\n</ol>\n<h1><a name=\"p-3185-changes-to-bolt12-needed-3\" class=\"anchor\" href=\"#p-3185-changes-to-bolt12-needed-3\"></a>Changes to BOLT12 needed</h1>\n<p>The main flaw I see here is that when the buyer’s node receives the invoice, they have no way to check the <code>invoice</code> matches the <code>invoice_request</code> they authorized. In BOLT12, it seems to be the sender’s job to check all the fields in the <code>invoice</code> that they match their original <code>invoice_request</code> before paying. Could the signature in field <code>240</code> in the <code>invoice_request</code> be copied over to the <code>invoice</code> to field <code>239</code> so that the payer can verify they trust the invoice they received? It seems like this could also add to a lot of scalability and performance advantages for node implementations because they won’t have to keep track of all the outstanding <code>invoice_requests</code> that they have sent out (and periodically garbage collect them), they will just have to keep a list of <code>invreq_payer_id</code>. The logic here is that the sender’s node should be able to trust the signature from the <code>invreq_payer_id</code> it pre-generated for the buyer before the buyer went offline.</p>\n<h1><a name=\"p-3185-workflow-advantages-4\" class=\"anchor\" href=\"#p-3185-workflow-advantages-4\"></a>Workflow Advantages</h1>\n<ul>\n<li>Buyer/Sender does not need to be online. Seller does not need to provide a general purpose internet connection to its customers.</li>\n<li>Sender privacy is maintained.</li>\n<li>Seems very simple, may be able to be baked into a thin 85.6 mm × 53.98 mm smart card and not even need a phone.</li>\n<li>Could work with all point of sale devices and wallets.</li>\n<li>No webserver or SSL needed.</li>\n<li>Could be much more secure than alternatives such as <a href=\"https://github.com/theDavidCoen/LNURL-withdrawPOS\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - theDavidCoen/LNURL-withdrawPOS: A reference flow for open source implementations of POS devices able to read LNURL-withdraw links via NFC</a> .</li>\n</ul>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-09-14T07:01:38.506Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 53,
  "reads": 14,
  "readers_count": 13,
  "score": 237.4,
  "yours": false,
  "topic_id": 1134,
  "topic_slug": "privately-sending-payments-while-offline-with-bolt12",
  "topic_title": "Privately sending payments while offline with BOLT12",
  "topic_html_title": "Privately sending payments while offline with BOLT12",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "# Overview\n\nI have an idea for devices to authorize payments from their remote online node while the device authorizing the payment has no direct internet connection. The receiver needs their node to be online though. I think we would need a slight adjustment to the BOLT12 `invoice` for this approach to be secure.\n\nI'd appreciate any thoughts and criticism you may have!\n\n# Consider this scenario\n\n1. Buyer is at home with their phone phone connected to the internet (say it is running a Zeus wallet connected to a remote node).\n2. Buyer requests many `invreq_payer_id` and `invreq_paths` to be pre-computed on the node and stores them on the phone along with the secret keys corresponding to all of the `invreq_payer_id`. Each `invreq_payer_id` is assigned a validity time and budget and can be manually revoked later (in case the phone gets stolen).\n3. Buyer leaves home with their phone.\n4. Buyer's node remains at home connected to the internet.\n5. Buyer arrives in a foreign land and can no longer connect to the internet.\n6. Buyer gets hungry\n7. Buyer finds a seller of food.\n8. Buyer needs to make payment for the food.\n9. Seller's point of sale device wants to accept payment and has an internet connection.\n10. Buyer's node back at home still has an internet connection.\n11. Seller's point of sale provides a BOLT12 `offer` over NFC or QR.\n12. Buyer's device reads the `offer` and responds with a signed `invoice_request` over NFC, QR, or bluetooth using some of the `invreq_payer_id` and `invreq_paths` it pre-computed before leaving home. It ignores the `offer_paths` or `offer_issuer_id` fields of the offer since it is not sending the reply as an onion message. It also sends a `reply_path` for sending an `invoice` back as an onion message.\n13. Seller's point of sale device receives the `invoice_request`.\n14. Seller's point of sale device responds with an onion message `invoice` back to the buyer's node over the internet.\n15. Buyer's node back at home receives the onion message `invoice` and pays the `invoice`.\n16. Seller's point of sale device receives the payment and seller provides food.\n17. Buyer eats.\n\n\n# Changes to BOLT12 needed\n\nThe main flaw I see here is that when the buyer's node receives the invoice, they have no way to check the `invoice` matches the `invoice_request` they authorized. In BOLT12, it seems to be the sender's job to check all the fields in the `invoice` that they match their original `invoice_request` before paying. Could the signature in field `240` in the `invoice_request` be copied over to the `invoice` to field `239` so that the payer can verify they trust the invoice they received? It seems like this could also add to a lot of scalability and performance advantages for node implementations because they won't have to keep track of all the outstanding `invoice_requests` that they have sent out (and periodically garbage collect them), they will just have to keep a list of `invreq_payer_id`. The logic here is that the sender's node should be able to trust the signature from the `invreq_payer_id` it pre-generated for the buyer before the buyer went offline.\n\n\n\n# Workflow Advantages\n\n- Buyer/Sender does not need to be online. Seller does not need to provide a general purpose internet connection to its customers.\n- Sender privacy is maintained.\n- Seems very simple, may be able to be baked into a thin 85.6 mm × 53.98 mm smart card and not even need a phone.\n- Could work with all point of sale devices and wallets.\n- No webserver or SSL needed.\n- Could be much more secure than alternatives such as https://github.com/theDavidCoen/LNURL-withdrawPOS .",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 532,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}