{
  "id": 6208,
  "name": "ZmnSCPxj jxPCSnmZ",
  "username": "ZmnSCPxj",
  "avatar_template": "/letter_avatar_proxy/v4/letter/z/ee7513/{size}.png",
  "created_at": "2025-11-09T23:15:13.002Z",
  "cooked": "<blockquote>\n<p>then such a network would be a great testing ground for new features, uses, services, etc – basically anything for which bitcoiners may have demand for, but for which mainnet bitcoin is not suitable.</p>\n</blockquote>\n<p>IMO if a feature cannot get into mainnet Bitcoin anyway, it is largely pointless to fantasize about it or “test” it.  First we have to demonstrate that Bitcoin has <em><strong>not</strong></em> ossified yet; then there is non-zero value in having a testing ground (and more specifically, <em>another</em> testing ground).</p>\n<blockquote>\n<p>Yet, it is important to remember that many of the arguments we may come up with for why there is no value here, are almost identical to what could have been said about bitcoin itself</p>\n</blockquote>\n<p>The big advantage of Bitcoin was that it existed prior to any Bitcoin existing, and for much of its early days, people involved in it were doing FAFO on what was basically valueless tokens.  Nowadays you have to somehow displace the position of Bitcoin.</p>\n<p>It appears to be non-obvious that when the whitepaper says “longest chain of proof-of-work wins” it cuts across even incompatible rules and so-called “altcoins”; there can only be really one Bitcoin, at least in the local space (dunno about spaces distant enough that even speed-of-light transmission has massive latency).</p>\n<p>With that said — it would theoretically be possible that miners of Bitcoin can follow additional rules that they impose on themselves and some certain other participants in some sub-network, but which they do not impose on participants outside of the sub-network (but which are still participants in the existing public Bitcoin mining network).  This is in principle something like a “softer” version of a softfork (“softerfork” tightening of rules on self and sub-network of the entire network, but not on the network as a whole, compared to “softfork” tightening of rules on the entire network), and such a “softerfork” would probably be able to implement what you have in mind (i.e. Bitcoin blocks of miners participating in this p2share sub-network commit to an extra non-Bitcoin block that transacts a different currency, the “share”, that has different semantics).</p>",
  "post_number": 8,
  "post_type": 1,
  "posts_count": 10,
  "updated_at": "2025-11-09T23:15:13.002Z",
  "reply_count": 1,
  "reply_to_post_number": 7,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 10,
  "readers_count": 9,
  "score": 7.0,
  "yours": false,
  "topic_id": 2093,
  "topic_slug": "p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner",
  "topic_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "topic_html_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "category_id": 7,
  "display_username": "ZmnSCPxj jxPCSnmZ",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 125,
    "username": "VzxPLnHqr",
    "name": "VzxPLnHqr",
    "avatar_template": "/user_avatar/delvingbitcoin.org/vzxplnhqr/{size}/121_2.png"
  },
  "bookmarked": false,
  "raw": "> then such a network would be a great testing ground for new features, uses, services, etc – basically anything for which bitcoiners may have demand for, but for which mainnet bitcoin is not suitable.\n\nIMO if a feature cannot get into mainnet Bitcoin anyway, it is largely pointless to fantasize about it or \"test\" it.  First we have to demonstrate that Bitcoin has ***not*** ossified yet; then there is non-zero value in having a testing ground (and more specifically, *another* testing ground).\n\n> Yet, it is important to remember that many of the arguments we may come up with for why there is no value here, are almost identical to what could have been said about bitcoin itself\n\nThe big advantage of Bitcoin was that it existed prior to any Bitcoin existing, and for much of its early days, people involved in it were doing FAFO on what was basically valueless tokens.  Nowadays you have to somehow displace the position of Bitcoin.\n\nIt appears to be non-obvious that when the whitepaper says \"longest chain of proof-of-work wins\" it cuts across even incompatible rules and so-called \"altcoins\"; there can only be really one Bitcoin, at least in the local space (dunno about spaces distant enough that even speed-of-light transmission has massive latency).\n\nWith that said --- it would theoretically be possible that miners of Bitcoin can follow additional rules that they impose on themselves and some certain other participants in some sub-network, but which they do not impose on participants outside of the sub-network (but which are still participants in the existing public Bitcoin mining network).  This is in principle something like a \"softer\" version of a softfork (\"softerfork\" tightening of rules on self and sub-network of the entire network, but not on the network as a whole, compared to \"softfork\" tightening of rules on the entire network), and such a \"softerfork\" would probably be able to implement what you have in mind (i.e. Bitcoin blocks of miners participating in this p2share sub-network commit to an extra non-Bitcoin block that transacts a different currency, the \"share\", that has different semantics).",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 104,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "then such a network would be a great testing ground for new features, uses, services, etc – basically anything for which bitcoiners may have demand for, but for which mainnet bitcoin is not suitable. \n\nIMO if a feature cannot get into mainnet Bitcoin anyway, it is largely pointless to fantasize abo&hellip;",
  "truncated": true,
  "post_url": "/t/p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner/2093/8",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}