{
  "id": 6244,
  "name": "VzxPLnHqr",
  "username": "VzxPLnHqr",
  "avatar_template": "/user_avatar/delvingbitcoin.org/vzxplnhqr/{size}/121_2.png",
  "created_at": "2025-11-14T20:06:12.440Z",
  "cooked": "<p>Sorry to necropost here. From the original OP:</p>\n<blockquote>\n<p>… this is important as we should be looking to support what users are attempting to make, where reasonable, to avoid out-of-band fee solutions.</p>\n</blockquote>\n<p>This conversation is largely around fee inputs (whether exogenous or endogenous). However, there may be another type of transaction fee which we may need to consider: <strong>explicit fee outputs</strong>.</p>\n<p>I am referring to a fee paid to a miner where the fee is represented as a separate output in the transaction. Let us call such fee outputs “explicit” fees, as opposed to usual “implicit” fees (<code> = sum of inputs - sum of outputs</code>).</p>\n<p>Of course, transactions with explicit fee outputs take up more block space, so the explicit fee must account for the miner’s opportunity cost.</p>\n<p>But <em>why</em> are out-of-band explicit-fee outputs bad? I think one reason which is often not considered by non-experts is that out-of-band explicit fee outputs are not, unless carefully constructed, subject to the coinbase maturity restrictions.</p>\n<p>The coinbase maturity is actually a crucial component of Bitcoin’s security. We should naturally want as many of the block’s <strong>fee</strong> sats as possible flowing into those coinbase (or equivalently locked – see below) outputs.</p>\n<p>I wonder whether, in a post-subsidy bitcoin world, or a world where the chain is being re-organized more than usual, users (especially receivers) may find themselves needing to adopt explicit <code>anyone_can_spend</code> fee outputs which emulate the coinbase maturity semantics. Maybe a simple output script of something like <code>100 op_csv</code>.</p>\n<p>In such a world, I suppose a receiver could use CPFP to attach such an output to their inbound transactions.</p>",
  "post_number": 12,
  "post_type": 1,
  "posts_count": 12,
  "updated_at": "2025-11-14T20:06:12.440Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 5,
  "readers_count": 4,
  "score": 0.8,
  "yours": false,
  "topic_id": 512,
  "topic_slug": "taxonomy-of-transaction-fees-in-smart-contracts",
  "topic_title": "Taxonomy of Transaction Fees in Smart Contracts",
  "topic_html_title": "Taxonomy of Transaction Fees in Smart Contracts",
  "category_id": 7,
  "display_username": "VzxPLnHqr",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Sorry to necropost here. From the original OP:\n\n>  ... this is important as we should be looking to support what users are attempting to make, where reasonable, to avoid out-of-band fee solutions.\n\nThis conversation is largely around fee inputs (whether exogenous or endogenous). However, there may be another type of transaction fee which we may need to consider: **explicit fee outputs**.\n\nI am referring to a fee paid to a miner where the fee is represented as a separate output in the transaction. Let us call such fee outputs \"explicit\" fees, as opposed to usual \"implicit\" fees (` = sum of inputs - sum of outputs`).\n\nOf course, transactions with explicit fee outputs take up more block space, so the explicit fee must account for the miner's opportunity cost.\n\nBut _why_ are out-of-band explicit-fee outputs bad? I think one reason which is often not considered by non-experts is that out-of-band explicit fee outputs are not, unless carefully constructed, subject to the coinbase maturity restrictions.\n\nThe coinbase maturity is actually a crucial component of Bitcoin's security. We should naturally want as many of the block's **fee** sats as possible flowing into those coinbase (or equivalently locked -- see below) outputs.\n\nI wonder whether, in a post-subsidy bitcoin world, or a world where the chain is being re-organized more than usual, users (especially receivers) may find themselves needing to adopt explicit `anyone_can_spend` fee outputs which emulate the coinbase maturity semantics. Maybe a simple output script of something like `100 op_csv`.\n\nIn such a world, I suppose a receiver could use CPFP to attach such an output to their inbound transactions.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 125,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Sorry to necropost here. From the original OP: \n\n… this is important as we should be looking to support what users are attempting to make, where reasonable, to avoid out-of-band fee solutions. \n\nThis conversation is largely around fee inputs (whether exogenous or endogenous). However, there may be a&hellip;",
  "truncated": true,
  "post_url": "/t/taxonomy-of-transaction-fees-in-smart-contracts/512/12",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}