{
  "id": 6341,
  "name": "VzxPLnHqr",
  "username": "VzxPLnHqr",
  "avatar_template": "/user_avatar/delvingbitcoin.org/vzxplnhqr/{size}/121_2.png",
  "created_at": "2025-11-25T19:14:25.408Z",
  "cooked": "<p>Part of the confusion here is my fault. The original post presented a less generalized version of p2share but where the share issuance was more similar to Bitcoin’s (shrinking-pie model). Then, later in the thread I presented a more refined version which, I believe, is equivalent to PPLNS in expectation. Then, to confuse things more, I presented the most general version where the “parameters” (shape of the share issuance schedule, block time, difficulty adjustment algorithm, etc) can all be fine tuned.</p>\n<p>Now, to get on the same page with regard to nomenclature, when I refer to “shares” I am here referring to the sharechain’s unit of account. You can imagine a sharechain as its own network which operates similar to bitcoin, and just like bitcoin has output amounts (sats) in its utxos, a sharechain has output amounts (shares) in its utxos.</p>\n<p>Due to the “select a random shareholder” mechanism of p2share, <em>unlike</em> bitcoin itself, these shares possess an equity-like property that we might associate with more traditional for-profit enterprises. That is why I am calling them shares. Though, of course, it is important to remember that a sharechain is not itself any sort of “legal structure” in the traditional sense. In this manner it <em>is</em> like Bitcoin.</p>\n<p>You seem to be imagining a sharechain shareholder having an “account” more similar to how some networks use an account-based methodology for tracking amounts rather than a utxo methodology. While it might be possible or even preferable to use that sort of mechanism within the sharechain, that is a technical detail that, in my opinion, does not really matter right now in our discussion.</p>\n<aside class=\"quote no-group\" data-username=\"cmp_ancp\" data-post=\"20\" data-topic=\"2093\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/c/b3f665/48.png\" class=\"avatar\"> cmp_ancp:</div>\n<blockquote>\n<p>In any case, I am really pro bruning the selected account shares.</p>\n</blockquote>\n</aside>\n<p>I am not sure if this is where you are getting confused or not, but we are not necessarily selecting an “account.” We are randomly selecting a specific share. That specific share will (in a utxo model) be located in a certain utxo which will have a certain public key associated with it. That is all we, as sharechain nodes, know. Conveniently, that is also all we need to know.</p>\n<p>Sure, we could “burn” the entire utxo which contains that share, but that suffers from a number of problems, some of which you have pointed out. A miner can easily minimize her number of burned shares by pulverizing her shares across many outputs.</p>\n<p>Set all the technical concerns aside for a moment and assume that the sharechain has solved a Bitcoin block and the reward (subsidy + fees, in sats) is <code>R</code>. Let’s assume we <em>could</em> randomly select and “burn” <code>R</code> sats worth of shares, in exchange for distributing the <code>R</code> bitcoin to those shareholders. This is nearly equivalent to what happens in a share buyback in the traditional equity markets.</p>\n<p>However, mathematically the buyback method is equivalent, in expectation, to the much more simple, and also conveniently tractable/implementable: <em>“select a single share at random and distribute the entire reward <code>R</code> to the owner of that share.”</em></p>\n<p>A major advantage of the above simplification is that we need only select a single share at random. Whereas with what you want to do, we would need to select a set of shares and the set of shares selected is necessarily a function of <code>R</code> and some sort of price signal getting smuggled into the sharechain (otherwise we would not know how many shares to “burn”). This is an unnecessary complication, and may not even be possible, yet the simple model of selecting and distributing the reward to a single share <em>achieves the same result,</em> and we can let the exogenous market just price things accordingly.</p>\n<aside class=\"quote no-group\" data-username=\"cmp_ancp\" data-post=\"20\" data-topic=\"2093\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/c/b3f665/48.png\" class=\"avatar\"> cmp_ancp:</div>\n<blockquote>\n<p>Inflation is also somewhat of a problem. If, in the long run, sharecoins are always devaluated,</p>\n</blockquote>\n</aside>\n<p>Again, this depends on the chosen parameters around share issuance. In the linear model where each share issued is always tied to a constant amount of work, then even though there is an ever-growing supply of shares, the difficulty adjustment algorithm takes care of this problem for us. Say difficulty grows by 100x on the sharechain, then sure there will be 100x more shares issued. And yes, in such a scenario, the new “high difficulty” shareholders would have a much higher liklihood of being randomly selected for the bitcoin reward. However, they also paid (in work) for those shares. Similarly, the “low difficulty” (earlier) shareholders <em>still</em> have a non-zero chance of being selected. This is why, in expectation, everything works out just fine. In the linear issuance model, even though supply of shares tends to infinity (note: it will, of course never actually get there), everyone is fairly accounted for. This is the beauty of a difficulty adjustment algorithm tied to thermodynamic work.</p>\n<aside class=\"quote no-group\" data-username=\"cmp_ancp\" data-post=\"20\" data-topic=\"2093\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/c/b3f665/48.png\" class=\"avatar\"> cmp_ancp:</div>\n<blockquote>\n<p>Another cool feature that could be managed by sharecoin is coordination to onchain txs. Imagine some ark style payout tree</p>\n</blockquote>\n</aside>\n<p>Sure, there are a lot of interesting things which might be tried by a sharechain, all without affecting mainchain bitcoin. I am less focused on the specifics here though and right now just want to explore the general p2share framework to ensure that it is sound and properly Bitcoin-aligned.</p>\n<p>Markets, especially of the open, permission-less, and unhampered kind, are very good at solving these sorts of problems. Sharechains with features or issuance models which are reckless will not do well in the atomic swap market. Nobody will want to part ways with their precious sats for those garbage shares, and those sharechains will lose hashrate (or never even achieve it in the first place) because of it. Sharechains with solid, but differentiated, feature sets and fair issuance have a much better chance of success.</p>",
  "post_number": 21,
  "post_type": 1,
  "posts_count": 25,
  "updated_at": "2025-11-25T19:14:25.408Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 16,
  "readers_count": 15,
  "score": 8.2,
  "yours": false,
  "topic_id": 2093,
  "topic_slug": "p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner",
  "topic_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "topic_html_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "category_id": 7,
  "display_username": "VzxPLnHqr",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Part of the confusion here is my fault. The original post presented a less generalized version of p2share but where the share issuance was more similar to Bitcoin's (shrinking-pie model). Then, later in the thread I presented a more refined version which, I believe, is equivalent to PPLNS in expectation. Then, to confuse things more, I presented the most general version where the \"parameters\" (shape of the share issuance schedule, block time, difficulty adjustment algorithm, etc) can all be fine tuned.\n\nNow, to get on the same page with regard to nomenclature, when I refer to \"shares\" I am here referring to the sharechain's unit of account. You can imagine a sharechain as its own network which operates similar to bitcoin, and just like bitcoin has output amounts (sats) in its utxos, a sharechain has output amounts (shares) in its utxos. \n\nDue to the \"select a random shareholder\" mechanism of p2share, _unlike_ bitcoin itself, these shares possess an equity-like property that we might associate with more traditional for-profit enterprises. That is why I am calling them shares. Though, of course, it is important to remember that a sharechain is not itself any sort of \"legal structure\" in the traditional sense. In this manner it _is_ like Bitcoin.\n\nYou seem to be imagining a sharechain shareholder having an \"account\" more similar to how some networks use an account-based methodology for tracking amounts rather than a utxo methodology. While it might be possible or even preferable to use that sort of mechanism within the sharechain, that is a technical detail that, in my opinion, does not really matter right now in our discussion.\n\n[quote=\"cmp_ancp, post:20, topic:2093\"]\nIn any case, I am really pro bruning the selected account shares.\n[/quote]\n\nI am not sure if this is where you are getting confused or not, but we are not necessarily selecting an \"account.\" We are randomly selecting a specific share. That specific share will (in a utxo model) be located in a certain utxo which will have a certain public key associated with it. That is all we, as sharechain nodes, know. Conveniently, that is also all we need to know.\n\nSure, we could \"burn\" the entire utxo which contains that share, but that suffers from a number of problems, some of which you have pointed out. A miner can easily minimize her number of burned shares by pulverizing her shares across many outputs.\n\nSet all the technical concerns aside for a moment and assume that the sharechain has solved a Bitcoin block and the reward (subsidy + fees, in sats) is `R`. Let's assume we _could_ randomly select and \"burn\" `R` sats worth of shares, in exchange for distributing the `R` bitcoin to those shareholders. This is nearly equivalent to what happens in a share buyback in the traditional equity markets. \n\nHowever, mathematically the buyback method is equivalent, in expectation, to the much more simple, and also conveniently tractable/implementable: _\"select a single share at random and distribute the entire reward `R` to the owner of that share.\"_\n\nA major advantage of the above simplification is that we need only select a single share at random. Whereas with what you want to do, we would need to select a set of shares and the set of shares selected is necessarily a function of `R` and some sort of price signal getting smuggled into the sharechain (otherwise we would not know how many shares to \"burn\"). This is an unnecessary complication, and may not even be possible, yet the simple model of selecting and distributing the reward to a single share _achieves the same result,_ and we can let the exogenous market just price things accordingly.\n\n[quote=\"cmp_ancp, post:20, topic:2093\"]\nInflation is also somewhat of a problem. If, in the long run, sharecoins are always devaluated,\n[/quote]\n\nAgain, this depends on the chosen parameters around share issuance. In the linear model where each share issued is always tied to a constant amount of work, then even though there is an ever-growing supply of shares, the difficulty adjustment algorithm takes care of this problem for us. Say difficulty grows by 100x on the sharechain, then sure there will be 100x more shares issued. And yes, in such a scenario, the new \"high difficulty\" shareholders would have a much higher liklihood of being randomly selected for the bitcoin reward. However, they also paid (in work) for those shares. Similarly, the \"low difficulty\" (earlier) shareholders _still_ have a non-zero chance of being selected. This is why, in expectation, everything works out just fine. In the linear issuance model, even though supply of shares tends to infinity (note: it will, of course never actually get there), everyone is fairly accounted for. This is the beauty of a difficulty adjustment algorithm tied to thermodynamic work. \n\n[quote=\"cmp_ancp, post:20, topic:2093\"]\nAnother cool feature that could be managed by sharecoin is coordination to onchain txs. Imagine some ark style payout tree\n[/quote]\n\nSure, there are a lot of interesting things which might be tried by a sharechain, all without affecting mainchain bitcoin. I am less focused on the specifics here though and right now just want to explore the general p2share framework to ensure that it is sound and properly Bitcoin-aligned.\n\nMarkets, especially of the open, permission-less, and unhampered kind, are very good at solving these sorts of problems. Sharechains with features or issuance models which are reckless will not do well in the atomic swap market. Nobody will want to part ways with their precious sats for those garbage shares, and those sharechains will lose hashrate (or never even achieve it in the first place) because of it. Sharechains with solid, but differentiated, feature sets and fair issuance have a much better chance of success.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 125,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Part of the confusion here is my fault. The original post presented a less generalized version of p2share but where the share issuance was more similar to Bitcoin’s (shrinking-pie model). Then, later in the thread I presented a more refined version which, I believe, is equivalent to PPLNS in expecta&hellip;",
  "truncated": true,
  "post_url": "/t/p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner/2093/21",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}