{
  "id": 6205,
  "name": "ZmnSCPxj jxPCSnmZ",
  "username": "ZmnSCPxj",
  "avatar_template": "/letter_avatar_proxy/v4/letter/z/ee7513/{size}.png",
  "created_at": "2025-11-09T15:45:50.552Z",
  "cooked": "<p>The concept is a revival of the old “P2Pool” design, which has a separate “sharechain”.  By my memory (it may be inaccurate) the coinbase committed to multiple low-difficulty shares, i.e. actual full blocks whose block difficulty was lower than the difficulty of Bitcoin, but higher than the P2Pool share difficulty.  The innovation of <em><strong>this</strong></em> OP is to randomly select a lucky shareholder, instead of having one output per shareholder as in the original P2Pool.</p>\n<p>The problem with <em><strong>this</strong></em> OP is that the whole point of a pool is precisely to manage luck: instead of some enormous windfall going to some miner, a bunch of cooperating miners pool their hashpower and divide the large block reward amongst themselves via some policy (some measure of their contributed hashpower).  So it does not quite provide the desired properties needed for a true pool.</p>\n<p>P2Pool could not scale up because each hasher who contributed in the last N shares to the pool had to have an output on the coinbase, which was untenable.</p>\n<p>In a non-P2Pool pool, typically the issue is that there is a central coordinator.  The central coordinator aggregates the multiple tiny shares that each hasher provides, and pays out to them as larger aggregated payments.  The problem is that the central coordinator can discredit the share that a hasher provides if the central coordinator wants to censor some transaction that the hasher submits in their work — i.e. the new Stratum is insufficient as the central coordinator can always deny paying for the work submitted by a hasher after it discovers that the hasher has included censored transactions (and the coordinator still gets the coinbase rewards anyway).</p>\n<p>What we <em><strong>actually</strong></em> need is a Lightning-like construction to aggregate the multiple small payments that a P2Pool-like pool builds, but we cannot use HTLCs; instead, we need a SCRIPT with comparison of large 256-bit numbers (difficulty comparison), <em><strong>and</strong></em> some way to ensure that the committed transactions in a block (which would need to be some kind of ZK-proof, or else the pool coordinator can inspect the block of the hasher before paying out — we need the requirement that the pool coordinator pays out only if the hasher includes valid transactions, but cannot learn the transactions until after it has paid out, similar to how HTLC preimages work in Lightning: once the hasher has given out the transactions to the coordinator, the coordinator cannot “take back” the amount, in much the same way that once the preimage of an HTLC has been published, the HTLC-offeror cannot “take back” the HTLC).  Unfortunately, we cannot compare 256-bit numbers (<code>OP_GREATERTHAN</code> et al only work on 32-bit numbers) and in any case, the validity check cannot be performed (though it may be possible to generate a BitVM for it? Not sure: the big issue with BitVM is that in practice its logic is the inverse of what we want, i.e. it is a “get paid if invalid, until a timeout” system, not a “get paid if valid, until a timeout” system).</p>\n<p>Probably the above would require changes to Bitcoin.  Unfortunately, large custodians already have much of the economic majority in Bitcoin — and centralized non-P2Pool pool coordinators <em><strong>are</strong></em> custodians, full stop, because they hold the money that hashers have rightfully earned, which allows them undue power over the hashers — and there is no incentive for custodians to allow non-custodial uses that would erode their use (which explains why there are astroturfed disinformation and distraction campaigns that prioritize other things — particularly censorship, the most important power that custodians get — over noncustodial-supporting changes like <code>OP_CTV</code>).</p>",
  "post_number": 6,
  "post_type": 1,
  "posts_count": 9,
  "updated_at": "2025-11-09T15:51:03.139Z",
  "reply_count": 1,
  "reply_to_post_number": 5,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 10,
  "readers_count": 9,
  "score": 6.8,
  "yours": false,
  "topic_id": 2093,
  "topic_slug": "p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner",
  "topic_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "topic_html_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "category_id": 7,
  "display_username": "ZmnSCPxj jxPCSnmZ",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 898,
    "username": "cmp_ancp",
    "name": "",
    "avatar_template": "/letter_avatar_proxy/v4/letter/c/b3f665/{size}.png"
  },
  "bookmarked": false,
  "raw": "The concept is a revival of the old \"P2Pool\" design, which has a separate \"sharechain\".  By my memory (it may be inaccurate) the coinbase committed to multiple low-difficulty shares, i.e. actual full blocks whose block difficulty was lower than the difficulty of Bitcoin, but higher than the P2Pool share difficulty.  The innovation of ***this*** OP is to randomly select a lucky shareholder, instead of having one output per shareholder as in the original P2Pool.\n\nThe problem with ***this*** OP is that the whole point of a pool is precisely to manage luck: instead of some enormous windfall going to some miner, a bunch of cooperating miners pool their hashpower and divide the large block reward amongst themselves via some policy (some measure of their contributed hashpower).  So it does not quite provide the desired properties needed for a true pool.\n\nP2Pool could not scale up because each hasher who contributed in the last N shares to the pool had to have an output on the coinbase, which was untenable.\n\nIn a non-P2Pool pool, typically the issue is that there is a central coordinator.  The central coordinator aggregates the multiple tiny shares that each hasher provides, and pays out to them as larger aggregated payments.  The problem is that the central coordinator can discredit the share that a hasher provides if the central coordinator wants to censor some transaction that the hasher submits in their work --- i.e. the new Stratum is insufficient as the central coordinator can always deny paying for the work submitted by a hasher after it discovers that the hasher has included censored transactions (and the coordinator still gets the coinbase rewards anyway).\n\nWhat we ***actually*** need is a Lightning-like construction to aggregate the multiple small payments that a P2Pool-like pool builds, but we cannot use HTLCs; instead, we need a SCRIPT with comparison of large 256-bit numbers (difficulty comparison), ***and*** some way to ensure that the committed transactions in a block (which would need to be some kind of ZK-proof, or else the pool coordinator can inspect the block of the hasher before paying out --- we need the requirement that the pool coordinator pays out only if the hasher includes valid transactions, but cannot learn the transactions until after it has paid out, similar to how HTLC preimages work in Lightning: once the hasher has given out the transactions to the coordinator, the coordinator cannot \"take back\" the amount, in much the same way that once the preimage of an HTLC has been published, the HTLC-offeror cannot \"take back\" the HTLC).  Unfortunately, we cannot compare 256-bit numbers (`OP_GREATERTHAN` et al only work on 32-bit numbers) and in any case, the validity check cannot be performed (though it may be possible to generate a BitVM for it? Not sure: the big issue with BitVM is that in practice its logic is the inverse of what we want, i.e. it is a \"get paid if invalid, until a timeout\" system, not a \"get paid if valid, until a timeout\" system).\n\nProbably the above would require changes to Bitcoin.  Unfortunately, large custodians already have much of the economic majority in Bitcoin --- and centralized non-P2Pool pool coordinators ***are*** custodians, full stop, because they hold the money that hashers have rightfully earned, which allows them undue power over the hashers --- and there is no incentive for custodians to allow non-custodial uses that would erode their use (which explains why there are astroturfed disinformation and distraction campaigns that prioritize other things --- particularly censorship, the most important power that custodians get --- over noncustodial-supporting changes like `OP_CTV`).",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 104,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "The concept is a revival of the old “P2Pool” design, which has a separate “sharechain”.  By my memory (it may be inaccurate) the coinbase committed to multiple low-difficulty shares, i.e. actual full blocks whose block difficulty was lower than the difficulty of Bitcoin, but higher than the P2Pool s&hellip;",
  "truncated": true,
  "post_url": "/t/p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner/2093/6",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}