{
  "id": 6207,
  "name": "VzxPLnHqr",
  "username": "VzxPLnHqr",
  "avatar_template": "/user_avatar/delvingbitcoin.org/vzxplnhqr/{size}/121_2.png",
  "created_at": "2025-11-09T21:07:19.357Z",
  "cooked": "<p>Thank you for reading and for your replies. I was actually hesitant to tag this thread as mining, because, to me at least this is less about mining and more about the overarching economic and philosophical consequences (if any). You seem to have gleaned that too, so thank you!</p>\n<blockquote>\n<p>The concept is a revival of the old “P2Pool” design, which has a separate “sharechain”. By my memory (it may be inaccurate) the coinbase committed to multiple low-difficulty shares, i.e. actual full blocks whose block difficulty was lower than the difficulty of Bitcoin, but higher than the P2Pool share difficulty.</p>\n</blockquote>\n<p>I think your memory is correct here with regard to how P2Pool functioned. The concept presented here of of paying out to a random shareholder to save mainchain blockspace and thereby maximize fee revenue might have bought P2Pool some more time, but it is probably more nuanced than that …</p>\n<blockquote>\n<p>The innovation of <em><strong>this</strong></em> OP is to randomly select a lucky shareholder, instead of having one output per shareholder as in the original P2Pool.</p>\n</blockquote>\n<p>I think there are a couple subtle things that are worth mentioning:</p>\n<p>First, P2Pool did not (to my memory at least) have transferable “shares.” Adding this feature into the mix, coupled with a fixed schedule of <em>fair</em><sup class=\"footnote-ref\"><a href=\"#footnote-6207-1\" id=\"footnote-ref-6207-1\">[1]</a></sup> share issuance, is what may provide for the sharechain network to be longer lived itself.</p>\n<p>Second, if you have a longer lived sharechain network(s) which is symbiotic with bitcoin, then such a network would be a great testing ground for new features, uses, services, etc – basically anything for which bitcoiners may have demand for, but for which mainnet bitcoin is not suitable.</p>\n<p>Whether the shares themselves are able to obtain and maintain any “value” greater than <code>0.00000.... sats/share</code>, is currently an unknown.</p>\n<p>Yet, it is important to remember that many of the arguments we may come up with for why there is no value here, are almost identical to what could have been said about bitcoin itself. Now, I am not suggesting that any of these sharechains, if they existed, would or even could eclipse bitcoin.</p>\n<p>Rather, if such mining networks existed, and even a small fraction of overall bitcoin hashrate was directed through such networks (and rewarded commensurately via the p2share mechanism contemplated here), then the value of those shares relative to bitcoin and those shares relative to one another (assuming multiple networks) does have at least <em>some</em> information signal which is relevant to the bitcoin ecosystem.</p>\n<blockquote>\n<p>If I secretly own much of the shares <em>and</em> more than 50% of the hashrate … this of course converts proof-of-stake to proof-of-work-with-extra-steps, which is undesirable</p>\n</blockquote>\n<p>This actually gets to the crux of the issue, and why I posted here in the first place. While I agree with you in spirit here, I am not sure exactly why it is undesirable, especially if we extend your definition of “proof-of-stake” here to include “any non-bitcoin-denominated investments” (including equity investments wall street companies), then why would we <em>not</em> want to convert those things into our beloved bitcoin-compatible proof of work?</p>\n<p>Of course, we can argue that all those types of investments/investors need to just eventually learn the hard way and ultimately obtain bitcoin directly somehow which, outside of theft or gifts, leaves only two options: mine it or buy it. This doesn’t change that.</p>\n<blockquote>\n<p>… That is, this scheme might end up just being solo-mining-with-extra-steps.</p>\n</blockquote>\n<p>This is a good thing. Well, the extra-steps is perhaps annoying. However, the argument I am trying (and quite likely failing!) to make here is that this is the feature. The fact that it, in expectation, the p2share model economically degrade down to solo mining (albeit with some extra steps) is exactly why this concept is interesting:</p>\n<p><strong>p2share gives bitcoin hodlers a (very risky! but trustless!) mechanism to buy “equity” (shares) which represent future mining earnings, if any, of a given p2share bitcoin-compatible mining network.</strong></p>\n<p>So, at least in theory, rather than buy wallstreet shares of wallstreet companies which are purporting to help bitcoin, but really only help wallstreet, and the fiat mindset, this is a way to keep it all in our dysfunctionally resilient bitcoin ecosystem.</p>\n<blockquote>\n<p>What we <em><strong>actually</strong></em> need is a Lightning-like construction to aggregate the multiple small payments that a P2Pool-like pool builds, but we cannot use HTLCs; instead, we need a SCRIPT with comparison of large 256-bit numbers (difficulty comparison),</p>\n</blockquote>\n<p>I too came to this conclusion back when I was exploring worklocks <sup class=\"footnote-ref\"><a href=\"#footnote-6207-2\" id=\"footnote-ref-6207-2\">[2]</a></sup>. It is ironic that bitcoin is itself distributed via guarded PoW (i.e. proof of work is the first pass, but success is also guarded by other criteria such as timestamps, …), yet it is not trivial to do try to do the same thing within bitcoin itself (namely distribute a UTXOs sats to unknown ultimate beneficiaries, but with a possibly different set of guarding criteria – at least without requiring an upgrade to Bitcoin).</p>\n<blockquote>\n<p>Probably the above would require changes to Bitcoin. Unfortunately, large custodians already have much of the economic majority in Bitcoin …</p>\n</blockquote>\n<p>Precisely why something like p2share may be helpful/useful? No changes to Bitcoin necessary.</p>\n<h3><a name=\"p-6207-on-p2share-incentives-1\" class=\"anchor\" href=\"#p-6207-on-p2share-incentives-1\"></a>on p2share incentives</h3>\n<p>If we set aside the bootstrapping problem for a moment. I am not sure how such a network is bootstrapped. Maybe it is luck, or benevolence, or something else. Incidentally, I believe nonce grinding would only be an issue while the sharechain network difficulty is low, and here we are explicitly skipping that phase of the contemplated sharechain’s history and teleporting to a period where difficulty is high enough and competition for shares is tough enough that the extra grinding is not worth it. That may be too unrealistic a simplification, but let us go with it for now.</p>\n<p>A first-pass analysis hunch says that:</p>\n<ol>\n<li><em>if</em> participants value their bitcoin and Bitcoin’s future <em>and</em> have determined that p2share is one way to try to bolster that future (i.e. so they buy shares of various sharechain(s) with features they desire/use/agree with, and direct their mining power to such sharechain(s))</li>\n<li><em>then</em> a sharechain miner will likely want to obtain/maintain a balance of shares which is commensurate with the her hashrate relative to the <em>sharechain</em> – in other words, the “extra steps” she takes are simply to protect herself from diluation.</li>\n</ol>\n<p>In some ways, such a sharechain miner might be lauded for this behavior since:</p>\n<ul>\n<li>she is actively securing the bitcoin network and protecting its future</li>\n<li>she is doing it in a trustless and decentralized way but (presumably, by her choice of sharechain(s)) with a set of like-minded participants, thereby sending a signal to mainchain of their desired future features..</li>\n<li>her behavior is similar to someone who tries to obtain mainchain bitcoin (via buying or mining) and continues to accumulate – so it gracefully degrades to a behavior we generally want to encourage.</li>\n</ul>\n<p>But this all very informal so far and <strong>maybe the p2share concept is a dead end?</strong></p>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"footnote-6207-1\" class=\"footnote-item\"><p>The reference escapes me, but I think there is a paper somewhere which proves that, at least for certain reasonable notions of fairness, issuance via proof-of-work is the optimal issuance mechanism. <a href=\"#footnote-ref-6207-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-6207-2\" class=\"footnote-item\"><p><a href=\"https://github.com/VzxPLnHqr/sig-pow\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - VzxPLnHqr/sig-pow: proof of work via ecdsa signature length</a> (note: there are some flaws in the code/construtcion, it was just an exploration) <a href=\"#footnote-ref-6207-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>",
  "post_number": 7,
  "post_type": 1,
  "posts_count": 9,
  "updated_at": "2025-11-09T21:11:28.980Z",
  "reply_count": 1,
  "reply_to_post_number": 6,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 8,
  "readers_count": 7,
  "score": 6.2,
  "yours": false,
  "topic_id": 2093,
  "topic_slug": "p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner",
  "topic_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "topic_html_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "category_id": 7,
  "display_username": "VzxPLnHqr",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 104,
    "username": "ZmnSCPxj",
    "name": "ZmnSCPxj jxPCSnmZ",
    "avatar_template": "/letter_avatar_proxy/v4/letter/z/ee7513/{size}.png"
  },
  "bookmarked": false,
  "raw": "Thank you for reading and for your replies. I was actually hesitant to tag this thread as mining, because, to me at least this is less about mining and more about the overarching economic and philosophical consequences (if any). You seem to have gleaned that too, so thank you!\n\n> The concept is a revival of the old “P2Pool” design, which has a separate “sharechain”. By my memory (it may be inaccurate) the coinbase committed to multiple low-difficulty shares, i.e. actual full blocks whose block difficulty was lower than the difficulty of Bitcoin, but higher than the P2Pool share difficulty. \n\nI think your memory is correct here with regard to how P2Pool functioned. The concept presented here of of paying out to a random shareholder to save mainchain blockspace and thereby maximize fee revenue might have bought P2Pool some more time, but it is probably more nuanced than that ...\n\n> The innovation of ***this*** OP is to randomly select a lucky shareholder, instead of having one output per shareholder as in the original P2Pool.\n\nI think there are a couple subtle things that are worth mentioning:\n\nFirst, P2Pool did not (to my memory at least) have transferable \"shares.\" Adding this feature into the mix, coupled with a fixed schedule of *fair*[^fair_issuance] share issuance, is what may provide for the sharechain network to be longer lived itself.\n\nSecond, if you have a longer lived sharechain network(s) which is symbiotic with bitcoin, then such a network would be a great testing ground for new features, uses, services, etc -- basically anything for which bitcoiners may have demand for, but for which mainnet bitcoin is not suitable. \n\nWhether the shares themselves are able to obtain and maintain any \"value\" greater than `0.00000.... sats/share`, is currently an unknown. \n\nYet, it is important to remember that many of the arguments we may come up with for why there is no value here, are almost identical to what could have been said about bitcoin itself. Now, I am not suggesting that any of these sharechains, if they existed, would or even could eclipse bitcoin.\n\nRather, if such mining networks existed, and even a small fraction of overall bitcoin hashrate was directed through such networks (and rewarded commensurately via the p2share mechanism contemplated here), then the value of those shares relative to bitcoin and those shares relative to one another (assuming multiple networks) does have at least _some_ information signal which is relevant to the bitcoin ecosystem.\n\n> If I secretly own much of the shares *and* more than 50% of the hashrate ... this of course converts proof-of-stake to proof-of-work-with-extra-steps, which is undesirable\n\nThis actually gets to the crux of the issue, and why I posted here in the first place. While I agree with you in spirit here, I am not sure exactly why it is undesirable, especially if we extend your definition of \"proof-of-stake\" here to include \"any non-bitcoin-denominated investments\" (including equity investments wall street companies), then why would we _not_ want to convert those things into our beloved bitcoin-compatible proof of work?\n\nOf course, we can argue that all those types of investments/investors need to just eventually learn the hard way and ultimately obtain bitcoin directly somehow which, outside of theft or gifts, leaves only two options: mine it or buy it. This doesn't change that. \n\n\n> ... That is, this scheme might end up just being solo-mining-with-extra-steps.\n\nThis is a good thing. Well, the extra-steps is perhaps annoying. However, the argument I am trying (and quite likely failing!) to make here is that this is the feature. The fact that it, in expectation, the p2share model economically degrade down to solo mining (albeit with some extra steps) is exactly why this concept is interesting:\n\n**p2share gives bitcoin hodlers a (very risky! but trustless!) mechanism to buy \"equity\" (shares) which represent future mining earnings, if any, of a given p2share bitcoin-compatible mining network.** \n\nSo, at least in theory, rather than buy wallstreet shares of wallstreet companies which are purporting to help bitcoin, but really only help wallstreet, and the fiat mindset, this is a way to keep it all in our dysfunctionally resilient bitcoin ecosystem.\n\n> What we ***actually*** need is a Lightning-like construction to aggregate the multiple small payments that a P2Pool-like pool builds, but we cannot use HTLCs; instead, we need a SCRIPT with comparison of large 256-bit numbers (difficulty comparison),\n\nI too came to this conclusion back when I was exploring worklocks [^sigpow]. It is ironic that bitcoin is itself distributed via guarded PoW (i.e. proof of work is the first pass, but success is also guarded by other criteria such as timestamps, ...), yet it is not trivial to do try to do the same thing within bitcoin itself (namely distribute a UTXOs sats to unknown ultimate beneficiaries, but with a possibly different set of guarding criteria -- at least without requiring an upgrade to Bitcoin).\n\n> Probably the above would require changes to Bitcoin. Unfortunately, large custodians already have much of the economic majority in Bitcoin ...\n\nPrecisely why something like p2share may be helpful/useful? No changes to Bitcoin necessary.\n\n### on p2share incentives\n\nIf we set aside the bootstrapping problem for a moment. I am not sure how such a network is bootstrapped. Maybe it is luck, or benevolence, or something else. Incidentally, I believe nonce grinding would only be an issue while the sharechain network difficulty is low, and here we are explicitly skipping that phase of the contemplated sharechain's history and teleporting to a period where difficulty is high enough and competition for shares is tough enough that the extra grinding is not worth it. That may be too unrealistic a simplification, but let us go with it for now.\n\nA first-pass analysis hunch says that:\n\n1. _if_ participants value their bitcoin and Bitcoin's future _and_ have determined that p2share is one way to try to bolster that future (i.e. so they buy shares of various sharechain(s) with features they desire/use/agree with, and direct their mining power to such sharechain(s))\n2. _then_ a sharechain miner will likely want to obtain/maintain a balance of shares which is commensurate with the her hashrate relative to the _sharechain_ -- in other words, the \"extra steps\" she takes are simply to protect herself from diluation.\n\nIn some ways, such a sharechain miner might be lauded for this behavior since:\n   * she is actively securing the bitcoin network and protecting its future\n   * she is doing it in a trustless and decentralized way but (presumably, by her choice of sharechain(s)) with a set of like-minded participants, thereby sending a signal to mainchain of their desired future features..\n   * her behavior is similar to someone who tries to obtain mainchain bitcoin (via buying or mining) and continues to accumulate -- so it gracefully degrades to a behavior we generally want to encourage.\n\nBut this all very informal so far and **maybe the p2share concept is a dead end?**\n\n[^fair_issuance]: The reference escapes me, but I think there is a paper somewhere which proves that, at least for certain reasonable notions of fairness, issuance via proof-of-work is the optimal issuance mechanism.\n\n[^sigpow]: https://github.com/VzxPLnHqr/sig-pow (note: there are some flaws in the code/construtcion, it was just an exploration)",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 125,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Thank you for reading and for your replies. I was actually hesitant to tag this thread as mining, because, to me at least this is less about mining and more about the overarching economic and philosophical consequences (if any). You seem to have gleaned that too, so thank you! \n\nThe concept is a rev&hellip;",
  "truncated": true,
  "post_url": "/t/p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner/2093/7",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}