{
  "id": 6203,
  "name": "ZmnSCPxj jxPCSnmZ",
  "username": "ZmnSCPxj",
  "avatar_template": "/letter_avatar_proxy/v4/letter/z/ee7513/{size}.png",
  "created_at": "2025-11-09T06:07:07.470Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"VzxPLnHqr\" data-post=\"1\" data-topic=\"2093\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/vzxplnhqr/48/121_2.png\" class=\"avatar\"> VzxPLnHqr:</div>\n<blockquote>\n<p>A value <code>q</code> is determined using a function similar to:</p>\n<p><code>q = sha256(\"q selector\" || sharechain_blockheader_i) mod n</code></p>\n<p>where <span class=\"math\">n</span> is the total number of shares outstanding at block <code>i</code>.</p>\n</blockquote>\n</aside>\n<p>Note that the probability of getting the reward on the Bitcoin blockchain is proportional to the number of shares I own on the share network.  In particular, we should note that it is quite possible for a grinding attack to be performed, where I ensure that, when I am mining sharechain blockheader i + 1, I make sure that sharechain blockheader i + 2 will be be paid to me (and so forth in future mines).  If I secretly own much of the shares <em>and</em> more than 50% of the hashrate on the share-network, I can induce minor miners who join the share-network to effectively contribute all mining rewards to me, effectively taking over their hashrate.  This leads to a bootstrapping problem: why would anyone actually want to mine on the share-network I started, when it is entirely possible that I secretly own most of the shares and most of the hashrate?  And if there is not enough <em>other</em> people who want to join this new share-network, then there is no way to actually move from “the starting operator is in a position to steal all hashrate of all new joining miners” to “the shares are distributed enough that it is a non-issue” because nobody <em>else</em> will rationally mine on this.</p>\n<p>In my opinion, the central error of proof-of-stake is the assumption that you cannot grind  the random selection of the winning staker, and this scheme evokes the same error; the above hash you show <em><strong>can</strong></em> be ground, especially as <code>n</code> will start out small, to always go to some target participant; this of course converts proof-of-stake to proof-of-work-with-extra-steps, which is undesirable. The more complex things become, the more it is possible that there is some hidden optimization that can massively disrupt the mining industry (the way ASICBOOST was disruptive and was implicated in the delay of SegWit activation).</p>\n<p>That is, this scheme might end up just being solo-mining-with-extra-steps.</p>",
  "post_number": 4,
  "post_type": 1,
  "posts_count": 8,
  "updated_at": "2025-11-09T06:07:07.470Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 12,
  "readers_count": 11,
  "score": 17.4,
  "yours": false,
  "topic_id": 2093,
  "topic_slug": "p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner",
  "topic_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "topic_html_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "category_id": 7,
  "display_username": "ZmnSCPxj jxPCSnmZ",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"VzxPLnHqr, post:1, topic:2093\"]\nA value `q` is determined using a function similar to:\n\n`q = sha256(\"q selector\" || sharechain_blockheader_i) mod n`\n\nwhere $n$ is the total number of shares outstanding at block `i`.\n[/quote]\n\nNote that the probability of getting the reward on the Bitcoin blockchain is proportional to the number of shares I own on the share network.  In particular, we should note that it is quite possible for a grinding attack to be performed, where I ensure that, when I am mining sharechain blockheader i + 1, I make sure that sharechain blockheader i + 2 will be be paid to me (and so forth in future mines).  If I secretly own much of the shares *and* more than 50% of the hashrate on the share-network, I can induce minor miners who join the share-network to effectively contribute all mining rewards to me, effectively taking over their hashrate.  This leads to a bootstrapping problem: why would anyone actually want to mine on the share-network I started, when it is entirely possible that I secretly own most of the shares and most of the hashrate?  And if there is not enough *other* people who want to join this new share-network, then there is no way to actually move from \"the starting operator is in a position to steal all hashrate of all new joining miners\" to \"the shares are distributed enough that it is a non-issue\" because nobody *else* will rationally mine on this.\n\nIn my opinion, the central error of proof-of-stake is the assumption that you cannot grind  the random selection of the winning staker, and this scheme evokes the same error; the above hash you show ***can*** be ground, especially as `n` will start out small, to always go to some target participant; this of course converts proof-of-stake to proof-of-work-with-extra-steps, which is undesirable. The more complex things become, the more it is possible that there is some hidden optimization that can massively disrupt the mining industry (the way ASICBOOST was disruptive and was implicated in the delay of SegWit activation).\n\nThat is, this scheme might end up just being solo-mining-with-extra-steps.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 104,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Note that the probability of getting the reward on the Bitcoin blockchain is proportional to the number of shares I own on the share network.  In particular, we should note that it is quite possible for a grinding attack to be performed, where I ensure that, when I am mining sharechain blockheader &hellip;",
  "truncated": true,
  "post_url": "/t/p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner/2093/4",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}