{
  "id": 6216,
  "name": "VzxPLnHqr",
  "username": "VzxPLnHqr",
  "avatar_template": "/user_avatar/delvingbitcoin.org/vzxplnhqr/{size}/121_2.png",
  "created_at": "2025-11-11T19:35:04.880Z",
  "cooked": "<p>Thanks for providing some more details regarding your current design parameters. Here are some not-very-formal thoughts. I hope they are helpful:</p>\n<blockquote>\n<p>The discount is determined by the market…</p>\n</blockquote>\n<p>The total discount factor <code>d</code>, a number in the range [0,1], can be broken into two components <code>d = d_time*d_params</code>:</p>\n<ol>\n<li>\n<p><code>d_time</code>: time-value-of-money considerations – sats available now (via atomic swap) are worth more than sats which are (expected to be) available later.</p>\n</li>\n<li>\n<p><code>d_params</code>: protocol-specific constraints/parameters such as PPLNS window size, share expiry, etc.</p>\n</li>\n</ol>\n<p>Ideally we want a market which will price at <code>d = 1.0</code> which basically would mean that large miners and market makers would pay essentially full price to scoop up the shares of the smaller shareholders. Since time is inescapable, it is likely that <code>d_time</code> will almost always be less than <code>1.0</code>. That being said, with a strong track record, good future prospects, and ample liquidity, <code>d_time</code> may approach <code>1.0</code>, and that would be great. That is what we want.</p>\n<p>However, if we choose the parameters incorrectly (note: I am not saying you are choosing them incorrectly here, mostly just trying to brainstorm with you), we run the risk of the effect being that <code>d_params</code> is going to max out at some value less than 1.0.</p>\n<p>You already indicated that you believe PPLNS window size and share expiry will adversely affect the discount. So, what happens if we look at it in limit (unbounded window, no expiry)?</p>\n<p>In the limit, I think you basically end up recovering the p2share design, but with a tweak: you are paying out only to the top 20 shareholders, rather than (in the p2share design) paying out to a randomly selected single shareholder.</p>\n<p>Of course we could expand p2share to randomly select 20 shareholders. But what I am trying to point out is that it is precisely the random selection process which pushes towards incentive alignment. It implies a risk that, even if you are a large shareholder, you <em>might not be selected immediately</em>, yet mitigates that risk because you can have confidence that <em>even the smallest shareholders will be selected eventually</em> (so long as there is hashrate<sup class=\"footnote-ref\"><a href=\"#footnote-6216-1\" id=\"footnote-ref-6216-1\">[1]</a></sup>). Therefore, it naturally enforces a 1 share = 1 share mentality, regardless of when the shares were originally earned. And that is why profit maximizing p2share miners have at least some motivation, but not the obligation, to also buy up other shares, especially when they come across price dislocations.</p>\n<p>I am concerned that in your current design, the large shareholders and would-be market-makers are somehow being assumed to have the obligation to buy shares from the smaller miners, but the obligation is (of course!) unenforceable.</p>\n<p>Attempting to think it through:</p>\n<ul>\n<li>say your top 20 miners represent <code>p%</code> of your hash rate, but <code>q%</code> of outstanding shares (in the current PPLNS window). We cannot directly measure <code>p</code> (which is why shares exist in the first place!), so we want <code>q</code> to, in expectation, equal <code>p</code>.</li>\n<li>as I currently understand it, your current design will allocate <code>100%</code> of the mainchain reward to those top 20 shareholders <em>irrespective</em> of whether/how/if those shareholders bought up shares from the smaller players</li>\n</ul>\n<p>Now imagine you are contemplating being a miner/market maker for this. The problem (as I see it) is that if, through your trading actions, you cannot become one of those top 20 before the window closes, then all your hashes/trades affecting that window will irrecoverable losses. This is a result of the chosen parameters, and therefore is a cause of <code>d_params</code> being less than 1.0.</p>\n<p>A more ideal design:</p>\n<ol>\n<li>for the top 20 shareholders which represent <code>q%</code> of shares outstanding would only be allocated <code>q%</code> of the mainchain bitcoin reward.</li>\n<li>those shareholder’s shares would be destroyed (because they have now been redeemed) and the remaining <code>(1-q)%</code> of the mainchain bitcoin reward would be paid out to the bottom <code>(1-q)%</code> of shareholders using some sort of off-chain mechanism.</li>\n</ol>\n<p>Alas, I cannot figure out how to do the above without mainchain covenants and without some sort of custodial mechanism, and for both of those reasons I currently consider it a dead end. However you can probably see where this is going now: <strong>can we approximate the above ideal design without requiring any changes to mainchain bitcoin and staying non-custodial?</strong></p>\n<p>It may not fully or faithfully approximate it, but I do wonder whether randomly selected shareholders, non-expiring shares, and an unbounded PPLNS window (which is just another name for “deterministic share issuance schedule, coupled with difficulty adjustment algorithm”), might get the closest to recovering the desired ideal, and hence maximizing the marketability of the shares while remaining non-custodial and no-mainchain-upgrade-required.</p>\n<h3><a name=\"p-6216-speaking-of-design-parameters-1\" class=\"anchor\" href=\"#p-6216-speaking-of-design-parameters-1\"></a>speaking of design parameters</h3>\n<p><a class=\"mention\" href=\"/u/zmnscpxj\">@ZmnSCPxj</a> While writing this post, it occurred to me that the OP which delineates the overall design of p2share does not explicitly state that when a payout happens (i.e. when that lucky shareholder is allocated the entire mainchain bitcoin reward), that the shareholder’s shares are destroyed.</p>\n<p>Rather, in the OP I presented it more similar to a distribution of profits rather than a share buyback. The buyback/redemption model is probably the better model. However, I remember now why I arrived at the distributional design. It was because I could not solve the following problem cleanly:</p>\n<p>To actually implement the buyback model, the sharechain would need to carry, as part of its state, the current “price per share.” This is so sharechain nodes can calculate how many of the selected shareholder’s shares to buyback (destroy). Even if this calculation is somehow possible in an objective oracle-free manner (a tough, maybe impossible challenge in it of itself!), it triggers some other issues:</p>\n<ol>\n<li>\n<p>Overflow - what if the selected shareholder does not have enough shares to “sell” back? Where does the excess btc reward go then? Since we want to remain non-custodial, one idea would be to randomly select a second shareholder and buy their shares back, and so on, until the reward has been exhausted. With each new selected shareholder the mainchain coinbase output set grows, so we start losing our precious blockspace and we end up back at the original P2Pool bloated coinbase problem.</p>\n</li>\n<li>\n<p>Market depth - even if we could have the sharechain objectively converge on a price per share and use it for these buybacks, it should also characterize market depth, and so then now we have to somehow emulate an entire order book inside sharechain…</p>\n</li>\n</ol>\n<p>That is when I stopped and switched to the “just distribute the entire reward to the randomly selected shareholder” model. But I suppose there is an unexplored third model of, “choose one lucky shareholder and buy/destroy all the shares in that share output, and assign that shareholder the entire mainchain reward.” Naturally large shareholders would then split their share holding across multiple outputs. This would not affect their probability of being selected, but it would minimize how many shares they sell if they are selected. This behavior likely puts downward pressure on the share price (assuming there is any such price at all!), not to mention unnecessarily bloats the sharechain utxo set. Nevertheless, maybe there is something here.</p>\n<hr>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"footnote-6216-1\" class=\"footnote-item\"><p>whether there will be future hashrate, and how much, is accounted for in the <code>d_time</code> discount factor. It is a statement or expectation about the future, and hence about the time value of money. <a href=\"#footnote-ref-6216-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>",
  "post_number": 12,
  "post_type": 1,
  "posts_count": 12,
  "updated_at": "2025-11-11T19:37:16.933Z",
  "reply_count": 0,
  "reply_to_post_number": 11,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 3,
  "readers_count": 2,
  "score": 0.4,
  "yours": false,
  "topic_id": 2093,
  "topic_slug": "p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner",
  "topic_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "topic_html_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "category_id": 7,
  "display_username": "VzxPLnHqr",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 102,
    "username": "jungly",
    "name": "jungly",
    "avatar_template": "/user_avatar/delvingbitcoin.org/jungly/{size}/289_2.png"
  },
  "bookmarked": false,
  "raw": "Thanks for providing some more details regarding your current design parameters. Here are some not-very-formal thoughts. I hope they are helpful:\n\n> The discount is determined by the market....\n\nThe total discount factor `d`, a number in the range [0,1], can be broken into two components `d = d_time*d_params`:\n1. `d_time`: time-value-of-money considerations -- sats available now (via atomic swap) are worth more than sats which are (expected to be) available later. \n\n2. `d_params`: protocol-specific constraints/parameters such as PPLNS window size, share expiry, etc.\n\nIdeally we want a market which will price at `d = 1.0` which basically would mean that large miners and market makers would pay essentially full price to scoop up the shares of the smaller shareholders. Since time is inescapable, it is likely that `d_time` will almost always be less than `1.0`. That being said, with a strong track record, good future prospects, and ample liquidity, `d_time` may approach `1.0`, and that would be great. That is what we want.\n\nHowever, if we choose the parameters incorrectly (note: I am not saying you are choosing them incorrectly here, mostly just trying to brainstorm with you), we run the risk of the effect being that `d_params` is going to max out at some value less than 1.0.\n\nYou already indicated that you believe PPLNS window size and share expiry will adversely affect the discount. So, what happens if we look at it in limit (unbounded window, no expiry)?\n\nIn the limit, I think you basically end up recovering the p2share design, but with a tweak: you are paying out only to the top 20 shareholders, rather than (in the p2share design) paying out to a randomly selected single shareholder. \n\nOf course we could expand p2share to randomly select 20 shareholders. But what I am trying to point out is that it is precisely the random selection process which pushes towards incentive alignment. It implies a risk that, even if you are a large shareholder, you _might not be selected immediately_, yet mitigates that risk because you can have confidence that _even the smallest shareholders will be selected eventually_ (so long as there is hashrate[^future_hashrate]). Therefore, it naturally enforces a 1 share = 1 share mentality, regardless of when the shares were originally earned. And that is why profit maximizing p2share miners have at least some motivation, but not the obligation, to also buy up other shares, especially when they come across price dislocations.\n\nI am concerned that in your current design, the large shareholders and would-be market-makers are somehow being assumed to have the obligation to buy shares from the smaller miners, but the obligation is (of course!) unenforceable.\n\nAttempting to think it through: \n* say your top 20 miners represent `p%` of your hash rate, but `q%` of outstanding shares (in the current PPLNS window). We cannot directly measure `p` (which is why shares exist in the first place!), so we want `q` to, in expectation, equal `p`.\n* as I currently understand it, your current design will allocate `100%` of the mainchain reward to those top 20 shareholders _irrespective_ of whether/how/if those shareholders bought up shares from the smaller players\n\nNow imagine you are contemplating being a miner/market maker for this. The problem (as I see it) is that if, through your trading actions, you cannot become one of those top 20 before the window closes, then all your hashes/trades affecting that window will irrecoverable losses. This is a result of the chosen parameters, and therefore is a cause of `d_params` being less than 1.0. \n\nA more ideal design:\n1. for the top 20 shareholders which represent `q%` of shares outstanding would only be allocated `q%` of the mainchain bitcoin reward.\n2. those shareholder's shares would be destroyed (because they have now been redeemed) and the remaining `(1-q)%` of the mainchain bitcoin reward would be paid out to the bottom `(1-q)%` of shareholders using some sort of off-chain mechanism.\n\nAlas, I cannot figure out how to do the above without mainchain covenants and without some sort of custodial mechanism, and for both of those reasons I currently consider it a dead end. However you can probably see where this is going now: **can we approximate the above ideal design without requiring any changes to mainchain bitcoin and staying non-custodial?**\n\nIt may not fully or faithfully approximate it, but I do wonder whether randomly selected shareholders, non-expiring shares, and an unbounded PPLNS window (which is just another name for \"deterministic share issuance schedule, coupled with difficulty adjustment algorithm\"), might get the closest to recovering the desired ideal, and hence maximizing the marketability of the shares while remaining non-custodial and no-mainchain-upgrade-required.\n\n### speaking of design parameters\n\n@ZmnSCPxj While writing this post, it occurred to me that the OP which delineates the overall design of p2share does not explicitly state that when a payout happens (i.e. when that lucky shareholder is allocated the entire mainchain bitcoin reward), that the shareholder's shares are destroyed. \n\nRather, in the OP I presented it more similar to a distribution of profits rather than a share buyback. The buyback/redemption model is probably the better model. However, I remember now why I arrived at the distributional design. It was because I could not solve the following problem cleanly: \n\nTo actually implement the buyback model, the sharechain would need to carry, as part of its state, the current \"price per share.\" This is so sharechain nodes can calculate how many of the selected shareholder's shares to buyback (destroy). Even if this calculation is somehow possible in an objective oracle-free manner (a tough, maybe impossible challenge in it of itself!), it triggers some other issues:\n\n1. Overflow - what if the selected shareholder does not have enough shares to \"sell\" back? Where does the excess btc reward go then? Since we want to remain non-custodial, one idea would be to randomly select a second shareholder and buy their shares back, and so on, until the reward has been exhausted. With each new selected shareholder the mainchain coinbase output set grows, so we start losing our precious blockspace and we end up back at the original P2Pool bloated coinbase problem.\n\n2. Market depth - even if we could have the sharechain objectively converge on a price per share and use it for these buybacks, it should also characterize market depth, and so then now we have to somehow emulate an entire order book inside sharechain...\n\nThat is when I stopped and switched to the \"just distribute the entire reward to the randomly selected shareholder\" model. But I suppose there is an unexplored third model of, \"choose one lucky shareholder and buy/destroy all the shares in that share output, and assign that shareholder the entire mainchain reward.\" Naturally large shareholders would then split their share holding across multiple outputs. This would not affect their probability of being selected, but it would minimize how many shares they sell if they are selected. This behavior likely puts downward pressure on the share price (assuming there is any such price at all!), not to mention unnecessarily bloats the sharechain utxo set. Nevertheless, maybe there is something here.\n\n---\n[^future_hashrate]: whether there will be future hashrate, and how much, is accounted for in the `d_time` discount factor. It is a statement or expectation about the future, and hence about the time value of money.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 125,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Thanks for providing some more details regarding your current design parameters. Here are some not-very-formal thoughts. I hope they are helpful: \n\nThe discount is determined by the market… \n\nThe total discount factor d, a number in the range [0,1], can be broken into two components d = d_time*d_par&hellip;",
  "truncated": true,
  "post_url": "/t/p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner/2093/12",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}