{
  "id": 6282,
  "name": "VzxPLnHqr",
  "username": "VzxPLnHqr",
  "avatar_template": "/user_avatar/delvingbitcoin.org/vzxplnhqr/{size}/121_2.png",
  "created_at": "2025-11-19T01:54:33.609Z",
  "cooked": "<h2><a name=\"p-6282-on-incentive-compatibility-updated-share-issuance-mechanism-1\" class=\"anchor\" href=\"#p-6282-on-incentive-compatibility-updated-share-issuance-mechanism-1\"></a>on incentive compatibility (updated share issuance mechanism)</h2>\n<p>On further reflection, rather than tie sharechain issuance to a shrinking-pie schedule like Bitcoin (as proposed in the original p2share example above), we might be able to <strong>recover incentive compatibility by simply issuing a constant number of shares per unit work.</strong></p>\n<p>Bitcoin’s base “unit of work” is 2^32 sha256d attempts. Now, given that in 2025 we have sha256d available ASICS right out of the gate, we should probably raise sharechain’s “unit of work” to something higher. The actual value is not important, but a reasonable choice could be found empirically.</p>\n<p>With this modification, the sharechain ledger will represent all contributed work over time. It is a fair  accounting because the sharechain still has its own difficulty adjustment algorithm.</p>\n<p>The “select a random shareholder” technique from the original design remains unchained.</p>\n<p>For concreteness, let the share <code>S</code> issuance per sharechain block be something like <code>S = c*D_sharechain</code>, for some constant <code>c</code> which is set at genesis.</p>\n<p>As hash rate of the sharechain grows, the issuance of shares grows too, so there is inflation from a share supply standpoint. However, there is still always a chance that one of your early shares (from back when hash rate was small) will be the randomly selected share.</p>\n<p>Similarly, when the hash rate of the sharechain drops, the number of shares issued per block will drop accordingly.</p>\n<p>Now, let us imagine a scenario where the sharechain hash rate grows 100x (say this happens across multiple difficulty adjustments even), and then stays there for some time, only to eventually drop down to the orignal 1x. Because the number of shares being issued is proportional to difficulty, the number of shares which were issued in the “high difficulty” period will <em>vastly</em> out number the number which are issued during the “low difficulty” period.</p>\n<p>However, individual miners aren’t being disproportionately rewarded; the system is just scaling issuance to match the collective effort. It is a pure representation<sup class=\"footnote-ref\"><a href=\"#footnote-6282-1\" id=\"footnote-ref-6282-1\">[1]</a></sup> of the notion of proportional fairness.<sup class=\"footnote-ref\"><a href=\"#footnote-6282-2\" id=\"footnote-ref-6282-2\">[2]</a></sup></p>\n<p>This might in fact recover incentive compatibility such that it is “just as rational” to mine bitcoin indirectly by mining on a p2share chain as it would be to mine bitcoin directly (solo or via pool).</p>\n<p>As <a class=\"mention\" href=\"/u/zmnscpxj\">@ZmnSCPxj</a> elegantly put it earlier, this is “mining bitcoin with extra steps,” but if it degenerates to an acceptable notion of incentive compatibility (in expectation), while remaining trustless and decentralized, then perhaps the extra steps may be worth it for many?</p>\n<hr>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"footnote-6282-1\" class=\"footnote-item\"><p>speaking of representations: yes, this does mean that if the sharechain starts at difficulty 1 and grows exponentially over time, that we might need larger than 64-bits to represent sharechain amounts. But it is also not 2009 anymore, so that is probably not too much of an issue. <a href=\"#footnote-ref-6282-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-6282-2\" class=\"footnote-item\"><p>admittedly, not everyone agrees that proportional fairness is the “correct” notion of fairness in all circumstances. However, in a trustless, decentralized system like bitcoin, or this p2share mechanism, we can argue that it is the correct notion of fairness. <a href=\"#footnote-ref-6282-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>",
  "post_number": 13,
  "post_type": 1,
  "posts_count": 14,
  "updated_at": "2025-11-19T01:54:33.609Z",
  "reply_count": 1,
  "reply_to_post_number": 12,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 4,
  "readers_count": 3,
  "score": 5.8,
  "yours": false,
  "topic_id": 2093,
  "topic_slug": "p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner",
  "topic_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "topic_html_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "category_id": 7,
  "display_username": "VzxPLnHqr",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 125,
    "username": "VzxPLnHqr",
    "name": "VzxPLnHqr",
    "avatar_template": "/user_avatar/delvingbitcoin.org/vzxplnhqr/{size}/121_2.png"
  },
  "bookmarked": false,
  "raw": "## on incentive compatibility (updated share issuance mechanism)\n\nOn further reflection, rather than tie sharechain issuance to a shrinking-pie schedule like Bitcoin (as proposed in the original p2share example above), we might be able to **recover incentive compatibility by simply issuing a constant number of shares per unit work.**\n\nBitcoin's base \"unit of work\" is 2^32 sha256d attempts. Now, given that in 2025 we have sha256d available ASICS right out of the gate, we should probably raise sharechain's \"unit of work\" to something higher. The actual value is not important, but a reasonable choice could be found empirically.\n\nWith this modification, the sharechain ledger will represent all contributed work over time. It is a fair  accounting because the sharechain still has its own difficulty adjustment algorithm.\n\nThe \"select a random shareholder\" technique from the original design remains unchained.\n\nFor concreteness, let the share `S` issuance per sharechain block be something like `S = c*D_sharechain`, for some constant `c` which is set at genesis. \n\nAs hash rate of the sharechain grows, the issuance of shares grows too, so there is inflation from a share supply standpoint. However, there is still always a chance that one of your early shares (from back when hash rate was small) will be the randomly selected share.\n\nSimilarly, when the hash rate of the sharechain drops, the number of shares issued per block will drop accordingly. \n\nNow, let us imagine a scenario where the sharechain hash rate grows 100x (say this happens across multiple difficulty adjustments even), and then stays there for some time, only to eventually drop down to the orignal 1x. Because the number of shares being issued is proportional to difficulty, the number of shares which were issued in the \"high difficulty\" period will _vastly_ out number the number which are issued during the \"low difficulty\" period.\n\nHowever, individual miners aren't being disproportionately rewarded; the system is just scaling issuance to match the collective effort. It is a pure representation[^representation] of the notion of proportional fairness.[^proportional]\n\nThis might in fact recover incentive compatibility such that it is \"just as rational\" to mine bitcoin indirectly by mining on a p2share chain as it would be to mine bitcoin directly (solo or via pool). \n\nAs @ZmnSCPxj elegantly put it earlier, this is \"mining bitcoin with extra steps,\" but if it degenerates to an acceptable notion of incentive compatibility (in expectation), while remaining trustless and decentralized, then perhaps the extra steps may be worth it for many?\n\n\n---\n\n[^representation]: speaking of representations: yes, this does mean that if the sharechain starts at difficulty 1 and grows exponentially over time, that we might need larger than 64-bits to represent sharechain amounts. But it is also not 2009 anymore, so that is probably not too much of an issue.\n\n[^proportional]: admittedly, not everyone agrees that proportional fairness is the \"correct\" notion of fairness in all circumstances. However, in a trustless, decentralized system like bitcoin, or this p2share mechanism, we can argue that it is the correct notion of fairness.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 125,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "<a name=\"p-6282-on-incentive-compatibility-updated-share-issuance-mechanism-1\" class=\"anchor\" href=\"#p-6282-on-incentive-compatibility-updated-share-issuance-mechanism-1\"></a>on incentive compatibility (updated share issuance mechanism)\nOn further reflection, rather than tie sharechain issuance to a shrinking-pie schedule like Bitcoin (as proposed in the original p2share example above), we might be able to recover incentive compatibility by simply issuing a constant numb&hellip;",
  "truncated": true,
  "post_url": "/t/p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner/2093/13",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}