{
  "id": 6295,
  "name": "VzxPLnHqr",
  "username": "VzxPLnHqr",
  "avatar_template": "/user_avatar/delvingbitcoin.org/vzxplnhqr/{size}/121_2.png",
  "created_at": "2025-11-20T01:43:27.222Z",
  "cooked": "<p>After re-reading this thread, it is clear that it would be difficult for a newcomer to fully come up to speed with what is being discussed here. Additionally, some of the design parameters have been refined. Below is an attempt to distill things into a more intuitive picture which is consistent with my current thinking about it.</p>\n<p><em>[Disclaimer: I used an LLM to help create this summary, but spent a lot of time carefully reviewing and editing it before posting here.]</em></p>\n<h2><a name=\"p-6295-the-story-so-far-1\" class=\"anchor\" href=\"#p-6295-the-story-so-far-1\"></a>The Story So Far</h2>\n<p>P2Share is a decentralized mining framework that builds on the legacy of P2Pool, enabling Bitcoin miners and non-miners to form symbiotic sub-networks called sharechains. These sharechains operate as valid Bitcoin mining pools from the perspective of the mainnet, contributing hash power to Bitcoin’s security while introducing their own internal unit of account – ransferable “shares.” Unlike traditional altcoins or forks that dilute Bitcoin’s proof-of-work (PoW) by splitting thermodynamic effort, sharechains align fully with Bitcoin’s consensus, ensuring <strong>all work bolsters mainnet security without requiring any changes to Bitcoin itself.</strong></p>\n<h3><a name=\"p-6295-core-mechanism-of-sharechains-2\" class=\"anchor\" href=\"#p-6295-core-mechanism-of-sharechains-2\"></a>Core Mechanism of Sharechains</h3>\n<p>At its heart, a sharechain is a separate blockchain that miners participate in to collectively mine Bitcoin blocks. Miners submit low-difficulty shares to the sharechain, which adjusts its own difficulty independently.</p>\n<p>The hash of the sharechain blockheader is inserted within mainchain block template. The template is constructed by the sharechain miner in accordance with both sharechain consensus and Bitcoin consensus. Sharechain consensus specifies what the miner is to place in the bitcoin block’s coinbase output (more on this later). Sharechain consensus also requires that the bitcoin block be valid according to Bitcoin consensus in every way except for possibly not meeting the Bitcoin difficulty requirement.</p>\n<p>Within the bitcoin block, a sharechain miner is free to choose and include whichever bitcoin transactions she wants, so long as they are valid according to Bitcoin consensus. Within the sharechain, in addition to assigning herself the share reward, she is also free to choose and include whichever sharechain transactions she wants, so long as those transactions are valid according to sharechain consensus.</p>\n<p>When the sharechain’s combined effort eventually produces a valid Bitcoin block, the Bitcoin reward (subsidy plus fees) is assigned not pro-rata to all participants, but <em>to a single pseudorandomly selected shareholder.</em> At sharechain height <code>i</code>, sharechain miners are working to find sharechain block <code>i+1</code>. The selection for which share is chosen is derived from the sharechain’s most recently mined block, using a mechanism like <code>q(i+1) = sha256(\"q selector\" || sharechain_blockheader_i) mod total_shares_outstanding</code>. In expectation, this is equivalent to proportional distribution, as the probability of selection scales with shares owned.</p>\n<p>To minimize Bitcoin mainnet block space usage, which was a key limitation of original P2Pool design, the coinbase transaction outputs to just one address: that of the selected shareholder. This maximizes room for fee-paying transactions, enhancing overall revenue potential. Shares themselves are minted and distributed via the sharechain’s PoW, and they can be traded trustlessly via atomic swaps with Bitcoin, potentially establishing a market price in satoshis.</p>\n<h3><a name=\"p-6295-incentive-compatible-share-issuance-3\" class=\"anchor\" href=\"#p-6295-incentive-compatible-share-issuance-3\"></a>Incentive-Compatible Share Issuance</h3>\n<p>The design aims for incentive compatibility by issuing a constant number of shares per unit of work, rather than following a fixed halving schedule like Bitcoin. Specifically, share issuance per block is <code>S = c * D_sharechain</code>, where <code>c</code> is an emperically determined genesis constant and <code>D_sharechain</code> is the current sharechain difficulty. This ties issuance directly to contributed work, creating inflation in share supply as hash rate grows, but preserving proportional fairness across all historical work.</p>\n<ul>\n<li>\n<p><strong>Why this recovers incentive compatibility</strong>: Each share represents a consistent unit of PoW effort, adjusted for difficulty changes. Early shares retain value because the random selection draws from the entire ledger, giving them ongoing chances at Bitcoin rewards even as the network scales. In scenarios of hash rate fluctuations (e.g., a 100x increase followed by a drop), issuance scales accordingly, ensuring no disproportionate rewards; miners are compensated based on collective effort over time.</p>\n</li>\n<li>\n<p><strong>Alignment with existing models</strong>: This mirrors Pay-Per-Last-N-Shares (PPLNS) in expectation, where <code>N</code> encompasses all shares ever issued, and difficulty adjustments normalize work per share. PPLNS is widely used in mining pools due to its proven rationality, balancing real costs like electricity with predictable payouts. Here, miners rationally participate if their share holdings match their hash rate contribution, protecting against dilution while mining Bitcoin indirectly.</p>\n</li>\n<li>\n<p><strong>Nodes set and enforce sharechain consensus</strong>: Just as with Bitcoin, not all sharechain nodes need be mining nodes. Just as with Bitcoin, consensus is set and enforced by the nodes collectively, and only a subset of those nodes are mining nodes. <em>A fully validating sharechain node is also, by definition, a fully validating Bitcoin node.</em> Notably, however, because any sharechain node with a nonzero share balance has a chance to receive the Bitcoin reward, there is a modicum of incentive to run a sharechain node.</p>\n</li>\n</ul>\n<p>This setup degrades gracefully to solo mining “with extra steps,” but the extras provide trustless decentralization: miners avoid custodial risks of centralized pools, and there is incentive to hold shares as “equity” in future earnings. This is somewhat akin to buying equity in a Bitcoin-aligned venture, but more transparent, borderless, and argubably just plain better – but still risky! Shares are merely a probabilistic claim on the future Bitcoin earnings of the sharechain, if any. This is not very different from equity in a startup.</p>\n<h3><a name=\"p-6295-benefits-for-the-bitcoin-ecosystem-4\" class=\"anchor\" href=\"#p-6295-benefits-for-the-bitcoin-ecosystem-4\"></a>Benefits for the Bitcoin Ecosystem</h3>\n<p>Sharechains enhance Bitcoin without threatening its conservative core. They serve as testing grounds for innovative features, such as new scripting, anti-spam measures, or L2 integrations that might not suit mainnet, yet information about which may be nonetheless helpful. Consensus changes within a sharechain can signal preferences and/or readiness to Bitcoin via miner commitments, fostering decentralized coordination. There is also information in relative sharechain prices. For instance, multiple sharechains could emerge with distinct rules, and their relative share prices (realized via atomic swaps) would reflect market demand, thereby providing valuable signals without taking any hash power away from Bitcoin.</p>\n<p>Ephemeral or speculative sharechains are viable too, as they still contribute PoW to Bitcoin at real cost. Successful innovations could lead to mergers, where one chain absorbs another’s shares and features via a hard fork, backporting value while keeping everything within the Bitcoin ecosystem. Spam is managed internally, with reckless chains likely facing devalued shares, rewarding prudent stewardship.</p>\n<p>From a game-theoretic view, sharechains deter attacks: 51% attempts on a sharechain cost attackers mainnet revenue, and Bitcoin-friendly miners may defend them to preserve overall security. Grinding attacks (e.g., nonce manipulation to self-assign rewards) become uneconomical at equilibrium difficulty, as the extra work outweighs benefits.</p>\n<p>In essence, P2Share offers a fair, efficient path to decentralize mining further, channel experimental energy back into Bitcoin, and convert potentially wasted PoW into additive security, <strong>all while remaining fully compatible and incentive-aligned with Bitcoin.</strong> This could empower Bitcoiners to innovate symbiotically, strengthening the network’s resilience without compromise.</p>",
  "post_number": 16,
  "post_type": 1,
  "posts_count": 16,
  "updated_at": "2025-11-20T01:43:27.222Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 3,
  "readers_count": 2,
  "score": 0.6,
  "yours": false,
  "topic_id": 2093,
  "topic_slug": "p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner",
  "topic_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "topic_html_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "category_id": 7,
  "display_username": "VzxPLnHqr",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "After re-reading this thread, it is clear that it would be difficult for a newcomer to fully come up to speed with what is being discussed here. Additionally, some of the design parameters have been refined. Below is an attempt to distill things into a more intuitive picture which is consistent with my current thinking about it.\n\n_[Disclaimer: I used an LLM to help create this summary, but spent a lot of time carefully reviewing and editing it before posting here.]_\n\n## The Story So Far\n\nP2Share is a decentralized mining framework that builds on the legacy of P2Pool, enabling Bitcoin miners and non-miners to form symbiotic sub-networks called sharechains. These sharechains operate as valid Bitcoin mining pools from the perspective of the mainnet, contributing hash power to Bitcoin's security while introducing their own internal unit of account -- ransferable \"shares.\" Unlike traditional altcoins or forks that dilute Bitcoin's proof-of-work (PoW) by splitting thermodynamic effort, sharechains align fully with Bitcoin's consensus, ensuring **all work bolsters mainnet security without requiring any changes to Bitcoin itself.**\n\n### Core Mechanism of Sharechains\nAt its heart, a sharechain is a separate blockchain that miners participate in to collectively mine Bitcoin blocks. Miners submit low-difficulty shares to the sharechain, which adjusts its own difficulty independently. \n\nThe hash of the sharechain blockheader is inserted within mainchain block template. The template is constructed by the sharechain miner in accordance with both sharechain consensus and Bitcoin consensus. Sharechain consensus specifies what the miner is to place in the bitcoin block's coinbase output (more on this later). Sharechain consensus also requires that the bitcoin block be valid according to Bitcoin consensus in every way except for possibly not meeting the Bitcoin difficulty requirement.\n\nWithin the bitcoin block, a sharechain miner is free to choose and include whichever bitcoin transactions she wants, so long as they are valid according to Bitcoin consensus. Within the sharechain, in addition to assigning herself the share reward, she is also free to choose and include whichever sharechain transactions she wants, so long as those transactions are valid according to sharechain consensus.\n\nWhen the sharechain's combined effort eventually produces a valid Bitcoin block, the Bitcoin reward (subsidy plus fees) is assigned not pro-rata to all participants, but _to a single pseudorandomly selected shareholder._ At sharechain height `i`, sharechain miners are working to find sharechain block `i+1`. The selection for which share is chosen is derived from the sharechain's most recently mined block, using a mechanism like `q(i+1) = sha256(\"q selector\" || sharechain_blockheader_i) mod total_shares_outstanding`. In expectation, this is equivalent to proportional distribution, as the probability of selection scales with shares owned.\n\nTo minimize Bitcoin mainnet block space usage, which was a key limitation of original P2Pool design, the coinbase transaction outputs to just one address: that of the selected shareholder. This maximizes room for fee-paying transactions, enhancing overall revenue potential. Shares themselves are minted and distributed via the sharechain's PoW, and they can be traded trustlessly via atomic swaps with Bitcoin, potentially establishing a market price in satoshis.\n\n### Incentive-Compatible Share Issuance\nThe design aims for incentive compatibility by issuing a constant number of shares per unit of work, rather than following a fixed halving schedule like Bitcoin. Specifically, share issuance per block is `S = c * D_sharechain`, where `c` is an emperically determined genesis constant and `D_sharechain` is the current sharechain difficulty. This ties issuance directly to contributed work, creating inflation in share supply as hash rate grows, but preserving proportional fairness across all historical work.\n\n- **Why this recovers incentive compatibility**: Each share represents a consistent unit of PoW effort, adjusted for difficulty changes. Early shares retain value because the random selection draws from the entire ledger, giving them ongoing chances at Bitcoin rewards even as the network scales. In scenarios of hash rate fluctuations (e.g., a 100x increase followed by a drop), issuance scales accordingly, ensuring no disproportionate rewards; miners are compensated based on collective effort over time.\n\n- **Alignment with existing models**: This mirrors Pay-Per-Last-N-Shares (PPLNS) in expectation, where `N` encompasses all shares ever issued, and difficulty adjustments normalize work per share. PPLNS is widely used in mining pools due to its proven rationality, balancing real costs like electricity with predictable payouts. Here, miners rationally participate if their share holdings match their hash rate contribution, protecting against dilution while mining Bitcoin indirectly.\n\n- **Nodes set and enforce sharechain consensus**: Just as with Bitcoin, not all sharechain nodes need be mining nodes. Just as with Bitcoin, consensus is set and enforced by the nodes collectively, and only a subset of those nodes are mining nodes. _A fully validating sharechain node is also, by definition, a fully validating Bitcoin node._ Notably, however, because any sharechain node with a nonzero share balance has a chance to receive the Bitcoin reward, there is a modicum of incentive to run a sharechain node.\n\nThis setup degrades gracefully to solo mining \"with extra steps,\" but the extras provide trustless decentralization: miners avoid custodial risks of centralized pools, and there is incentive to hold shares as \"equity\" in future earnings. This is somewhat akin to buying equity in a Bitcoin-aligned venture, but more transparent, borderless, and argubably just plain better -- but still risky! Shares are merely a probabilistic claim on the future Bitcoin earnings of the sharechain, if any. This is not very different from equity in a startup.\n\n### Benefits for the Bitcoin Ecosystem\nSharechains enhance Bitcoin without threatening its conservative core. They serve as testing grounds for innovative features, such as new scripting, anti-spam measures, or L2 integrations that might not suit mainnet, yet information about which may be nonetheless helpful. Consensus changes within a sharechain can signal preferences and/or readiness to Bitcoin via miner commitments, fostering decentralized coordination. There is also information in relative sharechain prices. For instance, multiple sharechains could emerge with distinct rules, and their relative share prices (realized via atomic swaps) would reflect market demand, thereby providing valuable signals without taking any hash power away from Bitcoin.\n\nEphemeral or speculative sharechains are viable too, as they still contribute PoW to Bitcoin at real cost. Successful innovations could lead to mergers, where one chain absorbs another's shares and features via a hard fork, backporting value while keeping everything within the Bitcoin ecosystem. Spam is managed internally, with reckless chains likely facing devalued shares, rewarding prudent stewardship.\n\nFrom a game-theoretic view, sharechains deter attacks: 51% attempts on a sharechain cost attackers mainnet revenue, and Bitcoin-friendly miners may defend them to preserve overall security. Grinding attacks (e.g., nonce manipulation to self-assign rewards) become uneconomical at equilibrium difficulty, as the extra work outweighs benefits.\n\nIn essence, P2Share offers a fair, efficient path to decentralize mining further, channel experimental energy back into Bitcoin, and convert potentially wasted PoW into additive security, **all while remaining fully compatible and incentive-aligned with Bitcoin.** This could empower Bitcoiners to innovate symbiotically, strengthening the network's resilience without compromise.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 125,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "After re-reading this thread, it is clear that it would be difficult for a newcomer to fully come up to speed with what is being discussed here. Additionally, some of the design parameters have been refined. Below is an attempt to distill things into a more intuitive picture which is consistent with&hellip;",
  "truncated": true,
  "post_url": "/t/p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner/2093/16",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}