{
  "id": 6196,
  "name": "VzxPLnHqr",
  "username": "VzxPLnHqr",
  "avatar_template": "/user_avatar/delvingbitcoin.org/vzxplnhqr/{size}/121_2.png",
  "created_at": "2025-11-07T01:06:06.018Z",
  "cooked": "<p>Hi everyone,</p>\n<p>I have been thinking about this topic for a while and wanted to share it here for discussion.</p>\n<p><em>TL;DR:</em> I wonder if there is some under-investigated territory where we can have efficient decentralized mining <s>pools</s> networks and use these networks as testing beds for new features. No mainchain changes required.</p>\n<p>Feedback very welcome!</p>\n<h1><a name=\"p-6196-p2share-1\" class=\"anchor\" href=\"#p-6196-p2share-1\"></a>p2share</h1>\n<p>A <strong>p2share</strong> network is a distributed bitcoin mining <s>pool</s> network with transferrable rewards (shares).</p>\n<h3><a name=\"p-6196-a-mining-pool-which-is-actually-a-network-of-its-own-2\" class=\"anchor\" href=\"#p-6196-a-mining-pool-which-is-actually-a-network-of-its-own-2\"></a><strong>A mining pool which is actually a network of its own.</strong></h3>\n<p>Imagine a bitcoin mining <s>pool</s> network that operates very similarly to bitcoin itself:</p>\n<ul>\n<li>The network has its own consensus rules and “full nodes” which set and enforce the rules.</li>\n<li>The network rewards miners with “shares” when they create a valid block.</li>\n<li>Shares are transferrable among network participants (shareholders).</li>\n<li>Additional consensus rules, with different or experimental features, may also be in place.\n<ul>\n<li>For example, the network might use a mechanism like <code>sighash_anyprevout</code>, <code>op_cat</code>, or other covenant tools.</li>\n<li>The network might have adjusted block size limits.</li>\n<li>It may even support confidential transactions.</li>\n</ul>\n</li>\n<li><strong>Most importantly, when the network mines a valid mainchain bitcoin block, the entire bitcoin reward is assigned to a <em>single, randomly selected shareholder</em>.</strong><sup class=\"footnote-ref\"><a href=\"#footnote-6196-1\" id=\"footnote-ref-6196-1\">[1]</a></sup>\n<ul>\n<li>Rather than distributing rewards to everyone (or using a centralized service), the coinbase output is constructed to pay out to the one eligible share.</li>\n<li>This design keeps the bitcoin coinbase output compact, reducing transaction bloat and maximizing revenue from fee-paying bitcoin transactions.</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"p-6196-example-a-sharechain-network-3\" class=\"anchor\" href=\"#p-6196-example-a-sharechain-network-3\"></a>Example: a sharechain network</h3>\n<p>Let us call the above contemplated network a “sharechain” network. From the perspective of bitcoin mainchain, it appears <strong>simply as a mining pool</strong>. However, the sharechain enforces its own consensus rules, and one particularly unique rule concerns how bitcoin rewards are paid out.</p>\n<p>Here is the process in more detail:</p>\n<ol>\n<li>\n<p><strong>The Network Operates like Bitcoin:</strong><br>\nImagine the sharechain is built in close analogy to bitcoin:</p>\n<ul>\n<li>It has a 10-minute block time.<sup class=\"footnote-ref\"><a href=\"#footnote-6196-2\" id=\"footnote-ref-6196-2\">[2]</a></sup></li>\n<li>It starts with 50 shares per block with a halving schedule like bitcoin’s</li>\n<li>The resulting deterministic “shrinking-pie” effect mimics bitcoin’s supply schedule.<sup class=\"footnote-ref\"><a href=\"#footnote-6196-3\" id=\"footnote-ref-6196-3\">[3]</a></sup></li>\n</ul>\n</li>\n<li>\n<p><strong>Miners Construct Their Block According to Dual Rules:</strong><br>\nMary, a sharechain miner, works on a valid bitcoin mainchain block template of her choosing. She selects the bitcoin transactions but must organize the bitcoin coinbase output under strict sharechain consensus rules:</p>\n<ul>\n<li><strong>Key Rule:</strong> The coinbase output must pay the public key corresponding to the owner of a specific share called <code>q</code>.</li>\n</ul>\n</li>\n<li>\n<p><strong>Random Selection of the Reward Recipient:</strong><br>\nSuppose the sharechain is currently at block height <code>i</code> (i.e. all miners are searching for sharechain block <code>i+1</code>). Then, as part of constructing the bitcoin block template:</p>\n<ul>\n<li>\n<p>A value <code>q</code> is determined using a function similar to:</p>\n<p><code>q = sha256(\"q selector\" || sharechain_blockheader_i) mod n</code></p>\n<p>where <span class=\"math\">n</span> is the total number of shares outstanding at block <code>i</code>.</p>\n</li>\n<li>\n<p><strong>Clarification:</strong><br>\nThis calculation employs a tagged hash that guarantees a <strong>uniform, pseudorandom selection</strong> among all shares. Every sharechain node will compute the same <span class=\"math\">q</span> from the shared consensus state and agree on which share (and its owner) is designated to receive the bitcoin reward.<sup class=\"footnote-ref\"><a href=\"#footnote-6196-4\" id=\"footnote-ref-6196-4\">[4]</a></sup></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Assigning the Bitcoin Reward:</strong><br>\nMary looks up the designated share (at position <span class=\"math\">q</span>) in the sharechain’s UTXO set:</p>\n<ul>\n<li>Each share in the UTXO set is ordered canonically, ensuring consistency.</li>\n<li>The bitcoin coinbase output is constructed to pay the public key associated with the selected share.</li>\n<li><strong>Important Outcome:</strong> Even if Mary mines the block and collects the share reward (the sharebase output), the bitcoin reward itself is not automatically hers. Instead, it goes to the owner of share <span class=\"math\">q</span>. The probability that Mary receives the bitcoin reward is precisely <span class=\"math\">v / n</span> if she owns <span class=\"math\">v</span> out of <span class=\"math\">n</span> shares.</li>\n</ul>\n</li>\n<li>\n<p><strong>Why is This Random Payout Mechanism OK?</strong></p>\n<ul>\n<li><strong>Fairness in Expectation:</strong><br>\nAlthough each block’s bitcoin reward is given entirely to one randomly selected shareholder, when considered over many blocks, every share is rewarded proportionally to its prevalence in the total supply. In expectation, it works much like a pro-rata distribution.</li>\n<li><strong>Economical and Efficient:</strong><br>\nBy assigning the payout to a single share, the bitcoin coinbase output remains small. This efficiency leaves more room for fee-paying transactions, maximizing revenue.</li>\n<li><strong>Trustless and Decentralized:</strong><br>\nThe random selection is completely deterministic and enforced by consensus rules. No centralized authority or federation is needed, preserving the trustless nature of both the sharechain network and bitcoin.</li>\n<li><strong>Incentive Alignment:</strong><br>\nMiners are motivated to accumulate shares since owning a higher fraction improves their odds of winning the bitcoin reward, whether during active mining or while holding shares as a speculative asset.</li>\n</ul>\n</li>\n</ol>\n<h3><a name=\"p-6196-some-observations-4\" class=\"anchor\" href=\"#p-6196-some-observations-4\"></a>Some Observations</h3>\n<p><strong>Impact on the Miner:</strong><br>\nIf Mary holds all the shares, then the system essentially reverts to solo mining bitcoin. However, as soon as the share ownership is spread among various parties, there is a chance (<span class=\"math\">1 - v/n</span> for Mary when holding <span class=\"math\">v</span> of <span class=\"math\">n</span> shares) that a randomly chosen share could belong to someone else. Over time, however, the expectation is for rewards to be distributed fairly in line with each miner’s share of the total.<sup class=\"footnote-ref\"><a href=\"#footnote-6196-5\" id=\"footnote-ref-6196-5\">[5]</a></sup></p>\n<p><strong>Speculative and Functional Benefits:</strong><br>\nEven if a miner ends up not winning a particular bitcoin reward, owning shares means that, over time, every share represents a chance at the reward. This quality may add an intrinsic or speculative value to shares, possibly fostering a secondary market—beneficial for atomic swaps or other network functionalities.</p>\n<h2><a name=\"p-6196-open-questions-5\" class=\"anchor\" href=\"#p-6196-open-questions-5\"></a>Open Questions</h2>\n<ul>\n<li>\n<h3><a name=\"p-6196-is-it-incentive-compatible-to-mine-on-this-chain-6\" class=\"anchor\" href=\"#p-6196-is-it-incentive-compatible-to-mine-on-this-chain-6\"></a>Is it incentive-compatible to mine on this chain?</h3>\n</li>\n</ul>\n<p>In our approach the shares are issued in a fashion similar to bitcoin where earlier miners will obtain more shares per block than later miners. Maybe this tweak alone is enough to render the approach viable? or to render it non-viable? It is hard to know at this point in our analysis.</p>\n<ul>\n<li>\n<h3><a name=\"p-6196-is-a-sharechain-a-sidechain-7\" class=\"anchor\" href=\"#p-6196-is-a-sharechain-a-sidechain-7\"></a>Is a sharechain a sidechain?</h3>\n</li>\n</ul>\n<p>A consequence of having a deterministic share supply is that the internal unit of account of the sharechain network will not be 1:1 with bitcoin.</p>\n<p>This lack of parity is upsetting to many bitcoiners who seek the holy grail of a trustless-2-way-peg and may be enough to label this approach as antithetical to bitcoin, label the sharechain network as an altcoin, or otherwise consisder it as an “attack” on bitcoin. However, these actions say little about whether it is incentive-compatible (i.e. rational) for a bitcoiner, or any sha256D-capable miner for that matter, to mine on the sharechain.</p>\n<p>Is a sha256D-capable miner better off simply mining mainchain bitcoin directly? Maybe? Maybe not?</p>\n<ul>\n<li>\n<h3><a name=\"p-6196-what-happens-if-the-features-offered-by-a-sharechain-network-network-are-incorporated-into-mainnet-bitcoin-8\" class=\"anchor\" href=\"#p-6196-what-happens-if-the-features-offered-by-a-sharechain-network-network-are-incorporated-into-mainnet-bitcoin-8\"></a>What happens if the features offered by a sharechain network network are incorporated into mainnet bitcoin?</h3>\n</li>\n</ul>\n<p>This is an interesting question. If the feature is incorporated (or expected to be) incorporated into mainnet bitcoin, then it seems logical that there would be very little demand for the sharechain shares. Hence, the hash rate of the sharechain network would be small/negligible and the expected value (in sats) of the shares would be negligible.</p>\n<p>On the other hand, if it is highly unlikely that the feature will ever be incorporated into bitcoin <em>and</em> there is demand for the feature, then it seems logical that there could also be significant demand for the sharechain shares. The expected value of the shares (in sats) in this case might be non-negligible.</p>\n<p>Perhaps the most interesting case is one where the feature in question is not likely to be activated on mainnet until well after the sharechain network is expected to win a mainnet block (remember, the sharechain network is essentially a mainnet mining pool). In this manner the price (in sats) of the shares coupled with the sharechain network’s current hashrate can serve somewhat as an informational proxy for the wider bitcoin ecosystem. It might help answer the question, “when will this feature be activated on mainnet?”</p>\n<ul>\n<li>\n<h3><a name=\"p-6196-is-it-an-altcoin-9\" class=\"anchor\" href=\"#p-6196-is-it-an-altcoin-9\"></a>Is it an altcoin?</h3>\n</li>\n</ul>\n<p>Is what is described above an “altcoin”? If the definition of altcoin is a network which uses a different unit of account than bitcoin, then, yes sharechains may be considered altcoins as in this case the shares are acting as the unit of account within the sharechain network.</p>\n<p>However, it is important to remember that unlike forks like BCH, BSV, and really any other PoW network, which split thermodynamic work across incompatible chains and hence detract from the security of mainchain bitcoin, these sharechain networks are in fact, as a core component of their own consensus, valid bitcoin mining networks and are therefore contributing to, not detracting from, the security of mainchain bitcoin.</p>\n<ul>\n<li>\n<h3><a name=\"p-6196-is-it-any-threat-to-bitcoin-mainnet-10\" class=\"anchor\" href=\"#p-6196-is-it-any-threat-to-bitcoin-mainnet-10\"></a>Is it any threat to bitcoin mainnet?</h3>\n</li>\n</ul>\n<p>Probably not, and it is not intended to be. Bitcoiners who want to use the sharechain network can trustlessly obtain shares by mining on the sharechain or purchase them via atomic swaps. For everyone else, the sharechain is simply a mining pool from the perspective of\nbitcoin mainchain, and as such it contributes to the security of bitcoin.</p>\n<ul>\n<li>\n<h3><a name=\"p-6196-will-bitcoin-mainnet-miners-want-to-51-attack-the-sharechain-networks-11\" class=\"anchor\" href=\"#p-6196-will-bitcoin-mainnet-miners-want-to-51-attack-the-sharechain-networks-11\"></a>Will bitcoin mainnet miners want to 51% attack the sharechain networks?</h3>\n</li>\n</ul>\n<p>Maybe? But they will lose regular mining revenue in the process. Eventually mainchain bitcoin miners stopped even caring about the BCH/BSV forks, and that makes sense because those forks are incompatible with mainchain bitcoin. BCH and BSV consensus rules do not add to the PoW security of mainchain bitcoin. Rather, they detract from it.</p>\n<p>These sharechain networks are different in that the network itself is actually trying to mine a mainchain bitcoin block. They lose both the mainchain bitcoin rewards <em>and</em> their sharechain network rewards if the bitcoin block is invalid. Therefore, these sharechain networks are in fact as bitcoin-friendly as they can be, and hopefully are less centralized than traditional mining pools. Everybody wins?</p>\n<ul>\n<li>\n<h3><a name=\"p-6196-will-bitcoin-mainnet-miners-provide-protection-from-unfriendly-sha256d-miners-12\" class=\"anchor\" href=\"#p-6196-will-bitcoin-mainnet-miners-provide-protection-from-unfriendly-sha256d-miners-12\"></a>Will bitcoin mainnet miners provide protection from unfriendly sha256D miners?</h3>\n</li>\n</ul>\n<p>Maybe there is some game theory which would indicate that it is in the best interest of all bitcoin-friendly sha256D miners to “protect” these sharechain networks if they are ever under PoW attack.</p>\n<h2><a name=\"p-6196-conclusion-13\" class=\"anchor\" href=\"#p-6196-conclusion-13\"></a>Conclusion</h2>\n<p><strong>In summary:</strong> p2share keeps bitcoin’s conservative security model intact but offers a fresh incentive mechanism that is fair, efficient, and aligned with the idea of a decentralized, innovative ecosystem.</p>\n<hr>\n<p>(Thank you for reading this far! You can probably stop reading now, but if you are curious, here are more notes and background<sup class=\"footnote-ref\"><a href=\"#footnote-6196-6\" id=\"footnote-ref-6196-6\">[6]</a></sup> and a thought experiment<sup class=\"footnote-ref\"><a href=\"#footnote-6196-7\" id=\"footnote-ref-6196-7\">[7]</a></sup>)</p>\n<h5><a name=\"p-6196-footnotes-14\" class=\"anchor\" href=\"#p-6196-footnotes-14\"></a>Footnotes</h5>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"footnote-6196-1\" class=\"footnote-item\"><p>Why pay out to a randomly selected shareholder rather than pro-rata to all shareholders?</p>\n<ul>\n<li>\n<p>One reason why P2Pool<sup class=\"footnote-ref\"><a href=\"#footnote-6196-8\" id=\"footnote-ref-6196-8\">[8]</a></sup>, a decentralized bitcoin mining pool, is no longer used for mainchain bitcoin mining is because its coinbase transactions were much larger than trusted-third-party mining pools. As such, there was less room for fee-paying transactions, thereby decreasing expected pool revenue.</p>\n</li>\n<li>\n<p>The coinbase output for P2Pool was large because each eligible shareholder was paid out in the coinbase whenever the pool successfully mined a block. Here we take a different approach and instead pay out a single shareholder selected uniform pseudorandomly. This keeps the bitcoin mainchain coinbase transaction extremely small, thereby maximizing the ability to capture revenue (bitcoin transaction fees).</p>\n</li>\n<li>\n<p>Paying out to a randomly selected shareholder is also a way to avoid requiring a federation of some sort (static or dynamic) to take custody of the btc rewards and distribute them. <strong>Paying out the entire btc reward to the owner of a randomly selected share is equivalent, in expectation, to paying out pro-rata.</strong> It also as an interesting effect of endowing some sort of future value to a share, thereby (possibly) helping to establish a lower bound on a market price (in sats) per share. Such a market price might be useful for parties wishing to complete atomic swaps betweeen sharechain and mainchain bitcoin.</p>\n</li>\n</ul>\n <a href=\"#footnote-ref-6196-1\" class=\"footnote-backref\">↩︎</a></li>\n<li id=\"footnote-6196-2\" class=\"footnote-item\"><p>Why such a long time between blocks? The parameters chosen for the example consensus rules above are just that: an example. However, by targeting a block generation rate which is similar, or longer, than bitcoin, we can reduce the sharechain orphan rate and keep our decentralized mining pool competitive. Stratum V2 can be used both within the sharechain network as well as at the interface between sharechain and mainchain. Let us not worry too much about these particular details right now. Also, from a UI/UX perspective a layer 2 network (e.g. lightning or similar) can be used to reduce the friction of longer block times. <a href=\"#footnote-ref-6196-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-6196-3\" class=\"footnote-item\"><p>There are other ways to create a shrinking-pie effect, some of which even include a notion similar to tail emmission (thereby ensuring block subsidy will always be a non-zero number of shares), but lets skip that discussion for now. The point is that there is the effect of a finite and deterministic supply of shares, and there are multiple ways to achieve that effect. Here we simply chose one that we are all familiar with because it is nearly identical to bitcoin itself. <a href=\"#footnote-ref-6196-3\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-6196-4\" class=\"footnote-item\"><p>Technically the selection of <code>q</code> from the utxo set should probably exclude sharechain coinbase utxos which have not yet matured, but let us skip that detail here for now. <a href=\"#footnote-ref-6196-4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-6196-5\" class=\"footnote-item\"><p>Mary could, of course, try to game the system and find a nonce for her block (block <code>i+1</code>) which would cause the sharechain network to “choose” her as the assignee of the bitcoin reward for the next block (block <code>i+2</code>). This may be a problem in the beginning when the sharechain network difficulty is extremely low. However, as soon as the sharechain difficulty finds equilibrium this attack becomes expensive in that it will require significant extra work to pull off. That work is probably better spent simply mining according to consensus which often will mean assigning a shareholder other than onesself as the would-be-winner of the bitcoin block reward. Afterall, for every valid sharechain block Mary mines, she <em>does</em> get to assign herself the shares! <a href=\"#footnote-ref-6196-5\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-6196-6\" class=\"footnote-item\"><p>Basically there are two problems that we are trying to solve here. The first is that it is extremely frustrating when otherwise good ideas (and people who want to work on them) are basically relegated to “go do it on an altcoin.” So, somewhat like drivechain (but without needing a soft fork), it would be nice to provide a mechanism where those people can still at least hang around the bitcoin ecosystem rather than go enrich a competitor.</p>\n<ul>\n<li>The other thing is that, in the opinion of this author (currently at least), if there is any argument to believe about the “energy waste” of PoW, it is actually to do with the plethora of PoW algorithms. PoW not applied to bitcoin is the extra waste. PoW applied to bitcoin is not waste. Therefore, it would be better if all PoW networks were merge-mined with bitcoin (and from the perspective of bitcoin appear simply as a mining pool) as then at least all PoW networks are adding to, rather than detracting from, bitcoin’s security.</li>\n<li>In other words, any sha256D mining which is not applied to bitcoin (or any PoW mining at all for that matter – from a thermodynamic perspective) is wasted/misallocated use of energy. The idea here is an effort to curtail that, by giving people/networks a better way to do it – <strong>just turn your sh*tcoin network into a bitcoin mining pool and call it good.</strong></li>\n<li>Imagine if ethereum started as, and continued today (and didn’t switch to PoS), just a bitcoin mining pool. It could still have its own unit of account (eth) which is what we are calling “shares” here, and of course there could have still been a bunch of sh*tcoinery on it, but at least if it were a sharechain, it would be adding hashrate to bitcoin which is good.</li>\n<li>Of course it is important that mainchain bitcoin itself stay extremely conservative. That is the beauty of the type of thing we are discussing here. Bitcoin itself can stay as-is and does not need to know or care about any of the things we are talking about here. <strong>From the perspective of Bitcoin, valid hash power is valid no matter its origin</strong> (whether a centralized mining pool, this p2share idea, solo mining, …).</li>\n</ul>\n <a href=\"#footnote-ref-6196-6\" class=\"footnote-backref\">↩︎</a></li>\n<li id=\"footnote-6196-7\" class=\"footnote-item\"><p>Technical details aside, the bigger issue that we are trying to resolve right now is whether the economics of p2share even make sense. Is it ever rational for anybody to even play by p2share rules when mining bitcoin, versus just using the established mining pools or solo mining bitcoin.</p>\n<ul>\n<li>\n<p>The primary, and possibly novel, “tweak” in the design here is is the idea of a blockchain (the p2share sharechain in this case) assigning its bitcoin reward to a random shareholder. We can take a step back, and think about what that might have looked like within bitcoin itself.</p>\n</li>\n<li>\n<p>For example, imagine if, at genesis in 2009 the rules for bitcoin mainchain were actually: miners assign all rewards to the owner of a pseudorandomly selected satoshi.</p>\n</li>\n<li>\n<p>It is weird to think about for sure. If bitcoin operated that way, it seems to change the economics quite a bit at first glance, but it is hard to be certain that the change is long-lived or even adverse. Maybe it is, but maybe it is not.</p>\n</li>\n<li>\n<p>But let us think about it … let us rewind to 2010-2013 or so. Imagine you wanted to mine back then, but owned not a single satoshi at the time. With the hypothetical rules we are contemplating, you could still mine of course – it is just that there would be a 0% chance that you are assigned the reward (this is because you don’t own any sats, so you are not represented on the ledger when the random sat is chosen).</p>\n</li>\n<li>\n<p>But this may not be enough to actually kill the network. Rather, the behavior around mining would have just changed. For example, in that weird world I just described, it would behoove you to buy or otherwise obtain a bunch of sats before you start mining so as to increase your chances of becoming that lucky shareholder.</p>\n</li>\n<li>\n<p>Also, we are setting aside the bootstrapping problem of: if nobody owns sats and the ledger is empty, then how does a prospective miner even buy sats – here let us just assume that satoshi hard-coded that he was the owner of the first 50btc – then by the rule proposed here, he would also be the assignee of the next block reward with 100% possibility, and this would remain true until he sold/transferred some sats to somebody else, and so on. This may seem like the ol’ “pre-mine” trick in disguise, and it sort of is, but not really. Only the first block reward need be hardcoded, the rest is still determined via consensus. Over time that first block reward becomes a de-minimus proportion of the total bitcoin outstanding.</p>\n</li>\n</ul>\n <a href=\"#footnote-ref-6196-7\" class=\"footnote-backref\">↩︎</a></li>\n<li id=\"footnote-6196-8\" class=\"footnote-item\"><p>see <a href=\"https://en.bitcoin.it/wiki/P2Pool\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">P2Pool - Bitcoin Wiki</a> and various attempts at <a href=\"https://github.com/pool2win/p2pool-v2\" rel=\"noopener nofollow ugc\">rebooting p2pool</a> as well as attempts to <a href=\"https://bitcointalk.org/index.php?topic=2135429.0\" rel=\"noopener nofollow ugc\">scale miner share payouts using payment channels</a> rather than huge coinbase transactions. <a href=\"#footnote-ref-6196-8\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 2,
  "updated_at": "2025-11-07T03:46:16.929Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 7,
  "reads": 9,
  "readers_count": 8,
  "score": 51.6,
  "yours": false,
  "topic_id": 2093,
  "topic_slug": "p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner",
  "topic_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "topic_html_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "category_id": 7,
  "display_username": "VzxPLnHqr",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 3,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Hi everyone,\n\nI have been thinking about this topic for a while and wanted to share it here for discussion.\n\n*TL;DR:* I wonder if there is some under-investigated territory where we can have efficient decentralized mining ~~pools~~ networks and use these networks as testing beds for new features. No mainchain changes required.\n\nFeedback very welcome!\n\n# p2share\n\nA **p2share** network is a distributed bitcoin mining ~~pool~~ network with transferrable rewards (shares).\n\n### **A mining pool which is actually a network of its own.**\n\nImagine a bitcoin mining ~~pool~~ network that operates very similarly to bitcoin itself:\n* The network has its own consensus rules and \"full nodes\" which set and enforce the rules.\n* The network rewards miners with \"shares\" when they create a valid block.\n* Shares are transferrable among network participants (shareholders).\n* Additional consensus rules, with different or experimental features, may also be in place.\n     * For example, the network might use a mechanism like `sighash_anyprevout`, `op_cat`, or other covenant tools.\n     * The network might have adjusted block size limits.\n     * It may even support confidential transactions.\n* **Most importantly, when the network mines a valid mainchain bitcoin block, the entire bitcoin reward is assigned to a *single, randomly selected shareholder*.**[^why_random_shareholder]  \n     * Rather than distributing rewards to everyone (or using a centralized service), the coinbase output is constructed to pay out to the one eligible share.\n     * This design keeps the bitcoin coinbase output compact, reducing transaction bloat and maximizing revenue from fee-paying bitcoin transactions.\n\n### Example: a sharechain network\n\nLet us call the above contemplated network a \"sharechain\" network. From the perspective of bitcoin mainchain, it appears **simply as a mining pool**. However, the sharechain enforces its own consensus rules, and one particularly unique rule concerns how bitcoin rewards are paid out.\n\nHere is the process in more detail:\n\n1. **The Network Operates like Bitcoin:**  \n   Imagine the sharechain is built in close analogy to bitcoin:\n   - It has a 10-minute block time.[^block_generation_rate]\n   - It starts with 50 shares per block with a halving schedule like bitcoin's\n   - The resulting deterministic “shrinking-pie” effect mimics bitcoin's supply schedule.[^shrinking_pie]\n\n2. **Miners Construct Their Block According to Dual Rules:**  \n   Mary, a sharechain miner, works on a valid bitcoin mainchain block template of her choosing. She selects the bitcoin transactions but must organize the bitcoin coinbase output under strict sharechain consensus rules:\n   - **Key Rule:** The coinbase output must pay the public key corresponding to the owner of a specific share called `q`.\n\n3. **Random Selection of the Reward Recipient:**  \n   Suppose the sharechain is currently at block height `i` (i.e. all miners are searching for sharechain block `i+1`). Then, as part of constructing the bitcoin block template:  \n   - A value `q` is determined using a function similar to:\n     \n     `q = sha256(\"q selector\" || sharechain_blockheader_i) mod n`\n\n     where $n$ is the total number of shares outstanding at block `i`.\n\n   - **Clarification:**  \n     This calculation employs a tagged hash that guarantees a **uniform, pseudorandom selection** among all shares. Every sharechain node will compute the same $q$ from the shared consensus state and agree on which share (and its owner) is designated to receive the bitcoin reward.[^exclude_immature_sharebase]\n     \n4. **Assigning the Bitcoin Reward:**  \n   Mary looks up the designated share (at position $q$) in the sharechain's UTXO set:\n   - Each share in the UTXO set is ordered canonically, ensuring consistency.\n   - The bitcoin coinbase output is constructed to pay the public key associated with the selected share.\n   - **Important Outcome:** Even if Mary mines the block and collects the share reward (the sharebase output), the bitcoin reward itself is not automatically hers. Instead, it goes to the owner of share $q$. The probability that Mary receives the bitcoin reward is precisely $v / n$ if she owns $v$ out of $n$ shares.\n\n5. **Why is This Random Payout Mechanism OK?**  \n   - **Fairness in Expectation:**  \n     Although each block’s bitcoin reward is given entirely to one randomly selected shareholder, when considered over many blocks, every share is rewarded proportionally to its prevalence in the total supply. In expectation, it works much like a pro-rata distribution.\n   - **Economical and Efficient:**  \n     By assigning the payout to a single share, the bitcoin coinbase output remains small. This efficiency leaves more room for fee-paying transactions, maximizing revenue.\n   - **Trustless and Decentralized:**  \n     The random selection is completely deterministic and enforced by consensus rules. No centralized authority or federation is needed, preserving the trustless nature of both the sharechain network and bitcoin.\n   - **Incentive Alignment:**  \n     Miners are motivated to accumulate shares since owning a higher fraction improves their odds of winning the bitcoin reward, whether during active mining or while holding shares as a speculative asset.\n\n### Some Observations\n\n**Impact on the Miner:**  \nIf Mary holds all the shares, then the system essentially reverts to solo mining bitcoin. However, as soon as the share ownership is spread among various parties, there is a chance ($1 - v/n$ for Mary when holding $v$ of $n$ shares) that a randomly chosen share could belong to someone else. Over time, however, the expectation is for rewards to be distributed fairly in line with each miner’s share of the total.[^assign_to_self]\n\n**Speculative and Functional Benefits:**  \nEven if a miner ends up not winning a particular bitcoin reward, owning shares means that, over time, every share represents a chance at the reward. This quality may add an intrinsic or speculative value to shares, possibly fostering a secondary market—beneficial for atomic swaps or other network functionalities.\n\n## Open Questions\n\n* ### Is it incentive-compatible to mine on this chain?\n\nIn our approach the shares are issued in a fashion similar to bitcoin where earlier miners will obtain more shares per block than later miners. Maybe this tweak alone is enough to render the approach viable? or to render it non-viable? It is hard to know at this point in our analysis.\n\n* ### Is a sharechain a sidechain?\n\nA consequence of having a deterministic share supply is that the internal unit of account of the sharechain network will not be 1:1 with bitcoin. \n\nThis lack of parity is upsetting to many bitcoiners who seek the holy grail of a trustless-2-way-peg and may be enough to label this approach as antithetical to bitcoin, label the sharechain network as an altcoin, or otherwise consisder it as an \"attack\" on bitcoin. However, these actions say little about whether it is incentive-compatible (i.e. rational) for a bitcoiner, or any sha256D-capable miner for that matter, to mine on the sharechain. \n\nIs a sha256D-capable miner better off simply mining mainchain bitcoin directly? Maybe? Maybe not?\n\n\n* ### What happens if the features offered by a sharechain network network are incorporated into mainnet bitcoin?\n\nThis is an interesting question. If the feature is incorporated (or expected to be) incorporated into mainnet bitcoin, then it seems logical that there would be very little demand for the sharechain shares. Hence, the hash rate of the sharechain network would be small/negligible and the expected value (in sats) of the shares would be negligible.\n\nOn the other hand, if it is highly unlikely that the feature will ever be incorporated into bitcoin *and* there is demand for the feature, then it seems logical that there could also be significant demand for the sharechain shares. The expected value of the shares (in sats) in this case might be non-negligible.\n\nPerhaps the most interesting case is one where the feature in question is not likely to be activated on mainnet until well after the sharechain network is expected to win a mainnet block (remember, the sharechain network is essentially a mainnet mining pool). In this manner the price (in sats) of the shares coupled with the sharechain network's current hashrate can serve somewhat as an informational proxy for the wider bitcoin ecosystem. It might help answer the question, \"when will this feature be activated on mainnet?\"\n\n* ### Is it an altcoin?\n\nIs what is described above an \"altcoin\"? If the definition of altcoin is a network which uses a different unit of account than bitcoin, then, yes sharechains may be considered altcoins as in this case the shares are acting as the unit of account within the sharechain network. \n\nHowever, it is important to remember that unlike forks like BCH, BSV, and really any other PoW network, which split thermodynamic work across incompatible chains and hence detract from the security of mainchain bitcoin, these sharechain networks are in fact, as a core component of their own consensus, valid bitcoin mining networks and are therefore contributing to, not detracting from, the security of mainchain bitcoin.\n\n* ### Is it any threat to bitcoin mainnet?\n\nProbably not, and it is not intended to be. Bitcoiners who want to use the sharechain network can trustlessly obtain shares by mining on the sharechain or purchase them via atomic swaps. For everyone else, the sharechain is simply a mining pool from the perspective of\nbitcoin mainchain, and as such it contributes to the security of bitcoin.\n\n* ### Will bitcoin mainnet miners want to 51% attack the sharechain networks?\n\nMaybe? But they will lose regular mining revenue in the process. Eventually mainchain bitcoin miners stopped even caring about the BCH/BSV forks, and that makes sense because those forks are incompatible with mainchain bitcoin. BCH and BSV consensus rules do not add to the PoW security of mainchain bitcoin. Rather, they detract from it. \n\nThese sharechain networks are different in that the network itself is actually trying to mine a mainchain bitcoin block. They lose both the mainchain bitcoin rewards *and* their sharechain network rewards if the bitcoin block is invalid. Therefore, these sharechain networks are in fact as bitcoin-friendly as they can be, and hopefully are less centralized than traditional mining pools. Everybody wins?\n\n* ### Will bitcoin mainnet miners provide protection from unfriendly sha256D miners?\n\nMaybe there is some game theory which would indicate that it is in the best interest of all bitcoin-friendly sha256D miners to \"protect\" these sharechain networks if they are ever under PoW attack.\n\n\n## Conclusion \n**In summary:** p2share keeps bitcoin’s conservative security model intact but offers a fresh incentive mechanism that is fair, efficient, and aligned with the idea of a decentralized, innovative ecosystem.\n\n---\n(Thank you for reading this far! You can probably stop reading now, but if you are curious, here are more notes and background[^notes_background] and a thought experiment[^thought_experiment])\n\n##### Footnotes\n[^p2pool]: see https://en.bitcoin.it/wiki/P2Pool and various attempts at [rebooting p2pool](https://github.com/pool2win/p2pool-v2) as well as attempts to [scale miner share payouts using payment channels](https://bitcointalk.org/index.php?topic=2135429.0) rather than huge coinbase transactions.\n\n[^shrinking_pie]: There are other ways to create a shrinking-pie effect, some of which even include a notion similar to tail emmission (thereby ensuring block subsidy will always be a non-zero number of shares), but lets skip that discussion for now. The point is that there is the effect of a finite and deterministic supply of shares, and there are multiple ways to achieve that effect. Here we simply chose one that we are all familiar with because it is nearly identical to bitcoin itself.\n\n[^block_generation_rate]: Why such a long time between blocks? The parameters chosen for the example consensus rules above are just that: an example. However, by targeting a block generation rate which is similar, or longer, than bitcoin, we can reduce the sharechain orphan rate and keep our decentralized mining pool competitive. Stratum V2 can be used both within the sharechain network as well as at the interface between sharechain and mainchain. Let us not worry too much about these particular details right now. Also, from a UI/UX perspective a layer 2 network (e.g. lightning or similar) can be used to reduce the friction of longer block times.\n\n[^assign_to_self]: Mary could, of course, try to game the system and find a nonce for her block (block `i+1`) which would cause the sharechain network to \"choose\" her as the assignee of the bitcoin reward for the next block (block `i+2`). This may be a problem in the beginning when the sharechain network difficulty is extremely low. However, as soon as the sharechain difficulty finds equilibrium this attack becomes expensive in that it will require significant extra work to pull off. That work is probably better spent simply mining according to consensus which often will mean assigning a shareholder other than onesself as the would-be-winner of the bitcoin block reward. Afterall, for every valid sharechain block Mary mines, she *does* get to assign herself the shares!\n\n[^exclude_immature_sharebase]: Technically the selection of `q` from the utxo set should probably exclude sharechain coinbase utxos which have not yet matured, but let us skip that detail here for now.\n\n[^notes_background]: Basically there are two problems that we are trying to solve here. The first is that it is extremely frustrating when otherwise good ideas (and people who want to work on them) are basically relegated to \"go do it on an altcoin.\" So, somewhat like drivechain (but without needing a soft fork), it would be nice to provide a mechanism where those people can still at least hang around the bitcoin ecosystem rather than go enrich a competitor.\n    - The other thing is that, in the opinion of this author (currently at least), if there is any argument to believe about the \"energy waste\" of PoW, it is actually to do with the plethora of PoW algorithms. PoW not applied to bitcoin is the extra waste. PoW applied to bitcoin is not waste. Therefore, it would be better if all PoW networks were merge-mined with bitcoin (and from the perspective of bitcoin appear simply as a mining pool) as then at least all PoW networks are adding to, rather than detracting from, bitcoin's security.\n    - In other words, any sha256D mining which is not applied to bitcoin (or any PoW mining at all for that matter -- from a thermodynamic perspective) is wasted/misallocated use of energy. The idea here is an effort to curtail that, by giving people/networks a better way to do it -- **just turn your sh*tcoin network into a bitcoin mining pool and call it good.**\n    - Imagine if ethereum started as, and continued today (and didn't switch to PoS), just a bitcoin mining pool. It could still have its own unit of account (eth) which is what we are calling \"shares\" here, and of course there could have still been a bunch of sh*tcoinery on it, but at least if it were a sharechain, it would be adding hashrate to bitcoin which is good.\n    - Of course it is important that mainchain bitcoin itself stay extremely conservative. That is the beauty of the type of thing we are discussing here. Bitcoin itself can stay as-is and does not need to know or care about any of the things we are talking about here. **From the perspective of Bitcoin, valid hash power is valid no matter its origin** (whether a centralized mining pool, this p2share idea, solo mining, ...).\n\n[^why_random_shareholder]: Why pay out to a randomly selected shareholder rather than pro-rata to all shareholders?\n    - One reason why P2Pool[^p2pool], a decentralized bitcoin mining pool, is no longer used for mainchain bitcoin mining is because its coinbase transactions were much larger than trusted-third-party mining pools. As such, there was less room for fee-paying transactions, thereby decreasing expected pool revenue.\n\n    - The coinbase output for P2Pool was large because each eligible shareholder was paid out in the coinbase whenever the pool successfully mined a block. Here we take a different approach and instead pay out a single shareholder selected uniform pseudorandomly. This keeps the bitcoin mainchain coinbase transaction extremely small, thereby maximizing the ability to capture revenue (bitcoin transaction fees).\n\n    - Paying out to a randomly selected shareholder is also a way to avoid requiring a federation of some sort (static or dynamic) to take custody of the btc rewards and distribute them. **Paying out the entire btc reward to the owner of a randomly selected share is equivalent, in expectation, to paying out pro-rata.** It also as an interesting effect of endowing some sort of future value to a share, thereby (possibly) helping to establish a lower bound on a market price (in sats) per share. Such a market price might be useful for parties wishing to complete atomic swaps betweeen sharechain and mainchain bitcoin.\n\n[^thought_experiment]: Technical details aside, the bigger issue that we are trying to resolve right now is whether the economics of p2share even make sense. Is it ever rational for anybody to even play by p2share rules when mining bitcoin, versus just using the established mining pools or solo mining bitcoin.\n    - The primary, and possibly novel, \"tweak\" in the design here is is the idea of a blockchain (the p2share sharechain in this case) assigning its bitcoin reward to a random shareholder. We can take a step back, and think about what that might have looked like within bitcoin itself. \n\n    - For example, imagine if, at genesis in 2009 the rules for bitcoin mainchain were actually: miners assign all rewards to the owner of a pseudorandomly selected satoshi. \n\n    - It is weird to think about for sure. If bitcoin operated that way, it seems to change the economics quite a bit at first glance, but it is hard to be certain that the change is long-lived or even adverse. Maybe it is, but maybe it is not.\n\n    - But let us think about it ... let us rewind to 2010-2013 or so. Imagine you wanted to mine back then, but owned not a single satoshi at the time. With the hypothetical rules we are contemplating, you could still mine of course -- it is just that there would be a 0% chance that you are assigned the reward (this is because you don't own any sats, so you are not represented on the ledger when the random sat is chosen).\n\n    - But this may not be enough to actually kill the network. Rather, the behavior around mining would have just changed. For example, in that weird world I just described, it would behoove you to buy or otherwise obtain a bunch of sats before you start mining so as to increase your chances of becoming that lucky shareholder.\n\n    - Also, we are setting aside the bootstrapping problem of: if nobody owns sats and the ledger is empty, then how does a prospective miner even buy sats -- here let us just assume that satoshi hard-coded that he was the owner of the first 50btc -- then by the rule proposed here, he would also be the assignee of the next block reward with 100% possibility, and this would remain true until he sold/transferred some sats to somebody else, and so on. This may seem like the ol' \"pre-mine\" trick in disguise, and it sort of is, but not really. Only the first block reward need be hardcoded, the rest is still determined via consensus. Over time that first block reward becomes a de-minimus proportion of the total bitcoin outstanding.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 125,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Hi everyone, \nI have been thinking about this topic for a while and wanted to share it here for discussion. \nTL;DR: I wonder if there is some under-investigated territory where we can have efficient decentralized mining pools networks and use these networks as testing beds for new features. No mainc&hellip;",
  "truncated": true,
  "post_url": "/t/p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner/2093/1",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}