{
  "id": 6280,
  "name": "",
  "username": "josh",
  "avatar_template": "/user_avatar/delvingbitcoin.org/josh/{size}/95_2.png",
  "created_at": "2025-11-18T20:41:14.166Z",
  "cooked": "<p>Hi all,</p>\n<p>I’ve been learning about RBF under the cluster mempool proposal, and I’m trying to better understand what developers mean by “incentive compatibility.”</p>\n<p>My understanding, from reading <a href=\"https://delvingbitcoin.org/t/an-overview-of-the-cluster-mempool-proposal/393\">An overview of the cluster mempool proposal</a>, is that cluster mempool is designed to maximize the total fees of the entire mempool, at all mempool sizes, while maintaining a total ordering of clusters. I find this compelling, but one comment still bothers me:</p>\n<blockquote>\n<p><strong>Note</strong>: To guard against free relay (an anti-DoS concern), we still will require that the total fee of the new transaction exceed the total fee of the conflicting transactions by at least as much as the min-relay-feerate * size of the new transaction. However this is a small effect, since the incentive compatibility rule described above already requires that the total fee cannot go down – this just bumps that value up slightly.</p>\n</blockquote>\n<p>What I’m struggling with is the last line, implying that it is always incentive compatible to prevent the total fees of the existing mempool from declining. Is this truly the case?</p>\n<h3><a name=\"p-6280-rbf-rbfr-and-free-relay-1\" class=\"anchor\" href=\"#p-6280-rbf-rbfr-and-free-relay-1\"></a>RBF, RBFr, and Free Relay</h3>\n<p>Over the weekend, <a class=\"mention\" href=\"/u/niftynei\">@niftynei</a> was telling me about Peter Todd’s <a href=\"https://petertodd.org/2024/one-shot-replace-by-fee-rate\" rel=\"noopener nofollow ugc\">RBFr proposal</a> (shoutout to *bitcoin++ NC co-hosted with <a class=\"mention\" href=\"/u/vnprc\">@vnprc</a>!). We debated the free relay / DOS concerns, and I’ve been thinking about how cluster mempool could resolve them.</p>\n<p>At a high-level, I have two questions:</p>\n<blockquote>\n<p><strong>Question 1:</strong> What is the principal concern about free relay from RBFr (replace-by-fee-rate)?  That the submitting user will physically “spend” fewer sats? That the total fees of the mempool will decline? Or that miners will insufficiently profit to warrant relay over the P2P network?</p>\n</blockquote>\n<blockquote>\n<p><strong>Question 2:</strong> If mining is competitive and miners are greedy, would it ever be incentivize compatible to intentionally mine on a less profitable block?</p>\n</blockquote>\n<p>Presumably, the answer to (2) is no, subject to the technical constraints of broadcasting over the P2P network.</p>\n<p>Regarding (1), I imagine that what matters most to the network is that miners receive a minimum additional profit from a replacement transaction broadcast over the P2P network, <em>in all future states of the mempool</em>. This raises the question:</p>\n<blockquote>\n<p><strong>Question 3:</strong> Under cluster mempool, can we prove the existence of a minimum marginal profit <span class=\"math\">P_{min}</span> over any block that contains a replacement transaction <span class=\"math\">T_r</span> instead of <span class=\"math\">T</span>, where <span class=\"math\">T_r</span> pays a higher fee rate but has fewer fees (let <span class=\"math\">P_{min}</span> = <code>min-relay-feerate</code> * size of <span class=\"math\">T_r</span>).</p>\n</blockquote>\n<p>I’m curious to hear how developers think about this question. My inclination is to think that with the total ordering of cluster mempool, we may be able to safely relay the replacement transaction <span class=\"math\">T_r</span>, by considering clusters that are guaranteed to never be in the same block as <span class=\"math\">T</span> and which fit within the blockspace opened up by the replacement.</p>\n<h3><a name=\"p-6280-formal-model-2\" class=\"anchor\" href=\"#p-6280-formal-model-2\"></a>Formal Model</h3>\n<p>Formally, let <span class=\"math\">\\Delta B = B - B_r</span> and <span class=\"math\">\\Delta F = F - F_r</span>, where <span class=\"math\">B</span> and <span class=\"math\">F</span> are the virtual size and fee of <span class=\"math\">T</span>, and <span class=\"math\">B_r</span> and <span class=\"math\">F_r</span> are the virtual size and fee of <span class=\"math\">T_r</span>.</p>\n<p>Furthermore, Let <span class=\"math\">C_i</span> by the <em>ith</em> cluster, as ordered by the cluster mempool, following <span class=\"math\">T</span>, and let <span class=\"math\">C_k</span> be the first cluster that is guaranteed to not be in the same block as <span class=\"math\">T</span>, because <span class=\"math\">T</span> plus clusters <span class=\"math\">i &lt; k</span> reaches the 4M WU block size limit.</p>\n<p>Finally, let’s assume that there exists a set of filling clusters <span class=\"math\">C_j</span>, <span class=\"math\">C_{j+1}</span>, etc. such that <span class=\"math\">j \\geq k</span>, the virtual size of the clusters is <span class=\"math\">B_C \\leq \\Delta B</span>, and the total fee of the clusters is <span class=\"math\">F_C \\geq \\Delta F + P_{min}</span>, where <span class=\"math\">P_{min}</span> is <code>min-relay-feerate</code> * <span class=\"math\">B_r</span>.</p>\n<p>Under these definitions, and under the assumption that mining is competitive, we can safely say that replacing <span class=\"math\">T</span> with <span class=\"math\">T_r</span> always clears the profitability required for relay. In any block containing <span class=\"math\">T</span>, we can mine a more profitable block containing <span class=\"math\">T_r</span>, because we can provably fill the extra blockspace with transactions that increase the total fee by at least <span class=\"math\">P_{min}</span>.</p>\n<p>Alternatively, if we cannot find a set of filling clusters <span class=\"math\">C_j</span>, <span class=\"math\">C_{j+1}</span>, etc. that satisfy these constraints, we cannot replace <span class=\"math\">T</span> with <span class=\"math\">T_r</span>.</p>\n<h3><a name=\"p-6280-potential-issues-3\" class=\"anchor\" href=\"#p-6280-potential-issues-3\"></a>Potential Issues</h3>\n<p>One potential issue is that the search for the filling clusters <span class=\"math\">C_j</span>, <span class=\"math\">C_{j+1}</span>, etc. can be computationally costly, which is a potential attack vector if the search is performed by nodes on the network. This is a linear search starting with cluster <span class=\"math\">C_k</span>, and in the worst case, we search the entire mempool and fail to find a filling set of clusters, making the search <span class=\"math\">O(n)</span> w.r.t. mempool size.</p>\n<p>One solution is to push the cost of search and selection onto the user, by requiring that the filling clusters be packaged with the replacement transaction <span class=\"math\">T_r</span> during relay. Alternatively, users could include the txids of those clusters, and the receiving node could look them up. If the node lacks those transactions (or the transactions in clusters <span class=\"math\">i &lt; k</span>), the user will need to relay those transactions first.</p>\n<p>A second potential issue is that an ignorant or irrational miner could mine transactions in clusters <span class=\"math\">i \\geq 0</span> without mining <span class=\"math\">T</span> or <span class=\"math\">T_r</span>, such that <span class=\"math\">T_r</span> is no longer more profitable than <span class=\"math\">T</span>. Presumably, the risk of this happening would be low, but it is worth acknowledging. What perhaps matters most is that the replacement is sufficiently profitable in expectation, providing the same DOS protection for relaying nodes as existing RBF.</p>\n<p>Third, given these considerations, defining <span class=\"math\">P_{min}</span> as <code>min-relay-feerate</code> * <span class=\"math\">B_r</span> may not be costly enough. We should also account for the cost of relaying the filling txids. This would make <span class=\"math\">P_{min}</span> equal to <code>min-relay-feerate</code> * <span class=\"math\">(B_r + 32 \\cdot N)</span>, where <span class=\"math\">N</span> is the number of filling txids.</p>\n<p>Finally, we need to prevent the repeated use of the same set of filling txids to make an unprofitable replacement. Otherwise, users could replace <span class=\"math\">T</span> with a <span class=\"math\">T_r</span> that would otherwise not be profitable, by replacing <span class=\"math\">T</span> multiple times.</p>\n<p>A potential solution is to use <span class=\"math\">\\Delta B = B_{orig} - B_r</span> and <span class=\"math\">\\Delta F = F_{orig} - F_r</span>, storing <span class=\"math\">B_{orig}</span> and <span class=\"math\">F_{orig}</span> after the first replacement requiring filling transactions. This has a minimal storage cost of two integers per replaced transaction, but the cost is effectively covered by the additional fee from relaying the txids.</p>\n<h3><a name=\"p-6280-incentive-compatible-4\" class=\"anchor\" href=\"#p-6280-incentive-compatible-4\"></a>Incentive Compatible?</h3>\n<p>This approach to a generalized RBF is an attempt on my part to better understand the constraints of the free relay problem and what a strictly incentive-compatible RBF would look like.</p>\n<p>In summary, what I currently think is incentive compatible appears to differ slightly from the current approach of the cluster mempool:</p>\n<blockquote>\n<p><strong>Current approach:</strong> Incentive-compatible RBF maximizes the total fees over the mempool, at all mempool sizes.</p>\n</blockquote>\n<blockquote>\n<p><strong>Alternative approach:</strong> Incentive-compatible RBF maximizes the total fee of any block that contains transaction <span class=\"math\">T</span>.</p>\n</blockquote>\n<p>These two approaches unify in the edge case where the block size is unbounded, making the second approach perhaps a generalization of the first.</p>\n<p>Appreciate feedback on this concept, and looking forward to seeing cluster mempool in the next version of Core!</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 2,
  "updated_at": "2025-11-19T03:43:48.167Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 17,
  "reads": 20,
  "readers_count": 19,
  "score": 104.0,
  "yours": false,
  "topic_id": 2115,
  "topic_slug": "generalizing-rbf-under-cluster-mempool",
  "topic_title": "Generalizing RBF under Cluster Mempool",
  "topic_html_title": "Generalizing RBF under Cluster Mempool",
  "category_id": 8,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 6,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Hi all,\n\nI've been learning about RBF under the cluster mempool proposal, and I'm trying to better understand what developers mean by \"incentive compatibility.\"\n\nMy understanding, from reading [An overview of the cluster mempool proposal](https://delvingbitcoin.org/t/an-overview-of-the-cluster-mempool-proposal/393), is that cluster mempool is designed to maximize the total fees of the entire mempool, at all mempool sizes, while maintaining a total ordering of clusters. I find this compelling, but one comment still bothers me:\n\n> **Note**: To guard against free relay (an anti-DoS concern), we still will require that the total fee of the new transaction exceed the total fee of the conflicting transactions by at least as much as the min-relay-feerate * size of the new transaction. However this is a small effect, since the incentive compatibility rule described above already requires that the total fee cannot go down – this just bumps that value up slightly.\n\nWhat I'm struggling with is the last line, implying that it is always incentive compatible to prevent the total fees of the existing mempool from declining. Is this truly the case?\n\n### RBF, RBFr, and Free Relay\n\nOver the weekend, @niftynei was telling me about Peter Todd's [RBFr proposal](https://petertodd.org/2024/one-shot-replace-by-fee-rate) (shoutout to *bitcoin++ NC co-hosted with @vnprc!). We debated the free relay / DOS concerns, and I've been thinking about how cluster mempool could resolve them.\n\nAt a high-level, I have two questions:\n\n> **Question 1:** What is the principal concern about free relay from RBFr (replace-by-fee-rate)?  That the submitting user will physically \"spend\" fewer sats? That the total fees of the mempool will decline? Or that miners will insufficiently profit to warrant relay over the P2P network?\n\n> **Question 2:** If mining is competitive and miners are greedy, would it ever be incentivize compatible to intentionally mine on a less profitable block?\n\nPresumably, the answer to (2) is no, subject to the technical constraints of broadcasting over the P2P network.\n\nRegarding (1), I imagine that what matters most to the network is that miners receive a minimum additional profit from a replacement transaction broadcast over the P2P network, *in all future states of the mempool*. This raises the question:\n\n> **Question 3:** Under cluster mempool, can we prove the existence of a minimum marginal profit $P_{min}$ over any block that contains a replacement transaction $T_r$ instead of $T$, where $T_r$ pays a higher fee rate but has fewer fees (let $P_{min}$ = `min-relay-feerate` * size of $T_r$).\n\nI'm curious to hear how developers think about this question. My inclination is to think that with the total ordering of cluster mempool, we may be able to safely relay the replacement transaction $T_r$, by considering clusters that are guaranteed to never be in the same block as $T$ and which fit within the blockspace opened up by the replacement.\n\n### Formal Model\n\nFormally, let $\\Delta B = B - B_r$ and $\\Delta F = F - F_r$, where $B$ and $F$ are the virtual size and fee of $T$, and $B_r$ and $F_r$ are the virtual size and fee of $T_r$.\n\nFurthermore, Let $C_i$ by the *ith* cluster, as ordered by the cluster mempool, following $T$, and let $C_k$ be the first cluster that is guaranteed to not be in the same block as $T$, because $T$ plus clusters $i < k$ reaches the 4M WU block size limit.\n\nFinally, let's assume that there exists a set of filling clusters $C_j$, $C_{j+1}$, etc. such that $j \\geq k$, the virtual size of the clusters is $B_C \\leq \\Delta B$, and the total fee of the clusters is $F_C \\geq \\Delta F + P_{min}$, where $P_{min}$ is `min-relay-feerate` * $B_r$.\n\nUnder these definitions, and under the assumption that mining is competitive, we can safely say that replacing $T$ with $T_r$ always clears the profitability required for relay. In any block containing $T$, we can mine a more profitable block containing $T_r$, because we can provably fill the extra blockspace with transactions that increase the total fee by at least $P_{min}$.\n\nAlternatively, if we cannot find a set of filling clusters $C_j$, $C_{j+1}$, etc. that satisfy these constraints, we cannot replace $T$ with $T_r$.\n\n### Potential Issues\n\nOne potential issue is that the search for the filling clusters $C_j$, $C_{j+1}$, etc. can be computationally costly, which is a potential attack vector if the search is performed by nodes on the network. This is a linear search starting with cluster $C_k$, and in the worst case, we search the entire mempool and fail to find a filling set of clusters, making the search $O(n)$ w.r.t. mempool size.\n\nOne solution is to push the cost of search and selection onto the user, by requiring that the filling clusters be packaged with the replacement transaction $T_r$ during relay. Alternatively, users could include the txids of those clusters, and the receiving node could look them up. If the node lacks those transactions (or the transactions in clusters $i < k$), the user will need to relay those transactions first.\n\nA second potential issue is that an ignorant or irrational miner could mine transactions in clusters $i \\geq 0$ without mining $T$ or $T_r$, such that $T_r$ is no longer more profitable than $T$. Presumably, the risk of this happening would be low, but it is worth acknowledging. What perhaps matters most is that the replacement is sufficiently profitable in expectation, providing the same DOS protection for relaying nodes as existing RBF.\n\nThird, given these considerations, defining $P_{min}$ as `min-relay-feerate` * $B_r$ may not be costly enough. We should also account for the cost of relaying the filling txids. This would make $P_{min}$ equal to `min-relay-feerate` * $(B_r + 32 \\cdot N)$, where $N$ is the number of filling txids.\n\nFinally, we need to prevent the repeated use of the same set of filling txids to make an unprofitable replacement. Otherwise, users could replace $T$ with a $T_r$ that would otherwise not be profitable, by replacing $T$ multiple times.\n\nA potential solution is to use $\\Delta B = B_{orig} - B_r$ and $\\Delta F = F_{orig} - F_r$, storing $B_{orig}$ and $F_{orig}$ after the first replacement requiring filling transactions. This has a minimal storage cost of two integers per replaced transaction, but the cost is effectively covered by the additional fee from relaying the txids.\n\n### Incentive Compatible?\n\nThis approach to a generalized RBF is an attempt on my part to better understand the constraints of the free relay problem and what a strictly incentive-compatible RBF would look like.\n\nIn summary, what I currently think is incentive compatible appears to differ slightly from the current approach of the cluster mempool:\n\n> **Current approach:** Incentive-compatible RBF maximizes the total fees over the mempool, at all mempool sizes.\n\n> **Alternative approach:** Incentive-compatible RBF maximizes the total fee of any block that contains transaction $T$.\n\nThese two approaches unify in the edge case where the block size is unbounded, making the second approach perhaps a generalization of the first.\n\nAppreciate feedback on this concept, and looking forward to seeing cluster mempool in the next version of Core!",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 98,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Hi all, \nI’ve been learning about RBF under the cluster mempool proposal, and I’m trying to better understand what developers mean by “incentive compatibility.” \nMy understanding, from reading <a href=\"https://delvingbitcoin.org/t/an-overview-of-the-cluster-mempool-proposal/393\">An overview of the cluster mempool proposal</a>, is that cluster mempool is designed to maximize the total fees&hellip;",
  "truncated": true,
  "post_url": "/t/generalizing-rbf-under-cluster-mempool/2115/1",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}