{
  "id": 6213,
  "name": "VzxPLnHqr",
  "username": "VzxPLnHqr",
  "avatar_template": "/user_avatar/delvingbitcoin.org/vzxplnhqr/{size}/121_2.png",
  "created_at": "2025-11-10T21:26:38.824Z",
  "cooked": "<blockquote>\n<p>It appears to be non-obvious that when the whitepaper says “longest chain of proof-of-work wins” it cuts across even incompatible rules and so-called “altcoins” …</p>\n</blockquote>\n<p>Yes, I agree this is non-obvious to many people. It is also why I want to be careful to point out that in the p2share model described here, the work applied to a sharechain is, by definition, work applied to mainchain bitcoin.</p>\n<blockquote>\n<p>With that said — it would theoretically be possible that miners of Bitcoin can follow additional rules  …</p>\n</blockquote>\n<p>I believe what you just described here is isomorphic to the underlying concept of p2share. So, if we think about the abstract notion of a “softerfork” (I like the term!), then I currently am, hesitantly, positing that the “select a random shareholder” rule might be the closest concrete instantiation of that abstract concept which (bootstrapping problem aside) approaches incentive compatibility.</p>\n<p>Though, I think we should also clarify that it need not be existing bitcoin miners who come together to launch a softerfork (using p2share semantics or otherwise). Even if the sharechain only comprises an extremely small portion of mainchain hashrate, a group of dedicated bitcoiners with minimal collective hashpower could launch one.</p>\n<p>For the same reason that it is non-trivial to answer question, “why would someone ever want to mine on sharechain rather than solo mine mainchain directly?,” it is also difficult to answer, <strong>“why would existing, or otherwise larger, miners want to attack the sharechain?”</strong></p>\n<p>If larger miners wanted to just troll sharechain and cause a bunch of reorgs, well, at least unlike proof-of-stake, sharechain is in fact still a proof-of-work chain, so the attack still has an irreversible external cost. Further, each hash applied to attack the sharechain (thereby abiding by the sharechain consensus) <em>could have in fact been applied to mainchain</em>.</p>\n<p>Unfortunately there probably are trolls in the world who would spend resources just to regularly wreak havoc (reorg) the sharechain. However, stalwart shareholders and prudent sharechain design parameters might still weather such storms. The best part is that even in this circumstance the trolls/attackers are still securing mainchain bitcoin throughout each and every attack!</p>\n<p>Now, for larger miners who are not trolls but merely trying to maximize their profits in whatever units of measurements their hearts desire, even if such miners are not interested in the sharechain initially, they may become interested if, by some bizarre aligning of moons, there are ever market arbitrage opportunities between shares and mainchain btc large enough to justify the “extra steps” of capturing (and thereby closing) those opportunities.</p>\n<p>Knowing the above behavior is looming, it seems the price per share (in sats of course!) is naturally bounded on the upside. As such we need not worry about  sharechain(s) ever “overtaking” bitcoin. Sharechains might gobble up some hash rate from the centralized pools, but that is not a bad thing.</p>\n<p>It still begs the question of whether a “softerfork” sharechain with p2share-like semantics will ever have sustained price per share greater than <code>0.000000... sats/share</code>.</p>\n<blockquote>\n<p>What we are doing at P2Poolv2 is less revolutionary. … This allows coinbase of constant size to support a larger number of users. 20 large miners get paid in the coinbase, the other smaller ones trade their shares with the large miners or market makers using atomic swap between sharechain and bitcoin. The market makers or the larger miners buy the smaller miner’s share at a discount, and the market pricing takes care of the discount amount.</p>\n</blockquote>\n<p><a class=\"mention\" href=\"/u/jungly\">@jungly</a> Thanks for chiming in! In the OP I linked to your repo so that people might also be aware that there is at least some attempts to revitalize (some of) the original P2Pool concepts.</p>\n<p>I have some questions about your most recent design iteration, <s>but I will ask them in a different thread so that we can keep this one a little bit less implementation-specific (for now at least!).</s> (edit: could not find an existing thread for your p2poolv2):</p>\n<ol>\n<li>\n<p>Is it still custodial in the sense of using a FROST federation or similar? Asking because one reason why I am interested in alternative designs is specifically for them to remain non-custodial, which is in fact possible, as demonstrated here with p2share.</p>\n</li>\n<li>\n<p>What are the motivations for a market maker or large miner to buy the smaller shares? What is the opportunity cost to them if they do not buy the smaller shares?</p>\n</li>\n<li>\n<p>Does this mean that the shares in your current design are long-lived such that a small miner can obtain shares and then come back in the far future and try to sell those shares to a larger miner? or do the shares in your current design somehow expire?</p>\n</li>\n</ol>",
  "post_number": 10,
  "post_type": 1,
  "posts_count": 10,
  "updated_at": "2025-11-10T21:26:38.824Z",
  "reply_count": 0,
  "reply_to_post_number": 8,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 5,
  "readers_count": 4,
  "score": 1.0,
  "yours": false,
  "topic_id": 2093,
  "topic_slug": "p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner",
  "topic_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "topic_html_title": "P2share: how to turn any network (or testnet!) into a bitcoin miner",
  "category_id": 7,
  "display_username": "VzxPLnHqr",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 104,
    "username": "ZmnSCPxj",
    "name": "ZmnSCPxj jxPCSnmZ",
    "avatar_template": "/letter_avatar_proxy/v4/letter/z/ee7513/{size}.png"
  },
  "bookmarked": false,
  "raw": "> It appears to be non-obvious that when the whitepaper says “longest chain of proof-of-work wins” it cuts across even incompatible rules and so-called “altcoins” ...\n\nYes, I agree this is non-obvious to many people. It is also why I want to be careful to point out that in the p2share model described here, the work applied to a sharechain is, by definition, work applied to mainchain bitcoin.\n\n> With that said — it would theoretically be possible that miners of Bitcoin can follow additional rules  ...\n\nI believe what you just described here is isomorphic to the underlying concept of p2share. So, if we think about the abstract notion of a \"softerfork\" (I like the term!), then I currently am, hesitantly, positing that the \"select a random shareholder\" rule might be the closest concrete instantiation of that abstract concept which (bootstrapping problem aside) approaches incentive compatibility.\n\nThough, I think we should also clarify that it need not be existing bitcoin miners who come together to launch a softerfork (using p2share semantics or otherwise). Even if the sharechain only comprises an extremely small portion of mainchain hashrate, a group of dedicated bitcoiners with minimal collective hashpower could launch one. \n\nFor the same reason that it is non-trivial to answer question, \"why would someone ever want to mine on sharechain rather than solo mine mainchain directly?,\" it is also difficult to answer, **\"why would existing, or otherwise larger, miners want to attack the sharechain?\"** \n\nIf larger miners wanted to just troll sharechain and cause a bunch of reorgs, well, at least unlike proof-of-stake, sharechain is in fact still a proof-of-work chain, so the attack still has an irreversible external cost. Further, each hash applied to attack the sharechain (thereby abiding by the sharechain consensus) _could have in fact been applied to mainchain_.\n\nUnfortunately there probably are trolls in the world who would spend resources just to regularly wreak havoc (reorg) the sharechain. However, stalwart shareholders and prudent sharechain design parameters might still weather such storms. The best part is that even in this circumstance the trolls/attackers are still securing mainchain bitcoin throughout each and every attack! \n\nNow, for larger miners who are not trolls but merely trying to maximize their profits in whatever units of measurements their hearts desire, even if such miners are not interested in the sharechain initially, they may become interested if, by some bizarre aligning of moons, there are ever market arbitrage opportunities between shares and mainchain btc large enough to justify the \"extra steps\" of capturing (and thereby closing) those opportunities.\n\nKnowing the above behavior is looming, it seems the price per share (in sats of course!) is naturally bounded on the upside. As such we need not worry about  sharechain(s) ever \"overtaking\" bitcoin. Sharechains might gobble up some hash rate from the centralized pools, but that is not a bad thing.\n\nIt still begs the question of whether a \"softerfork\" sharechain with p2share-like semantics will ever have sustained price per share greater than `0.000000... sats/share`.\n\n> What we are doing at P2Poolv2 is less revolutionary. ... This allows coinbase of constant size to support a larger number of users. 20 large miners get paid in the coinbase, the other smaller ones trade their shares with the large miners or market makers using atomic swap between sharechain and bitcoin. The market makers or the larger miners buy the smaller miner’s share at a discount, and the market pricing takes care of the discount amount.\n\n\n@jungly Thanks for chiming in! In the OP I linked to your repo so that people might also be aware that there is at least some attempts to revitalize (some of) the original P2Pool concepts.\n\nI have some questions about your most recent design iteration, ~~but I will ask them in a different thread so that we can keep this one a little bit less implementation-specific (for now at least!).~~ (edit: could not find an existing thread for your p2poolv2):\n\n1. Is it still custodial in the sense of using a FROST federation or similar? Asking because one reason why I am interested in alternative designs is specifically for them to remain non-custodial, which is in fact possible, as demonstrated here with p2share.\n\n2. What are the motivations for a market maker or large miner to buy the smaller shares? What is the opportunity cost to them if they do not buy the smaller shares?\n\n3. Does this mean that the shares in your current design are long-lived such that a small miner can obtain shares and then come back in the far future and try to sell those shares to a larger miner? or do the shares in your current design somehow expire?",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 125,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "It appears to be non-obvious that when the whitepaper says “longest chain of proof-of-work wins” it cuts across even incompatible rules and so-called “altcoins” … \n\nYes, I agree this is non-obvious to many people. It is also why I want to be careful to point out that in the p2share model described &hellip;",
  "truncated": true,
  "post_url": "/t/p2share-how-to-turn-any-network-or-testnet-into-a-bitcoin-miner/2093/10",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}