{
  "id": 2368,
  "name": "David A. Harding",
  "username": "harding",
  "avatar_template": "/user_avatar/delvingbitcoin.org/harding/{size}/6_2.png",
  "created_at": "2024-05-04T21:22:17.700Z",
  "cooked": "<p>I don’t understand the point of this.  Your concern is that <em>most</em> miners will choose centralized transaction selection, so you want to force <em>all</em> miners in a decentralized pool to use the transactions selected by other miners?  How does that not make the problem worse?</p>\n<p>Here’s an example: assume today that 99% of all transaction selection is performed by X.  That means there will still be about one block a day that includes indepedently selected transactions—and anyone paying a high enough feerate can almost guarantee that their transaction will be included in that block (provided the tx is valid and policy acceptable).  Fees are a good solution to weak censorship: it allows the people being censored to take direct action and buy their way out of their problem.</p>\n<p>But if 100% of miners use your described pool, they’ll have to mine any transaction that was previously included in a share before they can mine any transactions of their own choosing.  So whoever can include a tx in a share first gets to decide the transaction selection for every other miner in a pool.  That creates a strong incentive to be the person who can first include a tx in a share: they can collect out-of-band fees that nobody else can collect and they can perfectly censor unwanted transactions by including junk transactions instead.</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2024-05-04T21:22:17.700Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 1,
  "reads": 16,
  "readers_count": 15,
  "score": 8.2,
  "yours": false,
  "topic_id": 842,
  "topic_slug": "deterministic-tx-selection-for-censorship-resistance",
  "topic_title": "Deterministic tx selection for censorship resistance",
  "topic_html_title": "Deterministic tx selection for censorship resistance",
  "category_id": 7,
  "display_username": "David A. Harding",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I don't understand the point of this.  Your concern is that _most_ miners will choose centralized transaction selection, so you want to force _all_ miners in a decentralized pool to use the transactions selected by other miners?  How does that not make the problem worse?\n\nHere's an example: assume today that 99% of all transaction selection is performed by X.  That means there will still be about one block a day that includes indepedently selected transactions---and anyone paying a high enough feerate can almost guarantee that their transaction will be included in that block (provided the tx is valid and policy acceptable).  Fees are a good solution to weak censorship: it allows the people being censored to take direct action and buy their way out of their problem.\n\nBut if 100% of miners use your described pool, they'll have to mine any transaction that was previously included in a share before they can mine any transactions of their own choosing.  So whoever can include a tx in a share first gets to decide the transaction selection for every other miner in a pool.  That creates a strong incentive to be the person who can first include a tx in a share: they can collect out-of-band fees that nobody else can collect and they can perfectly censor unwanted transactions by including junk transactions instead.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 6,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}