{
  "id": 2400,
  "name": "Richard Myers",
  "username": "remyers",
  "avatar_template": "/user_avatar/delvingbitcoin.org/remyers/{size}/159_2.png",
  "created_at": "2024-05-10T14:29:04.329Z",
  "cooked": "<p>I’ve replaced draft  <a href=\"https://github.com/bitcoin/bitcoin/pull/29442\" rel=\"noopener nofollow ugc\">PR 29442</a> with a  simpler draft <a href=\"https://github.com/bitcoin/bitcoin/pull/30080\" rel=\"noopener nofollow ugc\">PR 30080</a> that only adds new coin selection parameters, primarily <code>add_excess_to_recipient_position</code>.</p>\n<p>A changeless transaction may select inputs with excess value over what is needed to reach the desired fee rate and output targets. Currently that excess value is considered waste and burned as fees. You may prefer any excess value to be added to an output you control. When fees are high the cost of adding a change output increases and so does the amount of potential excess value spent as fees.</p>\n<p>Anytime you retain the value from an over payment then it makes sense to not lose the excess to fees.</p>\n<p>When splicing on-chain value into a Lightning channel it would be better to get credit for the excess value off-chain.  Lightning Service Providers (LSPs) that use <a href=\"https://github.com/lightning/bolts/pull/878\" rel=\"noopener nofollow ugc\">liquidity ads</a> will prefer to add any excess as extra inbound liquidity for clients instead of paying the excess as fees.</p>\n<p>LSPs that sell inbound liquidity will prefer to maintain a set of UTXOs that are sized to fund a changeless transactions of pre-defined funding amounts <em>plus</em> the fee to spend each amount at various feerates without additional inputs or an added change output.</p>\n<p>The best case for an LSP is to always have a confirmed UTXO of the requested funding amount plus the fee to spend it at the current feerate. A transaction with one taproot input and two taproot outputs (both a funding and a change output) is approximately 37% more expensive than not having a change output.</p>\n<p>If the excess value from a changeless UTXO can be retained by the LSP as extra inbound liquidity then the LSP can cover the range of likely fee rates with fewer UTXOs. Each UTXO can be used at a specific feerate and also any lower feerates up to the point that the excess is greater than the cost of adding a change output.  The potential space of funding amounts and feerates can be “tiled” so that UTXOs exists at non-overlapping intervals smaller than the threshold for adding a change output. This approach can minimize the fee cost of providing liquidity to near the ideal case of always having a UTXO of the amount needed for a changeless funding transaction.</p>\n<p>There are likely other use cases where a user may want excess fees applied to their target output because the extra value would be credited to them by a custodian or retailer.</p>\n<p>This new proposal assumes the LSP proactively selects a larger UTXO than is needed when fees are low to create change outputs that refill the cache of tiled UTXOs.</p>",
  "post_number": 11,
  "post_type": 1,
  "updated_at": "2024-05-10T14:29:04.329Z",
  "reply_count": 1,
  "reply_to_post_number": 10,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 6,
  "readers_count": 5,
  "score": 6.2,
  "yours": false,
  "topic_id": 600,
  "topic_slug": "liquidity-provider-utxo-management",
  "topic_title": "Liquidity provider utxo management",
  "topic_html_title": "Liquidity provider utxo management",
  "category_id": 8,
  "display_username": "Richard Myers",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": "",
  "reply_to_user": {
    "username": "remyers",
    "name": "Richard Myers",
    "avatar_template": "/user_avatar/delvingbitcoin.org/remyers/{size}/159_2.png"
  },
  "bookmarked": false,
  "raw": "I've replaced draft  [PR 29442](https://github.com/bitcoin/bitcoin/pull/29442) with a  simpler draft [PR 30080](https://github.com/bitcoin/bitcoin/pull/30080) that only adds new coin selection parameters, primarily `add_excess_to_recipient_position`.\n\nA changeless transaction may select inputs with excess value over what is needed to reach the desired fee rate and output targets. Currently that excess value is considered waste and burned as fees. You may prefer any excess value to be added to an output you control. When fees are high the cost of adding a change output increases and so does the amount of potential excess value spent as fees.\n\nAnytime you retain the value from an over payment then it makes sense to not lose the excess to fees. \n\nWhen splicing on-chain value into a Lightning channel it would be better to get credit for the excess value off-chain.  Lightning Service Providers (LSPs) that use [liquidity ads](https://github.com/lightning/bolts/pull/878) will prefer to add any excess as extra inbound liquidity for clients instead of paying the excess as fees.\n\nLSPs that sell inbound liquidity will prefer to maintain a set of UTXOs that are sized to fund a changeless transactions of pre-defined funding amounts *plus* the fee to spend each amount at various feerates without additional inputs or an added change output.\n\nThe best case for an LSP is to always have a confirmed UTXO of the requested funding amount plus the fee to spend it at the current feerate. A transaction with one taproot input and two taproot outputs (both a funding and a change output) is approximately 37% more expensive than not having a change output.\n\nIf the excess value from a changeless UTXO can be retained by the LSP as extra inbound liquidity then the LSP can cover the range of likely fee rates with fewer UTXOs. Each UTXO can be used at a specific feerate and also any lower feerates up to the point that the excess is greater than the cost of adding a change output.  The potential space of funding amounts and feerates can be \"tiled\" so that UTXOs exists at non-overlapping intervals smaller than the threshold for adding a change output. This approach can minimize the fee cost of providing liquidity to near the ideal case of always having a UTXO of the amount needed for a changeless funding transaction.\n\nThere are likely other use cases where a user may want excess fees applied to their target output because the extra value would be credited to them by a custodian or retailer.\n\nThis new proposal assumes the LSP proactively selects a larger UTXO than is needed when fees are low to create change outputs that refill the cache of tiled UTXOs.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 55,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}