{
  "id": 2397,
  "name": "Bob McElrath",
  "username": "mcelrath",
  "avatar_template": "/user_avatar/delvingbitcoin.org/mcelrath/{size}/521_2.png",
  "created_at": "2024-05-09T15:43:20.132Z",
  "cooked": "<blockquote>\n<p>I don’t understand the point of this. Your concern is that <em>most</em> miners will choose centralized transaction selection, so you want to force <em>all</em> miners in a decentralized pool to use the transactions selected by other miners? How does that not make the problem worse?</p>\n</blockquote>\n<p>By forcing miners to do tx selection, we increase the number of parties that would need to be attacked by the state in order to control what is mined. Whether or not we have deterministic tx selection, both SV2 and Braidpool are attempting to move tx selection to the individual miners instead of (a smaller number of) pools. If we succeed in getting miners to do tx selection, then this deterministic tx selection idea probably isn’t necessary.</p>\n<blockquote>\n<p>Here’s an example: assume today that 99% of all transaction selection is performed by X. That means there will still be about one block a day that includes indepedently selected transactions</p>\n</blockquote>\n<p>A miner with &lt; 1% hashrate performing independent tx selection has to take a huge risk in variance - about 18% monthly on his revenue, and it gets worse for even smaller miners. In a decentralized pool that same miner would win around 1000 shares per day, with a monthly revenue variance of about 0.58%. We want independent miners to not have to take this financial risk, it’s the whole point of pools in the first place.</p>\n<blockquote>\n<p>But if 100% of miners use your described pool, they’ll have to mine any transaction that was previously included in a share before they can mine any transactions of their own choosing.</p>\n</blockquote>\n<p>With deterministic tx selection they would be unable to mine transactions of their own choosing at all. They must first be mined into a share in order to have consensus that they’re known to all miners. (This is true with or without deterministic tx selection) Also note that Braidpool will use “full proportional” payouts, so any fees are shared with the pool. A miner can’t claim high fee transactions for himself. (Note that this isn’t fully decided - if you have good arguments that the miner should earn fees for himself or get an extra reward for mining a block I’d be interested in hearing it - there’s a wide design space and game theory here)</p>\n<blockquote>\n<p>So whoever can include a tx in a share first gets to decide the transaction selection for every other miner in a pool. That creates a strong incentive to be the person who can first include a tx in a share: they can collect out-of-band fees that nobody else can collect and they can perfectly censor unwanted transactions by including junk transactions instead.</p>\n</blockquote>\n<p>Yes, miners can mine never-before-seen transactions into shares instead of broadcasting them to the mempool, and collect OOB fees for them if they wish. I don’t really see a problem with that. As far as censoring by including junk transactions, a large enough miner can do that today anyway and it’s a 51% attack. It’s still a 51% attack on the share-chain. This might be an argument to limit the size of the sharechain-mempool though, it doesn’t make sense to allow this sharechain-mempool to grow without bound, which would enable the attack you describe.</p>\n<p>Cheers,\n– Bob</p>",
  "post_number": 6,
  "post_type": 1,
  "updated_at": "2024-05-09T15:43:20.132Z",
  "reply_count": 0,
  "reply_to_post_number": 3,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 6,
  "readers_count": 5,
  "score": 1.2,
  "yours": false,
  "topic_id": 842,
  "topic_slug": "deterministic-tx-selection-for-censorship-resistance",
  "topic_title": "Deterministic tx selection for censorship resistance",
  "topic_html_title": "Deterministic tx selection for censorship resistance",
  "category_id": 7,
  "display_username": "Bob McElrath",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "harding",
    "name": "David A. Harding",
    "avatar_template": "/user_avatar/delvingbitcoin.org/harding/{size}/6_2.png"
  },
  "bookmarked": false,
  "raw": "> I don’t understand the point of this. Your concern is that *most* miners will choose centralized transaction selection, so you want to force *all* miners in a decentralized pool to use the transactions selected by other miners? How does that not make the problem worse?\n\nBy forcing miners to do tx selection, we increase the number of parties that would need to be attacked by the state in order to control what is mined. Whether or not we have deterministic tx selection, both SV2 and Braidpool are attempting to move tx selection to the individual miners instead of (a smaller number of) pools. If we succeed in getting miners to do tx selection, then this deterministic tx selection idea probably isn't necessary.\n\n> Here’s an example: assume today that 99% of all transaction selection is performed by X. That means there will still be about one block a day that includes indepedently selected transactions\n\nA miner with < 1% hashrate performing independent tx selection has to take a huge risk in variance - about 18% monthly on his revenue, and it gets worse for even smaller miners. In a decentralized pool that same miner would win around 1000 shares per day, with a monthly revenue variance of about 0.58%. We want independent miners to not have to take this financial risk, it's the whole point of pools in the first place.\n\n> But if 100% of miners use your described pool, they’ll have to mine any transaction that was previously included in a share before they can mine any transactions of their own choosing.\n\nWith deterministic tx selection they would be unable to mine transactions of their own choosing at all. They must first be mined into a share in order to have consensus that they're known to all miners. (This is true with or without deterministic tx selection) Also note that Braidpool will use \"full proportional\" payouts, so any fees are shared with the pool. A miner can't claim high fee transactions for himself. (Note that this isn't fully decided - if you have good arguments that the miner should earn fees for himself or get an extra reward for mining a block I'd be interested in hearing it - there's a wide design space and game theory here)\n\n>  So whoever can include a tx in a share first gets to decide the transaction selection for every other miner in a pool. That creates a strong incentive to be the person who can first include a tx in a share: they can collect out-of-band fees that nobody else can collect and they can perfectly censor unwanted transactions by including junk transactions instead.\n\nYes, miners can mine never-before-seen transactions into shares instead of broadcasting them to the mempool, and collect OOB fees for them if they wish. I don't really see a problem with that. As far as censoring by including junk transactions, a large enough miner can do that today anyway and it's a 51% attack. It's still a 51% attack on the share-chain. This might be an argument to limit the size of the sharechain-mempool though, it doesn't make sense to allow this sharechain-mempool to grow without bound, which would enable the attack you describe.\n\nCheers,\n-- Bob",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 406,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}