{
  "id": 2542,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/417_2.png",
  "created_at": "2024-05-27T03:16:05.749Z",
  "cooked": "<aside class=\"quote no-group quote-modified\" data-username=\"1440000bytes\" data-post=\"1\" data-topic=\"916\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/1440000bytes/48/301_2.png\" class=\"avatar\"> 1440000bytes:</div>\n<blockquote>\n<p>I think there are some risks involved in running such mints and the <strong>only use case for eCash</strong> that makes sense is [Dark Net Markets].</p>\n</blockquote>\n</aside>\n<p>This seems backwards to me: ecash (in the digicash style) generally requires a centralised mint that’s a single point-of-failure for everyone using ecash. If most uses of ecash are dark (illegal/black market), then once law enforcement decides to crack down on them, the mint becomes an easy and attractive target. That’s very high risk for the operators of the mint, even if they attempt to protect themselves via a federation or anonymity tools, and it’s also high risk for users of the system: if the mint is forced to shut down by a hostile actor, none of the funds stored as ecash are recoverable. If the mint’s operators are anonymous to law enforcement, then they’re also anonymous to the majority of its users, and that probably elevates the risk of the operators doing a rug pull as well: a rug pull has the benefit of both getting a chunk of funds immediately, and also bounds the risk that law enforcement are going to come after you because you’ve been enabling crime or terrorism or whatever.</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2024-05-27T03:16:05.749Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 8,
  "readers_count": 7,
  "score": 6.4,
  "yours": false,
  "topic_id": 916,
  "topic_slug": "dnm-ecash-and-privacy",
  "topic_title": "DNM, eCash and privacy",
  "topic_html_title": "DNM, eCash and privacy",
  "category_id": 8,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"1440000bytes, post:1, topic:916\"]\nI think there are some risks involved in running such mints and the **only use case for eCash** that makes sense is [Dark Net Markets].\n[/quote]\n\nThis seems backwards to me: ecash (in the digicash style) generally requires a centralised mint that's a single point-of-failure for everyone using ecash. If most uses of ecash are dark (illegal/black market), then once law enforcement decides to crack down on them, the mint becomes an easy and attractive target. That's very high risk for the operators of the mint, even if they attempt to protect themselves via a federation or anonymity tools, and it's also high risk for users of the system: if the mint is forced to shut down by a hostile actor, none of the funds stored as ecash are recoverable. If the mint's operators are anonymous to law enforcement, then they're also anonymous to the majority of its users, and that probably elevates the risk of the operators doing a rug pull as well: a rug pull has the benefit of both getting a chunk of funds immediately, and also bounds the risk that law enforcement are going to come after you because you've been enabling crime or terrorism or whatever.",
  "actions_summary": [],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}