{
  "id": 2878,
  "name": "Christian Decker",
  "username": "cdecker",
  "avatar_template": "/user_avatar/delvingbitcoin.org/cdecker/{size}/99_2.png",
  "created_at": "2024-07-12T11:16:37.983Z",
  "cooked": "<p>I don’t think that the similarity between the Fiat channels proposal and Tony’s construction are similar at all:</p>\n<ul>\n<li>The former uses hosted channels, making it purely custodial. There is a proof of misbehavior, i.e., a hosted channel user can point to the host and show they misbehaved, but that’s strictly weaker than the unilateral enforcement in LN itself.</li>\n<li>The latter is still a normal LN node, with channels denominated in BTC, and the worst that can happen is that the peer does not cooperate to update the exchange rate and adjust holdings, so worst case you have BTC, but the exchange rate is outdated. With hosted channels you don’t get anything.</li>\n<li>Hosted channel clients are not normal LN nodes, whereas Tony’s construction allows you to mix BTC and USD channels in the same node (even allowing you to offer swap services out of the box).</li>\n</ul>\n<p>I think it’s unfair to claim the two constructions are the same, even slightly misleading. There is a whole spectrum of solutions, and many things get reinvented, but let’s be fair about how we cluster solutions, not to lose some interesting tradeoffs.</p>",
  "post_number": 7,
  "post_type": 1,
  "updated_at": "2024-07-12T11:16:37.983Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 5,
  "readers_count": 4,
  "score": 1.0,
  "yours": false,
  "topic_id": 875,
  "topic_slug": "stable-channels-peer-to-peer-dollar-balances-on-lightning",
  "topic_title": "Stable Channels - peer-to-peer dollar balances on Lightning",
  "topic_html_title": "Stable Channels - peer-to-peer dollar balances on Lightning",
  "category_id": 7,
  "display_username": "Christian Decker",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I don't think that the similarity between the Fiat channels proposal and Tony's construction are similar at all:\n\n - The former uses hosted channels, making it purely custodial. There is a proof of misbehavior, i.e., a hosted channel user can point to the host and show they misbehaved, but that's strictly weaker than the unilateral enforcement in LN itself.\n - The latter is still a normal LN node, with channels denominated in BTC, and the worst that can happen is that the peer does not cooperate to update the exchange rate and adjust holdings, so worst case you have BTC, but the exchange rate is outdated. With hosted channels you don't get anything.\n - Hosted channel clients are not normal LN nodes, whereas Tony's construction allows you to mix BTC and USD channels in the same node (even allowing you to offer swap services out of the box).\n\nI think it's unfair to claim the two constructions are the same, even slightly misleading. There is a whole spectrum of solutions, and many things get reinvented, but let's be fair about how we cluster solutions, not to lose some interesting tradeoffs.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 103,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}