{
  "id": 5090,
  "name": "Garlo Nicon",
  "username": "garlonicon",
  "avatar_template": "/letter_avatar_proxy/v4/letter/g/278dde/{size}.png",
  "created_at": "2025-05-22T11:40:30.057Z",
  "cooked": "<blockquote>\n<p>The other attempts to define it are super confusing.</p>\n</blockquote>\n<p>Why? The whole idea behind it is quite simple: if you have L2 and L1, then Lightning Network has more transactions than mainnet, and when they are committed on-chain, they can be discarded (so that future LN nodes don’t have to download them). And the same can be true between L1 and L0: if you can commit things upwards in a way, where cryptographical assumptions are not weaker than before, then you can discard some data from L1, and use L0 instead.</p>\n<p>Because during Initial Blockchain Download, you don’t have to pull the full history from 2009 to 2025. You only have to pull enough data, to be 100% sure, that Proof of Work is correct, and all chains of signatures are correct, and other consensus rules like that are met. But: if you can process some kind of proof, instead of processing the actual data, and the proof has the same cryptographic assumptions, then you can reach better spam resistance. If you have “Alice → Bob → Charlie” transaction chain, then you can just process and store “Alice → Charlie” in your L0 node, and the proof, that Bob was inside, can be kept separately. Then, you will reach similar case, as if “Alice → Bob” and “Bob → Charlie” would be LN transactions, and “Alice → Charlie” would be the final on-chain commitment, but instead of doing it between L2 and L1, you would do that between L1 and L0.</p>\n<blockquote>\n<p>Well to me if there is a layer-0, then it’s the internet.</p>\n</blockquote>\n<p>Oh, there are many things, which are simpler than L1: for example, you can have a node, which collects only block headers, and traces only Proof of Work, based on that. In another topic, there are discussions about UTXO proofs. But in general, you can have quite lightweight node in practice, where you have to process less data during Initial Blockchain Download, and more data, when coins are moved.</p>\n<p>And to reach better spam resistance, you can simply make your node more pruned, than it currently is. Now, you have only full nodes, and pruned nodes. In the future, there will probably be nodes, which will process only a subset of what is happening in L1, and then, they will be more resistant to spam, because users would have to provide heavier proofs, when moving their coins.</p>",
  "post_number": 5,
  "post_type": 1,
  "posts_count": 7,
  "updated_at": "2025-05-22T11:40:30.057Z",
  "reply_count": 0,
  "reply_to_post_number": 4,
  "quote_count": 0,
  "incoming_link_count": 8,
  "reads": 46,
  "readers_count": 45,
  "score": 44.0,
  "yours": false,
  "topic_id": 1692,
  "topic_slug": "the-spam-problem-of-bitcoin-and-unpermissioned-broadcast-networks-in-general",
  "topic_title": "The Spam problem of Bitcoin and Unpermissioned Broadcast Networks in general",
  "topic_html_title": "The Spam problem of Bitcoin and Unpermissioned Broadcast Networks in general",
  "category_id": 6,
  "display_username": "Garlo Nicon",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 48,
    "username": "moonsettler",
    "name": "moonsettler",
    "avatar_template": "/user_avatar/delvingbitcoin.org/moonsettler/{size}/38_2.png"
  },
  "bookmarked": false,
  "raw": "> The other attempts to define it are super confusing.\n\nWhy? The whole idea behind it is quite simple: if you have L2 and L1, then Lightning Network has more transactions than mainnet, and when they are committed on-chain, they can be discarded (so that future LN nodes don't have to download them). And the same can be true between L1 and L0: if you can commit things upwards in a way, where cryptographical assumptions are not weaker than before, then you can discard some data from L1, and use L0 instead.\n\nBecause during Initial Blockchain Download, you don't have to pull the full history from 2009 to 2025. You only have to pull enough data, to be 100% sure, that Proof of Work is correct, and all chains of signatures are correct, and other consensus rules like that are met. But: if you can process some kind of proof, instead of processing the actual data, and the proof has the same cryptographic assumptions, then you can reach better spam resistance. If you have \"Alice -> Bob -> Charlie\" transaction chain, then you can just process and store \"Alice -> Charlie\" in your L0 node, and the proof, that Bob was inside, can be kept separately. Then, you will reach similar case, as if \"Alice -> Bob\" and \"Bob -> Charlie\" would be LN transactions, and \"Alice -> Charlie\" would be the final on-chain commitment, but instead of doing it between L2 and L1, you would do that between L1 and L0.\n\n> Well to me if there is a layer-0, then it’s the internet.\n\nOh, there are many things, which are simpler than L1: for example, you can have a node, which collects only block headers, and traces only Proof of Work, based on that. In another topic, there are discussions about UTXO proofs. But in general, you can have quite lightweight node in practice, where you have to process less data during Initial Blockchain Download, and more data, when coins are moved.\n\nAnd to reach better spam resistance, you can simply make your node more pruned, than it currently is. Now, you have only full nodes, and pruned nodes. In the future, there will probably be nodes, which will process only a subset of what is happening in L1, and then, they will be more resistant to spam, because users would have to provide heavier proofs, when moving their coins.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 372,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "The other attempts to define it are super confusing. \n\nWhy? The whole idea behind it is quite simple: if you have L2 and L1, then Lightning Network has more transactions than mainnet, and when they are committed on-chain, they can be discarded (so that future LN nodes don’t have to download them). &hellip;",
  "truncated": true,
  "post_url": "/t/the-spam-problem-of-bitcoin-and-unpermissioned-broadcast-networks-in-general/1692/5",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}