{
  "id": 5079,
  "name": "",
  "username": "gmaxwell",
  "avatar_template": "/letter_avatar_proxy/v4/letter/g/fbc32d/{size}.png",
  "created_at": "2025-05-21T23:06:02.432Z",
  "cooked": "<p>Sigh. No one forgot or failed to know about it.  In fact, that comment was made in regard to comments by myself and Matt who created it.  It’s just another dishonest smear. (particularly given that the comment it was initially made in response to was my PR comment which expressly discusses the subject!)</p>\n<p>The extrapool was primarily created for replacements.  It’s applicability to heterogeneous policy is relatively limited, particularly when the subject being discussed-- as it has been here-- is Bitcoin Core’s defaults.</p>\n<p>Extrapool and extrapool like techniques only help when you’ve observed, downloaded, and processed a transaction – that is the case when you are an unusual node filtering more than others around you.  But in the case of Bitcoin Core’s default relay policy it won’t help because generally you won’t have ever seen the transaction to begin with.</p>\n<p>Like many other things in the p2p protocol there are assumptions that the behavior of honest nodes is pretty homogeneous (and consistent with mining).   Where you know its not it would be useful to increase the size of the extrapool,  though increasing it isn’t free because both the worst case memory requirements and a slowdown in processing blocks due to the additional conversion/matching.  The increase also undermines one of the arguments people are making for the filtering in general-- that it at least keeps the transactions from wasting their memory until they’re mined.</p>\n<p>Improvements may well be useful, I think it likely (and I previously advocated for them!)-- but none the less have no relevance to Bitcoin Core default policy discussions for the aforementioned “you can’t extrapool it if you never saw it” reason.</p>",
  "post_number": 2,
  "post_type": 1,
  "posts_count": 6,
  "updated_at": "2025-05-21T23:08:43.649Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 1,
  "reads": 25,
  "readers_count": 24,
  "score": 45.0,
  "yours": false,
  "topic_id": 1716,
  "topic_slug": "vextratxnforcompact-considered-useful",
  "topic_title": "vExtraTxnForCompact Considered Useful",
  "topic_html_title": "vExtraTxnForCompact Considered Useful",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Sigh. No one forgot or failed to know about it.  In fact, that comment was made in regard to comments by myself and Matt who created it.  It's just another dishonest smear. (particularly given that the comment it was initially made in response to was my PR comment which expressly discusses the subject!)\n\nThe extrapool was primarily created for replacements.  It's applicability to heterogeneous policy is relatively limited, particularly when the subject being discussed-- as it has been here-- is Bitcoin Core's defaults.  \n\nExtrapool and extrapool like techniques only help when you've observed, downloaded, and processed a transaction -- that is the case when you are an unusual node filtering more than others around you.  But in the case of Bitcoin Core's default relay policy it won't help because generally you won't have ever seen the transaction to begin with.\n\nLike many other things in the p2p protocol there are assumptions that the behavior of honest nodes is pretty homogeneous (and consistent with mining).   Where you know its not it would be useful to increase the size of the extrapool,  though increasing it isn't free because both the worst case memory requirements and a slowdown in processing blocks due to the additional conversion/matching.  The increase also undermines one of the arguments people are making for the filtering in general-- that it at least keeps the transactions from wasting their memory until they're mined.\n\nImprovements may well be useful, I think it likely (and I previously advocated for them!)-- but none the less have no relevance to Bitcoin Core default policy discussions for the aforementioned \"you can't extrapool it if you never saw it\" reason.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 699,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Sigh. No one forgot or failed to know about it.  In fact, that comment was made in regard to comments by myself and Matt who created it.  It’s just another dishonest smear. (particularly given that the comment it was initially made in response to was my PR comment which expressly discusses the subje&hellip;",
  "truncated": true,
  "post_url": "/t/vextratxnforcompact-considered-useful/1716/2",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}