{
  "id": 5062,
  "name": "",
  "username": "gmaxwell",
  "avatar_template": "/letter_avatar_proxy/v4/letter/g/fbc32d/{size}.png",
  "created_at": "2025-05-20T23:44:48.509Z",
  "cooked": "<p>There is no need for any kind of “deterrent” as a freestanding goal, particularly in this context where the proposal reduces the cost of utxo bloat to essentially whatever it cost to track the (un)spentness.</p>\n<p>From the perspective of the consensus rules it mostly doesn’t matter who constructs the proofs.  From a security and autonomy perspective it must be realistic for the owners of the coin to do so on their own.</p>\n<p>This proposal has the advantage the the proofs are static, so they’re basically free to construct-- the Bitcoin wallet even used to store exactly the txo proofs this proposal assumes though the behavior was removed because it wasn’t used for anything.  (I point out above why sadly I think standard SPV proofs aren’t great but if this were adopted using them sufficiently old wallets even already have the required proofs, how cool is that?)</p>\n<p>Of course you could also have other parties providing the proofs, – anyone who wants to,  miners might well find it attractive since they collect the fees on the spend.   But I think this question is mostly outside the scope of the consensus rules themselves.</p>",
  "post_number": 20,
  "post_type": 1,
  "posts_count": 33,
  "updated_at": "2025-05-20T23:46:12.356Z",
  "reply_count": 0,
  "reply_to_post_number": 19,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 60,
  "readers_count": 59,
  "score": 27.0,
  "yours": false,
  "topic_id": 1707,
  "topic_slug": "dust-expiry-clean-the-utxo-set-from-spam",
  "topic_title": "Dust Expiry: Clean the UTXO set from spam",
  "topic_html_title": "Dust Expiry: Clean the UTXO set from spam",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 782,
    "username": "aurelian_btc",
    "name": null,
    "avatar_template": "/user_avatar/delvingbitcoin.org/aurelian_btc/{size}/1326_2.png"
  },
  "bookmarked": false,
  "raw": "There is no need for any kind of \"deterrent\" as a freestanding goal, particularly in this context where the proposal reduces the cost of utxo bloat to essentially whatever it cost to track the (un)spentness.\n\nFrom the perspective of the consensus rules it mostly doesn't matter who constructs the proofs.  From a security and autonomy perspective it must be realistic for the owners of the coin to do so on their own.\n\nThis proposal has the advantage the the proofs are static, so they're basically free to construct-- the Bitcoin wallet even used to store exactly the txo proofs this proposal assumes though the behavior was removed because it wasn't used for anything.  (I point out above why sadly I think standard SPV proofs aren't great but if this were adopted using them sufficiently old wallets even already have the required proofs, how cool is that?)\n\nOf course you could also have other parties providing the proofs, -- anyone who wants to,  miners might well find it attractive since they collect the fees on the spend.   But I think this question is mostly outside the scope of the consensus rules themselves.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 699,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "There is no need for any kind of “deterrent” as a freestanding goal, particularly in this context where the proposal reduces the cost of utxo bloat to essentially whatever it cost to track the (un)spentness. \nFrom the perspective of the consensus rules it mostly doesn’t matter who constructs the pro&hellip;",
  "truncated": true,
  "post_url": "/t/dust-expiry-clean-the-utxo-set-from-spam/1707/20",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}