{
  "id": 5109,
  "name": "Brh28",
  "username": "brh28",
  "avatar_template": "/user_avatar/delvingbitcoin.org/brh28/{size}/836_2.png",
  "created_at": "2025-05-23T20:28:07.443Z",
  "cooked": "<p>Thank you for taking the time to summarize this discussion.</p>\n<p>As you mention, there is a fundamental trade-off between performance (latency) and privacy. While there <em>may</em> be a slight privacy improvement, I’m more concerned that this amplifies performance issues that already exist in Lightning today. Adding a forwarding delay effects every hop of every payment attempt. Not only does this slow the delivery of successful payments by <code>delay * hop_count</code>, but perhaps more concerning is it also delays failing payment attempts, both legitimate and malicious. As routing relies on trial-and-error, failed payments are expected. Worse yet, probing is a common trick to improve future reliability, which means we can expect the number of failed payments to grow exponentially with the number of nodes on the network. Adding delays to these failed attempts compounds the problem of locked liquidity and HTLC slots for routing nodes.</p>\n<p>So I agree, routing nodes have no incentive to follow these rules, other than as an optional feature to attract privacy-focused nodes.</p>\n<p>I like your idea of applying delays at the source and destinations:</p>\n<ol>\n<li>It’s opt-in and can be tuned to the user’s preference</li>\n<li>It’s doesn’t require protocol changes</li>\n<li>For the receiver, it’s safe to consider the payment successful, even while delaying HTLC fulfillment</li>\n</ol>",
  "post_number": 2,
  "post_type": 1,
  "posts_count": 40,
  "updated_at": "2025-05-23T20:28:07.443Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 52,
  "readers_count": 51,
  "score": 25.4,
  "yours": false,
  "topic_id": 1723,
  "topic_slug": "latency-and-privacy-in-lightning",
  "topic_title": "Latency and Privacy in Lightning",
  "topic_html_title": "Latency and Privacy in Lightning",
  "category_id": 7,
  "display_username": "Brh28",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Thank you for taking the time to summarize this discussion.\n\nAs you mention, there is a fundamental trade-off between performance (latency) and privacy. While there *may* be a slight privacy improvement, I'm more concerned that this amplifies performance issues that already exist in Lightning today. Adding a forwarding delay effects every hop of every payment attempt. Not only does this slow the delivery of successful payments by `delay * hop_count`, but perhaps more concerning is it also delays failing payment attempts, both legitimate and malicious. As routing relies on trial-and-error, failed payments are expected. Worse yet, probing is a common trick to improve future reliability, which means we can expect the number of failed payments to grow exponentially with the number of nodes on the network. Adding delays to these failed attempts compounds the problem of locked liquidity and HTLC slots for routing nodes. \n\nSo I agree, routing nodes have no incentive to follow these rules, other than as an optional feature to attract privacy-focused nodes. \n\nI like your idea of applying delays at the source and destinations:\n1. It's opt-in and can be tuned to the user's preference\n2. It's doesn't require protocol changes\n3. For the receiver, it's safe to consider the payment successful, even while delaying HTLC fulfillment",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 558,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Thank you for taking the time to summarize this discussion. \nAs you mention, there is a fundamental trade-off between performance (latency) and privacy. While there may be a slight privacy improvement, I’m more concerned that this amplifies performance issues that already exist in Lightning today. A&hellip;",
  "truncated": true,
  "post_url": "/t/latency-and-privacy-in-lightning/1723/2",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}