{
  "id": 5025,
  "name": "",
  "username": "light",
  "avatar_template": "/user_avatar/delvingbitcoin.org/light/{size}/350_2.png",
  "created_at": "2025-05-17T21:32:58.958Z",
  "cooked": "<p>In his post “<a href=\"https://delvingbitcoin.org/t/perpetually-kycd-coins-using-evil-covenants/556\">Perpetually KYC’d Coins Using Evil Covenants</a>” <a class=\"mention\" href=\"/u/robinlinus\">@RobinLinus</a> sketches out a high level design for a “perpetual KYC contract” using <code>OP_CTV</code>, <code>OP_CSFS</code>, <code>OP_CAT</code>, and <code>OP_EXPIRE</code>. While the technical discussion around that particular design is interesting, I see it as downstream of a more philosophical question, which is: <strong>should we rule out any soft fork proposal (or combination of proposals) that enables “evil” covenants?<sup class=\"footnote-ref\"><a href=\"#footnote-5025-1\" id=\"footnote-ref-5025-1\">[1]</a></sup></strong></p>\n<p>If the answer to this question is yes, then I believe research such as that in the thread linked above is worth pursuing, because we would of course want to know ahead of time whether or not (and perhaps how, exactly) a given proposal / combination of proposals enables evil covenants if we are explicitly trying to avoid enabling them.</p>\n<p>If, otoh, the answer is no, then I think this research is maybe academically interesting but, for the most part, only really helpful to tyrants by doing some of their dirty work for them. (I say this with all due respect to Robin and other researchers who have spent time digging into the implementation details of evil covenants.)</p>\n<p>Net of all considerations, my answer to whether we should rule out soft fork proposals (or combinations of proposals) that enable evil covenants is a categorical “no”. That is, I don’t find the possibility of evil covenants <em>of any conceivable design</em> to be a compelling reason to oppose a soft fork that enables them.</p>\n<p>I arrive at this conclusion for two reasons, one more technical and one more philosophical:</p>\n<h2><a name=\"p-5025-h-1-the-existence-or-possibility-of-workable-alternatives-1\" class=\"anchor\" href=\"#p-5025-h-1-the-existence-or-possibility-of-workable-alternatives-1\"></a>1. The existence (or possibility) of workable alternatives</h2>\n<p>I strongly doubt that absent KYC covenant abilities, tyrants who want to strictly control how their citizens use bitcoin will simply throw up their hands and say “oh well, bitcoin doesn’t have the ability to create these KYC covenants, I guess we’ll have to let our citizens use it freely”. No, they will come up with some workable alternative that more or less achieves the desired outcome. A few options that are close at hand are:</p>\n<ul>\n<li>\n<p>A <a href=\"https://medium.com/@RubenSomsen/21-million-bitcoins-to-rule-all-sidechains-the-perpetual-one-way-peg-96cb2f8ac302\" rel=\"noopener nofollow ugc\">P1WP</a> scheme, where users must permanently transfer their coins into a sidesystem that runs according to rules set by the tyrant (with harsh penalties for holding/transferring coins outside of this scheme)</p>\n</li>\n<li>\n<p>A cosigner scheme, such as <a href=\"https://docs.liquid.net/docs/blockstream-amp-overview\" rel=\"noopener nofollow ugc\">AMP</a>, where the tyrant mandates that all coins must held in a 2-of-2 address with the tyrant as cosigner and the tyrant only cosigns transfers to approved addresses (with harsh penalties for holding/transferring coins outside of this scheme)</p>\n</li>\n<li>\n<p>Requiring use of a custodian, and requiring the custodians to only send to approved addresses (with harsh penalties for doing otherwise)</p>\n</li>\n<li>\n<p>Allowing self-custody but requiring users to only send to approved addresses (with harsh penalties for doing otherwise)</p>\n</li>\n</ul>\n<h2><a name=\"p-5025-h-2-taking-the-bad-with-the-good-respecting-freedom-and-encouraging-responsibility-2\" class=\"anchor\" href=\"#p-5025-h-2-taking-the-bad-with-the-good-respecting-freedom-and-encouraging-responsibility-2\"></a>2. Taking the bad with the good, respecting freedom and encouraging responsibility</h2>\n<p>On the other side of the coin (no pun intended) recursive covenants can give us strong tools for making self-custodial bitcoin more private, fungible, and scalable; in short: better freedom money. I believe the potential for good here far outweighs the potential for bad. As much as I would not like to see evil covenants forced upon people, I think it’s even more important that people have access to the good capabilities of covenants.</p>\n<p>The same way firearms have empowered both tyrant forces and freedom fighters, and the internet has enabled both mass surveillance and mass free speech, bitcoin (with or without covenants) can be used for both bad and good; to control people or to liberate them.</p>\n<p>How the tools we build actually end up being used is in some cases within our control and in some cases outside of our control. It is up to each of us as individuals to use the tools at our disposal responsibly, at the very least, to not use them to harm others. To the extent that we have a say in the organizations in society, such as govts and corporations, we should endeavor that they use available tools with the same level of care we expect of individuals. And when individuals and organizations stray from the path of righteousness, we should endeavor to have strong institutions of justice to hold those who harm others accountable, provide justice to victims, and prevent further harm. (And I would certainly consider the coercive imposition of KYC covenants to be a harmful act deserving of opposition and justice.)</p>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"footnote-5025-1\" class=\"footnote-item\"><p>To define terms here, I consider “evil covenants” to be covenants that inflict some kind of unwanted restriction or outcome upon individual users of the covenant. I put changes that result in mevil or other <em>systemic</em> issues in a separate category worthy of their own philosophical and technical discussions. <a href=\"#footnote-ref-5025-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 12,
  "updated_at": "2025-05-17T21:36:35.733Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 68,
  "reads": 49,
  "readers_count": 48,
  "score": 379.6,
  "yours": false,
  "topic_id": 1703,
  "topic_slug": "on-the-possibility-of-evil-covenants-and-implications-for-soft-fork-proposals",
  "topic_title": "On the possibility of evil covenants and implications for soft fork proposals",
  "topic_html_title": "On the possibility of evil covenants and implications for soft fork proposals",
  "category_id": 5,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "In his post \"[Perpetually KYC’d Coins Using Evil Covenants](https://delvingbitcoin.org/t/perpetually-kycd-coins-using-evil-covenants/556)\" @RobinLinus sketches out a high level design for a \"perpetual KYC contract\" using `OP_CTV`, `OP_CSFS`, `OP_CAT`, and `OP_EXPIRE`. While the technical discussion around that particular design is interesting, I see it as downstream of a more philosophical question, which is: **should we rule out any soft fork proposal (or combination of proposals) that enables \"evil\" covenants?[^1]**\n\nIf the answer to this question is yes, then I believe research such as that in the thread linked above is worth pursuing, because we would of course want to know ahead of time whether or not (and perhaps how, exactly) a given proposal / combination of proposals enables evil covenants if we are explicitly trying to avoid enabling them.\n\nIf, otoh, the answer is no, then I think this research is maybe academically interesting but, for the most part, only really helpful to tyrants by doing some of their dirty work for them. (I say this with all due respect to Robin and other researchers who have spent time digging into the implementation details of evil covenants.)\n\nNet of all considerations, my answer to whether we should rule out soft fork proposals (or combinations of proposals) that enable evil covenants is a categorical \"no\". That is, I don't find the possibility of evil covenants _of any conceivable design_ to be a compelling reason to oppose a soft fork that enables them.\n\nI arrive at this conclusion for two reasons, one more technical and one more philosophical:\n\n## 1. The existence (or possibility) of workable alternatives\n\nI strongly doubt that absent KYC covenant abilities, tyrants who want to strictly control how their citizens use bitcoin will simply throw up their hands and say \"oh well, bitcoin doesn't have the ability to create these KYC covenants, I guess we'll have to let our citizens use it freely\". No, they will come up with some workable alternative that more or less achieves the desired outcome. A few options that are close at hand are:\n\n- A [P1WP](https://medium.com/@RubenSomsen/21-million-bitcoins-to-rule-all-sidechains-the-perpetual-one-way-peg-96cb2f8ac302) scheme, where users must permanently transfer their coins into a sidesystem that runs according to rules set by the tyrant (with harsh penalties for holding/transferring coins outside of this scheme)\n\n- A cosigner scheme, such as [AMP](https://docs.liquid.net/docs/blockstream-amp-overview), where the tyrant mandates that all coins must held in a 2-of-2 address with the tyrant as cosigner and the tyrant only cosigns transfers to approved addresses (with harsh penalties for holding/transferring coins outside of this scheme)\n  \n- Requiring use of a custodian, and requiring the custodians to only send to approved addresses (with harsh penalties for doing otherwise)\n  \n- Allowing self-custody but requiring users to only send to approved addresses (with harsh penalties for doing otherwise)\n\n## 2. Taking the bad with the good, respecting freedom and encouraging responsibility\n\nOn the other side of the coin (no pun intended) recursive covenants can give us strong tools for making self-custodial bitcoin more private, fungible, and scalable; in short: better freedom money. I believe the potential for good here far outweighs the potential for bad. As much as I would not like to see evil covenants forced upon people, I think it's even more important that people have access to the good capabilities of covenants.\n\nThe same way firearms have empowered both tyrant forces and freedom fighters, and the internet has enabled both mass surveillance and mass free speech, bitcoin (with or without covenants) can be used for both bad and good; to control people or to liberate them.\n\nHow the tools we build actually end up being used is in some cases within our control and in some cases outside of our control. It is up to each of us as individuals to use the tools at our disposal responsibly, at the very least, to not use them to harm others. To the extent that we have a say in the organizations in society, such as govts and corporations, we should endeavor that they use available tools with the same level of care we expect of individuals. And when individuals and organizations stray from the path of righteousness, we should endeavor to have strong institutions of justice to hold those who harm others accountable, provide justice to victims, and prevent further harm. (And I would certainly consider the coercive imposition of KYC covenants to be a harmful act deserving of opposition and justice.)\n\n[^1]: To define terms here, I consider \"evil covenants\" to be covenants that inflict some kind of unwanted restriction or outcome upon individual users of the covenant. I put changes that result in mevil or other _systemic_ issues in a separate category worthy of their own philosophical and technical discussions.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 289,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "In his post “<a href=\"https://delvingbitcoin.org/t/perpetually-kycd-coins-using-evil-covenants/556\">Perpetually KYC’d Coins Using Evil Covenants</a>” <a class=\"mention\" href=\"/u/robinlinus\">@RobinLinus</a> sketches out a high level design for a “perpetual KYC contract” using OP_CTV, OP_CSFS, OP_CAT, and OP_EXPIRE. While the technical discussion around that particular design is interesting, I see it as downstream of a more philosoph&hellip;",
  "truncated": true,
  "post_url": "/t/on-the-possibility-of-evil-covenants-and-implications-for-soft-fork-proposals/1703/1",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}