{
  "id": 5147,
  "name": "Vojtěch Strnad",
  "username": "vostrnad",
  "avatar_template": "/user_avatar/delvingbitcoin.org/vostrnad/{size}/422_2.png",
  "created_at": "2025-05-28T18:56:22.528Z",
  "cooked": "<p>Hi everyone,</p>\n<p>as you might have heard, several mining pools announced today that they will partner up in supporting the mining of non-standard transactions. News article here: <a href=\"https://www.coindesk.com/business/2025/05/27/bitlayer-joins-forces-with-antpool-f2pool-and-spiderpool-to-supercharge-bitcoin-defi\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Bitcoin News: Bitlayer Joins Forces With Antpool, F2Pool, and SpiderPool to Supercharge BTC DeFi</a></p>\n<p>I haven’t been able to confirm for sure, but since the article specifically mentions BitVM, it seems one standardness rule they have in mind is the 100 kvB weight limit for transactions, as some BitVM transactions are supposedly larger than that.</p>\n<p>The rule has multiple benefits, such as limiting the impact of quadratic hashing in pre-SegWit inputs, but the <a href=\"https://github.com/bitcoin/bips/blob/72af87fc72999e3f0a26a06e6e0a7f3134236337/bip-0054.md\" rel=\"noopener nofollow ugc\">Consensus Cleanup</a> proposal already addresses that. The other primary benefit is that it makes building more optimal block templates easier, reducing the need for centralized template providers.</p>\n<p>Ideally we’d want to make this limit a consensus rule, but that risks both impacting future uses of large transactions that could be tremendously valuable (in the case of BitVM that remains to be seen) and confiscating already existing UTXOs that require a large transaction to be spent. A weaker version of this rule might go something like this:</p>\n<p><strong>A non-coinbase transaction weighing more than 400,000 WU must be the only transaction in a block apart from the coinbase transaction.</strong></p>\n<p>This would preserve the ability to create oversized transactions for protocols that are valuable enough to afford a whole block for themselves from time to time, and it wouldn’t make it any more difficult to create optimal templates. However, it has that one nasty drawback: MEV. Miners could still add more outputs to the coinbase transaction, i.e. space they could sell for data storage, and smaller miners would be at a disadvantage trying to provide this service.</p>\n<p>Potential solutions that come to mind include limiting the size of the coinbase transaction in a block with an oversized transaction (however that would affect decentralized coinbase payout schemes) or allowing just one oversized transaction per block without disallowing smaller transactions (though I’m not sure how much that would actually help in building optimal block templates).</p>\n<p>If you have other ideas, I’d be happy to hear about them. I don’t think that long-term we want a Bitcoin without any sort of consensus check against oversized transactions. If they become at least somewhat common, miners could be forced to use centralized template providers to remain profitable (<a href=\"https://www.mevwatch.info/\" rel=\"noopener nofollow ugc\">as is the case today with Ethereum</a>).</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 9,
  "updated_at": "2025-05-28T19:01:24.876Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 243,
  "reads": 55,
  "readers_count": 54,
  "score": 1221.0,
  "yours": false,
  "topic_id": 1732,
  "topic_slug": "non-confiscatory-transaction-weight-limit",
  "topic_title": "Non-confiscatory Transaction Weight Limit",
  "topic_html_title": "Non-confiscatory Transaction Weight Limit",
  "category_id": 7,
  "display_username": "Vojtěch Strnad",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Hi everyone,\n\nas you might have heard, several mining pools announced today that they will partner up in supporting the mining of non-standard transactions. News article here: https://www.coindesk.com/business/2025/05/27/bitlayer-joins-forces-with-antpool-f2pool-and-spiderpool-to-supercharge-bitcoin-defi\n\nI haven't been able to confirm for sure, but since the article specifically mentions BitVM, it seems one standardness rule they have in mind is the 100 kvB weight limit for transactions, as some BitVM transactions are supposedly larger than that.\n\nThe rule has multiple benefits, such as limiting the impact of quadratic hashing in pre-SegWit inputs, but the [Consensus Cleanup](https://github.com/bitcoin/bips/blob/72af87fc72999e3f0a26a06e6e0a7f3134236337/bip-0054.md) proposal already addresses that. The other primary benefit is that it makes building more optimal block templates easier, reducing the need for centralized template providers.\n\nIdeally we'd want to make this limit a consensus rule, but that risks both impacting future uses of large transactions that could be tremendously valuable (in the case of BitVM that remains to be seen) and confiscating already existing UTXOs that require a large transaction to be spent. A weaker version of this rule might go something like this:\n\n**A non-coinbase transaction weighing more than 400,000 WU must be the only transaction in a block apart from the coinbase transaction.**\n\nThis would preserve the ability to create oversized transactions for protocols that are valuable enough to afford a whole block for themselves from time to time, and it wouldn't make it any more difficult to create optimal templates. However, it has that one nasty drawback: MEV. Miners could still add more outputs to the coinbase transaction, i.e. space they could sell for data storage, and smaller miners would be at a disadvantage trying to provide this service.\n\nPotential solutions that come to mind include limiting the size of the coinbase transaction in a block with an oversized transaction (however that would affect decentralized coinbase payout schemes) or allowing just one oversized transaction per block without disallowing smaller transactions (though I'm not sure how much that would actually help in building optimal block templates).\n\nIf you have other ideas, I'd be happy to hear about them. I don't think that long-term we want a Bitcoin without any sort of consensus check against oversized transactions. If they become at least somewhat common, miners could be forced to use centralized template providers to remain profitable ([as is the case today with Ethereum](https://www.mevwatch.info/)).",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 227,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Hi everyone, \nas you might have heard, several mining pools announced today that they will partner up in supporting the mining of non-standard transactions. News article here: <a href=\"https://www.coindesk.com/business/2025/05/27/bitlayer-joins-forces-with-antpool-f2pool-and-spiderpool-to-supercharge-bitcoin-defi\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Bitcoin News: Bitlayer Joins Forces With Antpool, F2Pool, and SpiderPool to Supercharge BTC DeFi</a> \nI haven’t been able to con&hellip;",
  "truncated": true,
  "post_url": "/t/non-confiscatory-transaction-weight-limit/1732/1",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}