{
  "id": 4947,
  "name": "",
  "username": "josh",
  "avatar_template": "/user_avatar/delvingbitcoin.org/josh/{size}/95_2.png",
  "created_at": "2025-05-06T15:04:57.135Z",
  "cooked": "<p><em>TLDR: I’m exploring an idea to enable generalized program composition and coin delegation, which seems to strike a nice balance between simplicity and flexibility.</em></p>\n<p>I’ve been thinking recently about the optimal way to introduce delegation to Bitcoin. The idea of delegating one’s coins is not a new one. Some <a href=\"https://bitcoinops.org/en/topics/op_codeseparator/\" rel=\"noopener nofollow ugc\">speculate</a> that <code>OP_CODESEPARATOR</code> was an early attempt by Satoshi to do delegation. More recently, proposals like <a href=\"https://gnusha.org/pi/bitcoindev/CAAS2fgSnfd++94+40vnSRxQfi9fk8N6+2-DbjVpssHxFvYveFQ@mail.gmail.com/\" rel=\"noopener nofollow ugc\">Graftroot</a> and <a href=\"https://gist.github.com/sipa/ca1502f8465d0d5032d9dd2465f32603\" rel=\"noopener nofollow ugc\">Entroot</a> have been put forward, which would enable delegation (and re-delegation), but only from key path spends and only to a locking script. In contrast, <a href=\"https://github.com/bitcoin/bips/blob/3365fb7a7e5e25b95b94d65808e32a02aa684aaa/bip-0348.md\" rel=\"noopener nofollow ugc\">CSFS</a> would enable delegation from script path spends, but it’s limited, as it only facilitates delegation within a pre-committed script.</p>\n<p>When considering delegation, what type of functionality is desirable? I’d argue that generalized delegation has two properties:</p>\n<ol>\n<li>Delegation <em>from any valid spending path</em></li>\n<li>Delegation <em>to arbitrarily complex compositions of programs and script</em></li>\n</ol>\n<p>The latter is important so that users can delegate to <em>addresses</em>, and not just public keys, while retaining the ability to add timelocks and other conditions.</p>\n<p>In order to build this, we need two key features: 1) “Generalized Composition,” and 2) “Generalized Delegation.” Generalized composition involves the conjunction of programs and script, and delegation is merely the addition of a second composition on-the-fly, if the primary one is satisfied.</p>\n<p>Is there a simple and safe way to implement generalized composition and delegation within Taproot? I think there is…</p>\n<p>I’d like to present a proof-of-concept that I came up with, which I’m calling “Graftleaf.”</p>\n<h2><a name=\"p-4947-proposal-graftleaf-1\" class=\"anchor\" href=\"#p-4947-proposal-graftleaf-1\"></a>Proposal: Graftleaf</h2>\n<p>Graftleaf is a new Taproot leaf version (0xc2), which uses the annex to perform delegations. Graftleaf adds two significant capabilities:</p>\n<ol>\n<li><strong>Composition</strong>: The ability to execute zero, one, or more witness programs in sequence, including a locking script.</li>\n<li><strong>Delegation</strong>: The ability to add additional spending conditions at signature-time, which can comprise any combination of programs and script.</li>\n</ol>\n<p>The core execution logic is fewer than 60 lines of code. You can find my implementation <a href=\"https://github.com/joshdoman/bitcoin/pull/1\" rel=\"noopener nofollow ugc\">here</a>. I’ve included a fairly large test suite, though there’s definitely room for improvement.</p>\n<p>Below are some technical details on how it works. I wrap up with a more in-depth comparison versus existing proposals and a brief discussion of some possible use cases. I’d appreciate feedback, and I hope this work is of interest to the community.</p>\n<h2><a name=\"p-4947-technical-overview-2\" class=\"anchor\" href=\"#p-4947-technical-overview-2\"></a>Technical Overview</h2>\n<p>This implementation creates a new tapleaf version (0xc2) and gives consensus meaning to the annex when this leaf version is used:</p>\n<h3><a name=\"p-4947-composition-mechanism-3\" class=\"anchor\" href=\"#p-4947-composition-mechanism-3\"></a>Composition Mechanism</h3>\n<ul>\n<li>Multiple witness programs can be executed in sequence</li>\n<li>Each program has its own section of the witness stack, defined by explicit size elements</li>\n<li>Programs can be different witness versions (v1+) or script</li>\n<li>Resource limits (stack size, validation weight) are preserved and enforced across executions</li>\n<li>Signatures commit to the chain of tapleafs and annexes in the execution path to prevent witness malleability and replay attacks</li>\n<li>If the annex is absent, empty, or begins with 0x00, all elements on the stack must be consumed</li>\n</ul>\n<h3><a name=\"p-4947-delegation-mechanism-4\" class=\"anchor\" href=\"#p-4947-delegation-mechanism-4\"></a>Delegation Mechanism</h3>\n<ul>\n<li>Users can commit to additional spending conditions at signature-time using the annex</li>\n<li>Any valid composition of programs and script can be delegated to</li>\n<li>Delegation is indicated by an annex beginning with the tag 0x01</li>\n<li>Annexes starting with the tag 0x01 are forbidden unless signed to prevent witness malleability</li>\n<li>After delegated execution completes, all elements on the stack must be consumed</li>\n</ul>\n<h2><a name=\"p-4947-technical-deep-dive-5\" class=\"anchor\" href=\"#p-4947-technical-deep-dive-5\"></a>Technical Deep Dive</h2>\n<h3><a name=\"p-4947-composition-6\" class=\"anchor\" href=\"#p-4947-composition-6\"></a>Composition</h3>\n<p>A composed program consists of multiple subprograms that execute in sequence. Each subprogram operates on its own portion of the witness stack, defined by a size element that indicates how many witness elements belong to the program.</p>\n<p>The witness stack for a composed program looks like:</p>\n<pre><code class=\"lang-auto\">[program1 witness elements]\n[program2 witness elements]\n...\n[programN witness elements]\n[size element for programN]\n...\n[size element for program2]\n[size element for program1]\n[tapleaf]\n[control block]\n</code></pre>\n<p>Each size element encodes the number of stack items for its corresponding program and is at most two bytes. Execution begins with the first program and continues through each program in sequence.</p>\n<p>The tapleaf encodes the list of programs as <code>[witness version][program length][program]</code>. If the witness version is 0xc0, all subsequent bytes are interpreted as script. Witness version 0 is not allowed as it is not compatible with tapscript.</p>\n<p>Tapleaf Example 1 (a series of programs composed with script):</p>\n<pre><code class=\"lang-auto\">[program1 witness version]\n[program1 program length]\n[program1]\n…\n[programN witness version]\n[programN program length]\n[programN]\n[0xc0]\n[script]\n</code></pre>\n<p>Tapleaf Example 2 (a program composed of only script):</p>\n<pre><code class=\"lang-auto\">[0xc0]\n[script]\n</code></pre>\n<p>If the program is empty or the annex is absent, empty, or begins with 0x00, the stack must be empty post-execution for validation to succeed.</p>\n<h3><a name=\"p-4947-delegation-7\" class=\"anchor\" href=\"#p-4947-delegation-7\"></a>Delegation</h3>\n<p>Delegation is implemented via the annex. When a non-empty annex is present with the leaf version 0xc2 and the annex begins with the tag 0x01, the remainder of the annex is interpreted as a composed program to be executed after the primary program completes.</p>\n<p>The witness stack for delegation looks like:</p>\n<pre><code class=\"lang-auto\">[primary program witness elements]\n[delegated program witness elements]\n[size elements for delegated program]\n[size elements for primary program]\n[tapleaf]\n[control block]\n[annex] (0x01 [delegated composed witness program])\n</code></pre>\n<p>The primary program executes first according to the composition rules. If successful and a signed annex exists with the 0x01 tag, the remaining stack elements are passed to the delegated witness program. When delegated execution completes, the stack must be empty for validation to succeed.</p>\n<p>Annex tags 0x02+ are left as an upgrade path for future modes of delegation and uses of the annex.</p>\n<h3><a name=\"p-4947-resource-limitations-8\" class=\"anchor\" href=\"#p-4947-resource-limitations-8\"></a>Resource Limitations</h3>\n<p>The validation weight budget is tracked and decremented across all compositions and delegations, ensuring that programs cannot bypass global resource limits.</p>\n<p>Likewise, the global stack size limit is enforced by requiring both the total stack size and the <code>EvalScript</code> stack size to be at most <code>MAX_STACK_SIZE / 2</code> after a 0xc2 tapleaf is encountered. This conservatively ensures that the total stack size remains at most <code>MAX_STACK_SIZE</code>.</p>\n<h3><a name=\"p-4947-security-considerations-9\" class=\"anchor\" href=\"#p-4947-security-considerations-9\"></a>Security Considerations</h3>\n<p>Replay attacks and witness malleability are the primary security concerns. To prevent replay attacks, signatures commit to the full chain of tapleafs and annexes in the execution path. This provides protection in the event that there are multiple possible execution paths that the user may sign.</p>\n<p>In addition, to prevent witness malleability, execution fails if a delegating annex is not signed. The annex can be signed directly, or it can be signed by a child program, which must commit to the full chain of annexes in the execution path.</p>\n<h2><a name=\"p-4947-potential-benefits-10\" class=\"anchor\" href=\"#p-4947-potential-benefits-10\"></a>Potential Benefits</h2>\n<p>This proposal has several potential benefits, including:</p>\n<ol>\n<li><strong>Backward-compatibility</strong>: Works with existing P2TR addresses.</li>\n<li><strong>Enhanced composability</strong>: Enables “vault-of-vaults” and other complex spending policies, compatible with new witness programs adopted in the future (ex: P2QRH).</li>\n<li><strong>Generalized delegation</strong>: Allows users to authorize additional spending conditions at signature-time, delegating to any combination of addresses and script.</li>\n<li><strong>Re-delegation</strong>: Allows users to re-delegate to other users, adding additional restrictions to the structure of the final transaction.</li>\n<li><strong>Improved privacy and fungibility</strong>: Could increase P2TR adoption by encouraging users to adopt wallets and vaults that can be composed with and delegated to.</li>\n</ol>\n<p>Additional benefits may include:</p>\n<ol>\n<li><strong>Delegation-only opcodes</strong>: Creates framework to allow math and introspection opcodes (ex: <code>OP_CAT</code>) to be committed to in an annex but not in a scriptPubKey. Such opcodes could then be safely used during delegation without enabling AMMs or state-carrying recursive covenants.</li>\n<li><strong>Compatibility with future upgrades</strong>: Provides framework for future witness programs and uses of the annex.</li>\n</ol>\n<h2><a name=\"p-4947-use-cases-11\" class=\"anchor\" href=\"#p-4947-use-cases-11\"></a>Use Cases</h2>\n<h3><a name=\"p-4947-vault-of-vaults-12\" class=\"anchor\" href=\"#p-4947-vault-of-vaults-12\"></a>Vault-of-Vaults</h3>\n<p>Ex: Alice, Bob, and Carol create a 2-of-3 vault by combining their P2TR addresses, rather than their public keys. Each address corresponds to a personal vault that Alice, Bob, or Carol controls. This can be a single sig, a 2-of-3 multisig, a decaying multisig, or something more complex. Only two addresses must be satisfied in order to unlock the funds. If desired, additional spending paths can be added, such as a time-delayed backup, accessible by a single party.</p>\n<p>This vault-of-vaults is easy to audit and assemble, and parties can selectively reveal their spending paths to the other parties, or not reveal any except those that are used.</p>\n<h3><a name=\"p-4947-receiver-paid-payments-13\" class=\"anchor\" href=\"#p-4947-receiver-paid-payments-13\"></a>Receiver-Paid Payments</h3>\n<p>Ex: Alice pays Bob without committing to the fee rate of the transaction. Alice simply delegates a portion of her balance to Bob, sending herself the residual using SINGLE|ANYONECANPAY. Bob can then complete the transaction and choose the appropriate fee rate.</p>\n<p>This basic pattern could be used to support more complex payment flows in the future.</p>\n<h3><a name=\"p-4947-bitcoin-markets-14\" class=\"anchor\" href=\"#p-4947-bitcoin-markets-14\"></a>Bitcoin Markets</h3>\n<p>Ex: With a single signature, Bob can make an offer to sell a UTXO-linked asset from cold storage to one of many possible approved buyers, in exchange for bitcoin. Using timelocks, Bob could even give some buyers a right-of-first-refusal.</p>\n<p>Likewise, if an introspection opcode is enabled, Bob could offer bitcoin to many possible recipients, in exchange for some onchain or offchain asset tied to a UTXO. The ability to commit to a specific UTXO is important because it provides a built-in mechanism to cancel the offer, if the asset is transferred to someone else.</p>\n<h2><a name=\"p-4947-a-path-to-key-path-delegation-15\" class=\"anchor\" href=\"#p-4947-a-path-to-key-path-delegation-15\"></a>A Path to Key Path Delegation</h2>\n<p>Graftleaf lays the groundwork for delegation from script path <em>and</em> key path spends using the annex. Unfortunately, BIP341 Taproot does not appear to have an upgrade mechanism for key path spends, since a key path spend is only possible with a witness stack that has only one element after removing the (optional) annex. This can be resolved with a new witness program, but it would require a new address type, which history shows can take a long time for industry to adopt.</p>\n<h2><a name=\"p-4947-comparison-with-other-proposals-16\" class=\"anchor\" href=\"#p-4947-comparison-with-other-proposals-16\"></a>Comparison with Other Proposals</h2>\n<p>This proposal shares similarities with several other proposals:</p>\n<ul>\n<li><strong>Graftroot</strong>: Allows delegation but only from key path spends and only once</li>\n<li><strong>CSFS</strong>: Complementary feature for re-binding signatures to pre-committed scripts</li>\n<li><strong>G’root</strong>: Complementary feature that uses Pederson commitments to add script commitments to key path spends</li>\n<li><strong>Entroot</strong>: Combines ideas from Graftroot and G’root, replacing Pederson commitments with a hash-to-curve scheme, but only facilitates delegations from key path spends and compositions between a key path spend and script.</li>\n</ul>\n<p>Pieter Wuille’s Entroot is perhaps the closest cousin to this proposal. The primary difference is that this proposal enables:</p>\n<ol>\n<li>Script path delegation</li>\n<li>Delegation from a composition of programs and script</li>\n<li>Arbitrarily complex compositions on a single leaf</li>\n</ol>\n<p>In addition, this proposal does not require hash-to-curve or a new address type. The core composition and delegation logic is upgradeable and reusable, if new programs with hash-to-curve or key path delegation are added in the future.</p>\n<h2><a name=\"p-4947-concluding-thoughts-17\" class=\"anchor\" href=\"#p-4947-concluding-thoughts-17\"></a>Concluding Thoughts</h2>\n<p>I have taken care to consider possible edge cases and respect resource limitations, but if there is anything I have missed, I’d welcome the community’s feedback. Naturally, soft fork proposals are highly contentious, but I believe that generic composition and delegation is an important architectural problem for Bitcoin to solve, provided there’s a way to do so safely with acceptable tradeoffs.</p>\n<p>If there’s interest in a BIP, please let me know.</p>\n<p>*<em>Special thanks to Alex Lewin for reviewing early drafts of this post</em></p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 1,
  "updated_at": "2025-05-06T15:10:06.012Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 18,
  "reads": 23,
  "readers_count": 22,
  "score": 109.6,
  "yours": false,
  "topic_id": 1669,
  "topic_slug": "graftleaf-program-composition-and-generic-delegation",
  "topic_title": "Graftleaf: Program Composition and Generic Delegation",
  "topic_html_title": "Graftleaf: Program Composition and Generic Delegation",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "_TLDR: I'm exploring an idea to enable generalized program composition and coin delegation, which seems to strike a nice balance between simplicity and flexibility._\n\nI’ve been thinking recently about the optimal way to introduce delegation to Bitcoin. The idea of delegating one’s coins is not a new one. Some [speculate](https://bitcoinops.org/en/topics/op_codeseparator/) that `OP_CODESEPARATOR` was an early attempt by Satoshi to do delegation. More recently, proposals like [Graftroot](https://gnusha.org/pi/bitcoindev/CAAS2fgSnfd++94+40vnSRxQfi9fk8N6+2-DbjVpssHxFvYveFQ@mail.gmail.com/) and [Entroot](https://gist.github.com/sipa/ca1502f8465d0d5032d9dd2465f32603) have been put forward, which would enable delegation (and re-delegation), but only from key path spends and only to a locking script. In contrast, [CSFS](https://github.com/bitcoin/bips/blob/3365fb7a7e5e25b95b94d65808e32a02aa684aaa/bip-0348.md) would enable delegation from script path spends, but it's limited, as it only facilitates delegation within a pre-committed script.\n\nWhen considering delegation, what type of functionality is desirable? I’d argue that generalized delegation has two properties:\n1. Delegation _from any valid spending path_\n2. Delegation _to arbitrarily complex compositions of programs and script_\n\nThe latter is important so that users can delegate to _addresses_, and not just public keys, while retaining the ability to add timelocks and other conditions.\n\nIn order to build this, we need two key features: 1) \"Generalized Composition,\" and 2) \"Generalized Delegation.\" Generalized composition involves the conjunction of programs and script, and delegation is merely the addition of a second composition on-the-fly, if the primary one is satisfied.\n\nIs there a simple and safe way to implement generalized composition and delegation within Taproot? I think there is...\n\nI’d like to present a proof-of-concept that I came up with, which I'm calling \"Graftleaf.\"\n\n## Proposal: Graftleaf\n\nGraftleaf is a new Taproot leaf version (0xc2), which uses the annex to perform delegations. Graftleaf adds two significant capabilities:\n\n1. **Composition**: The ability to execute zero, one, or more witness programs in sequence, including a locking script.\n4. **Delegation**: The ability to add additional spending conditions at signature-time, which can comprise any combination of programs and script.\n\nThe core execution logic is fewer than 60 lines of code. You can find my implementation [here](https://github.com/joshdoman/bitcoin/pull/1). I’ve included a fairly large test suite, though there’s definitely room for improvement.\n\nBelow are some technical details on how it works. I wrap up with a more in-depth comparison versus existing proposals and a brief discussion of some possible use cases. I’d appreciate feedback, and I hope this work is of interest to the community.\n\n## Technical Overview\n\nThis implementation creates a new tapleaf version (0xc2) and gives consensus meaning to the annex when this leaf version is used:\n\n### Composition Mechanism\n\n- Multiple witness programs can be executed in sequence\n- Each program has its own section of the witness stack, defined by explicit size elements\n- Programs can be different witness versions (v1+) or script\n- Resource limits (stack size, validation weight) are preserved and enforced across executions\n- Signatures commit to the chain of tapleafs and annexes in the execution path to prevent witness malleability and replay attacks\n- If the annex is absent, empty, or begins with 0x00, all elements on the stack must be consumed\n\n### Delegation Mechanism\n\n- Users can commit to additional spending conditions at signature-time using the annex\n- Any valid composition of programs and script can be delegated to\n- Delegation is indicated by an annex beginning with the tag 0x01\n- Annexes starting with the tag 0x01 are forbidden unless signed to prevent witness malleability\n- After delegated execution completes, all elements on the stack must be consumed\n\n## Technical Deep Dive\n\n### Composition\n\nA composed program consists of multiple subprograms that execute in sequence. Each subprogram operates on its own portion of the witness stack, defined by a size element that indicates how many witness elements belong to the program.\n\nThe witness stack for a composed program looks like:\n\n```\n[program1 witness elements]\n[program2 witness elements]\n...\n[programN witness elements]\n[size element for programN]\n...\n[size element for program2]\n[size element for program1]\n[tapleaf]\n[control block]\n```\n\nEach size element encodes the number of stack items for its corresponding program and is at most two bytes. Execution begins with the first program and continues through each program in sequence.\n\nThe tapleaf encodes the list of programs as `[witness version][program length][program]`. If the witness version is 0xc0, all subsequent bytes are interpreted as script. Witness version 0 is not allowed as it is not compatible with tapscript.\n\nTapleaf Example 1 (a series of programs composed with script):\n\n```\n[program1 witness version]\n[program1 program length]\n[program1]\n…\n[programN witness version]\n[programN program length]\n[programN]\n[0xc0]\n[script]\n```\n\nTapleaf Example 2 (a program composed of only script):\n\n```\n[0xc0]\n[script]\n```\n\nIf the program is empty or the annex is absent, empty, or begins with 0x00, the stack must be empty post-execution for validation to succeed. \n\n### Delegation\n\nDelegation is implemented via the annex. When a non-empty annex is present with the leaf version 0xc2 and the annex begins with the tag 0x01, the remainder of the annex is interpreted as a composed program to be executed after the primary program completes.\n\nThe witness stack for delegation looks like:\n\n```\n[primary program witness elements]\n[delegated program witness elements]\n[size elements for delegated program]\n[size elements for primary program]\n[tapleaf]\n[control block]\n[annex] (0x01 [delegated composed witness program])\n```\n\nThe primary program executes first according to the composition rules. If successful and a signed annex exists with the 0x01 tag, the remaining stack elements are passed to the delegated witness program. When delegated execution completes, the stack must be empty for validation to succeed.\n\nAnnex tags 0x02+ are left as an upgrade path for future modes of delegation and uses of the annex.\n\n### Resource Limitations\n\nThe validation weight budget is tracked and decremented across all compositions and delegations, ensuring that programs cannot bypass global resource limits.\n\nLikewise, the global stack size limit is enforced by requiring both the total stack size and the `EvalScript` stack size to be at most `MAX_STACK_SIZE / 2` after a 0xc2 tapleaf is encountered. This conservatively ensures that the total stack size remains at most `MAX_STACK_SIZE`.\n\n### Security Considerations\n\nReplay attacks and witness malleability are the primary security concerns. To prevent replay attacks, signatures commit to the full chain of tapleafs and annexes in the execution path. This provides protection in the event that there are multiple possible execution paths that the user may sign.   \n\nIn addition, to prevent witness malleability, execution fails if a delegating annex is not signed. The annex can be signed directly, or it can be signed by a child program, which must commit to the full chain of annexes in the execution path.\n\n## Potential Benefits\n\nThis proposal has several potential benefits, including:\n\n1. **Backward-compatibility**: Works with existing P2TR addresses.\n2. **Enhanced composability**: Enables \"vault-of-vaults\" and other complex spending policies, compatible with new witness programs adopted in the future (ex: P2QRH).\n5. **Generalized delegation**: Allows users to authorize additional spending conditions at signature-time, delegating to any combination of addresses and script.\n6. **Re-delegation**: Allows users to re-delegate to other users, adding additional restrictions to the structure of the final transaction.\n7. **Improved privacy and fungibility**: Could increase P2TR adoption by encouraging users to adopt wallets and vaults that can be composed with and delegated to.\n\nAdditional benefits may include:\n\n1. **Delegation-only opcodes**: Creates framework to allow math and introspection opcodes (ex: `OP_CAT`) to be committed to in an annex but not in a scriptPubKey. Such opcodes could then be safely used during delegation without enabling AMMs or state-carrying recursive covenants.\n2. **Compatibility with future upgrades**: Provides framework for future witness programs and uses of the annex.\n\n## Use Cases\n\n### Vault-of-Vaults\nEx: Alice, Bob, and Carol create a 2-of-3 vault by combining their P2TR addresses, rather than their public keys. Each address corresponds to a personal vault that Alice, Bob, or Carol controls. This can be a single sig, a 2-of-3 multisig, a decaying multisig, or something more complex. Only two addresses must be satisfied in order to unlock the funds. If desired, additional spending paths can be added, such as a time-delayed backup, accessible by a single party.\n\nThis vault-of-vaults is easy to audit and assemble, and parties can selectively reveal their spending paths to the other parties, or not reveal any except those that are used.\n\n### Receiver-Paid Payments\nEx: Alice pays Bob without committing to the fee rate of the transaction. Alice simply delegates a portion of her balance to Bob, sending herself the residual using SINGLE|ANYONECANPAY. Bob can then complete the transaction and choose the appropriate fee rate.\n\nThis basic pattern could be used to support more complex payment flows in the future.\n\n### Bitcoin Markets\nEx: With a single signature, Bob can make an offer to sell a UTXO-linked asset from cold storage to one of many possible approved buyers, in exchange for bitcoin. Using timelocks, Bob could even give some buyers a right-of-first-refusal.\n\nLikewise, if an introspection opcode is enabled, Bob could offer bitcoin to many possible recipients, in exchange for some onchain or offchain asset tied to a UTXO. The ability to commit to a specific UTXO is important because it provides a built-in mechanism to cancel the offer, if the asset is transferred to someone else.\n\n## A Path to Key Path Delegation\n\nGraftleaf lays the groundwork for delegation from script path *and* key path spends using the annex. Unfortunately, BIP341 Taproot does not appear to have an upgrade mechanism for key path spends, since a key path spend is only possible with a witness stack that has only one element after removing the (optional) annex. This can be resolved with a new witness program, but it would require a new address type, which history shows can take a long time for industry to adopt.\n\n## Comparison with Other Proposals\n\nThis proposal shares similarities with several other proposals:\n\n- **Graftroot**: Allows delegation but only from key path spends and only once\n- **CSFS**: Complementary feature for re-binding signatures to pre-committed scripts\n- **G’root**: Complementary feature that uses Pederson commitments to add script commitments to key path spends\n- **Entroot**: Combines ideas from Graftroot and G’root, replacing Pederson commitments with a hash-to-curve scheme, but only facilitates delegations from key path spends and compositions between a key path spend and script.\n\nPieter Wuille’s Entroot is perhaps the closest cousin to this proposal. The primary difference is that this proposal enables:\n1. Script path delegation\n2. Delegation from a composition of programs and script\n3. Arbitrarily complex compositions on a single leaf\n\nIn addition, this proposal does not require hash-to-curve or a new address type. The core composition and delegation logic is upgradeable and reusable, if new programs with hash-to-curve or key path delegation are added in the future.\n\n## Concluding Thoughts\n\nI have taken care to consider possible edge cases and respect resource limitations, but if there is anything I have missed, I'd welcome the community's feedback. Naturally, soft fork proposals are highly contentious, but I believe that generic composition and delegation is an important architectural problem for Bitcoin to solve, provided there’s a way to do so safely with acceptable tradeoffs.\n\nIf there’s interest in a BIP, please let me know.\n\n**Special thanks to Alex Lewin for reviewing early drafts of this post*",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 98,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "TLDR: I’m exploring an idea to enable generalized program composition and coin delegation, which seems to strike a nice balance between simplicity and flexibility. \nI’ve been thinking recently about the optimal way to introduce delegation to Bitcoin. The idea of delegating one’s coins is not a new o&hellip;",
  "truncated": true,
  "post_url": "/t/graftleaf-program-composition-and-generic-delegation/1669/1",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}