{
  "id": 5049,
  "name": "",
  "username": "gmaxwell",
  "avatar_template": "/letter_avatar_proxy/v4/letter/g/fbc32d/{size}.png",
  "created_at": "2025-05-20T10:02:07.123Z",
  "cooked": "<p>There have been a lot of older proposals along the utxo commitment scheme lines, they generally run into the problem that maintaining a commitment over the UTXO set is so expensive that it destroys the savings.  Like great you made it 1/4 the size but now requires a factor log(n) more work to update… that’s not a big win.  And/Or they run into issues that the bottleneck for any particular user might be storage or it might be communication and making it cost log(n) work more to <em>spend</em> isn’t a win.</p>\n<p>But perhaps scoping this to outputs which are unlikely to be spent, even unlikely to be spendable, and making their spending cost just come out of their tx size (so no further resource inflation for nodes)--  actually solves both of those issues.</p>\n<p>Obviously anything with-confiscation is a non-flyer.  The principle is important to uphold, and the fact that you floated it at all might outright sabotage the potentially useful idea. <img src=\"https://delvingbitcoin.org/images/emoji/twitter/frowning.png?v=14\" title=\":frowning:\" class=\"emoji\" alt=\":frowning:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>I think there would also just be merit in setting a threshold value which no matter the age the output wouldn’t be pruned--  I believe this can probably be set so that all ‘real wallets’ are almost entirely above it while almost all outputs which are very unlikely to get spent (unless bitcoin increases in value a lot) are below it.  This would greatly increase the pool of users for which the change has no effect at all and might oppose it because they don’t want any change at all.</p>\n<p>If the rule against spending without a proof only applied to outputs in a range of heights, it would make it possible to adjust the thresholds both up and down with softforks.  Except for a value of <em>0</em> it’s arguable that even 1 satoshi may be valuable enough in the future that there is no sense in doing this because it very likely will get spent.  It’s a little less elegant, but the realpoltik of people being nervous about losing access to the coins they buried in the back yard (even though it likely wouldn’t be well founded) is worth keeping in mind.  If it can optimize almost as well while leaving more people alone that’s better.  And asking people to reason about the far future is just going to result in less agreement, e.g. given enough time some people 1 sat will buy a whole planet or something. <img src=\"https://delvingbitcoin.org/images/emoji/twitter/slight_smile.png?v=14\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Invocation of annex assumes a particular script type, but a lot of the dust stuff is varrious script types.  It’s arguable that this proof data should be “super-prunable” – after all it’s entirely redundant if you have the entire chain.  So e.g. it could cost weight like regular data but be in a separate witness that you could skip downloading when processing the entire chain (since if you’re processing the entire chain you could just construct it yourself).  At the very least it should be designed so that there are no degrees of freedom in the serialization so that even if it were in transactions it could be stripped and reconstructed to save sync bandwidth.</p>",
  "post_number": 12,
  "post_type": 1,
  "posts_count": 33,
  "updated_at": "2025-05-20T10:05:53.078Z",
  "reply_count": 3,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 4,
  "reads": 70,
  "readers_count": 69,
  "score": 79.0,
  "yours": false,
  "topic_id": 1707,
  "topic_slug": "dust-expiry-clean-the-utxo-set-from-spam",
  "topic_title": "Dust Expiry: Clean the UTXO set from spam",
  "topic_html_title": "Dust Expiry: Clean the UTXO set from spam",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "There have been a lot of older proposals along the utxo commitment scheme lines, they generally run into the problem that maintaining a commitment over the UTXO set is so expensive that it destroys the savings.  Like great you made it 1/4 the size but now requires a factor log(n) more work to update... that's not a big win.  And/Or they run into issues that the bottleneck for any particular user might be storage or it might be communication and making it cost log(n) work more to *spend* isn't a win.\n\nBut perhaps scoping this to outputs which are unlikely to be spent, even unlikely to be spendable, and making their spending cost just come out of their tx size (so no further resource inflation for nodes)--  actually solves both of those issues.\n\nObviously anything with-confiscation is a non-flyer.  The principle is important to uphold, and the fact that you floated it at all might outright sabotage the potentially useful idea. :( \n\nI think there would also just be merit in setting a threshold value which no matter the age the output wouldn't be pruned--  I believe this can probably be set so that all 'real wallets' are almost entirely above it while almost all outputs which are very unlikely to get spent (unless bitcoin increases in value a lot) are below it.  This would greatly increase the pool of users for which the change has no effect at all and might oppose it because they don't want any change at all.\n\nIf the rule against spending without a proof only applied to outputs in a range of heights, it would make it possible to adjust the thresholds both up and down with softforks.  Except for a value of _0_ it's arguable that even 1 satoshi may be valuable enough in the future that there is no sense in doing this because it very likely will get spent.  It's a little less elegant, but the realpoltik of people being nervous about losing access to the coins they buried in the back yard (even though it likely wouldn't be well founded) is worth keeping in mind.  If it can optimize almost as well while leaving more people alone that's better.  And asking people to reason about the far future is just going to result in less agreement, e.g. given enough time some people 1 sat will buy a whole planet or something. :)\n\nInvocation of annex assumes a particular script type, but a lot of the dust stuff is varrious script types.  It's arguable that this proof data should be \"super-prunable\" -- after all it's entirely redundant if you have the entire chain.  So e.g. it could cost weight like regular data but be in a separate witness that you could skip downloading when processing the entire chain (since if you're processing the entire chain you could just construct it yourself).  At the very least it should be designed so that there are no degrees of freedom in the serialization so that even if it were in transactions it could be stripped and reconstructed to save sync bandwidth.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 699,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "There have been a lot of older proposals along the utxo commitment scheme lines, they generally run into the problem that maintaining a commitment over the UTXO set is so expensive that it destroys the savings.  Like great you made it 1/4 the size but now requires a factor log(n) more work to update&hellip;",
  "truncated": true,
  "post_url": "/t/dust-expiry-clean-the-utxo-set-from-spam/1707/12",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}