{
  "id": 5064,
  "name": "",
  "username": "gmaxwell",
  "avatar_template": "/letter_avatar_proxy/v4/letter/g/fbc32d/{size}.png",
  "created_at": "2025-05-21T00:06:32.547Z",
  "cooked": "<p>I agree. Today I greatly regret ever introducing the term covenant and starting the discussion with examples of misuses-- I thought keeping them silly would help keep the context of “just don’t do this”, but sadly the idea was stripped from the original context and used abusively.  I think the concept is now far more often abused to deceptively fearmonger than it is used to improve our understanding.</p>\n<p>The fact that abuse can be done is a reason to reject abuse, not reject freedom.  There are a half dozen ways in which the consensus rules almost allow arbitrary programmatic covenants ‘by accident’ and almost any meaningful flexibility inherently does so-- to avoid it requires an absolute straight jacket.</p>\n<p>And there is no reason to do so because the ‘evil’ usage can just be accomplished through plain multisig (or an undetectable threshold signature).   The evil actor is not meaningfully emboldened by the modest uptime improvements that a more autonomous system would provide, particularly since the covenity way of doing things comes with a <em>massive</em> increase in transaction costs.  While in non-coercive usage transaction cost inflation can usually be avoided by consensual key path joint signatures.</p>\n<p>There is a flip side to this point however:  The productive use of covenants can also almost always be accomplished with some compromise via multisig.  There are reasons that it’s not quite symmetrical (evil overlord loses only some uptime guarantees with multisig, while honest covenant user takes an addition security risks)  but I do think it’s fair to say that any proposal for increased functionality which could be emulated with some kind of multisig oracle but isn’t should explain why the public should believe that their application is so important and yet no one is doing it via emulation.</p>\n<p>It’s important because the utility and efficiency of the constructs can only be optimized if they match usage, which would be so much easier if the usage were real and concrete rather than speculative.  Particularly in that some of the speculative usage just amounts to “I want to mint and trade shitcoins on Bitcoin which will compete in the market with the value of Bitcoin”.  … Not exactly a great selling point to Bitcoin users.  Absence of reasonable sounding concrete usage encourages people to fixate on the speculative uses they find less reasonable.</p>",
  "post_number": 2,
  "post_type": 1,
  "posts_count": 12,
  "updated_at": "2025-05-21T00:06:44.757Z",
  "reply_count": 3,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 33,
  "reads": 42,
  "readers_count": 41,
  "score": 218.2,
  "yours": false,
  "topic_id": 1703,
  "topic_slug": "on-the-possibility-of-evil-covenants-and-implications-for-soft-fork-proposals",
  "topic_title": "On the possibility of evil covenants and implications for soft fork proposals",
  "topic_html_title": "On the possibility of evil covenants and implications for soft fork proposals",
  "category_id": 5,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I agree. Today I greatly regret ever introducing the term covenant and starting the discussion with examples of misuses-- I thought keeping them silly would help keep the context of \"just don't do this\", but sadly the idea was stripped from the original context and used abusively.  I think the concept is now far more often abused to deceptively fearmonger than it is used to improve our understanding.\n\nThe fact that abuse can be done is a reason to reject abuse, not reject freedom.  There are a half dozen ways in which the consensus rules almost allow arbitrary programmatic covenants 'by accident' and almost any meaningful flexibility inherently does so-- to avoid it requires an absolute straight jacket.\n\nAnd there is no reason to do so because the 'evil' usage can just be accomplished through plain multisig (or an undetectable threshold signature).   The evil actor is not meaningfully emboldened by the modest uptime improvements that a more autonomous system would provide, particularly since the covenity way of doing things comes with a *massive* increase in transaction costs.  While in non-coercive usage transaction cost inflation can usually be avoided by consensual key path joint signatures.\n\nThere is a flip side to this point however:  The productive use of covenants can also almost always be accomplished with some compromise via multisig.  There are reasons that it's not quite symmetrical (evil overlord loses only some uptime guarantees with multisig, while honest covenant user takes an addition security risks)  but I do think it's fair to say that any proposal for increased functionality which could be emulated with some kind of multisig oracle but isn't should explain why the public should believe that their application is so important and yet no one is doing it via emulation.\n\nIt's important because the utility and efficiency of the constructs can only be optimized if they match usage, which would be so much easier if the usage were real and concrete rather than speculative.  Particularly in that some of the speculative usage just amounts to \"I want to mint and trade shitcoins on Bitcoin which will compete in the market with the value of Bitcoin\".  ... Not exactly a great selling point to Bitcoin users.  Absence of reasonable sounding concrete usage encourages people to fixate on the speculative uses they find less reasonable.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 699,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "I agree. Today I greatly regret ever introducing the term covenant and starting the discussion with examples of misuses-- I thought keeping them silly would help keep the context of “just don’t do this”, but sadly the idea was stripped from the original context and used abusively.  I think the conce&hellip;",
  "truncated": true,
  "post_url": "/t/on-the-possibility-of-evil-covenants-and-implications-for-soft-fork-proposals/1703/2",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}