{
  "id": 5080,
  "name": "szarka",
  "username": "szarka",
  "avatar_template": "/letter_avatar_proxy/v4/letter/s/34f0e0/{size}.png",
  "created_at": "2025-05-21T23:54:02.043Z",
  "cooked": "<p>Thanks for comment, Greg. I’m not quite sure who you have in mind when you refer to a “dishonest smear”, but that’s certainly not <em>my</em> intention here! When I say that this feature is forgotten or unknown, I’m specifically referring to (1) the too-many folks who have said things like “if a transaction is rejected by policy it is dropped on the floor” in the context of the recent OP_RETURN drama and (2) my fellow noderunners, many of whom would benefit from increasing it from its default size. The mempool gets all the love; nobody ever talks about humble vExtra, quietly doing yeoman’s work in the background. <img src=\"https://delvingbitcoin.org/images/emoji/twitter/wink.png?v=14\" title=\":wink:\" class=\"emoji\" alt=\":wink:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>As you say, this technique does little when mempools are homogenous. But, in a world where an increasing number of nodes are customizing policies with clients like Knots and Libre Relay, and more miners are generating their own block templates, it seems more relevant—and increasingly so in the future, if <code>datacarriersize</code> is uncapped by default in Core but many noderunners choose a different value.</p>\n<p>Whether the tradeoff in terms of increased RAM and CPU is worthwhile is something only an individual noderunner can answer, of course. But a whole lot of folks are spinning up new nodes (and, often, mining) at home, where they may have relatively performant hardware (I was testing on servers with 4 cores and 16 GB RAM, which is hardly state-of-the-art) but poor connectivity. Even the non-filtering node in my test pulled 6% of its transactions out of vExtra, so that seems like a pretty big win! It <em>did</em> extrapool them (mostly for non-filtering reasons) because it <em>did</em> see them.</p>",
  "post_number": 3,
  "post_type": 1,
  "posts_count": 6,
  "updated_at": "2025-05-21T23:54:02.043Z",
  "reply_count": 1,
  "reply_to_post_number": 2,
  "quote_count": 0,
  "incoming_link_count": 2,
  "reads": 25,
  "readers_count": 24,
  "score": 20.0,
  "yours": false,
  "topic_id": 1716,
  "topic_slug": "vextratxnforcompact-considered-useful",
  "topic_title": "vExtraTxnForCompact Considered Useful",
  "topic_html_title": "vExtraTxnForCompact Considered Useful",
  "category_id": 7,
  "display_username": "szarka",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 699,
    "username": "gmaxwell",
    "name": "",
    "avatar_template": "/letter_avatar_proxy/v4/letter/g/fbc32d/{size}.png"
  },
  "bookmarked": false,
  "raw": "Thanks for comment, Greg. I'm not quite sure who you have in mind when you refer to a \"dishonest smear\", but that's certainly not _my_ intention here! When I say that this feature is forgotten or unknown, I'm specifically referring to (1) the too-many folks who have said things like \"if a transaction is rejected by policy it is dropped on the floor\" in the context of the recent OP_RETURN drama and (2) my fellow noderunners, many of whom would benefit from increasing it from its default size. The mempool gets all the love; nobody ever talks about humble vExtra, quietly doing yeoman's work in the background. ;)\n\nAs you say, this technique does little when mempools are homogenous. But, in a world where an increasing number of nodes are customizing policies with clients like Knots and Libre Relay, and more miners are generating their own block templates, it seems more relevant---and increasingly so in the future, if `datacarriersize` is uncapped by default in Core but many noderunners choose a different value.\n\nWhether the tradeoff in terms of increased RAM and CPU is worthwhile is something only an individual noderunner can answer, of course. But a whole lot of folks are spinning up new nodes (and, often, mining) at home, where they may have relatively performant hardware (I was testing on servers with 4 cores and 16 GB RAM, which is hardly state-of-the-art) but poor connectivity. Even the non-filtering node in my test pulled 6% of its transactions out of vExtra, so that seems like a pretty big win! It *did* extrapool them (mostly for non-filtering reasons) because it *did* see them.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 798,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Thanks for comment, Greg. I’m not quite sure who you have in mind when you refer to a “dishonest smear”, but that’s certainly not my intention here! When I say that this feature is forgotten or unknown, I’m specifically referring to (1) the too-many folks who have said things like “if a transaction &hellip;",
  "truncated": true,
  "post_url": "/t/vextratxnforcompact-considered-useful/1716/3",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}