{
  "id": 5155,
  "name": "Adam Gibson",
  "username": "AdamISZ",
  "avatar_template": "/user_avatar/delvingbitcoin.org/adamisz/{size}/418_2.png",
  "created_at": "2025-05-29T14:01:00.675Z",
  "cooked": "<p>About this section of the Conclusion:</p>\n<blockquote>\n<p>We propose that Bitcoin’s quantum resistance strategy for action adopts a dual-track\napproach: contingency measures delivering minimal but functional protection against CRQCs\ncompleted in ~2 years, and a comprehensive path allowing thorough exploration of the\nproblem space and the development of a full-featured approach to take ~7 years</p>\n</blockquote>\n<p>So based on Section 8, I think I understood what you mean by “contingency measures here”; I <em>think</em> you mean deployment of any/some PQC based script type, i.e. making it available for use. Am I right? While I see the logic in putting that as a “first step”, somehow it feels like the wrong way round; that part is the most difficult to come to a decision on, even if it would be the most useful to have upfront.</p>\n<p>My gut feeling was also that we need 2 phases, but I had a different thing in mind - that the first phase would be (a) not a protocol, but a community step: migration to non-reused addresses so as to be in the “only short-term attack vulnerable” portion (also not sharing xpubs which should never happen anyway!), and using script-path taproot where possible, and then (b) a deployment of some CDR protocol variant, <em>even in the absence of consensus on a PQC sig scheme</em>. Then over a longer period, actual PQC schemes could be deployed.</p>\n<p>I realize that seems illogical, maybe it is, but I am more thinking about what could actually happen, than what I think should happen in an ideal world. Maybe I’m wrong but I expect consensus on adding PQC to Bitcoin is going to be <em>extremely</em> slow - unless the threat becomes very obvious indeed.</p>",
  "post_number": 3,
  "post_type": 1,
  "posts_count": 7,
  "updated_at": "2025-05-29T14:01:00.675Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 45,
  "readers_count": 44,
  "score": 14.0,
  "yours": false,
  "topic_id": 1730,
  "topic_slug": "bitcoin-and-quantum-computing",
  "topic_title": "Bitcoin and Quantum Computing",
  "topic_html_title": "Bitcoin and Quantum Computing",
  "category_id": 7,
  "display_username": "Adam Gibson",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "About this section of the Conclusion:\n\n> We propose that Bitcoin's quantum resistance strategy for action adopts a dual-track\napproach: contingency measures delivering minimal but functional protection against CRQCs\ncompleted in ~2 years, and a comprehensive path allowing thorough exploration of the\nproblem space and the development of a full-featured approach to take ~7 years\n\nSo based on Section 8, I think I understood what you mean by \"contingency measures here\"; I *think* you mean deployment of any/some PQC based script type, i.e. making it available for use. Am I right? While I see the logic in putting that as a \"first step\", somehow it feels like the wrong way round; that part is the most difficult to come to a decision on, even if it would be the most useful to have upfront.\n\nMy gut feeling was also that we need 2 phases, but I had a different thing in mind - that the first phase would be (a) not a protocol, but a community step: migration to non-reused addresses so as to be in the \"only short-term attack vulnerable\" portion (also not sharing xpubs which should never happen anyway!), and using script-path taproot where possible, and then (b) a deployment of some CDR protocol variant, *even in the absence of consensus on a PQC sig scheme*. Then over a longer period, actual PQC schemes could be deployed.\n\nI realize that seems illogical, maybe it is, but I am more thinking about what could actually happen, than what I think should happen in an ideal world. Maybe I'm wrong but I expect consensus on adding PQC to Bitcoin is going to be *extremely* slow - unless the threat becomes very obvious indeed.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 343,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "About this section of the Conclusion: \n\nWe propose that Bitcoin’s quantum resistance strategy for action adopts a dual-track\napproach: contingency measures delivering minimal but functional protection against CRQCs\ncompleted in ~2 years, and a comprehensive path allowing thorough exploration of the\n&hellip;",
  "truncated": true,
  "post_url": "/t/bitcoin-and-quantum-computing/1730/3",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}