{
  "id": 5050,
  "name": "",
  "username": "gmaxwell",
  "avatar_template": "/letter_avatar_proxy/v4/letter/g/fbc32d/{size}.png",
  "created_at": "2025-05-20T10:47:09.437Z",
  "cooked": "<blockquote>\n<p>I am not saying that this is what core is saying (and after more digging I got that it is not)</p>\n</blockquote>\n<p>Indeed, it’s not.  And I think moreover no one who has been carefully following or talking to the involved people could claim that it is.  And so basically these are just lies that has been deployed to manipulate the public and sell them on a narrative.  So I’m not really sure what any of the Bitcoin Developers are to do about it?</p>\n<p>Like I said to someone on reddit who complained that core had an “image problem” that, sure if someone goes around and says you beat your spouse you now have an “image problem”, but it’s often not one you can do much about.  Putting up a sign that says “Certainly not a spouse beater” doesn’t help. And going on the attack against the dishonest troll that originated the lies hardly helps when the other half of their narrative is that they’re just a poor victim being repressed.</p>\n<p>Nowhere in the discussion will you find a bitcoin core developer saying “your opinion is worthless because you’re not a developer” – they will respond to specific technical inaccuracies with technical corrections, sure.  But by contrast you constantly see broad dismissal of developers as some kind of mere technicians (or suggesting that some people have PHDs that they can’t understand the real world) as if they can’t be expert Bitcoin maximalists and also competent with software.  Sure there are myopic people that only do one thing, but generally competence is correlated and people that are excellent in one area are often pretty good in others too.  I fully expect anyone commenting on this issue will be able to have useful thoughts on any part of it.</p>\n<p>In my 15-ish year experience it seems to be a truism in Bitcoin is that the people who are most loudly yelling about their values are the people who are using them for marketing, rather than the people who believe in them most strongly.  I think a lot of the long time developers would put many of those supposed “monetary maxis” to shame by any number of metrics-- including the fact that they could have chosen to gain unfathomable additional wealth by producing scamcoins <em>and didn’t</em>.  Let me know when you find a monetary maxi influencer that has had a hit put out on them because of defending their views on Bitcoin or spend years of their life defending a billion dollar lawsuit trying to undermine Bitcoin’s monetary policy.</p>\n<p>In my view when actually believe in something you just don’t need to crow about it <em>all</em> the time.</p>\n<p>Following the person who yells the loudest is how people fall for conmen, 'cause <em>anyone</em> can yell and it’s a lot easier to say what people want to hear when you don’t care if you mean what you say or don’t care if its true.</p>\n<p>(I’m not accusing any particular people in this of being conmen, yet, but I have to say the plainly false claims that any of the core folks support that “merely a database” view is a bad sign)</p>\n<p>If you found this view unhelpful – sorry! But with no examples of the dismissive response means I don’t know how to be anything but meta-dismissive. <img src=\"https://delvingbitcoin.org/images/emoji/twitter/frowning.png?v=14\" title=\":frowning:\" class=\"emoji\" alt=\":frowning:\" loading=\"lazy\" width=\"20\" height=\"20\">  To the extent that problems have been created because  some have inaccurately portrayed Bitcoin Core the parties responsible are the ones with the inaccuracies.</p>\n<p>You are probably more able to correct that wrong than anyone perceived as associated with the project because at least you wouldn’t justify more of the oppression narrative.  All of Bitcoin is the responsibility of everyone who cares about Bitcoin.</p>\n<blockquote>\n<p>Do you guys have an avenue to gather users concerns?</p>\n</blockquote>\n<p>I’m not a bitcoin developer (not for many years),  but many of the developers involved in the discussion-- including the authors of both pull requests, the person who initiated the discussion, multiple project maintainers-- have been in the public discussion on here, reddit, stacker, bitcointalk, X… I’ve seen them get little to no response to their messages, and I can say that I’ve received practically none with the net effect that the considerable time I’ve spend feels like a substantial waste of time.</p>\n<p>[Aside, thank you for ending my seventeen day wait here, I only wish you were also the original poster! <img src=\"https://delvingbitcoin.org/images/emoji/twitter/stuck_out_tongue.png?v=14\" title=\":stuck_out_tongue:\" class=\"emoji\" alt=\":stuck_out_tongue:\" loading=\"lazy\" width=\"20\" height=\"20\"> ]</p>",
  "post_number": 8,
  "post_type": 1,
  "posts_count": 6,
  "updated_at": "2025-05-20T10:57:10.896Z",
  "reply_count": 1,
  "reply_to_post_number": 7,
  "quote_count": 0,
  "incoming_link_count": 1,
  "reads": 30,
  "readers_count": 29,
  "score": 46.0,
  "yours": false,
  "topic_id": 1650,
  "topic_slug": "behind-the-op-return-drama",
  "topic_title": "Behind the OP_RETURN Drama",
  "topic_html_title": "Behind the OP_RETURN Drama",
  "category_id": 5,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 792,
    "username": "FernandoTheKoala",
    "name": "",
    "avatar_template": "/letter_avatar_proxy/v4/letter/f/71c47a/{size}.png"
  },
  "bookmarked": false,
  "raw": "> I am not saying that this is what core is saying (and after more digging I got that it is not)\n\nIndeed, it's not.  And I think moreover no one who has been carefully following or talking to the involved people could claim that it is.  And so basically these are just lies that has been deployed to manipulate the public and sell them on a narrative.  So I'm not really sure what any of the Bitcoin Developers are to do about it?\n\nLike I said to someone on reddit who complained that core had an \"image problem\" that, sure if someone goes around and says you beat your spouse you now have an \"image problem\", but it's often not one you can do much about.  Putting up a sign that says \"Certainly not a spouse beater\" doesn't help. And going on the attack against the dishonest troll that originated the lies hardly helps when the other half of their narrative is that they're just a poor victim being repressed. \n\nNowhere in the discussion will you find a bitcoin core developer saying \"your opinion is worthless because you're not a developer\" -- they will respond to specific technical inaccuracies with technical corrections, sure.  But by contrast you constantly see broad dismissal of developers as some kind of mere technicians (or suggesting that some people have PHDs that they can't understand the real world) as if they can't be expert Bitcoin maximalists and also competent with software.  Sure there are myopic people that only do one thing, but generally competence is correlated and people that are excellent in one area are often pretty good in others too.  I fully expect anyone commenting on this issue will be able to have useful thoughts on any part of it.\n\nIn my 15-ish year experience it seems to be a truism in Bitcoin is that the people who are most loudly yelling about their values are the people who are using them for marketing, rather than the people who believe in them most strongly.  I think a lot of the long time developers would put many of those supposed \"monetary maxis\" to shame by any number of metrics-- including the fact that they could have chosen to gain unfathomable additional wealth by producing scamcoins *and didn't*.  Let me know when you find a monetary maxi influencer that has had a hit put out on them because of defending their views on Bitcoin or spend years of their life defending a billion dollar lawsuit trying to undermine Bitcoin's monetary policy.  \n\nIn my view when actually believe in something you just don't need to crow about it *all* the time.\n\nFollowing the person who yells the loudest is how people fall for conmen, 'cause *anyone* can yell and it's a lot easier to say what people want to hear when you don't care if you mean what you say or don't care if its true.\n\n(I'm not accusing any particular people in this of being conmen, yet, but I have to say the plainly false claims that any of the core folks support that \"merely a database\" view is a bad sign)\n\nIf you found this view unhelpful -- sorry! But with no examples of the dismissive response means I don't know how to be anything but meta-dismissive. :frowning:  To the extent that problems have been created because  some have inaccurately portrayed Bitcoin Core the parties responsible are the ones with the inaccuracies.\n\nYou are probably more able to correct that wrong than anyone perceived as associated with the project because at least you wouldn't justify more of the oppression narrative.  All of Bitcoin is the responsibility of everyone who cares about Bitcoin.\n\n> Do you guys have an avenue to gather users concerns?\n\nI'm not a bitcoin developer (not for many years),  but many of the developers involved in the discussion-- including the authors of both pull requests, the person who initiated the discussion, multiple project maintainers-- have been in the public discussion on here, reddit, stacker, bitcointalk, X... I've seen them get little to no response to their messages, and I can say that I've received practically none with the net effect that the considerable time I've spend feels like a substantial waste of time.\n\n[Aside, thank you for ending my seventeen day wait here, I only wish you were also the original poster! :P ]",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 699,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "I am not saying that this is what core is saying (and after more digging I got that it is not) \n\nIndeed, it’s not.  And I think moreover no one who has been carefully following or talking to the involved people could claim that it is.  And so basically these are just lies that has been deployed to &hellip;",
  "truncated": true,
  "post_url": "/t/behind-the-op-return-drama/1650/8",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}