{
  "id": 5048,
  "name": "",
  "username": "FernandoTheKoala",
  "avatar_template": "/letter_avatar_proxy/v4/letter/f/71c47a/{size}.png",
  "created_at": "2025-05-20T09:14:12.813Z",
  "cooked": "<p>Hello, just a node runner everyday dude who is a btc educator in his local community. Maybe I can provide some outiside perspective from normie_user_land here:</p>\n<aside class=\"quote no-group\" data-username=\"vostrnad\" data-post=\"3\" data-topic=\"1650\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/vostrnad/48/422_2.png\" class=\"avatar\"> vostrnad:</div>\n<blockquote>\n<p>I don’t see a lack of communication avenues between users and developers. We have the mailing list, GitHub issues and even the pull request comments for constructive criticisms of proposed changes (not brigading and repeating already addressed arguments).</p>\n</blockquote>\n</aside>\n<p>I agree that there is no lack of communication avenues between users and devs, but the issues might be:</p>\n<ol>\n<li>\n<p>the narrow scope in the way the communication is carried out: devs seems to wanna talk almost exclusively about purely technical aspects, while users want to incorporate other aspects in the discussion. Don’t get me wrong, as already stated users’ feeling should not dictate the direction of bitcoin, and the technical is where it’s at, but I think it is important to address users’ concers in a way that makes them feel heard and is engaging to them (and technical is not engaging neither sufficient for them).\nNow btc has spread (and will spread more and more) to an audience that is little technical, and finding an effective way to comunicate with this audience will become more and more necessary to avoid situation like this whole op_return. With btc growth, the overwhelming majority of node operators will be non devs, and it might be beneficial to take this into account for communication approaches.</p>\n</li>\n<li>\n<p>While it is true that there are plenty of communication avenues, the info might be too scattered. Let’s take this op_return case at hand. As a normie I was very confused by what was going on here, and initially I was persuaded by the “knots ppl”. To REALLY understand core reasons and come around it took me more than 20 hours of reading and listening from many sources (stacker news, github, mailing list, pull request comments, btc++ debate on youtube, podcast of Shinobi, convos on nostr). I don’t think a normal node runner would invest this kind of time to truly attempting to understand a debate, the goal should be to optimize for time and clarity. Here I have a suggestion in the final section “final thoughts”</p>\n</li>\n</ol>\n<aside class=\"quote no-group\" data-username=\"pandacute\" data-post=\"1\" data-topic=\"1650\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/p/47e85d/48.png\" class=\"avatar\"> pandacute:</div>\n<blockquote>\n<p>Right now, trust is pretty broken. It can be regained, but not without understanding what went wrong in the first place.</p>\n</blockquote>\n</aside>\n<p>vostrnad you say that trust has not been broken because 95% of network is choosing to run core. Your reply is from 2nd May, today 20th May Kore is at 8,5% of the network (and from what I read after this whole thing many ppl have ordered start9 and decided to run a node with knots, so the numbers should increase). While still irrelevant “in the big picture” I think this is undeniably a signal of loss of trust in core, when this % of ppl suddenly switch away from core it means something that deserves attention is going on. And instead of ignoring it, it can be taken as an oppurtinity to understand if maybe something has been done wrong and how to avoid it happening again in the future</p>\n<aside class=\"quote no-group\" data-username=\"vostrnad\" data-post=\"3\" data-topic=\"1650\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/vostrnad/48/422_2.png\" class=\"avatar\"> vostrnad:</div>\n<blockquote>\n<p>Conflict of interest doesn’t really matter here. If a change is proposed that would hurt Bitcoin at someone’s benefit, it can just as well be rejected on the basis of hurting Bitcoin alone. Changes can also be proposed pseudonymously, so there’s really no hope of policing conflicts of interest in the first place. Lastly, pull request comments are meant for reviewing the proposed changes, which is why the comment was hidden as off-topic.</p>\n</blockquote>\n</aside>\n<p>Maybe I see what I wanna see, but here I see exactly what I was talking about in my first point: looking at it only from a technical perspective when you say “…on the basis of hurting bitcoin alone”. Humans (and especially non devs) evaluate things not only from technical standpoint, and not taking this into consideration I fear will create more and more disconnetion between devs who sees things only through technical lens, and other non-devs who as “normal humans” look at things with a broader human lens (I mean, how can someone look at it and disregard the conflict of interest, and not taking into consideration from who it came from and the broader context in which it fits?). Please don’t get me wrong, I’m not suggesting to shift the primary focus from technical to broader, what I am suggesting is that non-technical things cannot be simply not ackowledged and put aside because they are non-technical and so irrelevant (I am afraid this approach will have the consequence of creating more distrust and unneccesary debates from the general node operators)</p>\n<aside class=\"quote no-group\" data-username=\"vostrnad\" data-post=\"3\" data-topic=\"1650\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/vostrnad/48/422_2.png\" class=\"avatar\"> vostrnad:</div>\n<blockquote>\n<p>No, they cannot. Devs only write the code, it is up to the users to choose to run it. Devs can decide to make any changes they want, but without users running their code they have no power.</p>\n</blockquote>\n</aside>\n<p>I think <a class=\"mention\" href=\"/u/pandacute\">@pandacute</a> is correct when he says it’s a “technocracy” in the sense that devs are the only one that can write code, users cannot write code, they can just react/adopt to it and express their questions/concers. I also don’t think it is a hepful statement to say “if you don’t like anymore what core is doing with the code just run another software”. Someone who ran core for years and so has given his trust to it, should be able to have his concerns listened to if there’s a change he is unsure of (rather than just silently leaving and run another software becuase he is not able to engage in a form of discussion which he can sustain).<br>\nIs this the kind of non-engagement we want? no discussion and just go somewhere else if you don’t like it anymore withouth being able to have a discussion all together?</p>\n<aside class=\"quote no-group\" data-username=\"gmaxwell\" data-post=\"5\" data-topic=\"1650\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/g/fbc32d/48.png\" class=\"avatar\"> gmaxwell:</div>\n<blockquote>\n<p>But don’t let me create yet another ‘dismissive’ response. You say here that this is a big change, why do you think it is? I think it is a very small change which should be of no interest to users generally.</p>\n</blockquote>\n</aside>\n<p>I believe it has been perceived as a big change from part of the community not because of the technical change itself, but because of the “signals” that core has sent with this PR. Below I summarize what has been perceived from outside in a “very raw way”:</p>\n<ul>\n<li>btc is not a money database, it’s a database for anything, let the market decides for itself</li>\n<li>there is no definition of spam, they are all valid transactions</li>\n<li>if you are not a dev you cannot understand, trust the experts</li>\n<li>as a node you are not free to decide what you can relay</li>\n<li>let’s focus on miners, not nodes</li>\n</ul>\n<p>I am not saying that this is what core is saying (and after more digging I got that it is not) but I can assure you that many people have perceived it this way from the outside. I don’t think the messages have been communicated in the most clear and effective way, and thus they have been misunderstood. As you have seen, the most vocal opposition is comprised of “btc monetary maxis”, they look at btc as freedom money and they are here for the revolution and they are very passionate (and I include myself here). I believe most have reacted the way they did because btc primarily as freedom money has been “not protected and seems to be not a given anymore”. After what happened I think you core have realized that are 2 things that really heated things up 1) taking away nodes capacity to set limit (perceived as taking freedom away); and 2) defining btc as database for whatever without underlining that the monetary purpose is still the priority and most fundamental aspect of btc.</p>\n<aside class=\"quote no-group\" data-username=\"gmaxwell\" data-post=\"5\" data-topic=\"1650\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/g/fbc32d/48.png\" class=\"avatar\"> gmaxwell:</div>\n<blockquote>\n<p>Please ask about them then!</p>\n</blockquote>\n</aside>\n<p>Do you guys have an avenue to gather users concerns? or you read and participate in the public discussions when an issue arises?</p>\n<p>Other final thoughts:</p>\n<p>You devs are amazing and the “unkind” statements that some users have directed at you are not  cool at all, but please look at them as an emotional reaction due to excessive passion for bitcoin as freedom money.\nYou guys should focus on the code because that is what you are amazing at, you should not have to spend so much time gathering users concerns and reading through posts to formulate a reply (this is all time taken away from working on code). I believe <a class=\"mention\" href=\"/u/antoinep\">@AntoineP</a> has done an amazing job at this, but maybe we could have achieved the same without you spending so much time on it.</p>\n<p>In conclusion:</p>\n<ol>\n<li>I am afraid more and more of these kind of debate will arise in the future, as future node operators will be less technical and more “generalist”, and might be necessary to consider a communication method that incorporate also non-technical aspects in a heavier manner to avoid future waste of time on both parts.</li>\n<li>Maybe core could have 2/3 ppl who are not devs but have a solid enough technical knowledge, which are mostly “expert communicators”: the role of these people would be to gather users concerns on various platforms, provide a single avenue to which direct users concers, elaborate them and summarise them to present to devs in a orderly fashion, being a bridge between “mostly technical devs” and “mostly moralists average people” and perhaps support explaining the technical aspects incorporating other aspects. Maybe in this way we can avoid wasting time on both sides and also have a more engaging discussion on both sides? I’d be happy to cover this role for free, and like me I’m sure many would be happy to contribute to the cause.</li>\n</ol>\n<p>Like many I am a simple man who just cares about btc as money and wants to help, I hope this external feedback can be useful to you guys.</p>\n<p>Respectfully, FernandoTheKoala</p>",
  "post_number": 7,
  "post_type": 1,
  "posts_count": 6,
  "updated_at": "2025-05-20T09:14:12.813Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 3,
  "incoming_link_count": 5,
  "reads": 35,
  "readers_count": 34,
  "score": 37.0,
  "yours": false,
  "topic_id": 1650,
  "topic_slug": "behind-the-op-return-drama",
  "topic_title": "Behind the OP_RETURN Drama",
  "topic_html_title": "Behind the OP_RETURN Drama",
  "category_id": 5,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Hello, just a node runner everyday dude who is a btc educator in his local community. Maybe I can provide some outiside perspective from normie_user_land here: \n\n[quote=\"vostrnad, post:3, topic:1650\"]\nI don’t see a lack of communication avenues between users and developers. We have the mailing list, GitHub issues and even the pull request comments for constructive criticisms of proposed changes (not brigading and repeating already addressed arguments).\n[/quote]\n\nI agree that there is no lack of communication avenues between users and devs, but the issues might be: \n\n1) the narrow scope in the way the communication is carried out: devs seems to wanna talk almost exclusively about purely technical aspects, while users want to incorporate other aspects in the discussion. Don't get me wrong, as already stated users' feeling should not dictate the direction of bitcoin, and the technical is where it's at, but I think it is important to address users' concers in a way that makes them feel heard and is engaging to them (and technical is not engaging neither sufficient for them). \nNow btc has spread (and will spread more and more) to an audience that is little technical, and finding an effective way to comunicate with this audience will become more and more necessary to avoid situation like this whole op_return. With btc growth, the overwhelming majority of node operators will be non devs, and it might be beneficial to take this into account for communication approaches.  \n\n2) While it is true that there are plenty of communication avenues, the info might be too scattered. Let's take this op_return case at hand. As a normie I was very confused by what was going on here, and initially I was persuaded by the \"knots ppl\". To REALLY understand core reasons and come around it took me more than 20 hours of reading and listening from many sources (stacker news, github, mailing list, pull request comments, btc++ debate on youtube, podcast of Shinobi, convos on nostr). I don't think a normal node runner would invest this kind of time to truly attempting to understand a debate, the goal should be to optimize for time and clarity. Here I have a suggestion in the final section \"final thoughts\"   \n\n[quote=\"pandacute, post:1, topic:1650\"]\nRight now, trust is pretty broken. It can be regained, but not without understanding what went wrong in the first place.\n[/quote]\n\nvostrnad you say that trust has not been broken because 95% of network is choosing to run core. Your reply is from 2nd May, today 20th May Kore is at 8,5% of the network (and from what I read after this whole thing many ppl have ordered start9 and decided to run a node with knots, so the numbers should increase). While still irrelevant \"in the big picture\" I think this is undeniably a signal of loss of trust in core, when this % of ppl suddenly switch away from core it means something that deserves attention is going on. And instead of ignoring it, it can be taken as an oppurtinity to understand if maybe something has been done wrong and how to avoid it happening again in the future  \n\n[quote=\"vostrnad, post:3, topic:1650\"]\nConflict of interest doesn’t really matter here. If a change is proposed that would hurt Bitcoin at someone’s benefit, it can just as well be rejected on the basis of hurting Bitcoin alone. Changes can also be proposed pseudonymously, so there’s really no hope of policing conflicts of interest in the first place. Lastly, pull request comments are meant for reviewing the proposed changes, which is why the comment was hidden as off-topic.\n[/quote]\n\nMaybe I see what I wanna see, but here I see exactly what I was talking about in my first point: looking at it only from a technical perspective when you say \"...on the basis of hurting bitcoin alone\". Humans (and especially non devs) evaluate things not only from technical standpoint, and not taking this into consideration I fear will create more and more disconnetion between devs who sees things only through technical lens, and other non-devs who as \"normal humans\" look at things with a broader human lens (I mean, how can someone look at it and disregard the conflict of interest, and not taking into consideration from who it came from and the broader context in which it fits?). Please don't get me wrong, I'm not suggesting to shift the primary focus from technical to broader, what I am suggesting is that non-technical things cannot be simply not ackowledged and put aside because they are non-technical and so irrelevant (I am afraid this approach will have the consequence of creating more distrust and unneccesary debates from the general node operators)   \n\n[quote=\"vostrnad, post:3, topic:1650\"]\nNo, they cannot. Devs only write the code, it is up to the users to choose to run it. Devs can decide to make any changes they want, but without users running their code they have no power.\n[/quote]\n\nI think @pandacute is correct when he says it's a \"technocracy\" in the sense that devs are the only one that can write code, users cannot write code, they can just react/adopt to it and express their questions/concers. I also don't think it is a hepful statement to say \"if you don't like anymore what core is doing with the code just run another software\". Someone who ran core for years and so has given his trust to it, should be able to have his concerns listened to if there's a change he is unsure of (rather than just silently leaving and run another software becuase he is not able to engage in a form of discussion which he can sustain).  \nIs this the kind of non-engagement we want? no discussion and just go somewhere else if you don't like it anymore withouth being able to have a discussion all together?\n\n[quote=\"gmaxwell, post:5, topic:1650\"]\nBut don’t let me create yet another ‘dismissive’ response. You say here that this is a big change, why do you think it is? I think it is a very small change which should be of no interest to users generally.\n[/quote]\n\n I believe it has been perceived as a big change from part of the community not because of the technical change itself, but because of the \"signals\" that core has sent with this PR. Below I summarize what has been perceived from outside in a \"very raw way\":\n- btc is not a money database, it's a database for anything, let the market decides for itself\n- there is no definition of spam, they are all valid transactions \n- if you are not a dev you cannot understand, trust the experts \n- as a node you are not free to decide what you can relay\n- let's focus on miners, not nodes \n\nI am not saying that this is what core is saying (and after more digging I got that it is not) but I can assure you that many people have perceived it this way from the outside. I don't think the messages have been communicated in the most clear and effective way, and thus they have been misunderstood. As you have seen, the most vocal opposition is comprised of \"btc monetary maxis\", they look at btc as freedom money and they are here for the revolution and they are very passionate (and I include myself here). I believe most have reacted the way they did because btc primarily as freedom money has been \"not protected and seems to be not a given anymore\". After what happened I think you core have realized that are 2 things that really heated things up 1) taking away nodes capacity to set limit (perceived as taking freedom away); and 2) defining btc as database for whatever without underlining that the monetary purpose is still the priority and most fundamental aspect of btc. \n\n[quote=\"gmaxwell, post:5, topic:1650\"]\nPlease ask about them then!\n[/quote]\n\nDo you guys have an avenue to gather users concerns? or you read and participate in the public discussions when an issue arises? \n\n\nOther final thoughts:\n\nYou devs are amazing and the \"unkind\" statements that some users have directed at you are not  cool at all, but please look at them as an emotional reaction due to excessive passion for bitcoin as freedom money. \nYou guys should focus on the code because that is what you are amazing at, you should not have to spend so much time gathering users concerns and reading through posts to formulate a reply (this is all time taken away from working on code). I believe @AntoineP has done an amazing job at this, but maybe we could have achieved the same without you spending so much time on it. \n\nIn conclusion: \n1) I am afraid more and more of these kind of debate will arise in the future, as future node operators will be less technical and more \"generalist\", and might be necessary to consider a communication method that incorporate also non-technical aspects in a heavier manner to avoid future waste of time on both parts. \n2) Maybe core could have 2/3 ppl who are not devs but have a solid enough technical knowledge, which are mostly \"expert communicators\": the role of these people would be to gather users concerns on various platforms, provide a single avenue to which direct users concers, elaborate them and summarise them to present to devs in a orderly fashion, being a bridge between \"mostly technical devs\" and \"mostly moralists average people\" and perhaps support explaining the technical aspects incorporating other aspects. Maybe in this way we can avoid wasting time on both sides and also have a more engaging discussion on both sides? I'd be happy to cover this role for free, and like me I'm sure many would be happy to contribute to the cause.  \n\nLike many I am a simple man who just cares about btc as money and wants to help, I hope this external feedback can be useful to you guys.  \n\nRespectfully, FernandoTheKoala",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 792,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Hello, just a node runner everyday dude who is a btc educator in his local community. Maybe I can provide some outiside perspective from normie_user_land here: \n\nI agree that there is no lack of communication avenues between users and devs, but the issues might be: \n\n\nthe narrow scope in the way the&hellip;",
  "truncated": true,
  "post_url": "/t/behind-the-op-return-drama/1650/7",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}