{
  "id": 5111,
  "name": "",
  "username": "FernandoTheKoala",
  "avatar_template": "/letter_avatar_proxy/v4/letter/f/71c47a/{size}.png",
  "created_at": "2025-05-24T13:52:55.614Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"gmaxwell\" data-post=\"8\" data-topic=\"1650\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/g/fbc32d/48.png\" class=\"avatar\"> gmaxwell:</div>\n<blockquote>\n<p>Indeed, it’s not. And I think moreover no one who has been carefully following or talking to the involved people could claim that it is. And so basically these are just lies that has been deployed to manipulate the public and sell them on a narrative. So I’m not really sure what any of the Bitcoin Developers are to do about it?</p>\n</blockquote>\n</aside>\n<p>I agree with you, I’m not suggesting to go on the attack of “dishonest troll”, the focus should not be on this. Rather I’m suggesting core to  focus on itself and the way it communicates with the public.\nI believe the message absorbed by some audience  is different than the message core intended to communicate (which resulted in 10% of network moving away from core) and we should ask ourselves how this happened. Maybe some public is too emotional/technical illiterate and is blindly persuaded by influencers? (sure, there’s always some of this). But I fear there is also a disconnection in the communication between devs-public besides the fact that the information is too scatterd to be directly and easily accessed by the average node-runner. Also, it almost feels like devs operate/think on a different level compared to the public, and it’s hard to find a meeting point where both parties can really understand each other.\nAgain, maybe this is just an empty worry of mine and it will not be an issue again, but I suspect more of these “disconnected” conversation devs-public might happen in the future unless something changes</p>\n<aside class=\"quote no-group\" data-username=\"gmaxwell\" data-post=\"8\" data-topic=\"1650\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/g/fbc32d/48.png\" class=\"avatar\"> gmaxwell:</div>\n<blockquote>\n<p>(I’m not accusing any particular people in this of being conmen, yet, but I have to say the plainly false claims that any of the core folks support that “merely a database” view is a bad sign)</p>\n</blockquote>\n</aside>\n<p>Myself (as a simple node runner) I did not get the idea that core was supporting btc as “merely a database”, but I also did not get the idea that core was prioritizing btc as “money database” (and this not because of influencers, but by watching btc++ debate myself and reading mailing-list and delvingbticoin).<br>\nI personally would have liked to see more discussion on pro/cons of change at consensus level to stop “spams”, and what are the frictions that have/are preventing this consensus change (since both parties don’t like spam on btc, why haven’t we revisited again this topic where both parties are aligned? it has been superficially mentioned many times but never really explored)</p>\n<p>Also, the message I absorbed from core is (and please any core dev correct me if I got it wrong): “look, filters don’t work and spam will get in the block anyway so keeping filters limit as they are is pretty useless (objectively true). If there’s demand and ppl pay for it miners will accept these tx for the fees because they chase profit (also objectively true). We already have a mining centralization issue, and leaving things as they are might creates even more mining centralization (objectively true). So let’s lift op_ret limit hoping they will use this avenue and stop using other avenues that are harmful to the network”. I think everything is not-up-for-debate until the last step. I’m not saying the last step is wrong, I’m just saying that it is not unquestionable like the other steps and perhaps deserved a more in depth explanation, in my head something like “given the situation either we change things at consensus level to get rid of spams altogether (but we already discussed about this and could not find consensus, let’s reopen the discussion if you want), then the second best thing is to lift op_return and see if we get ppl to use op_retur  and avoid greater mining centralization. Also, the majority is of the opinion that the best defense is not to “censor” this kind of tx but rather to let the market sort it out and hopefully contain them through fees in a way that it does not heavily prevent/impact financial tx. IF, and only IF, this change does result in the market pushing out finacial tx and making btc as money not usable, then rest assured we will intervene”.</p>\n<p>Regarding the last part maybe this is me as monetary-maxis who wants to be constantly reassured that core 1st priority is btc as money and all other use-case come later, and maybe this is me who wants to define btc as primarily money while we should all collectively decide what bitcoin is by letting the market sort itself out (honestly I’m still thinking about this), but I believe that explicitely and directly knowing how core stands in regard to this might not have created the confusion and antagonisation that we witnessed. I think many “knots” ppl simply wanted to know if  we are still aligned that money use is still 1st priority, and I think this was not unquestionably clear in the many discussions</p>\n<p>I’m aware that some of my impressions above are wrong, but nonetheless I shared them in the hope of better understanding where the disconnection of communication might have happened</p>\n<p>Respectfully, a well-meaning pleb</p>",
  "post_number": 9,
  "post_type": 1,
  "posts_count": 6,
  "updated_at": "2025-05-24T13:52:55.614Z",
  "reply_count": 0,
  "reply_to_post_number": 8,
  "quote_count": 1,
  "incoming_link_count": 3,
  "reads": 27,
  "readers_count": 26,
  "score": 20.4,
  "yours": false,
  "topic_id": 1650,
  "topic_slug": "behind-the-op-return-drama",
  "topic_title": "Behind the OP_RETURN Drama",
  "topic_html_title": "Behind the OP_RETURN Drama",
  "category_id": 5,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"gmaxwell, post:8, topic:1650\"]\nIndeed, it’s not. And I think moreover no one who has been carefully following or talking to the involved people could claim that it is. And so basically these are just lies that has been deployed to manipulate the public and sell them on a narrative. So I’m not really sure what any of the Bitcoin Developers are to do about it?\n[/quote]\n\nI agree with you, I'm not suggesting to go on the attack of \"dishonest troll\", the focus should not be on this. Rather I'm suggesting core to  focus on itself and the way it communicates with the public. \nI believe the message absorbed by some audience  is different than the message core intended to communicate (which resulted in 10% of network moving away from core) and we should ask ourselves how this happened. Maybe some public is too emotional/technical illiterate and is blindly persuaded by influencers? (sure, there's always some of this). But I fear there is also a disconnection in the communication between devs-public besides the fact that the information is too scatterd to be directly and easily accessed by the average node-runner. Also, it almost feels like devs operate/think on a different level compared to the public, and it's hard to find a meeting point where both parties can really understand each other. \nAgain, maybe this is just an empty worry of mine and it will not be an issue again, but I suspect more of these \"disconnected\" conversation devs-public might happen in the future unless something changes\n\n[quote=\"gmaxwell, post:8, topic:1650\"]\n(I’m not accusing any particular people in this of being conmen, yet, but I have to say the plainly false claims that any of the core folks support that “merely a database” view is a bad sign)\n[/quote]\n\nMyself (as a simple node runner) I did not get the idea that core was supporting btc as \"merely a database\", but I also did not get the idea that core was prioritizing btc as \"money database\" (and this not because of influencers, but by watching btc++ debate myself and reading mailing-list and delvingbticoin).  \nI personally would have liked to see more discussion on pro/cons of change at consensus level to stop \"spams\", and what are the frictions that have/are preventing this consensus change (since both parties don't like spam on btc, why haven't we revisited again this topic where both parties are aligned? it has been superficially mentioned many times but never really explored)  \n\nAlso, the message I absorbed from core is (and please any core dev correct me if I got it wrong): \"look, filters don't work and spam will get in the block anyway so keeping filters limit as they are is pretty useless (objectively true). If there's demand and ppl pay for it miners will accept these tx for the fees because they chase profit (also objectively true). We already have a mining centralization issue, and leaving things as they are might creates even more mining centralization (objectively true). So let's lift op_ret limit hoping they will use this avenue and stop using other avenues that are harmful to the network\". I think everything is not-up-for-debate until the last step. I'm not saying the last step is wrong, I'm just saying that it is not unquestionable like the other steps and perhaps deserved a more in depth explanation, in my head something like \"given the situation either we change things at consensus level to get rid of spams altogether (but we already discussed about this and could not find consensus, let's reopen the discussion if you want), then the second best thing is to lift op_return and see if we get ppl to use op_retur  and avoid greater mining centralization. Also, the majority is of the opinion that the best defense is not to \"censor\" this kind of tx but rather to let the market sort it out and hopefully contain them through fees in a way that it does not heavily prevent/impact financial tx. IF, and only IF, this change does result in the market pushing out finacial tx and making btc as money not usable, then rest assured we will intervene\". \n\nRegarding the last part maybe this is me as monetary-maxis who wants to be constantly reassured that core 1st priority is btc as money and all other use-case come later, and maybe this is me who wants to define btc as primarily money while we should all collectively decide what bitcoin is by letting the market sort itself out (honestly I'm still thinking about this), but I believe that explicitely and directly knowing how core stands in regard to this might not have created the confusion and antagonisation that we witnessed. I think many \"knots\" ppl simply wanted to know if  we are still aligned that money use is still 1st priority, and I think this was not unquestionably clear in the many discussions\n\nI'm aware that some of my impressions above are wrong, but nonetheless I shared them in the hope of better understanding where the disconnection of communication might have happened \n\nRespectfully, a well-meaning pleb",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 792,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "I agree with you, I’m not suggesting to go on the attack of “dishonest troll”, the focus should not be on this. Rather I’m suggesting core to  focus on itself and the way it communicates with the public.\nI believe the message absorbed by some audience  is different than the message core intended to&hellip;",
  "truncated": true,
  "post_url": "/t/behind-the-op-return-drama/1650/9",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}