{
  "id": 5128,
  "name": "",
  "username": "tnull",
  "avatar_template": "/user_avatar/delvingbitcoin.org/tnull/{size}/449_2.png",
  "created_at": "2025-05-27T09:59:49.927Z",
  "cooked": "<p>Thank you Carla for this great write-up of the discussion! I agree with your analysis in general, here are just a few points I want to add:</p>\n<ul>\n<li>Yes, adding forwarding delays could be perceived to be unaligned with forwarding nodes’ incentives, however, they already do this and also gain some efficiency and performance from batching HTLCs. Of course, there is a latency trade-off here, but generally it holds that the longer you wait, the higher are the chances that you can benefit from the reduced IO and network-latency overhead of batching HTLCs. IIUC, this would become even more relevant if we were to implement  <code>option_simplified_update</code> in the future.</li>\n<li>As always, “privacy loves company”. So requiring individual nodes who think they need additional privacy protections to add random delays might help with the particular on-path adversary model in mind, but it could actually have them stand out more in the general case. I.e., depending on the adversary it could even put a crosshair on their back, at least if it doesn’t become a best practice to add reasonable random delays before claiming (receiver-side) / retrying (sender-side) payments. So, if we agree sender/receiver side delays are the way to go, it would make sense to actually document best-practices that any implementation should stick to, just as we already do for the CLTV expiry delta in the <a href=\"https://github.com/lightning/bolts/blob/011bf84d74d130c2972becca97c87f297b9d4a92/07-routing-gossip.md#recommendations-for-routing\" rel=\"noopener nofollow ugc\">BOLT #7 “Recommendations for Routing”</a> section.</li>\n<li>Note that in our research paper ([5]), we still assumed a purely BOLT11 world in which sender’s receiver anonymity was non-existing, i.e., the sender would always know the full path and hence the identity of the receiver anyways. However, in a post-BOLT12/blinded path world, the receiver’s identity can be actually hidden from the sender, and now the <em>sender</em> could be considered an on-path adversary. If we now report exact hold times of each intermediate hop to the sender, it might allow them to re-identify the receiver,  breaking the BOLT12 privacy gains we just finally introduced. But of course, if we consider this case, we’d also need to think about mitigations for the onion message parts of the protocol.</li>\n</ul>\n<p>TLDR: Yes, I agree that receiver/sender-side delays could be an option, if they were documented as (~binding) best practices for implementations. That’s mod the concerns regarding breaking blinded path privacy.</p>",
  "post_number": 5,
  "post_type": 1,
  "posts_count": 40,
  "updated_at": "2025-05-27T10:09:24.579Z",
  "reply_count": 2,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 38,
  "readers_count": 37,
  "score": 62.6,
  "yours": false,
  "topic_id": 1723,
  "topic_slug": "latency-and-privacy-in-lightning",
  "topic_title": "Latency and Privacy in Lightning",
  "topic_html_title": "Latency and Privacy in Lightning",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 3,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Thank you Carla for this great write-up of the discussion! I agree with your analysis in general, here are just a few points I want to add:\n\n- Yes, adding forwarding delays could be perceived to be unaligned with forwarding nodes' incentives, however, they already do this and also gain some efficiency and performance from batching HTLCs. Of course, there is a latency trade-off here, but generally it holds that the longer you wait, the higher are the chances that you can benefit from the reduced IO and network-latency overhead of batching HTLCs. IIUC, this would become even more relevant if we were to implement  `option_simplified_update` in the future.\n- As always, \"privacy loves company\". So requiring individual nodes who think they need additional privacy protections to add random delays might help with the particular on-path adversary model in mind, but it could actually have them stand out more in the general case. I.e., depending on the adversary it could even put a crosshair on their back, at least if it doesn't become a best practice to add reasonable random delays before claiming (receiver-side) / retrying (sender-side) payments. So, if we agree sender/receiver side delays are the way to go, it would make sense to actually document best-practices that any implementation should stick to, just as we already do for the CLTV expiry delta in the [BOLT #7 \"Recommendations for Routing\"](https://github.com/lightning/bolts/blob/011bf84d74d130c2972becca97c87f297b9d4a92/07-routing-gossip.md#recommendations-for-routing) section.\n- Note that in our research paper ([5]), we still assumed a purely BOLT11 world in which sender's receiver anonymity was non-existing, i.e., the sender would always know the full path and hence the identity of the receiver anyways. However, in a post-BOLT12/blinded path world, the receiver's identity can be actually hidden from the sender, and now the *sender* could be considered an on-path adversary. If we now report exact hold times of each intermediate hop to the sender, it might allow them to re-identify the receiver,  breaking the BOLT12 privacy gains we just finally introduced. But of course, if we consider this case, we'd also need to think about mitigations for the onion message parts of the protocol.\n\nTLDR: Yes, I agree that receiver/sender-side delays could be an option, if they were documented as (~binding) best practices for implementations. That's mod the concerns regarding breaking blinded path privacy.",
  "actions_summary": [
    {
      "id": 2,
      "count": 3
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 145,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Thank you Carla for this great write-up of the discussion! I agree with your analysis in general, here are just a few points I want to add: \n\nYes, adding forwarding delays could be perceived to be unaligned with forwarding nodes’ incentives, however, they already do this and also gain some efficienc&hellip;",
  "truncated": true,
  "post_url": "/t/latency-and-privacy-in-lightning/1723/5",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    },
    {
      "id": "heart",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 3,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}