{
  "id": 4950,
  "name": "Brh28",
  "username": "brh28",
  "avatar_template": "/user_avatar/delvingbitcoin.org/brh28/{size}/836_2.png",
  "created_at": "2025-05-06T20:22:05.060Z",
  "cooked": "<h2><a name=\"p-4950-introduction-1\" class=\"anchor\" href=\"#p-4950-introduction-1\"></a>Introduction</h2>\n<p>To route a payment on the Lightning Network, a sender must choose a path to the destination using channels which contain sufficient liquidity and meet certain forwarding rules (e.g routing fees). As neither the liquidity nor the balance in payment channels are shared with the network, a sender does not know if there is sufficient liquidity in each channel when constructing a path. This is referred to as <em>liquidity uncertainty.</em> With no other mechanism to resolve this uncertainty, nodes are left to a trial-and-error strategy. That is, attempt the payment anyway and hope it works. If it doesn’t, update the local view of the graph and try again. This approach to routing has a host of issues:</p>\n<h4><a name=\"p-4950-h-1-sub-optimal-routing-2\" class=\"anchor\" href=\"#p-4950-h-1-sub-optimal-routing-2\"></a>1. Sub-optimal routing</h4>\n<p>Without prior knowledge, a channels probability of error due to insufficient liquidity approximates the ratio of the payment amount to the channel capacity, which means larger payments through relatively low capacity channels are prone to error. Furthermore, this risk is compounded at every channel, which means longer paths become exponentially difficult. See appendix A for details.</p>\n<p>Routing calculations must account for this uncertainty by favoring shorter paths and higher capacity channels. Not only does this effect the payment sender who’s more likely to pay extra in fees for reliable liquidity, it’s also a centralizing force on the network. See appendix B for details</p>\n<p>Low payment success rates implies a large set of potential routes. When the final route is unknown, routing fees are more difficult to predict.</p>\n<p>Failed payments are a burden to routing nodes in the failing sub-path in the form of locked liquidity, HTLC slots, and wasted computational resources.</p>\n<h4><a name=\"p-4950-h-2-slow-discovery-process-3\" class=\"anchor\" href=\"#p-4950-h-2-slow-discovery-process-3\"></a>2. Slow Discovery Process</h4>\n<p>By using payments to discover feasible paths, HTLCs need to be set up and torn down at each hop, which requires multiple rounds of communication between peers. This is a lot of wasted time whenever a payment fails. Furthermore, this process must be executed serially to avoid the delivery of multiple successful payments, which fundamentally limits the rate at which path discovery can occur.</p>\n<h4><a name=\"p-4950-h-3-routing-limitations-4\" class=\"anchor\" href=\"#p-4950-h-3-routing-limitations-4\"></a>3. Routing limitations</h4>\n<p>To route a payment, the sender needs the latest updates to the graph. This requirement is a burden to the sender, who needs to constantly sync the channel graph, and to routers, who must limit their channel updates.</p>\n<hr>\n<h2><a name=\"p-4950-proposal-5\" class=\"anchor\" href=\"#p-4950-proposal-5\"></a>Proposal</h2>\n<p>Allow nodes to share routing information with each other in the form of path queries. The proposal includes the following optional messages, which allow nodes to cooperatively construct a path:</p>\n<ol>\n<li><code>path_query</code></li>\n</ol>\n<ul>\n<li>\n<p>source_node_id</p>\n</li>\n<li>\n<p>destination_node_id</p>\n</li>\n<li>\n<p>amount</p>\n</li>\n<li>\n<p>expiry</p>\n</li>\n</ul>\n<ol start=\"2\">\n<li><code>path_reply</code></li>\n</ol>\n<ul>\n<li>\n<p>path</p>\n<ul>\n<li>\n<p>amount</p>\n</li>\n<li>\n<p>fees</p>\n</li>\n<li>\n<p>cltv_delta</p>\n</li>\n</ul>\n</li>\n</ul>\n<ol start=\"3\">\n<li><code>reject_path_query</code></li>\n</ol>\n<ul>\n<li>reason</li>\n</ul>\n<p>Upon receiving a <code>path_query</code>, a node can choose how it wants to respond, including rejecting or ignoring it. The <code>path_reply</code> message helps the requester deliver a potential payment because it leverages routing information at the queried node. Notably, this solves the liquidity uncertainty problem for the queried node’s channels because a node knows it’s own balances and can respond accordingly. In contrast to the single execution onion, queries are lightweight and can be made concurrently. A parallel discovery process reduces liquidity uncertainty at a significantly faster rate than onions. Finally, it’s worth noting that a router can respond with any policy (e.g fees) it desires, unconstrained by existing rate limits.</p>\n<h2><a name=\"p-4950-putting-into-practice-6\" class=\"anchor\" href=\"#p-4950-putting-into-practice-6\"></a>Putting into practice</h2>\n<p>The proposal outlines a basic set of messages and it is for the node to choose their own request &amp; response strategies, including <em>who</em> they want to talk to (any subset of nodes), <em>what</em> they want to respond to (e.g minimum amounts) and any rate limits (number of requests and replies/paths). While there are innumerable strategies that may evolve, let’s walk-through a simple example where all nodes adopt a PEER_ONLY strategy (i.e nodes interact only with their channel peers):</p>\n<pre><code class=\"lang-auto\">        +--- A ------- B ---+          \n        |              |    |\n        |              |    |\nL -----\tS    +---------+    R\n        |    |              |\n        |    |              |\n        +--- C ------- D ---+           \n</code></pre>\n<p>Before attempting the payment, the sender (S) may choose to query any subset of it’s channel peers. The sender already knows that (L) is a leaf so does not query it. Alice (A) advertises the lowest routing fees but, since this is a larger payment, the sender decides to make concurrent queries to both Alice and Carol:</p>\n<ul>\n<li>Alice receives a <code>path_query</code> message requesting a path from herself (A) to the receiver (R). She sees she does not have the outbound liquidity to Bob (B) to complete the payment, so can either immediately respond with a <code>reject_path_query</code> with a reason indicating a temporary failure to find a route, or wait until liquidity becomes available to send a <code>path_reply</code>.</li>\n<li>Carol (C) receives a <code>path_query</code> requesting a path from herself to the receiver (R). She has sufficient outbound liquidity through Dave (D), but before responding to the sender, she decides to query Dave:\n<ul>\n<li>Dave receives a query from Carol for a path from himself (D) to the receiver. Similar to Alice, Dave responds that he has no route available</li>\n</ul>\n</li>\n<li>Upon discovering insufficient liquidity from D → R, Carol splits the sender amount and concurrently queries Bob (B) and Dave (D) with their respective splits.\n<ul>\n<li>Dave receives a new query requesting a path from himself (D) to the receiver, but of a lesser amount. This he does have the liquidity for! Since Dave knows he can route the requested payment, he responds to Carol with the given path and routing details.</li>\n<li>Bob (B) receives a new query requesting a path from himself (B) to the receiver for his split amount. Similar to Dave, he knows he can route the payment, so resonds to Carol with his routing details.</li>\n</ul>\n</li>\n<li>Upon receiving the path details from Bob and Dave, Carol can now confidently assemble a MPP from herself to the receiver. She constructs the MPP, adds her own routing details and sends a <code>path_reply</code> to the sender.</li>\n<li>Upon receiving the <code>path_reply</code> from Carol, Alice attempts the payment and on her first attempt, the payment succeeds.</li>\n</ul>\n<p>As you can see, path queries enable nodes to use queries to concurrently probe the network for feasible paths. When chained together, these queries swarm to the destination. Each hop knows it’s channel balance and can therefore reduce the liquidity uncertainty for their channel(s) in the path. After receiving a <code>path_reply</code> a node can prepend itself to the path and back-propogate it to the source.</p>\n<p>While the small example above illustrates the process, it is important to remember that liquidity uncertainty is particularly detrimental for longer paths on larger networks; trial-and-error may work for a small network like this, but does not scale to a growing number of nodes.</p>\n<h4><a name=\"p-4950-benefits-7\" class=\"anchor\" href=\"#p-4950-benefits-7\"></a>Benefits</h4>\n<p>As a simple set of flexible messages, it’s impossible to define all potential use cases. However, benefits can be broadly outlined as follows:</p>\n<ol>\n<li>Improves routes for larger payments, including lower fees, lower expected payment delivery times, and better fee estimation.</li>\n<li>Eliminates reliance of a fully synced channel graph. This is especially useful for mobile nodes who are not always available to receive updates and may prefer a relationship with an LSP.</li>\n<li>Enables more dynamic routing policy, whereby nodes can share updates without globally enforced rate limits.</li>\n<li>Distributes routing more evenly across the network, making smaller routing nodes more competitive</li>\n<li>Allow for network growth</li>\n</ol>\n<h4><a name=\"p-4950-addressing-potential-concerns-8\" class=\"anchor\" href=\"#p-4950-addressing-potential-concerns-8\"></a>Addressing potential concerns</h4>\n<ol>\n<li>Privacy.</li>\n</ol>\n<p>Naturally, any time information is shared, there is a privacy implication. However, this proposal is entirely optional; a node may choose to reveal as much or as little information to whomever they choose. For example, rather than revealing the true payment destination, a node can query a sub-path, which nicely compliments blinded paths.</p>\n<p>Additionally, the use of onion messages could significantly improve a node’s anonymity set, especially when querying node’s multiple hops away.</p>\n<ol start=\"2\">\n<li>Denial-of-service</li>\n</ol>\n<p>Nodes may choose their own response strategies, including filtering requests (e.g minimum amount) and setting rate limits.</p>\n<h2><a name=\"p-4950-expanding-the-messages-9\" class=\"anchor\" href=\"#p-4950-expanding-the-messages-9\"></a>Expanding the messages</h2>\n<p>The messages defined in this proposal are pretty bare. New fields can be added to these messages to enhance a node’s capabilites:</p>\n<ul>\n<li>Filters to the <code>path_query</code> to reduce the number of reply messages, such as a <code>maximum_fee</code></li>\n<li>Confidence scores that tell the requester the expected likelihood of payment delivery; the higher the routing node’s confidence, the more a path suggestion behaves like a <em>quote</em> for delivery.</li>\n<li>Time limits. A node can define a window of time their interested in a given path (e.g 1min, 1hr, 1day, always) and get notified with updates.</li>\n</ul>\n<h2><a name=\"p-4950-comparisons-to-trampoline-10\" class=\"anchor\" href=\"#p-4950-comparisons-to-trampoline-10\"></a>Comparisons to Trampoline</h2>\n<p>As far as I can tell, path queries can be used to accomplish everything trampoline routing proposes. The <a href=\"https://github.com/lightning/bolts/blob/32fd16e243d7ea4438c6646f35e731a73d691ca7/proposals/trampoline.md#introduction\" rel=\"noopener nofollow ugc\">trampoline proposal</a> states, “The main goal of trampoline routing is to reduce the amount of gossip that constrained nodes need to sync”. Furthermore, it states “constrained devices should only keep a small part of the network and leverage trampoline nodes to route payments.” With path queries, a node does not need any knowledge of the graph, but instead only a connection to a supporting peer.</p>\n<p>Trampoline pursues this goal while also preserving anonymity for the sender and receiver. This is done by including multiple hops in the trampoline route. Using path queries in the form of onion messages, a source node can attain a comparable anonymity set with only a single ‘trampoline hop’ using the following process:</p>\n<ol>\n<li>Select a node with path query support as a ‘trampoline’ hop.</li>\n<li>Query channel peer for a path to trampoline.</li>\n<li>Query trampoline for a path from trampoline to final destination.</li>\n<li>Send payment using aggregate route</li>\n</ol>\n<p>Note that while the pathfinding process is similar to trampoline in that it leverages routing information of other nodes, the final route does not use a special “trampoline route”, but rather a regular onion route. This means the trampoline hop has no information about the source other than the in-bound channel.</p>\n<p>Also, by requiring only a single trampoline hop, the full route is likely to be shorter. And as discussed above, paths derived from queries are likely to have higher success rates and lower fees while moving across the network.</p>\n<h2><a name=\"p-4950-moving-forward-11\" class=\"anchor\" href=\"#p-4950-moving-forward-11\"></a>Moving Forward</h2>\n<p>My primary goal is to get feedback, iterate on the proposal and open a draft PR into the BOLTs. Moving forward, I would be happy to work with any implementations interested in this feature.</p>\n<hr>\n<h2><a name=\"p-4950-appendix-a-payment-failure-probabilities-12\" class=\"anchor\" href=\"#p-4950-appendix-a-payment-failure-probabilities-12\"></a>Appendix A - Payment Failure Probabilities</h2>\n<p>Referencing <a href=\"https://github.com/lnbook/lnbook/blob/54453c7b1cf82186614ab929b80876ba18bdc65d/12_path_finding.asciidoc#liquidity-uncertainty-and-probability\" rel=\"noopener nofollow ugc\">Mastering the Lightning Network</a></p>\n<h4><a name=\"p-4950-for-a-given-channel-13\" class=\"anchor\" href=\"#p-4950-for-a-given-channel-13\"></a>For a given channel</h4>\n<p>The success probability function (only considering liquidity) is:</p>\n<p>P(a) = (c + 1 - a)/(c + 1),   where a = payment amount, c = channel capacity</p>\n<p>Using limits for approximation, we can eliminate the <code>+1</code>s and reduce the function to:</p>\n<p>P(a) = (c - a)/c = 1 - (a / c)</p>\n<p>As an additive inverse, we can deduce our probability of failure due to liquidity as (a / c) - the ratio of payment amount to the channel capacity.</p>\n<h4><a name=\"p-4950-for-a-payment-path-14\" class=\"anchor\" href=\"#p-4950-for-a-payment-path-14\"></a>For a payment path</h4>\n<p>The success probability of a payment path is the product of probabilities for each channel in the path(s):</p>\n<p>[<span class=\"math\">P_{payment} = \\prod_{i=1}^n P_i</span>]</p>\n<p>Likewise, probability of failure is a product of probabilities.</p>\n<h2><a name=\"p-4950-appendix-b-network-centralization-15\" class=\"anchor\" href=\"#p-4950-appendix-b-network-centralization-15\"></a>Appendix B - Network Centralization</h2>\n<p>As this <a href=\"https://arxiv.org/pdf/2102.09256\" rel=\"noopener nofollow ugc\">2021 study</a> shows, channel attachment strategies that connect to central nodes (e.g High degree, Betweeness) have significantally better payment success rates and better overall performance than more distributed strategies (e.g k-median), even when the distributed strategies offer lower fees. This is evidence that short paths through high capacity channels give larger routing nodes (high channel count, high capacity) a competitive advantage for larger payments, allowing them to capture more in routing fees.</p>\n<p>Additionally, payment success probabilities are higher for nodes with more volume (<a href=\"https://arxiv.org/pdf/2006.14358\" rel=\"noopener nofollow ugc\">see here</a>) because their previous payment attempts reduce their liquidity uncertainty. Lower uncertainty ultimately leads to better payment performance, meaning small nodes are at a disadvantage as a payment originator as well as routing.</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 5,
  "updated_at": "2025-05-07T22:19:36.996Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 101,
  "reads": 30,
  "readers_count": 29,
  "score": 511.0,
  "yours": false,
  "topic_id": 1672,
  "topic_slug": "path-queries-addressing-payment-reliability-and-routing-limitations",
  "topic_title": "Path Queries: Addressing Payment Reliability and Routing limitations",
  "topic_html_title": "Path Queries: Addressing Payment Reliability and Routing limitations",
  "category_id": 7,
  "display_username": "Brh28",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 3,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "## Introduction\n\nTo route a payment on the Lightning Network, a sender must choose a path to the destination using channels which contain sufficient liquidity and meet certain forwarding rules (e.g routing fees). As neither the liquidity nor the balance in payment channels are shared with the network, a sender does not know if there is sufficient liquidity in each channel when constructing a path. This is referred to as *liquidity uncertainty.* With no other mechanism to resolve this uncertainty, nodes are left to a trial-and-error strategy. That is, attempt the payment anyway and hope it works. If it doesn't, update the local view of the graph and try again. This approach to routing has a host of issues:\n\n#### 1\\. Sub-optimal routing \n\nWithout prior knowledge, a channels probability of error due to insufficient liquidity approximates the ratio of the payment amount to the channel capacity, which means larger payments through relatively low capacity channels are prone to error. Furthermore, this risk is compounded at every channel, which means longer paths become exponentially difficult. See appendix A for details.\n\nRouting calculations must account for this uncertainty by favoring shorter paths and higher capacity channels. Not only does this effect the payment sender who's more likely to pay extra in fees for reliable liquidity, it's also a centralizing force on the network. See appendix B for details   \n\n\nLow payment success rates implies a large set of potential routes. When the final route is unknown, routing fees are more difficult to predict. \n\nFailed payments are a burden to routing nodes in the failing sub-path in the form of locked liquidity, HTLC slots, and wasted computational resources.\n\n#### 2. Slow Discovery Process\n\nBy using payments to discover feasible paths, HTLCs need to be set up and torn down at each hop, which requires multiple rounds of communication between peers. This is a lot of wasted time whenever a payment fails. Furthermore, this process must be executed serially to avoid the delivery of multiple successful payments, which fundamentally limits the rate at which path discovery can occur.\n\n#### 3. Routing limitations\n\nTo route a payment, the sender needs the latest updates to the graph. This requirement is a burden to the sender, who needs to constantly sync the channel graph, and to routers, who must limit their channel updates.\n\n* * *\n\n## Proposal\n\nAllow nodes to share routing information with each other in the form of path queries. The proposal includes the following optional messages, which allow nodes to cooperatively construct a path:\n\n1.  `path_query`\n\n- source_node_id\n    \n- destination_node_id\n    \n- amount\n    \n- expiry\n    \n\n2.  `path_reply`\n\n- path\n    \n    - amount\n        \n    - fees\n        \n    - cltv_delta\n        \n\n3.  `reject_path_query`\n\n- reason\n\nUpon receiving a `path_query`, a node can choose how it wants to respond, including rejecting or ignoring it. The `path_reply` message helps the requester deliver a potential payment because it leverages routing information at the queried node. Notably, this solves the liquidity uncertainty problem for the queried node's channels because a node knows it's own balances and can respond accordingly. In contrast to the single execution onion, queries are lightweight and can be made concurrently. A parallel discovery process reduces liquidity uncertainty at a significantly faster rate than onions. Finally, it's worth noting that a router can respond with any policy (e.g fees) it desires, unconstrained by existing rate limits.\n\n## Putting into practice\n\nThe proposal outlines a basic set of messages and it is for the node to choose their own request & response strategies, including *who* they want to talk to (any subset of nodes), *what* they want to respond to (e.g minimum amounts) and any rate limits (number of requests and replies/paths). While there are innumerable strategies that may evolve, let's walk-through a simple example where all nodes adopt a PEER_ONLY strategy (i.e nodes interact only with their channel peers):\n\n```\n        +--- A ------- B ---+          \n        |              |    |\n        |              |    |\nL -----\tS    +---------+    R\n        |    |              |\n        |    |              |\n        +--- C ------- D ---+           \n```\n\n\nBefore attempting the payment, the sender (S) may choose to query any subset of it's channel peers. The sender already knows that (L) is a leaf so does not query it. Alice (A) advertises the lowest routing fees but, since this is a larger payment, the sender decides to make concurrent queries to both Alice and Carol:\n\n- Alice receives a `path_query` message requesting a path from herself (A) to the receiver (R). She sees she does not have the outbound liquidity to Bob (B) to complete the payment, so can either immediately respond with a `reject_path_query` with a reason indicating a temporary failure to find a route, or wait until liquidity becomes available to send a `path_reply`.\n- Carol (C) receives a `path_query` requesting a path from herself to the receiver (R). She has sufficient outbound liquidity through Dave (D), but before responding to the sender, she decides to query Dave:\n    - Dave receives a query from Carol for a path from himself (D) to the receiver. Similar to Alice, Dave responds that he has no route available \n- Upon discovering insufficient liquidity from D -> R, Carol splits the sender amount and concurrently queries Bob (B) and Dave (D) with their respective splits. \n    - Dave receives a new query requesting a path from himself (D) to the receiver, but of a lesser amount. This he does have the liquidity for! Since Dave knows he can route the requested payment, he responds to Carol with the given path and routing details. \n    - Bob (B) receives a new query requesting a path from himself (B) to the receiver for his split amount. Similar to Dave, he knows he can route the payment, so resonds to Carol with his routing details. \n- Upon receiving the path details from Bob and Dave, Carol can now confidently assemble a MPP from herself to the receiver. She constructs the MPP, adds her own routing details and sends a `path_reply` to the sender. \n- Upon receiving the `path_reply` from Carol, Alice attempts the payment and on her first attempt, the payment succeeds.\n  \n\nAs you can see, path queries enable nodes to use queries to concurrently probe the network for feasible paths. When chained together, these queries swarm to the destination. Each hop knows it's channel balance and can therefore reduce the liquidity uncertainty for their channel(s) in the path. After receiving a `path_reply` a node can prepend itself to the path and back-propogate it to the source. \n\nWhile the small example above illustrates the process, it is important to remember that liquidity uncertainty is particularly detrimental for longer paths on larger networks; trial-and-error may work for a small network like this, but does not scale to a growing number of nodes.\n\n#### Benefits\n\nAs a simple set of flexible messages, it's impossible to define all potential use cases. However, benefits can be broadly outlined as follows:\n\n1.  Improves routes for larger payments, including lower fees, lower expected payment delivery times, and better fee estimation.\n2.  Eliminates reliance of a fully synced channel graph. This is especially useful for mobile nodes who are not always available to receive updates and may prefer a relationship with an LSP.\n3.  Enables more dynamic routing policy, whereby nodes can share updates without globally enforced rate limits.\n4.  Distributes routing more evenly across the network, making smaller routing nodes more competitive\n5. Allow for network growth\n\n#### Addressing potential concerns\n\n1.  Privacy.\n\nNaturally, any time information is shared, there is a privacy implication. However, this proposal is entirely optional; a node may choose to reveal as much or as little information to whomever they choose. For example, rather than revealing the true payment destination, a node can query a sub-path, which nicely compliments blinded paths. \n\nAdditionally, the use of onion messages could significantly improve a node's anonymity set, especially when querying node's multiple hops away. \n\n2.  Denial-of-service \n\nNodes may choose their own response strategies, including filtering requests (e.g minimum amount) and setting rate limits.\n\n## Expanding the messages \n\nThe messages defined in this proposal are pretty bare. New fields can be added to these messages to enhance a node's capabilites:\n\n- Filters to the `path_query` to reduce the number of reply messages, such as a `maximum_fee`\n- Confidence scores that tell the requester the expected likelihood of payment delivery; the higher the routing node's confidence, the more a path suggestion behaves like a *quote* for delivery.\n- Time limits. A node can define a window of time their interested in a given path (e.g 1min, 1hr, 1day, always) and get notified with updates.\n\n## Comparisons to Trampoline\n\nAs far as I can tell, path queries can be used to accomplish everything trampoline routing proposes. The [trampoline proposal](https://github.com/lightning/bolts/blob/32fd16e243d7ea4438c6646f35e731a73d691ca7/proposals/trampoline.md#introduction) states, \"The main goal of trampoline routing is to reduce the amount of gossip that constrained nodes need to sync\". Furthermore, it states \"constrained devices should only keep a small part of the network and leverage trampoline nodes to route payments.\" With path queries, a node does not need any knowledge of the graph, but instead only a connection to a supporting peer.\n\nTrampoline pursues this goal while also preserving anonymity for the sender and receiver. This is done by including multiple hops in the trampoline route. Using path queries in the form of onion messages, a source node can attain a comparable anonymity set with only a single 'trampoline hop' using the following process: \n\n1. Select a node with path query support as a 'trampoline' hop.  \n2. Query channel peer for a path to trampoline. \n3. Query trampoline for a path from trampoline to final destination.\n4. Send payment using aggregate route \n\nNote that while the pathfinding process is similar to trampoline in that it leverages routing information of other nodes, the final route does not use a special \"trampoline route\", but rather a regular onion route. This means the trampoline hop has no information about the source other than the in-bound channel.   \n\nAlso, by requiring only a single trampoline hop, the full route is likely to be shorter. And as discussed above, paths derived from queries are likely to have higher success rates and lower fees while moving across the network.  \n\n## Moving Forward\n\nMy primary goal is to get feedback, iterate on the proposal and open a draft PR into the BOLTs. Moving forward, I would be happy to work with any implementations interested in this feature. \n\n* * *\n\n## Appendix A - Payment Failure Probabilities \n\nReferencing [Mastering the Lightning Network](https://github.com/lnbook/lnbook/blob/54453c7b1cf82186614ab929b80876ba18bdc65d/12_path_finding.asciidoc#liquidity-uncertainty-and-probability)\n\n#### For a given channel \n\nThe success probability function (only considering liquidity) is: \n\nP(a) = (c + 1 - a)/(c + 1),   where a = payment amount, c = channel capacity\n\nUsing limits for approximation, we can eliminate the `+1`s and reduce the function to:\n\nP(a) = (c - a)/c = 1 - (a / c)\n\nAs an additive inverse, we can deduce our probability of failure due to liquidity as (a / c) - the ratio of payment amount to the channel capacity. \n\n#### For a payment path\n\nThe success probability of a payment path is the product of probabilities for each channel in the path(s):\n\n\\[$P_{payment} = \\prod_{i=1}^n P_i$\\]\n\nLikewise, probability of failure is a product of probabilities.\n\n## Appendix B - Network Centralization\n\nAs this [2021 study](https://arxiv.org/pdf/2102.09256) shows, channel attachment strategies that connect to central nodes (e.g High degree, Betweeness) have significantally better payment success rates and better overall performance than more distributed strategies (e.g k-median), even when the distributed strategies offer lower fees. This is evidence that short paths through high capacity channels give larger routing nodes (high channel count, high capacity) a competitive advantage for larger payments, allowing them to capture more in routing fees.\n\nAdditionally, payment success probabilities are higher for nodes with more volume ([see here](https://arxiv.org/pdf/2006.14358)) because their previous payment attempts reduce their liquidity uncertainty. Lower uncertainty ultimately leads to better payment performance, meaning small nodes are at a disadvantage as a payment originator as well as routing.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 558,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "<a name=\"p-4950-introduction-1\" class=\"anchor\" href=\"#p-4950-introduction-1\"></a>Introduction\nTo route a payment on the Lightning Network, a sender must choose a path to the destination using channels which contain sufficient liquidity and meet certain forwarding rules (e.g routing fees). As neither the liquidity nor the balance in payment channels are shared with the network, a&hellip;",
  "truncated": true,
  "post_url": "/t/path-queries-addressing-payment-reliability-and-routing-limitations/1672/1",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}