{
  "id": 3049,
  "name": "HubertusVIE",
  "username": "HubertusVIE",
  "avatar_template": "/user_avatar/delvingbitcoin.org/hubertusvie/{size}/770_2.png",
  "created_at": "2024-08-23T13:48:46.952Z",
  "cooked": "<p>Guys, the title of this really triggered me especially in a Bitcoin context.</p>\n<p>So please: <strong>A deflationary currency is impossible</strong></p>\n<p>This is also be the reason why bitcoin still is not catching on as a proper money, as is excessive volatility without a trend.</p>\n<p>A deflationary currency is even worse than an inflationary one. Inflation “only” steals from producing participants over time, deflation directly causes production and supply chains to break down fast and réliably. This has been seen often enough in history. It is called deflationary spiral.</p>\n<p>Falling prices lead to reduced consumer spending and business investment. Weak demand, in turn, causes businesses to lower prices further, leading to more economic contraction. As the cycle continues, it results in severe economic depression, with widespread job losses, decreased demand, and further price declines, misery and hardship for all but a few lucky speculators.</p>\n<p><strong>Central Banking is a problem, not a solution</strong></p>\n<p>“Central banks can recognise this behaviour, and tweak the money supply and interest rates”:\nThat is their claim, pure theory. Practically they do things with insufficient knowledge about circumstances, like any central planner, with a long lag in data, a long delay in action, often based on faulty economics, and a further time gap till they see policy effects. Worst of all, they have a statist gusto for interventionism and get appointed by politicians.</p>\n<p>“Central banks economists and financial engineers have a meaningful future, even in an all Bitcoin future”:\nThat’s about the worst future imaginable. We must design and develop everything in the Bitcoin system permissionless and non-custodial precisely because the state, princes and kings, politicians verifiably always usurp and abuse the monetary system. With today’s tech, a free market money with a stable objective exchange value is perfectly doable.</p>\n<p>“The central bank could issue an inflationary currency backed by deflationary one”\nIn truth, a central bank monopoly does not need any “backing” as their banknotes are not redeemable. They need some foreign currency reserves for international trade balancing, otherwise they “buy” government bonds to give cash to politicians which debase their currency. While it is more involved nowadays, in essence it is the same as emperor Nero reducing the metal content of Roman coin. Needless to say that government’s repayment at maturity is just rollover by “buying” more government bonds., i.e. not repayment at all. Proof is the gold backing of the Euro. ECB started off at 80% gold backing, now it is 8%, the rest is mostly European government debt.</p>\n<p>I leave it there. My message is:</p>\n<p>Government has no business in the money business. No more central banks. We must liberalise, privatise. With the right kind of method and issue policy based on proof of work (or real value), the private sector can supply the economy with the right amount of good money just fine.</p>",
  "post_number": 16,
  "post_type": 1,
  "updated_at": "2024-08-23T13:48:46.952Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 9,
  "readers_count": 8,
  "score": 1.2,
  "yours": false,
  "topic_id": 22,
  "topic_slug": "deflationary-money-is-a-good-thing",
  "topic_title": "Deflationary money is a Good Thing",
  "topic_html_title": "Deflationary money is a Good Thing",
  "category_id": 5,
  "display_username": "HubertusVIE",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Guys, the title of this really triggered me especially in a Bitcoin context. \n\nSo please: **A deflationary currency is impossible**\n\nThis is also be the reason why bitcoin still is not catching on as a proper money, as is excessive volatility without a trend.\n\nA deflationary currency is even worse than an inflationary one. Inflation “only” steals from producing participants over time, deflation directly causes production and supply chains to break down fast and réliably. This has been seen often enough in history. It is called deflationary spiral. \n\nFalling prices lead to reduced consumer spending and business investment. Weak demand, in turn, causes businesses to lower prices further, leading to more economic contraction. As the cycle continues, it results in severe economic depression, with widespread job losses, decreased demand, and further price declines, misery and hardship for all but a few lucky speculators.\n\n**Central Banking is a problem, not a solution**\n\n“Central banks can recognise this behaviour, and tweak the money supply and interest rates”:\nThat is their claim, pure theory. Practically they do things with insufficient knowledge about circumstances, like any central planner, with a long lag in data, a long delay in action, often based on faulty economics, and a further time gap till they see policy effects. Worst of all, they have a statist gusto for interventionism and get appointed by politicians.\n\n“Central banks economists and financial engineers have a meaningful future, even in an all Bitcoin future”:\nThat’s about the worst future imaginable. We must design and develop everything in the Bitcoin system permissionless and non-custodial precisely because the state, princes and kings, politicians verifiably always usurp and abuse the monetary system. With today's tech, a free market money with a stable objective exchange value is perfectly doable.\n\n“The central bank could issue an inflationary currency backed by deflationary one”\nIn truth, a central bank monopoly does not need any “backing” as their banknotes are not redeemable. They need some foreign currency reserves for international trade balancing, otherwise they “buy” government bonds to give cash to politicians which debase their currency. While it is more involved nowadays, in essence it is the same as emperor Nero reducing the metal content of Roman coin. Needless to say that government's repayment at maturity is just rollover by “buying” more government bonds., i.e. not repayment at all. Proof is the gold backing of the Euro. ECB started off at 80% gold backing, now it is 8%, the rest is mostly European government debt. \n\nI leave it there. My message is: \n\nGovernment has no business in the money business. No more central banks. We must liberalise, privatise. With the right kind of method and issue policy based on proof of work (or real value), the private sector can supply the economy with the right amount of good money just fine.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 515,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}