{
  "id": 3058,
  "name": "David A. Harding",
  "username": "harding",
  "avatar_template": "/user_avatar/delvingbitcoin.org/harding/{size}/6_2.png",
  "created_at": "2024-08-26T18:36:33.434Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"evoskuil\" data-post=\"32\" data-topic=\"710\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/evoskuil/48/391_2.png\" class=\"avatar\"> evoskuil:</div>\n<blockquote>\n<p>do not perpetuate this error that it fixes something.</p>\n</blockquote>\n</aside>\n<p>I recall you making similar proclamations during the  <a href=\"https://milksad.info/disclosure.html#libbitcoin-team-response-and-context\">milk sad</a> disclosure.  The intuitive way of using your API was not the secure way to use it.  Rather than change your API, you put a single piece of documentation about the insecurity on a page that many API users may never have read.  Many other pages of your documentation gave examples that used the API in an insecure way.  You believed this was acceptable.  Others disagreed.</p>\n<p>We have a similar situation with Bitcoin’s merkle trees.  They were intended to allow the generation of cryptographically secure transaction inclusion proofs with a single partial merkle branch.  Now Bitcoin protocol developers know that is insecure.  There’s some limited propagation of that knowledge to downstream developers, but it remains an obscure problem with an abstruse solution.  We could content ourselves with the limited documentation we’ve written about it and claim anyone who later loses money due to this problem is the victim of incompetence—or we could carefully weigh the consensus change required to restore the security of the simple, intuitive, and efficient way of generating and verifying transaction inclusion proofs.</p>\n<p>Restoring a simple protocol to its originally intended security is a fix, in my opinion.</p>",
  "post_number": 33,
  "post_type": 1,
  "updated_at": "2024-08-26T18:38:50.661Z",
  "reply_count": 1,
  "reply_to_post_number": 32,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 8,
  "readers_count": 7,
  "score": 6.6,
  "yours": false,
  "topic_id": 710,
  "topic_slug": "great-consensus-cleanup-revival",
  "topic_title": "Great Consensus Cleanup Revival",
  "topic_html_title": "Great Consensus Cleanup Revival",
  "category_id": 7,
  "display_username": "David A. Harding",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"evoskuil, post:32, topic:710\"]\ndo not perpetuate this error that it fixes something.\n[/quote]\n\nI recall you making similar proclamations during the  [milk sad](https://milksad.info/disclosure.html#libbitcoin-team-response-and-context) disclosure.  The intuitive way of using your API was not the secure way to use it.  Rather than change your API, you put a single piece of documentation about the insecurity on a page that many API users may never have read.  Many other pages of your documentation gave examples that used the API in an insecure way.  You believed this was acceptable.  Others disagreed.\n\nWe have a similar situation with Bitcoin's merkle trees.  They were intended to allow the generation of cryptographically secure transaction inclusion proofs with a single partial merkle branch.  Now Bitcoin protocol developers know that is insecure.  There's some limited propagation of that knowledge to downstream developers, but it remains an obscure problem with an abstruse solution.  We could content ourselves with the limited documentation we've written about it and claim anyone who later loses money due to this problem is the victim of incompetence---or we could carefully weigh the consensus change required to restore the security of the simple, intuitive, and efficient way of generating and verifying transaction inclusion proofs.\n\nRestoring a simple protocol to its originally intended security is a fix, in my opinion.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 6,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}