{
  "id": 3067,
  "name": "David A. Harding",
  "username": "harding",
  "avatar_template": "/user_avatar/delvingbitcoin.org/harding/{size}/6_2.png",
  "created_at": "2024-08-27T20:50:48.600Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"ariard\" data-post=\"38\" data-topic=\"710\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/a/c67d28/48.png\" class=\"avatar\"> ariard:</div>\n<blockquote>\n<p>Come on Dave… this is borderline sheer intellectual dishonesty. I think you’re worth better than that.</p>\n</blockquote>\n</aside>\n<p>Fuck you, Antoine.  Everything I said was true.</p>\n<p>Here’s why I made that comparison: I thought <a class=\"mention\" href=\"/u/evoskuil\">@evoskuil</a>’s claim that “the proposed invalidation of 64 byte transactions does not in any way represent a fix to a vulnerability” was obviously wrong.  But, instead of saying that, I tried to imagine a counterfactual where it was true.  I succeeded under the assumption that the availability of a theoretical workaround known to experts means a vulnerability doesn’t exist, even if it might be the case that non-experts don’t know about the problem or don’t have access to the workaround.  In other words, it’s not a vulnerability if we can blame victims for being ignorant or lacking resources.  From my perspective, that was exactly the approach <a class=\"mention\" href=\"/u/evoskuil\">@evoskuil</a> took in the response to the milk sad disclosure, and understanding that previous approach of his helps me make sense of his current claim.</p>\n<p>You seem to be arguing that we shouldn’t blame libbitcoin for having a confusing API and insufficient documentation since other security software has similar problems.  But then who do we blame when something goes wrong?  Do we blame the victims for not using our misshapen tools the “correct” way?  Or do we accept that we can do better and improve our tools?</p>\n<p>To me, that’s part of the argument being had here: SPV is currently a bad API that requires poorly documented workarounds to make safe.  Do we leave it as-is and (perhaps) later blame anyone who falls victim to CVE-2017-12842 for not having learned about that edge case?  Or is it worth a small consensus change to make SPV secure against CVE-2017-12842?</p>",
  "post_number": 39,
  "post_type": 1,
  "updated_at": "2024-08-27T20:50:48.600Z",
  "reply_count": 0,
  "reply_to_post_number": 38,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 1,
  "readers_count": 0,
  "score": 0,
  "yours": false,
  "topic_id": 710,
  "topic_slug": "great-consensus-cleanup-revival",
  "topic_title": "Great Consensus Cleanup Revival",
  "topic_html_title": "Great Consensus Cleanup Revival",
  "category_id": 7,
  "display_username": "David A. Harding",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"ariard, post:38, topic:710\"]\nCome on Dave… this is borderline sheer intellectual dishonesty. I think you’re worth better than that.\n[/quote]\n\nFuck you, Antoine.  Everything I said was true.\n\nHere's why I made that comparison: I thought @evoskuil's claim that \"the proposed invalidation of 64 byte transactions does not in any way represent a fix to a vulnerability\" was obviously wrong.  But, instead of saying that, I tried to imagine a counterfactual where it was true.  I succeeded under the assumption that the availability of a theoretical workaround known to experts means a vulnerability doesn't exist, even if it might be the case that non-experts don't know about the problem or don't have access to the workaround.  In other words, it's not a vulnerability if we can blame victims for being ignorant or lacking resources.  From my perspective, that was exactly the approach @evoskuil took in the response to the milk sad disclosure, and understanding that previous approach of his helps me make sense of his current claim.\n\nYou seem to be arguing that we shouldn't blame libbitcoin for having a confusing API and insufficient documentation since other security software has similar problems.  But then who do we blame when something goes wrong?  Do we blame the victims for not using our misshapen tools the \"correct\" way?  Or do we accept that we can do better and improve our tools?\n\nTo me, that's part of the argument being had here: SPV is currently a bad API that requires poorly documented workarounds to make safe.  Do we leave it as-is and (perhaps) later blame anyone who falls victim to CVE-2017-12842 for not having learned about that edge case?  Or is it worth a small consensus change to make SPV secure against CVE-2017-12842?",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 6,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}