{
  "id": 3062,
  "name": "",
  "username": "valuedmammal",
  "avatar_template": "/letter_avatar_proxy/v4/letter/v/c6cbf5/{size}.png",
  "created_at": "2024-08-27T01:31:46.969Z",
  "cooked": "<p>This is a test showing that the full-rbf node (B) saw significantly less variance in <em>score</em>. If you see any problem with the calculations or believe a different test would be more appropriate let me know.</p>\n<p><img src=\"https://delvingbitcoin.org/uploads/default/original/1X/88ea8bc0a69411555819a2f040811e596cd16f9d.jpeg\" alt=\"mempool-variance\" data-base62-sha1=\"jxdrN9OpGgJ5nazn8lB8PS8BAvP\" width=\"400\" height=\"264\"></p>\n<hr>\n<h2><a name=\"p-3062-discussion-1\" class=\"anchor\" href=\"#p-3062-discussion-1\"></a>Discussion</h2>\n<p>An obvious confounding variable was <strong>node uptime</strong> which could affect network visability. The fullrbf node is an always-on server while the bip125 node is a pruned node on an old laptop that is off most of the time. I attempted to smooth out that variation by making sure the nodes were peered with one another giving them the opportunity to share their own mempool contents.</p>\n<p>One of the reasons I took on this exploration was to engage in a larger discussion about the health of the p2p network. It’s important that node operators have a habit of monitoring statistics to track changes in usage by network participants.</p>\n<p>The score is intentionally “dumb”. We would like it to have a value close to 1, but deviations from perfect aren’t necessarily a cause for concern. Indeed we expect to see variation by virtue of the distributed network - some nodes see some transactions and other nodes see others. It would be unrealistic to expect perfection from every block - certainly that would make it less useful as a metric. Thankfully I was surprised to observe such high p2p scores on a regular basis. In contrast, witnessing large or prolonged deviations could be a sign that either <strong>1)</strong> local policy has fallen adrift of the wider network or <strong>2)</strong> significant volumes of transactions are confirming having never entered the mempool to begin with.</p>\n<p>In terms of policy I don’t take a stance on whether nodes should conform to miner practices or vice versa. I do think we should try to strike a balance between sane and reliable defaults while recognizing the need to evolve and adapt policy with the aim of making the mempool an efficient place where users will want to transact.</p>",
  "post_number": 5,
  "post_type": 1,
  "updated_at": "2024-08-27T01:31:46.969Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 26,
  "reads": 11,
  "readers_count": 10,
  "score": 127.2,
  "yours": false,
  "topic_id": 1077,
  "topic_slug": "casual-research-on-running-mempoolfullrbf",
  "topic_title": "Casual research on running `mempoolfullrbf`",
  "topic_html_title": "Casual research on running `mempoolfullrbf`",
  "category_id": 8,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "This is a test showing that the full-rbf node (B) saw significantly less variance in _score_. If you see any problem with the calculations or believe a different test would be more appropriate let me know.\n\n![mempool-variance|400x264](upload://jxdrN9OpGgJ5nazn8lB8PS8BAvP.jpeg)\n\n<hr>\n\n## Discussion\nAn obvious confounding variable was **node uptime** which could affect network visability. The fullrbf node is an always-on server while the bip125 node is a pruned node on an old laptop that is off most of the time. I attempted to smooth out that variation by making sure the nodes were peered with one another giving them the opportunity to share their own mempool contents.\n\nOne of the reasons I took on this exploration was to engage in a larger discussion about the health of the p2p network. It's important that node operators have a habit of monitoring statistics to track changes in usage by network participants.\n\nThe score is intentionally \"dumb\". We would like it to have a value close to 1, but deviations from perfect aren't necessarily a cause for concern. Indeed we expect to see variation by virtue of the distributed network - some nodes see some transactions and other nodes see others. It would be unrealistic to expect perfection from every block - certainly that would make it less useful as a metric. Thankfully I was surprised to observe such high p2p scores on a regular basis. In contrast, witnessing large or prolonged deviations could be a sign that either **1)** local policy has fallen adrift of the wider network or **2)** significant volumes of transactions are confirming having never entered the mempool to begin with.\n\nIn terms of policy I don't take a stance on whether nodes should conform to miner practices or vice versa. I do think we should try to strike a balance between sane and reliable defaults while recognizing the need to evolve and adapt policy with the aim of making the mempool an efficient place where users will want to transact.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 512,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}