{
  "id": 3020,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/417_2.png",
  "created_at": "2024-08-21T10:08:20.432Z",
  "cooked": "<p>Hey all,</p>\n<p>I’ve changed the “inappropriate” flag (<em>“This post contains content that a reasonable person would consider offensive, abusive, to be hateful conduct or a violation of our community guidelines”</em>) to a slightly more general “not constructive” flag, with the description:</p>\n<ul>\n<li><strong>It’s Not Constructive</strong> This post contains non-constructive content, for example it may be repetitive, trolling, argumentative, or include content that a reasonable person would consider offensive, abusive, or a violation of <a href=\"https://delvingbitcoin.org/guidelines\">our community guidelines</a>.</li>\n</ul>\n<p>If you’re seeing posts/replies that aren’t just not interesting to you but are not constructive, please help by flagging them, both to help maintain/increase the signal/noise ratio, and to help other posters be aware of which is which without having to get a potentially scary message from the moderators.</p>\n<p>I’ve also heard some concern that some people might be posting about techniques they’ve applied for patent protection on, setting up a potential trap for people who might implement those techniques, so as a minimal step towards dealing with that I’ve also taken the opportunity to add the phrase “This includes deceptively encouraging the use of patent-encumbered techniques.” to the “It’s Illegal” flag category, in case anyone’s aware of cases where that’s happening.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-08-21T10:08:20.432Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 2,
  "readers_count": 1,
  "score": 0,
  "yours": false,
  "topic_id": 1085,
  "topic_slug": "flagging-posts-topics",
  "topic_title": "Flagging posts/topics",
  "topic_html_title": "Flagging posts/topics",
  "category_id": 2,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Hey all,\n\nI've changed the \"inappropriate\" flag (*\"This post contains content that a reasonable person would consider offensive, abusive, to be hateful conduct or a violation of our community guidelines\"*) to a slightly more general \"not constructive\" flag, with the description:\n\n * **It's Not Constructive** This post contains non-constructive content, for example it may be repetitive, trolling, argumentative, or include content that a reasonable person would consider offensive, abusive, or a violation of [our community guidelines](https://delvingbitcoin.org/guidelines).\n\nIf you're seeing posts/replies that aren't just not interesting to you but are not constructive, please help by flagging them, both to help maintain/increase the signal/noise ratio, and to help other posters be aware of which is which without having to get a potentially scary message from the moderators.\n\nI've also heard some concern that some people might be posting about techniques they've applied for patent protection on, setting up a potential trap for people who might implement those techniques, so as a minimal step towards dealing with that I've also taken the opportunity to add the phrase \"This includes deceptively encouraging the use of patent-encumbered techniques.\" to the \"It's Illegal\" flag category, in case anyone's aware of cases where that's happening.",
  "actions_summary": [],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}