{
  "id": 521,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/3_2.png",
  "created_at": "2023-11-30T08:16:15.460Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"ZmnSCPxj\" data-post=\"6\" data-topic=\"22\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/z/ee7513/48.png\" class=\"avatar\"> ZmnSCPxj:</div>\n<blockquote>\n<p>The problem with any kind of “intelligent” use of inflationary minting is, again, a repeat of the principal vs agent problem.</p>\n</blockquote>\n</aside>\n<p>The key word there is “minting” – you get a conflict because you’re both assigning value to something, and creating that something out of nothing, so why not create lots of the something, give it to yourself, and voila you’re rich. The problem is that eventually doesn’t work: the market will eventually assign a different value to that something.</p>\n<p>The trick in the approach above is not to have the minting at all: the only “something” is btc, and you can’t magically create more of it. Setting an exchange rate vs dollars, and pricing things in dollars doesn’t make anyone richer or poorer, it just turns price updating into a service by default.</p>\n<p>For example, if your salary is $90,000 and your grocery bill is $200 and your rent is $2000, then an economy-wide event that changes the savings rate just changes the value of all those things in BTC; if the savings rate increases and everyone wants more BTC, maybe you only get 80% as much BTC for your dollar, but that’s true in all those interactions, which gives the central bank a way of addressing systemic shocks, without causing inflation.</p>\n<p>Not every transaction will be denominated in dollars, of course; eg your salary might be denominated in dollars, while your mortgage payments are denominated in BTC. That then acts similarly to an interest rate rise: you’ll need to pay $1250/month instead of $1000/month given an 80% change in exchange rate. Note that compared to interest rate rises today, this is making it harder to pay off both the principal and the interest; whereas today, interest rate rises only make it harder to pay off the interest.</p>\n<p>If you have someone picking the exchange rate, then they could ignore the inflation data they’re meant to be using, and instead manipulate the results so their interest payments go up or down (depending on whether they’re lending or borrowing). Worst case, that just means the “dollar” is a useless idea, and everyone should do everything in BTC. But I think you could design a market-based system to set the exchange rate at present based on future CPI data results, to avoid that being a direct problem. I think some of the macroeconomists in favour of an NGDP-target rather than an inflation target have done some market design work on that sort of thing.</p>",
  "post_number": 8,
  "post_type": 1,
  "updated_at": "2023-11-30T08:16:15.460Z",
  "reply_count": 0,
  "reply_to_post_number": 6,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 3,
  "readers_count": 2,
  "score": 0.4,
  "yours": false,
  "topic_id": 22,
  "topic_slug": "deflationary-money-is-a-good-thing",
  "topic_title": "Deflationary money is a Good Thing",
  "topic_html_title": "Deflationary money is a Good Thing",
  "category_id": 5,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"ZmnSCPxj, post:6, topic:22\"]\nThe problem with any kind of “intelligent” use of inflationary minting is, again, a repeat of the principal vs agent problem.\n[/quote]\n\nThe key word there is \"minting\" -- you get a conflict because you're both assigning value to something, and creating that something out of nothing, so why not create lots of the something, give it to yourself, and voila you're rich. The problem is that eventually doesn't work: the market will eventually assign a different value to that something.\n\nThe trick in the approach above is not to have the minting at all: the only \"something\" is btc, and you can't magically create more of it. Setting an exchange rate vs dollars, and pricing things in dollars doesn't make anyone richer or poorer, it just turns price updating into a service by default.\n\nFor example, if your salary is $90,000 and your grocery bill is $200 and your rent is $2000, then an economy-wide event that changes the savings rate just changes the value of all those things in BTC; if the savings rate increases and everyone wants more BTC, maybe you only get 80% as much BTC for your dollar, but that's true in all those interactions, which gives the central bank a way of addressing systemic shocks, without causing inflation.\n\nNot every transaction will be denominated in dollars, of course; eg your salary might be denominated in dollars, while your mortgage payments are denominated in BTC. That then acts similarly to an interest rate rise: you'll need to pay $1250/month instead of $1000/month given an 80% change in exchange rate. Note that compared to interest rate rises today, this is making it harder to pay off both the principal and the interest; whereas today, interest rate rises only make it harder to pay off the interest.\n\nIf you have someone picking the exchange rate, then they could ignore the inflation data they're meant to be using, and instead manipulate the results so their interest payments go up or down (depending on whether they're lending or borrowing). Worst case, that just means the \"dollar\" is a useless idea, and everyone should do everything in BTC. But I think you could design a market-based system to set the exchange rate at present based on future CPI data results, to avoid that being a direct problem. I think some of the macroeconomists in favour of an NGDP-target rather than an inflation target have done some market design work on that sort of thing.",
  "actions_summary": [],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}