{
  "id": 343,
  "name": "Gregory Sanders",
  "username": "instagibbs",
  "avatar_template": "/user_avatar/delvingbitcoin.org/instagibbs/{size}/28_2.png",
  "created_at": "2023-11-08T15:17:46.153Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"ajtowns\" data-post=\"2\" data-topic=\"159\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ajtowns/48/3_2.png\" class=\"avatar\"> ajtowns:</div>\n<blockquote>\n<p>I guess the concern I have with this is some rules we have that create pinning vectors align with “miner incentives”, and if miners are incentivised to enforce those rules, then they’ll just work around any rules we create to reintroduce those pinning vectors?</p>\n</blockquote>\n</aside>\n<p>Part of my thinking on this priority based system is that it seems to be closer to compatible than V3 style, in that if it profits the next N blocks(let’s say very small numbers only), I think it basically approximates the type of selective relay you suggest, just in an opt-in manner? Bonus is a user can’t complain their tx isn’t showing up on their block explorer, they opted into not being relayed if miners don’t want to bother!</p>\n<aside class=\"quote no-group\" data-username=\"ajtowns\" data-post=\"2\" data-topic=\"159\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ajtowns/48/3_2.png\" class=\"avatar\"> ajtowns:</div>\n<blockquote>\n<p>This approach would perhaps be incompatible with non-consensus “prior restraint” features though: miners and users could easily just remove those features and maintain a network like this.</p>\n</blockquote>\n</aside>\n<p>I don’t see what’s incompatible? Miners would include a tx if it’s in the top, and not include if not. 1MvB is the strictest possible setting, and better for the user that doesn’t want to be pinned as long as they’re aggressively bumping fees on whatever schedule they need. The problem would be if miners decide to relax this restriction, allowing a potentially junkier backlog build. I don’t know why miners would want to do that.</p>\n<aside class=\"quote no-group\" data-username=\"ajtowns\" data-post=\"2\" data-topic=\"159\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ajtowns/48/3_2.png\" class=\"avatar\"> ajtowns:</div>\n<blockquote>\n<p>One approach to allowing a backlog while reducing the impact of free relay might be to make backlog relay unreliable.</p>\n</blockquote>\n</aside>\n<p>I’d have to think way harder on this, but I don’t think this is a crazy direction, no. I am not sure I’d even call it free relay, if we’re relaying less. We might need a more concrete definition, but pushing down how much we relay to prevent free relay seems right!</p>\n<aside class=\"quote no-group\" data-username=\"ajtowns\" data-post=\"2\" data-topic=\"159\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ajtowns/48/3_2.png\" class=\"avatar\"> ajtowns:</div>\n<blockquote>\n<p>I really feel like “pinning” is a fundamental design bug…</p>\n</blockquote>\n</aside>\n<p><em>handwave cluster mempool into existence</em></p>\n<p>An alternative and unbaked selective relay take could be to not only weigh the “depth” it is in the mempool/backlog, but also “how many vbytes away from top block” it is with respect to its preceding chunks in the cluster.</p>\n<p>If a newly proposed chunk in a cluster linearizes to “just after” top block chunks, and the new chunk itself is below Y kvB, where the size is not &gt;&gt; “smallest reasonable package attempts”, we accept and relay it. Taking V3 magic values for this example, we could allow 1 kvB “extra” in clusters. An adversary pays top block to stuff a cluster, or pays minfee to fill up the last 1 kvB which can be efficiently RBF’d, at least as well as V3 child txns can.</p>\n<p>In this scenario, we could just make “large” lower fee chunks relay unreliably. Casual users making smaller txns would not be effected unless they do consolidations or longer chains, depending on the Y you pick which directly influences the amount of pinning possible.</p>",
  "post_number": 3,
  "post_type": 1,
  "posts_count": 3,
  "updated_at": "2023-11-08T15:17:46.153Z",
  "reply_count": 0,
  "reply_to_post_number": 2,
  "quote_count": 1,
  "incoming_link_count": 1,
  "reads": 18,
  "readers_count": 17,
  "score": 8.6,
  "yours": false,
  "topic_id": 159,
  "topic_slug": "opt-in-transaction-policies-for-anti-pinning",
  "topic_title": "Opt-in transaction policies for anti-pinning",
  "topic_html_title": "Opt-in transaction policies for anti-pinning",
  "category_id": 8,
  "display_username": "Gregory Sanders",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"ajtowns, post:2, topic:159\"]\nI guess the concern I have with this is some rules we have that create pinning vectors align with “miner incentives”, and if miners are incentivised to enforce those rules, then they’ll just work around any rules we create to reintroduce those pinning vectors?\n[/quote]\n\nPart of my thinking on this priority based system is that it seems to be closer to compatible than V3 style, in that if it profits the next N blocks(let's say very small numbers only), I think it basically approximates the type of selective relay you suggest, just in an opt-in manner? Bonus is a user can't complain their tx isn't showing up on their block explorer, they opted into not being relayed if miners don't want to bother!\n\n[quote=\"ajtowns, post:2, topic:159\"]\nThis approach would perhaps be incompatible with non-consensus “prior restraint” features though: miners and users could easily just remove those features and maintain a network like this.\n[/quote]\n\nI don't see what's incompatible? Miners would include a tx if it's in the top, and not include if not. 1MvB is the strictest possible setting, and better for the user that doesn't want to be pinned as long as they're aggressively bumping fees on whatever schedule they need. The problem would be if miners decide to relax this restriction, allowing a potentially junkier backlog build. I don't know why miners would want to do that.\n\n[quote=\"ajtowns, post:2, topic:159\"]\nOne approach to allowing a backlog while reducing the impact of free relay might be to make backlog relay unreliable.\n[/quote]\n\nI'd have to think way harder on this, but I don't think this is a crazy direction, no. I am not sure I'd even call it free relay, if we're relaying less. We might need a more concrete definition, but pushing down how much we relay to prevent free relay seems right!\n\n[quote=\"ajtowns, post:2, topic:159\"]\nI really feel like “pinning” is a fundamental design bug…\n[/quote]\n\n*handwave cluster mempool into existence*\n\nAn alternative and unbaked selective relay take could be to not only weigh the \"depth\" it is in the mempool/backlog, but also \"how many vbytes away from top block\" it is with respect to its preceding chunks in the cluster.\n\nIf a newly proposed chunk in a cluster linearizes to \"just after\" top block chunks, and the new chunk itself is below Y kvB, where the size is not >> \"smallest reasonable package attempts\", we accept and relay it. Taking V3 magic values for this example, we could allow 1 kvB \"extra\" in clusters. An adversary pays top block to stuff a cluster, or pays minfee to fill up the last 1 kvB which can be efficiently RBF'd, at least as well as V3 child txns can.\n\nIn this scenario, we could just make \"large\" lower fee chunks relay unreliably. Casual users making smaller txns would not be effected unless they do consolidations or longer chains, depending on the Y you pick which directly influences the amount of pinning possible.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 31,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Part of my thinking on this priority based system is that it seems to be closer to compatible than V3 style, in that if it profits the next N blocks(let’s say very small numbers only), I think it basically approximates the type of selective relay you suggest, just in an opt-in manner? Bonus is a us&hellip;",
  "truncated": true,
  "post_url": "/t/opt-in-transaction-policies-for-anti-pinning/159/3",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}