{
  "id": 502,
  "name": "Pieter Wuille",
  "username": "sipa",
  "avatar_template": "/user_avatar/delvingbitcoin.org/sipa/{size}/1100_2.png",
  "created_at": "2023-11-28T00:26:32.524Z",
  "cooked": "<p>EDIT: this theorem is insufficient, as it doesn’t allow for cases where the moved good transactions get chunked together with bad transactions; a scenario that is possible in the prefix-intersection merging algorithm.</p>\n<h3><a name=\"theorem-1\" class=\"anchor\" href=\"#theorem-1\"></a>Theorem</h3>\n<p>Given the following:</p>\n<ul>\n<li>A linearization <span class=\"math\">L</span></li>\n<li>A topologically valid subset <span class=\"math\">T</span> of the transactions in <span class=\"math\">L</span> (which we’ll call “good” transactions).</li>\n<li>The good transactions merge into a single chunk of feerate <span class=\"math\">f</span>, when considered in the order they appear in in <span class=\"math\">L</span>.</li>\n<li>The highest chunk feerate of the bad transactions, again retaining the order of <span class=\"math\">L</span>, does not exceed <span class=\"math\">f</span>.</li>\n</ul>\n<p>Under those conditions, moving the good transactions to the front of the linearization (leaving the internal order of good transactions and that of bad transactions unchanged) results in a better or equivalent linearization (by becoming the new first chunk, of feerate <span class=\"math\">f</span>).</p>\n<h3><a name=\"proof-2\" class=\"anchor\" href=\"#proof-2\"></a>Proof</h3>\n<p>Observe that, among the set of linearizations for the same transactions which leave the internal orderings unchanged, none can give rise to a chunk feerate exceeding <span class=\"math\">f</span>. If it did, there must be some topologically valid subset <span class=\"math\">v</span> of transactions, consisting of a union of a prefix of the good transactions and a prefix of the bad transactions, whose combined feerate exceeds <span class=\"math\">f</span>. No prefix of the bad transactions can exceed feerate <span class=\"math\">f</span>, thus there must be a prefix of the good transactions that does. This is in contradiction with the given fact that all the good transactions merge into a single chunk of feerate <span class=\"math\">f</span>.</p>\n<p>Further observe that all good transactions merging into a single chunk of feerate <span class=\"math\">f</span> implies that any suffix of good transactions has feerate <span class=\"math\">\\geq f</span>.</p>\n<p>To prove that moving all good transactions to the front of the linearization always results in a better or equivalent linearization as the original, we will show that the following algorithm never worsens the diagram, and terminates when all the good transactions are in front:</p>\n<ul>\n<li>Compute the chunking <span class=\"math\">(c_0, c_1, \\ldots, c_n)</span> of the current linearization, merging equal-feerate chunks (this does not break the monotonic decrease property, and guarantees each <span class=\"math\">c_i</span> has distinct feerate).</li>\n<li>Find the last chunk index <span class=\"math\">t</span> such that <span class=\"math\">c_t \\cap T \\neq \\emptyset</span>.</li>\n<li>Modify the linearization by reordering the <span class=\"math\">c_t</span> transactions such that all of <span class=\"math\">c_t \\cap T</span> are at the start of <span class=\"math\">c_t</span>.</li>\n<li>Repeat (which implies rechunking).</li>\n</ul>\n<p>To show that this never worsens the diagram, it suffices to see that reordering transactions within a chunk at worst leaves the chunk unchanged, and at best splits it, which improves the diagram.</p>\n<p>Further, this algorithm makes progress as long as <span class=\"math\">c_t</span> does not start with all its good transactions. As long as that is the case, a nonzero amount of progress towards having all the good transactions at the start of the linearization is made. Thus, after a finite number of such steps, that end state must be reached.</p>\n<p>It remains to be shown that <span class=\"math\">c_t</span> cannot start with all its good transactions unless the end state is reached. Assume it does start with all its good transactions. The set <span class=\"math\">c_t \\cap T</span> is a suffix of the good transactions, and thus has feerate <span class=\"math\">\\geq f</span>. Since <span class=\"math\">c_t</span> <em>starts</em> with <span class=\"math\">c_t \\cap T</span>, the chunk <span class=\"math\">c_t</span> itself must have feerate <span class=\"math\">\\geq f</span>. However, every chunk must have feerate <span class=\"math\">\\leq f</span>. The combination of those two means <span class=\"math\">c_t</span> has <em>exactly</em> feerate <span class=\"math\">f</span>. There can only be one such chunk (as all <span class=\"math\">c_i</span> have distinct feerates), and it must be the first one (because no higher feerate is possible), so <span class=\"math\">t=0</span>. In this case, we are in the end state, because the first chunk is the only one with good transactions, and all good transactions are at its front.</p>",
  "post_number": 24,
  "post_type": 1,
  "posts_count": 46,
  "updated_at": "2023-11-29T19:01:17.049Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 2,
  "reads": 30,
  "readers_count": 29,
  "score": 21.0,
  "yours": false,
  "topic_id": 209,
  "topic_slug": "merging-incomparable-linearizations",
  "topic_title": "Merging incomparable linearizations",
  "topic_html_title": "Merging incomparable linearizations",
  "category_id": 8,
  "display_username": "Pieter Wuille",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 8,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "EDIT: this theorem is insufficient, as it doesn't allow for cases where the moved good transactions get chunked together with bad transactions; a scenario that is possible in the prefix-intersection merging algorithm.\n\n### Theorem\n\nGiven the following:\n* A linearization $L$\n* A topologically valid subset $T$ of the transactions in $L$ (which we'll call \"good\" transactions).\n* The good transactions merge into a single chunk of feerate $f$, when considered in the order they appear in in $L$.\n* The highest chunk feerate of the bad transactions, again retaining the order of $L$, does not exceed $f$.\n\nUnder those conditions, moving the good transactions to the front of the linearization (leaving the internal order of good transactions and that of bad transactions unchanged) results in a better or equivalent linearization (by becoming the new first chunk, of feerate $f$).\n\n### Proof\n\nObserve that, among the set of linearizations for the same transactions which leave the internal orderings unchanged, none can give rise to a chunk feerate exceeding $f$. If it did, there must be some topologically valid subset $v$ of transactions, consisting of a union of a prefix of the good transactions and a prefix of the bad transactions, whose combined feerate exceeds $f$. No prefix of the bad transactions can exceed feerate $f$, thus there must be a prefix of the good transactions that does. This is in contradiction with the given fact that all the good transactions merge into a single chunk of feerate $f$.\n\nFurther observe that all good transactions merging into a single chunk of feerate $f$ implies that any suffix of good transactions has feerate $\\geq f$.\n\nTo prove that moving all good transactions to the front of the linearization always results in a better or equivalent linearization as the original, we will show that the following algorithm never worsens the diagram, and terminates when all the good transactions are in front:\n* Compute the chunking $(c_0, c_1, \\ldots, c_n)$ of the current linearization, merging equal-feerate chunks (this does not break the monotonic decrease property, and guarantees each $c_i$ has distinct feerate).\n* Find the last chunk index $t$ such that $c_t \\cap T \\neq \\emptyset$.\n* Modify the linearization by reordering the $c_t$ transactions such that all of $c_t \\cap T$ are at the start of $c_t$.\n* Repeat (which implies rechunking).\n\nTo show that this never worsens the diagram, it suffices to see that reordering transactions within a chunk at worst leaves the chunk unchanged, and at best splits it, which improves the diagram.\n\nFurther, this algorithm makes progress as long as $c_t$ does not start with all its good transactions. As long as that is the case, a nonzero amount of progress towards having all the good transactions at the start of the linearization is made. Thus, after a finite number of such steps, that end state must be reached.\n\nIt remains to be shown that $c_t$ cannot start with all its good transactions unless the end state is reached. Assume it does start with all its good transactions. The set $c_t \\cap T$ is a suffix of the good transactions, and thus has feerate $\\geq f$. Since $c_t$ *starts* with $c_t \\cap T$, the chunk $c_t$ itself must have feerate $\\geq f$. However, every chunk must have feerate $\\leq f$. The combination of those two means $c_t$ has *exactly* feerate $f$. There can only be one such chunk (as all $c_i$ have distinct feerates), and it must be the first one (because no higher feerate is possible), so $t=0$. In this case, we are in the end state, because the first chunk is the only one with good transactions, and all good transactions are at its front.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 96,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "EDIT: this theorem is insufficient, as it doesn’t allow for cases where the moved good transactions get chunked together with bad transactions; a scenario that is possible in the prefix-intersection merging algorithm. \n<a name=\"theorem-1\" class=\"anchor\" href=\"#theorem-1\"></a>Theorem\nGiven the following: \n\nA linearization L\nA topologically valid subset T o&hellip;",
  "truncated": true,
  "post_url": "/t/merging-incomparable-linearizations/209/24",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}