{
  "id": 5832,
  "name": "",
  "username": "cedarctic",
  "avatar_template": "/letter_avatar_proxy/v4/letter/c/3d9bf3/{size}.png",
  "created_at": "2025-09-04T10:52:07.698Z",
  "cooked": "<h2><a name=\"p-5832-summary-1\" class=\"anchor\" href=\"#p-5832-summary-1\"></a>Summary</h2>\n<p>This post contains a collection of my findings on an attacker being able to eclipse Bitcoin nodes using interception attacks - a stealthier variant of the standard BGP hijack.</p>\n<p><strong>Key takeaways:</strong> The attack seems to be feasible against many nodes in the network, and I was able to produce a proof-of-concept by attacking my own mainnet node in an isolated environment. To hinder this type of attack, I looked into several mitigations, some of which use networking data that the node can observe independently.</p>\n<p>The rest of the post presents the attack in detail, looks into its feasibility, presents findings from a proof-of-concept implementation, discusses networking data that can be used in defenses, and concludes with a description of the proposed mitigations.</p>\n<details>\n<summary>\nParagraphs with more details to them have them in toggle lists like this one. Click to see more.</summary>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=dQw4w9WgXcQ\" rel=\"noopener nofollow ugc\"><img src=\"https://delvingbitcoin.org/images/emoji/twitter/goose.png?v=14\" title=\":goose:\" class=\"emoji only-emoji\" alt=\":goose:\" loading=\"lazy\" width=\"20\" height=\"20\"></a></li>\n</ul>\n</details>\n<h2><a name=\"p-5832-background-2\" class=\"anchor\" href=\"#p-5832-background-2\"></a>Background</h2>\n<p><strong>BGP and BGP hijacks:</strong> BGP is the protocol used by routers in the backbone of the internet to establish routes between a source and a destination. These routers belong to Autonomous Systems (ASes) (e.g: Verizon, AT&amp;T) and exchange announcements about IP prefixes to form paths to them. Because the protocol lacks authentication, an attacker can perform a BGP hijack by making a false announcement that is preferred over the legitimate one by the BGP best path selection algorithm. The attacker then diverts traffic from the legitimate destination to themselves. An attacker can partition Bitcoin this way (see [<a href=\"https://btc-hijack.ethz.ch/files/btc_hijack.pdf\" rel=\"noopener nofollow ugc\">4</a>]).</p>\n<p><strong>Interception (SICO) attacks:</strong> This is a stealthier variant of traditional BGP hijacks that also makes it easier to intercept and forward traffic to the legitimate destination. The attacker does this by limiting how their malicious announcements spread by tagging them with metadata known as BGP communities. This allows the attacker to evade BGP route monitors that can detect the attack, and maintain a path to the legitimate destination to forward traffic (see [<a href=\"https://www.cs.princeton.edu/~jrex/papers/sico19.pdf\" rel=\"noopener nofollow ugc\">5</a>], [<a href=\"https://arxiv.org/pdf/2408.09622\" rel=\"noopener nofollow ugc\">6</a>] for details).</p>\n<details>\n<summary>\nDetails on interception attacks</summary>\n<p>The attacker announces malicious BGP routes to the IP prefixes to which they want to intercept traffic. In these announcements the attacker claims to be the origin of the IP prefix or a hop in the path to the prefix. Routers that accept the announcement will route their traffic to the legitimate destination through the adversary.</p>\n<p>The attacker attaches BGP communities (e.g NoExportSelect, LowerPref) to their announcements to limit their propagation to specific ASes. This makes the attack stealthier and more practical, since announcements are observed by fewer ASes and the adversary attracts less traffic. This also allows the multi-homed adversary AS to maintain a route to the legitimate destination and forward traffic to it, turning the attacker into a man-in-the-middle (MITM).</p>\n</details>\n<p><strong>Eclipse attacks:</strong> The goal of the attacker is to control all incoming and outgoing connections to a node. This allows the attacker to waste mining power, do selfish mining, double spend, attack Lightning, etc [<a href=\"https://ihchoi12.github.io/assets/tran2020stealthier.pdf\" rel=\"noopener nofollow ugc\">1</a>]. This was previously done by polluting AddrMan’s tables with IPs that the attacker controlled [<a href=\"https://www.usenix.org/system/files/conference/usenixsecurity15/sec15-paper-heilman.pdf\" rel=\"noopener nofollow ugc\">2</a>], or was on the path to [<a href=\"https://ihchoi12.github.io/assets/tran2020stealthier.pdf\" rel=\"noopener nofollow ugc\">1</a>]. Core has mitigated these eclipsing methods by making changes to AddrMan.</p>\n<h2><a name=\"p-5832-attack-description-3\" class=\"anchor\" href=\"#p-5832-attack-description-3\"></a>Attack Description</h2>\n<p><strong>Requirements:</strong> The attacker controls a multi-peer AS by either <a href=\"https://www.coinbase.com/blog/celer-bridge-incident-analysis\" rel=\"noopener nofollow ugc\">compromising one</a> or <a href=\"https://nick.bouwhuis.net/posts/2023-02-12-setting-up-a-personal-asn/\" rel=\"noopener nofollow ugc\">setting up their own</a>.</p>\n<p>The attacker aims to intercept or control all victim node connections by the end of the attack by taking the following steps:</p>\n<ol>\n<li>\n<p>Continuously attempt to occupy incoming connection slots and avoid being evicted. This is done by using addresses in different network groups, relaying blocks and transactions, and having low latency (see [<a href=\"https://www.academia.edu/download/87294469/3460120.pdf\" rel=\"noopener nofollow ugc\">3</a>] for details).</p>\n</li>\n<li>\n<p>Compromise or set up a new AS as close (in number of AS hops) to the victim node AS as possible. This helps the attacker’s announcements to be preferred over legitimate ones by the BGP best path selection algorithm (AS path length criterion).</p>\n</li>\n<li>\n<p>Build a database of known Bitcoin nodes and their IP prefixes. This is done by running a node or using data like that from Bitnodes snapshots, etc.</p>\n</li>\n<li>\n<p>Sort IP prefixes by number of nodes and hijack them in succession at a rate that will not raise alarms. The attacker attaches BGP communities to limit the spread of the malicious advertisements to as few ASes as possible, and maintain a route to forward traffic to the legitimate destination.</p>\n</li>\n<li>\n<p>Observe the intercepted traffic and identify Bitcoin connections by known IPs and ports from Step 3.</p>\n<ol>\n<li>\n<p>If no Bitcoin traffic is observed for a hijacked prefix, stop hijacking it</p>\n</li>\n<li>\n<p>If Bitcoin traffic is seen:</p>\n<ol>\n<li>\n<p>If the peer’s IP is public, maintain the hijack as it is possibly an outbound connection</p>\n<ol>\n<li>\n<p>If it’s an <a href=\"https://github.com/bitcoin/bips/blob/4d6cd518a04a4101f3cd833cd18b1f31facbc129/bip-0324.mediawiki\" rel=\"noopener nofollow ugc\">encrypted V2 connection</a>, continue forwarding and intercepting traffic</p>\n</li>\n<li>\n<p>If it’s a V1 connection, impersonate it (or continue forwarding and intercepting)</p>\n</li>\n</ol>\n</li>\n<li>\n<p>If the peer’s IP is private, the connection is inbound. Reset the connection, and then occupy its slot with an attacker-controlled node. Finally, withdraw the route.</p>\n</li>\n</ol>\n</li>\n</ol>\n</li>\n<li>\n<p>Test to see if the victim is eclipsed: submit a transaction to the victim node and drop or delay traffic to the hijacked connections. Then check if the transaction propagates. At this point the attacker only has to maintain up to as many prefix hijacks as the number of connections it intercepts.</p>\n</li>\n</ol>\n<details>\n<summary>\nNote on asymmetric routing</summary>\n<p>Because internet routing can be asymmetric, if the attacker wishes to intercept both directions of the communication, they may have to make one additional prefix announcement for the victim’s prefix that targets the routers on the inbound path.</p>\n</details>\n<h2><a name=\"p-5832-attack-feasibility-4\" class=\"anchor\" href=\"#p-5832-attack-feasibility-4\"></a>Attack Feasibility</h2>\n<p>An attacker is successful in launching the attack if they manage to remain unnoticed while hijacking prefixes, and if their malicious BGP announcements are preferred over the legitimate ones. To remain stealthy, an attacker evades route monitors by limiting the spread of their announcements using BGP communities (see [<a href=\"https://arxiv.org/pdf/2408.09622\" rel=\"noopener nofollow ugc\">6</a>] for details), hijacking as few prefixes as possible, and doing so at a rate that won’t raise suspicions. The success of the malicious announcement depends on the victim prefixes and the attacker’s position in the network.</p>\n<p>To judge the feasibility of the attack, the rest of this section answers the following questions:</p>\n<ol>\n<li>\n<p>How many prefixes does the attacker have to hijack at most?</p>\n</li>\n<li>\n<p>Can the attacker hijack these prefixes at a reasonable time frame?</p>\n</li>\n<li>\n<p>How vulnerable are Bitcoin node prefixes to BGP hijacks?</p>\n</li>\n<li>\n<p>What is the probability that the attacker’s announcements will be preferred over the legitimate ones?</p>\n</li>\n</ol>\n<h3><a name=\"p-5832-h-1-number-of-prefixes-5\" class=\"anchor\" href=\"#p-5832-h-1-number-of-prefixes-5\"></a>1. Number of prefixes</h3>\n<p>Using a snapshot from <a href=\"https://bitnodes.io/\" rel=\"noopener nofollow ugc\">Bitnodes</a> we can see that <strong>all reachable nodes reside in just 4551 prefixes</strong> (the internet has over <a href=\"https://www.radb.net/\" rel=\"noopener nofollow ugc\">1,155,000 allocated prefixes</a>). Furthermore, the attacker can cover more than ~55% of reachable nodes by hijacking just 1000 prefixes.\n<div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/6/6279ae7a3ddabacb9fe5f9519da1779ddd01aeca.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/6279ae7a3ddabacb9fe5f9519da1779ddd01aeca\" title=\"Distribution of reachable Bitcoin nodes over IP prefixes. 55% of nodes reside in just 1000 prefixes\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/6/6279ae7a3ddabacb9fe5f9519da1779ddd01aeca_2_517x309.png\" alt=\"Distribution of reachable Bitcoin nodes over IP prefixes. 55% of nodes reside in just 1000 prefixes\" data-base62-sha1=\"e39uBvtQKejWPz4ubxbGD2yi3zQ\" width=\"517\" height=\"309\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/6/6279ae7a3ddabacb9fe5f9519da1779ddd01aeca_2_517x309.png, https://delvingbitcoin.org/uploads/default/optimized/2X/6/6279ae7a3ddabacb9fe5f9519da1779ddd01aeca_2_775x463.png 1.5x, https://delvingbitcoin.org/uploads/default/original/2X/6/6279ae7a3ddabacb9fe5f9519da1779ddd01aeca.png 2x\" data-dominant-color=\"FBFBFC\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">Distribution of reachable Bitcoin nodes over IP prefixes. 55% of nodes reside in just 1000 prefixes</span><span class=\"informations\">1000×600 28.1 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<h3><a name=\"p-5832-h-2-hijack-rate-6\" class=\"anchor\" href=\"#p-5832-h-2-hijack-rate-6\"></a>2. Hijack rate</h3>\n<p>Seeking to remain unnoticed, the attacker limits the rate of their announcements and minimizes the duration for which they remain active. In 2024 BGP routers received on average <a href=\"https://www.potaroo.net/ispcol/2025-01/bgpupd2024.html\" rel=\"noopener nofollow ugc\">over 200,000 BGP announcements per day</a>. An attacker seeking to eclipse a node over the course of 10 days will cause just a 0.23% increase in announcement volume if they have to hijack all reachable node prefixes. Furthermore, because the vast majority of malicious announcements do not have to be long lived, they are more likely blend in with benign misconfigurations.</p>\n<p>Graphs: Number of BGP route announcements and withdrawals for IPv4 and IPv6 prefixes as observed by a vantage point. Source: Geoff Huston - <a href=\"https://www.potaroo.net/ispcol/2025-01/bgpupd2024.html\" rel=\"noopener nofollow ugc\">ISP Column - January 2025</a>\n<div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/3/3b4d790657a79fe77da03d95321b941f991f8593.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/3b4d790657a79fe77da03d95321b941f991f8593\" title=\"image\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/3/3b4d790657a79fe77da03d95321b941f991f8593_2_345x207.png\" alt=\"image\" data-base62-sha1=\"8sC9DdFJ2PGOACE1keXaTiyqN47\" width=\"345\" height=\"207\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/3/3b4d790657a79fe77da03d95321b941f991f8593_2_345x207.png, https://delvingbitcoin.org/uploads/default/optimized/2X/3/3b4d790657a79fe77da03d95321b941f991f8593_2_517x310.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/3/3b4d790657a79fe77da03d95321b941f991f8593_2_690x414.png 2x\" data-dominant-color=\"E6F0F6\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">image</span><span class=\"informations\">1500×900 42.6 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/9/91cf1c6de4fa960d0cf1e4a18bb064e017dcba80.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/91cf1c6de4fa960d0cf1e4a18bb064e017dcba80\" title=\"image 1\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/9/91cf1c6de4fa960d0cf1e4a18bb064e017dcba80_2_345x207.png\" alt=\"image 1\" data-base62-sha1=\"kNSXVBbzeDG3l0gVV6e6gTavPNe\" width=\"345\" height=\"207\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/9/91cf1c6de4fa960d0cf1e4a18bb064e017dcba80_2_345x207.png, https://delvingbitcoin.org/uploads/default/optimized/2X/9/91cf1c6de4fa960d0cf1e4a18bb064e017dcba80_2_517x310.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/9/91cf1c6de4fa960d0cf1e4a18bb064e017dcba80_2_690x414.png 2x\" data-dominant-color=\"E7F1F6\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">image 1</span><span class=\"informations\">1500×900 44.6 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<h3><a name=\"p-5832-h-3-prefix-vulnerability-7\" class=\"anchor\" href=\"#p-5832-h-3-prefix-vulnerability-7\"></a>3. Prefix vulnerability</h3>\n<p>We find that the attacker can <strong>always successfully hijack 41.13% of node prefixes</strong> either because they have overly permissive <a href=\"https://www.arin.net/resources/manage/rpki/roa_request/\" rel=\"noopener nofollow ugc\">ROAs</a> or lack an ROA and use a shorter prefix than the longest one that BGP routers will propagate (see detailed analysis below). For the remaining <strong>59.87%</strong> of prefixes, the attacker’s announcement will have to <strong>compete with the legitimate one</strong> if a router receives both announcements.</p>\n<details>\n<summary>\nDetailed analysis of IP prefix vulnerability</summary>\n<p>For the attacker to be successful, their route announcement needs to be preferred over the legitimate one by other BGP routers. This depends on a number of factors including the IP prefix having a <a href=\"https://www.arin.net/resources/manage/rpki/roa_request/\" rel=\"noopener nofollow ugc\">Route Origin Authorization (ROA)</a> - which only allows the ROA holder to announce the prefix as the origin-, the permissiveness of the ROA, the length of the announced prefix, and the attacker’s topological position in relation to the BGP routers that receive the malicious announcement. We discuss the following 4 possible cases and how the attacker handles them:</p>\n<p><strong>Case 1: No ROA, and legitimate prefix length &lt; maximum length - 13.29% of prefixes</strong></p>\n<p>The absence of an ROA allows the attacker to announce that they are the origin of the prefix. Because the legitimate prefix announcement is shorter than the maximum length which BGP routers will propagate, the attacker can announce a longer prefix (more-specific), and their announcement will be preferred over the legitimate.</p>\n<p><strong>Case 2: No ROA, and legitimate prefix length == maximum length - 4.39% of prefixes</strong></p>\n<p>The attacker can still claim to be the origin, and make an announcement with the same prefix length as the legitimate one. The decision between adopting the attacker’s route or the legitimate one will depend on the <a href=\"https://www.cisco.com/c/en/us/support/docs/ip/border-gateway-protocol-bgp/13753-25.html\" rel=\"noopener nofollow ugc\">BGP best path selection algorithm</a> as configured on the router that observes the routes.</p>\n<p><strong>Case 3: ROA exists but is overly permissive, and legitimate prefix length &lt; maximum length - 27.84% of prefixes</strong></p>\n<p>The existence of an ROA prevents the attacker from announcing themselves as the prefix origin, but allows them to make an announcement where they are the second hop in the path. The attacker can do this regardless of them being connected to the legitimate origin. Because the ROA is overly permissive, the attacker can make more specific prefix announcements, making their announcements preferable to the legitimate ones (see [<a href=\"https://open.bu.edu/bitstream/2144/29023/2/p101-Gilad.pdf\" rel=\"noopener nofollow ugc\">7</a>] for details).</p>\n<p><strong>Case 4: ROA exists but is not overly permissive, or legitimate prefix length == maximum length - 54.48% of prefixes</strong></p>\n<p>The attacker cannot claim to be the origin because of the ROA, and instead claims that they are the second hop in the path. Similar to Case 2, the attacker announces the same prefix as the legitimate one and competes with it. Routers that receive both announcements select a path using the BGP best path selection algorithm.</p>\n</details>\n<h3><a name=\"p-5832-h-4-malicious-announcement-acceptance-8\" class=\"anchor\" href=\"#p-5832-h-4-malicious-announcement-acceptance-8\"></a>4. Malicious announcement acceptance</h3>\n<p>For the 59.87% of node prefixes that the attacker’s malicious routes will have to compete with the legitimate ones, the attacker can influence the <a href=\"https://www.cisco.com/c/en/us/support/docs/ip/border-gateway-protocol-bgp/13753-25.html\" rel=\"noopener nofollow ugc\">BGP best path selection algorithm</a> in their favor by placing themselves as close to the victim as possible to influence the AS path length criterion.</p>\n<p>The success rate and feasibility of the attack depends on the victim. The figure below quantifies this for a victim node in AS 31034. The x axis represents the number of hops away (in number of ASes) that the adversary AS is from the victim AS. The y axis shows the number of Bitcoin nodes that the adversary intercepts in blue, and in red the number of ASes that exist up to that number of hops away from the victim AS which the attacker can potentially compromise. For instance, an attacker can compromise one of 10,000+ ASes that are 3 or fewer hops away from the victim, and successfully hijack connections to over 85% of reachable nodes.</p>\n<p><em>Note: some reachable nodes are excluded from the figure (see collapsible section for details).</em></p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/3/3b6abce77270328dcce4e070d18b84ca919ec249.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/3b6abce77270328dcce4e070d18b84ca919ec249\" title=\"31034_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/3/3b6abce77270328dcce4e070d18b84ca919ec249_2_517x309.png\" alt=\"31034_cdf\" data-base62-sha1=\"8tCR3bkIL0PCND4PCsKQf5CuPot\" width=\"517\" height=\"309\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/3/3b6abce77270328dcce4e070d18b84ca919ec249_2_517x309.png, https://delvingbitcoin.org/uploads/default/optimized/2X/3/3b6abce77270328dcce4e070d18b84ca919ec249_2_775x463.png 1.5x, https://delvingbitcoin.org/uploads/default/original/2X/3/3b6abce77270328dcce4e070d18b84ca919ec249.png 2x\" data-dominant-color=\"FAF9FA\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">31034_cdf</span><span class=\"informations\">1000×600 39.3 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<details>\n<summary>\nMore details on the malicious announcement acceptance rate study</summary>\n<p>This analysis studies 13 random <a href=\"https://bitnodes.io/nodes/leaderboard/\" rel=\"noopener nofollow ugc\">“important” nodes (by Bitnodes PIX score)</a> in different regions as the candidate victims. These are nodes with characteristics such as high uptime, low latency, up-to-date block heights etc. that are desirable in nodes that are relied on for commercial activity.</p>\n<p>Using the IPs of these nodes, we estimate the paths between them and all other reachable Bitcoin nodes using a path estimation algorithm [<a href=\"https://citeseerx.ist.psu.edu/document?repid=rep1&amp;type=pdf&amp;doi=e9ec2d172b7657a238a467a25a08806dfb1931d1\" rel=\"noopener nofollow ugc\">8</a>]. By taking into consideration the ROAs, prefix lengths, and AS path length (as determined by the adversary’s hop count away from the victim) we can count the number of nodes for which the adversary’s announcement would be preferred over the legitimate one.</p>\n<p>The general trend shown by the figures is that as the distance from the victim node increases, the opportunities for the attacker to compromise or setup their own peering AS also increase, but the number of nodes for which they can successfully make malicious prefix announcements decreases. The plateau that appears on the number of hijackable peers in the graphs is explained by the prefixes that the attacker can always successfully hijack (see Cases 1 &amp; 3 in the collapsible paragraphs in the “Prefix vulnerability” subsection). In cases such as that of the victim node in AS 16125, the attacker can compromise or peer with one of tens of thousands of ASes up to 5 hops away and still be able to make malicious prefix announcements that cover the vast majority of reachable nodes.</p>\n<p><em>Note:</em> due to limitations of the path estimation algorithm, we have excluded the reachable nodes for which we could not calculate a valid route.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/e/ec6a08b30311c409436ec93aa323ec799505f23b.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/ec6a08b30311c409436ec93aa323ec799505f23b\" title=\"3356_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/e/ec6a08b30311c409436ec93aa323ec799505f23b_2_345x206.png\" alt=\"3356_cdf\" data-base62-sha1=\"xJpRj0vJLnAhUdSpDvVPrAzXSpZ\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/e/ec6a08b30311c409436ec93aa323ec799505f23b_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/e/ec6a08b30311c409436ec93aa323ec799505f23b_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/e/ec6a08b30311c409436ec93aa323ec799505f23b_2_690x412.png 2x\" data-dominant-color=\"F9F8FB\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">3356_cdf</span><span class=\"informations\">1000×600 35.3 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/0/0a9402496cc50e3e06f57d37fc61e55498956817.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/0a9402496cc50e3e06f57d37fc61e55498956817\" title=\"13259_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/0/0a9402496cc50e3e06f57d37fc61e55498956817_2_345x206.png\" alt=\"13259_cdf\" data-base62-sha1=\"1vzSHS1yhZ503CPjeuFC9U41FwX\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/0/0a9402496cc50e3e06f57d37fc61e55498956817_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/0/0a9402496cc50e3e06f57d37fc61e55498956817_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/0/0a9402496cc50e3e06f57d37fc61e55498956817_2_690x412.png 2x\" data-dominant-color=\"FAF9FB\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">13259_cdf</span><span class=\"informations\">1000×600 40.5 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/4/4cba09d9fb3783c0c5f91bc8c01b30eb8a9b9245.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/4cba09d9fb3783c0c5f91bc8c01b30eb8a9b9245\" title=\"7738_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/4/4cba09d9fb3783c0c5f91bc8c01b30eb8a9b9245_2_345x206.png\" alt=\"7738_cdf\" data-base62-sha1=\"aWKS9dbpvP4gA9dr7LFP3HECjjL\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/4/4cba09d9fb3783c0c5f91bc8c01b30eb8a9b9245_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/4/4cba09d9fb3783c0c5f91bc8c01b30eb8a9b9245_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/4/4cba09d9fb3783c0c5f91bc8c01b30eb8a9b9245_2_690x412.png 2x\" data-dominant-color=\"FAF9FB\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">7738_cdf</span><span class=\"informations\">1000×600 38 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/2/2abd4e99fd837f7a149e3f7b339c7afcb7564713.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/2abd4e99fd837f7a149e3f7b339c7afcb7564713\" title=\"6772_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/2/2abd4e99fd837f7a149e3f7b339c7afcb7564713_2_345x206.png\" alt=\"6772_cdf\" data-base62-sha1=\"665DOFWhVoXtg8FhqMnMlld2ZYT\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/2/2abd4e99fd837f7a149e3f7b339c7afcb7564713_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/2/2abd4e99fd837f7a149e3f7b339c7afcb7564713_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/2/2abd4e99fd837f7a149e3f7b339c7afcb7564713_2_690x412.png 2x\" data-dominant-color=\"FAF9FA\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">6772_cdf</span><span class=\"informations\">1000×600 39.8 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/9/9b7012732003e90d96c81edd633bfa6795750c0f.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/9b7012732003e90d96c81edd633bfa6795750c0f\" title=\"4049_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/9/9b7012732003e90d96c81edd633bfa6795750c0f_2_345x206.png\" alt=\"4049_cdf\" data-base62-sha1=\"mb47vYdsRYv97Euu2KerLuuG8AD\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/9/9b7012732003e90d96c81edd633bfa6795750c0f_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/9/9b7012732003e90d96c81edd633bfa6795750c0f_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/9/9b7012732003e90d96c81edd633bfa6795750c0f_2_690x412.png 2x\" data-dominant-color=\"FAF9FA\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">4049_cdf</span><span class=\"informations\">1000×600 39.7 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/f/f23bcbf5c625efe03cb103f119b4c03456a0dfa1.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/f23bcbf5c625efe03cb103f119b4c03456a0dfa1\" title=\"16125_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/f/f23bcbf5c625efe03cb103f119b4c03456a0dfa1_2_345x206.png\" alt=\"16125_cdf\" data-base62-sha1=\"yyTF1GmaepOFzqJjRqbKBf4NRbb\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/f/f23bcbf5c625efe03cb103f119b4c03456a0dfa1_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/f/f23bcbf5c625efe03cb103f119b4c03456a0dfa1_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/f/f23bcbf5c625efe03cb103f119b4c03456a0dfa1_2_690x412.png 2x\" data-dominant-color=\"FAF9FA\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">16125_cdf</span><span class=\"informations\">1000×600 39 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/8/853756de4fd5291e7d9727732cb7da7ebc009f51.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/853756de4fd5291e7d9727732cb7da7ebc009f51\" title=\"45102_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/8/853756de4fd5291e7d9727732cb7da7ebc009f51_2_345x206.png\" alt=\"45102_cdf\" data-base62-sha1=\"j0u4bBUGaCvbWavi9sjhDHiVDix\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/8/853756de4fd5291e7d9727732cb7da7ebc009f51_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/8/853756de4fd5291e7d9727732cb7da7ebc009f51_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/8/853756de4fd5291e7d9727732cb7da7ebc009f51_2_690x412.png 2x\" data-dominant-color=\"FAF9FA\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">45102_cdf</span><span class=\"informations\">1000×600 39 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/8/810c3066ef63fae959e751ccc9aad7e9240f43ac.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/810c3066ef63fae959e751ccc9aad7e9240f43ac\" title=\"34385_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/8/810c3066ef63fae959e751ccc9aad7e9240f43ac_2_345x206.png\" alt=\"34385_cdf\" data-base62-sha1=\"ipBHW3t0izqeSzFxps5e0uSgXj6\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/8/810c3066ef63fae959e751ccc9aad7e9240f43ac_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/8/810c3066ef63fae959e751ccc9aad7e9240f43ac_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/8/810c3066ef63fae959e751ccc9aad7e9240f43ac_2_690x412.png 2x\" data-dominant-color=\"FAF9FA\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">34385_cdf</span><span class=\"informations\">1000×600 39.9 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/f/fd5e912bd93f27673d745692b0e35e5b8f15e26a.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/fd5e912bd93f27673d745692b0e35e5b8f15e26a\" title=\"29686_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/f/fd5e912bd93f27673d745692b0e35e5b8f15e26a_2_345x206.png\" alt=\"29686_cdf\" data-base62-sha1=\"A9ppmnBNGs3Xvd10Z0vyG6BEvO2\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/f/fd5e912bd93f27673d745692b0e35e5b8f15e26a_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/f/fd5e912bd93f27673d745692b0e35e5b8f15e26a_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/f/fd5e912bd93f27673d745692b0e35e5b8f15e26a_2_690x412.png 2x\" data-dominant-color=\"FAF9FA\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">29686_cdf</span><span class=\"informations\">1000×600 39.7 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/f/fec7aa66a9fbae0b33ffaa5780f68bbb6a1c57aa.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/fec7aa66a9fbae0b33ffaa5780f68bbb6a1c57aa\" title=\"21499_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/f/fec7aa66a9fbae0b33ffaa5780f68bbb6a1c57aa_2_345x206.png\" alt=\"21499_cdf\" data-base62-sha1=\"AlT3FiECklkvQez7id4EZUFf09A\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/f/fec7aa66a9fbae0b33ffaa5780f68bbb6a1c57aa_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/f/fec7aa66a9fbae0b33ffaa5780f68bbb6a1c57aa_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/f/fec7aa66a9fbae0b33ffaa5780f68bbb6a1c57aa_2_690x412.png 2x\" data-dominant-color=\"FAF9FA\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">21499_cdf</span><span class=\"informations\">1000×600 39.4 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/b/b0fc3c70b0a969681eb0c352b4c0f5062cf60985.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/b0fc3c70b0a969681eb0c352b4c0f5062cf60985\" title=\"55286_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/b/b0fc3c70b0a969681eb0c352b4c0f5062cf60985_2_345x206.png\" alt=\"55286_cdf\" data-base62-sha1=\"pfGrME6XnAgWpvUFPckf8hipx9r\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/b/b0fc3c70b0a969681eb0c352b4c0f5062cf60985_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/b/b0fc3c70b0a969681eb0c352b4c0f5062cf60985_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/b/b0fc3c70b0a969681eb0c352b4c0f5062cf60985_2_690x412.png 2x\" data-dominant-color=\"FAF9FB\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">55286_cdf</span><span class=\"informations\">1000×600 39.4 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/7/7a949d6f6587b7e7ef8be3ff69b4c3d2438def6e.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/7a949d6f6587b7e7ef8be3ff69b4c3d2438def6e\" title=\"60781_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/7/7a949d6f6587b7e7ef8be3ff69b4c3d2438def6e_2_345x206.png\" alt=\"60781_cdf\" data-base62-sha1=\"huoELwbaxD37POpJ9HeHbUBdXXg\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/7/7a949d6f6587b7e7ef8be3ff69b4c3d2438def6e_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/7/7a949d6f6587b7e7ef8be3ff69b4c3d2438def6e_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/7/7a949d6f6587b7e7ef8be3ff69b4c3d2438def6e_2_690x412.png 2x\" data-dominant-color=\"FAF9FA\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">60781_cdf</span><span class=\"informations\">1000×600 39.9 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/0/099238d56d62cc743ee9824b3fc2dac7fea1c9da.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/099238d56d62cc743ee9824b3fc2dac7fea1c9da\" title=\"60414_cdf\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/0/099238d56d62cc743ee9824b3fc2dac7fea1c9da_2_345x206.png\" alt=\"60414_cdf\" data-base62-sha1=\"1mFzJPq7VGGhzJHP61A0bQIe118\" width=\"345\" height=\"206\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/0/099238d56d62cc743ee9824b3fc2dac7fea1c9da_2_345x206.png, https://delvingbitcoin.org/uploads/default/optimized/2X/0/099238d56d62cc743ee9824b3fc2dac7fea1c9da_2_517x309.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/0/099238d56d62cc743ee9824b3fc2dac7fea1c9da_2_690x412.png 2x\" data-dominant-color=\"FAF9FA\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">60414_cdf</span><span class=\"informations\">1000×600 39.2 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n</details>\n<h2><a name=\"p-5832-proof-of-concept-9\" class=\"anchor\" href=\"#p-5832-proof-of-concept-9\"></a>Proof of Concept</h2>\n<p>To confirm the feasibility of the attack I emulated a simple AS topology with gateways to the real internet, and eclipsed my own Bitcoin node that was connected to the mainnet. This topology is illustrated in the figure below along with the path that traffic took before and after the attack.</p>\n<p>While performing the attack, I noticed that in certain cases, possibly due to reasons related to the emulation environment, some intercepted connections dropped because of a TCP RST packet sent from one of the hops on the path. To overcome this, I ran the attack script 6 more times, at which point I was intercepting all of my node’s connections, including anchor connections. Because anchor connections exchange less traffic, I had to expand the observation time window to ensure that the the attack script had the chance to observe anchor traffic in hijacked prefixes.</p>\n<details>\n<summary>\nAdditional emulation details</summary>\n<p>I emulated the AS topology shown below using <a href=\"https://www.notion.so/24-02-2025-Emulator-work-1a4163ec85c08067be13eabfa406aeff?pvs=21\" rel=\"noopener nofollow ugc\">SEED</a>. In this topology, AS 152 hosts the victim Bitcoin node which is connected to the emulator <a href=\"https://github.com/seed-labs/seed-emulator/blob/eff5a7fba2412bb90191934ae6f3c8ad1aeb9d25/misc/openvpn-remote-access/README.md\" rel=\"noopener nofollow ugc\">via a VPN tunnel</a>. AS 152 peers at Internet Exchange Point (IXP) 101 and peers with AS 2 which provides transit to IXP 100. At IXP 100, AS 998 acts as a provider to AS 2 and is a gateway to the real internet. This means that under normal operation traffic from the victim AS to the real internet flows as follows: 152→ 101→ 2 →100 → 998 → Internet.</p>\n<p>The attacker controls AS 157 which peers at IXP 100 and has ASes 999 and 998 as upstream providers. Like AS 998, AS 999 is a gateway to the real internet. AS 999 and AS 998 have a peer relationship with each other. During the attack, AS 157 makes malicious announcements to AS 998 claiming to be the second hop on the path to all reachable nodes. To avoid AS 999 also adopting the malicious routes, which would prevent AS 157 from intercepting and routing the traffic to the legitimate destination via AS 999, the attacker attaches the NoExport BGP community to its announcements.</p>\n<p>The attacker proceeds to hijack prefixes as described in the attack algorithm making the traffic from the victim AS destined to the hijacked prefixes flow as follows: AS 152 → 101→ 2 →100 → 998 → 100 → 157 → 100 → 999 → Internet.</p>\n</details>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/1/15ac3073840b405939dd570532b7dd1e9f1e8508.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/15ac3073840b405939dd570532b7dd1e9f1e8508\" title=\"Simulation topology annotated with the path that traffic took before the attack (green), and that which it took after AS 157 started the interception (red).\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/1/15ac3073840b405939dd570532b7dd1e9f1e8508_2_517x315.png\" alt=\"Simulation topology annotated with the path that traffic took before the attack (green), and that which it took after AS 157 started the interception (red).\" data-base62-sha1=\"35IWjWLlvscWHKtIen9w6Bp8KSc\" width=\"517\" height=\"315\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/1/15ac3073840b405939dd570532b7dd1e9f1e8508_2_517x315.png, https://delvingbitcoin.org/uploads/default/optimized/2X/1/15ac3073840b405939dd570532b7dd1e9f1e8508_2_775x472.png 1.5x, https://delvingbitcoin.org/uploads/default/original/2X/1/15ac3073840b405939dd570532b7dd1e9f1e8508.png 2x\" data-dominant-color=\"F6F4F4\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">Simulation topology annotated with the path that traffic took before the attack (green), and that which it took after AS 157 started the interception (red).</span><span class=\"informations\">1020×623 110 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<h2><a name=\"p-5832-feasibility-of-using-locally-observed-path-data-10\" class=\"anchor\" href=\"#p-5832-feasibility-of-using-locally-observed-path-data-10\"></a>Feasibility of using locally-observed path data</h2>\n<p>To look for solutions that can detect or mitigate this attack, I wanted to evaluate the possibility of using networking data that can be observed directly by the victim node itself. To do this, I emulated nodes in the network and took periodic network measurements from them to a random sample of reachable Bitcoin node hosts that could act as peers.</p>\n<details>\n<summary>\nMeasurement setup details</summary>\n<p>The measurement setup consists of 6 vantage points deployed in the ASes of Internet Service Providers (ISPs) used by residential users, corporate customers, academic institutions, and cloud providers. These vantage points run CAIDA’s open source <a href=\"https://www.caida.org/catalog/software/scamper/\" rel=\"noopener nofollow ugc\">scamper</a> tool and receive instructions from a coordination node to make measurements. The coordination node instructs all vantage point nodes to perform pings and traceroutes to a sample of 350 random reachable Bitcoin node hosts every 4 minutes. Results are then gathered by the coordination node to perform post-processing and analysis.</p>\n<p>I have been collecting measurements for over a month at this point. I intend to continue measurement collection, further analyze the data, and prepare it for public release.</p>\n</details>\n<p>I share some relevant insights from the collected data:</p>\n<details>\n<summary>\nInsight #1: Host churn is low.</summary>\n<p>Over the past month, the number of nodes that could not be reached using ICMP pings has increased from 4 to 15-18 in the sample set of 350 reachable nodes.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/9/97315c2720d4359d408bd866f57f77c3d1c5407d.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/97315c2720d4359d408bd866f57f77c3d1c5407d\" title=\"Average number of failed pings per measurement round for each vantage point / monitor over the course of 2 weeks. Drops and gaps in measurements on 8/4, 8/8 and 8/9 are artifacts of rebooting the collection system.\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/9/97315c2720d4359d408bd866f57f77c3d1c5407d_2_690x230.png\" alt=\"Average number of failed pings per measurement round for each vantage point / monitor over the course of 2 weeks. Drops and gaps in measurements on 8/4, 8/8 and 8/9 are artifacts of rebooting the collection system.\" data-base62-sha1=\"lzvQMmhWADycohT7x1HcBMIcNxr\" width=\"690\" height=\"230\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/9/97315c2720d4359d408bd866f57f77c3d1c5407d_2_690x230.png, https://delvingbitcoin.org/uploads/default/optimized/2X/9/97315c2720d4359d408bd866f57f77c3d1c5407d_2_1035x345.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/9/97315c2720d4359d408bd866f57f77c3d1c5407d_2_1380x460.png 2x\" data-dominant-color=\"1C1F23\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">Average number of failed pings per measurement round for each vantage point / monitor over the course of 2 weeks. Drops and gaps in measurements on 8/4, 8/8 and 8/9 are artifacts of rebooting the collection system.</span><span class=\"informations\">2182×730 171 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n</details>\n<details>\n<summary>\nInsight #2: Traceroutes have a high success rate.</summary>\n<p>After post-processing, I confirmed that the traceroutes reached the destination AS in <strong>97% of cases</strong>. In particular, 43.3% of traceroutes reach the actual host, 47.9% stop because they reach the limit of allowable gaps at the end of the path, 8.17% report the host as unreachable, and 0.06% stop because a routing loop is detected.</p>\n</details>\n<details>\n<summary>\nInsight #3: Most AS hops on a given path can be reliably inferred.</summary>\n<p>The worst performing vantage point used for measurements had an average AS path completeness of 75.1%, while the best performing one had <strong>92% AS path completeness</strong>. These are conservative estimates where null hops are counted as single ASes. Path inference was done using data collected from <a href=\"https://archive.routeviews.org/bgpdata/\" rel=\"noopener nofollow ugc\">BGP monitor nodes</a>, and <a href=\"https://www.radb.net/\" rel=\"noopener nofollow ugc\">Internet Routing Registries</a> (IRRs), and using an algorithm informed by <a href=\"http://www.caida.org/catalog/datasets/as-relationships/\" rel=\"noopener nofollow ugc\">AS connectivity and business relationships</a>.</p>\n</details>\n<details>\n<summary>\nInsight #4: Paths to reachable nodes are generally stable.</summary>\n<p>This is demonstrated in the figures below that show the number of router hops, number of AS hops, and number of unidentifiable ASes on the paths reported by the traceroute measurements from each vantage point.</p>\n<p>In the boxplot, with the exception of a handful of nodes (marked in red on the axes), all nodes had &lt; 5% measurement outliers (marked with Os). In the vast majority of cases, interquantile ranges are equal to 0.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/9/985f964438ed0844ef9429c1b3c9697bc89e1221.jpeg\" data-download-href=\"https://delvingbitcoin.org/uploads/default/985f964438ed0844ef9429c1b3c9697bc89e1221\" title=\"39e30c1f-f67d-47b2-942f-aeac465371f5\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/9/985f964438ed0844ef9429c1b3c9697bc89e1221_2_690x205.jpeg\" alt=\"39e30c1f-f67d-47b2-942f-aeac465371f5\" data-base62-sha1=\"lJXmUZyMMvOUqkYCMgWq7PRdqmt\" width=\"690\" height=\"205\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/9/985f964438ed0844ef9429c1b3c9697bc89e1221_2_690x205.jpeg, https://delvingbitcoin.org/uploads/default/optimized/2X/9/985f964438ed0844ef9429c1b3c9697bc89e1221_2_1035x307.jpeg 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/9/985f964438ed0844ef9429c1b3c9697bc89e1221_2_1380x410.jpeg 2x\" data-dominant-color=\"F5F4F4\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">39e30c1f-f67d-47b2-942f-aeac465371f5</span><span class=\"informations\">1800×536 186 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p>It’s also the case that the path to a given destination is generally stable with regards to the specific routers (and by extension ASes) that appear on the path. The sankey diagram below presents the path that traffic took from one of our vantage points (left side) to a specific destination (right side) over the course of 2000 probes. Loop artifacts in the presentation are because null hops (marked in orange) at a specific hop count are all aggregated into one block.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/0/04ad4a6cf07f806182d1ce808a084e80e73f48cc.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/04ad4a6cf07f806182d1ce808a084e80e73f48cc\" title=\"image 4\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/0/04ad4a6cf07f806182d1ce808a084e80e73f48cc_2_689x142.png\" alt=\"image 4\" data-base62-sha1=\"FnbnytjKpR1k3zNaKpEs7q6E6E\" width=\"689\" height=\"142\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/0/04ad4a6cf07f806182d1ce808a084e80e73f48cc_2_689x142.png, https://delvingbitcoin.org/uploads/default/optimized/2X/0/04ad4a6cf07f806182d1ce808a084e80e73f48cc_2_1033x213.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/0/04ad4a6cf07f806182d1ce808a084e80e73f48cc_2_1378x284.png 2x\" data-dominant-color=\"DDE1E3\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">image 4</span><span class=\"informations\">2418×498 98.6 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n</details>\n<details>\n<summary>\nInsight #5: AS diversity increases during the first few hops before decreasing.</summary>\n<p>This is illustrated in the sankey diagram below that samples traffic to all 350 nodes and aggregates all destinations and terminal null traceroute hops in the block on the right. All traffic initially flows from AS 25 to 2152 before being it gets split over a set of ASes on the 3rd hop, and then an even larger set on the 4th hop.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/2/2ebeca28ffd407ece8118681a1f9073a87b85aeb.jpeg\" data-download-href=\"https://delvingbitcoin.org/uploads/default/2ebeca28ffd407ece8118681a1f9073a87b85aeb\" title=\"54e53f60-3c9f-49ef-8810-51d2559162b0\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/2/2ebeca28ffd407ece8118681a1f9073a87b85aeb_2_690x280.jpeg\" alt=\"54e53f60-3c9f-49ef-8810-51d2559162b0\" data-base62-sha1=\"6FwJaYBB9R0tAoujhmhzzGjYvcT\" width=\"690\" height=\"280\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/2/2ebeca28ffd407ece8118681a1f9073a87b85aeb_2_690x280.jpeg, https://delvingbitcoin.org/uploads/default/optimized/2X/2/2ebeca28ffd407ece8118681a1f9073a87b85aeb_2_1035x420.jpeg 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/2/2ebeca28ffd407ece8118681a1f9073a87b85aeb_2_1380x560.jpeg 2x\" data-dominant-color=\"EBEBEC\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">54e53f60-3c9f-49ef-8810-51d2559162b0</span><span class=\"informations\">1828×743 88.7 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p>This is also visualized in the following histogram that shows the number of unique ASes that traffic crosses at a given hop count. After the 4th hop, the number of unique available ASes decreases because most traffic has already reached its destination AS. ASes at hop counts &gt; 8 are mostly artifacts of terminating null hops in our traceroutes (e.g “null_15”).</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/5/55801033d8c77768ff0e871de6e56c68b38af3cd.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/55801033d8c77768ff0e871de6e56c68b38af3cd\" title=\"image 5\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/5/55801033d8c77768ff0e871de6e56c68b38af3cd_2_517x306.png\" alt=\"image 5\" data-base62-sha1=\"ccmXtDLDktNkzOC0pKTSZkRB3R3\" width=\"517\" height=\"306\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/5/55801033d8c77768ff0e871de6e56c68b38af3cd_2_517x306.png, https://delvingbitcoin.org/uploads/default/optimized/2X/5/55801033d8c77768ff0e871de6e56c68b38af3cd_2_775x459.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/5/55801033d8c77768ff0e871de6e56c68b38af3cd_2_1034x612.png 2x\" data-dominant-color=\"F3F9FB\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">image 5</span><span class=\"informations\">2110×1249 54.9 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n</details>\n<h2><a name=\"p-5832-mitigations-11\" class=\"anchor\" href=\"#p-5832-mitigations-11\"></a>Mitigations</h2>\n<p>The following are sketches of proposed mitigations that are tagged by them requiring traceroute capabilities by Bitcoin Core [x-T] or not [x-NT].</p>\n<h3><a name=\"p-5832-h-1-nt-peer-rotation-12\" class=\"anchor\" href=\"#p-5832-h-1-nt-peer-rotation-12\"></a>[1-NT] Peer rotation</h3>\n<p><strong>Description:</strong> We can periodically rotate a subset of our peers, potentially weighted in a way that favors long-term stable connections. This makes it harder for an attacker to settle on a set of hijacked connections and forces them to perpetually be performing hijacks to discover the new connections.</p>\n<p><strong>Pros:</strong> Only requires making changes to AddrMan.</p>\n<p><strong>Cons:</strong></p>\n<ul>\n<li>Nodes might lose good stable connections</li>\n<li>Hard to reason about the effects it will have on the overlay network w.r.t connectivity, latency etc. since nodes that have been online for a long time and have settled on long-lasting stable connections will now be rotating them regularly</li>\n</ul>\n<h3><a name=\"p-5832-h-2-nt-use-dynamic-port-negotiation-13\" class=\"anchor\" href=\"#p-5832-h-2-nt-use-dynamic-port-negotiation-13\"></a>[2-NT] Use dynamic port negotiation</h3>\n<p><strong>Description:</strong> Upon first connection, after exchanging version and verack messages, the two peers can optionally negotiate a random pair of ports to continue communications on, making it harder for an attacker who observes traffic beyond the initial interaction to identify connections based on known port numbers. This is inspired by what FTP does in passive mode (PASV).</p>\n<p><strong>Pros:</strong> Generally raises the bar for passive fingerprinting by on-path eavesdroppers.</p>\n<p><strong>Cons:</strong></p>\n<ul>\n<li>NAT / Firewall traversal: Requires one side to be able to dynamically open public facing ports, or building hole-punching coordination into the client.</li>\n<li>Protocol changes: Requires introducing a new type of network interaction</li>\n<li>An adversary with a complete list of Bitcoin node IPs can still spot a connection based on the addresses</li>\n</ul>\n<h3><a name=\"p-5832-h-3-nt-favor-peers-in-protected-prefixes-14\" class=\"anchor\" href=\"#p-5832-h-3-nt-favor-peers-in-protected-prefixes-14\"></a>[3-NT] Favor peers in protected prefixes</h3>\n<p><strong>Description:</strong> We can make AddrMan prefer connecting to peers in prefixes that are RPKI-protected and have minimal ROAs, or that use the maximum length propagatable by BGP. This makes the attack harder, as the adversary’s malicious routes need to compete with the legitimate ones.</p>\n<p><strong>Pros:</strong></p>\n<ul>\n<li>Only requires making local changes to AddrMan</li>\n<li>Preferring maximum-length prefixes does not introduce any new dependencies</li>\n</ul>\n<p><strong>Cons:</strong></p>\n<ul>\n<li>Can potentially increase centralization as it will bias connections in favor of peers in protected prefixes</li>\n<li>To check a prefix’s RPKI status, the client needs access to ROA information. This can be obtained using the RTR protocol and processing this information locally, or by querying a remote service (e.g <a href=\"https://www.nlnetlabs.nl/projects/routing/routinator/\" rel=\"noopener nofollow ugc\">a Routinator instance</a>).</li>\n</ul>\n<h3><a name=\"p-5832-h-4-t-select-at-least-one-peer-with-the-shortest-path-possible-15\" class=\"anchor\" href=\"#p-5832-h-4-t-select-at-least-one-peer-with-the-shortest-path-possible-15\"></a>[4-T] Select at least one peer with the shortest path possible</h3>\n<p><strong>Description:</strong> As shown in the Attack Feasibility section, attackers cannot hijack prefixes with minimal ROAs or maximum prefix lengths that are closer to the victim than the attacker. We can thus reserve one of our connection slots for the peer with the shortest AS path from us that is in a protected prefix.</p>\n<p><strong>Pros:</strong></p>\n<ul>\n<li>Significantly hinders the attack</li>\n<li>Like [3-NT] preferring maximum-length prefixes does not introduce new dependencies</li>\n</ul>\n<p><strong>Cons:</strong></p>\n<ul>\n<li>Requires making Core capable of making periodic traceroutes to candidate peers to judge the lengths of the AS paths to them</li>\n<li>Like [3-NT], requires RPKI information</li>\n</ul>\n<h3><a name=\"p-5832-h-5-t-route-aware-peer-selection-16\" class=\"anchor\" href=\"#p-5832-h-5-t-route-aware-peer-selection-16\"></a>[5-T] Route-aware peer selection</h3>\n<p><strong>Description:</strong> The idea is similar to that of the <a href=\"https://asmap.org/\" rel=\"noopener nofollow ugc\">ASmap project</a>, or of using network group buckets for peers. However, instead of selecting based on just <em>destination diversity,</em> we do so based on <em>path diversity</em>, exponentially favoring peers whose paths introduce new ASes earlier on.</p>\n<p><strong>Pros:</strong></p>\n<ul>\n<li>Only requires local changes and does not require external collaboration</li>\n<li>Can potentially readily leverage the efforts made by the ASMap project to resolve IPs to ASes</li>\n</ul>\n<p><strong>Cons:</strong></p>\n<ul>\n<li>Requires making Core capable of making periodic traceroutes to candidate peers to judge the lengths of the AS paths to them</li>\n</ul>\n<h2><a name=\"p-5832-discussion-17\" class=\"anchor\" href=\"#p-5832-discussion-17\"></a>Discussion</h2>\n<p>I am interested in receiving feedback on the proposed mitigations and discussing alternatives that I might have missed. I would also like to hear people’s thoughts on integrating traceroute functionality into core to enable the aforementioned mitigations.</p>\n<h2><a name=\"p-5832-acknowledgements-18\" class=\"anchor\" href=\"#p-5832-acknowledgements-18\"></a>Acknowledgements</h2>\n<p>I want to extend my gratitude to the people at Chaincode Labs for their support. Their input has been instrumental in carrying out this research.</p>\n<h2><a name=\"p-5832-references-19\" class=\"anchor\" href=\"#p-5832-references-19\"></a>References</h2>\n<p>[1] <a href=\"https://ihchoi12.github.io/assets/tran2020stealthier.pdf\" rel=\"noopener nofollow ugc\">A Stealthier Partitioning Attack against Bitcoin Peer-to-Peer Network</a></p>\n<p>[2] <a href=\"https://www.usenix.org/system/files/conference/usenixsecurity15/sec15-paper-heilman.pdf\" rel=\"noopener nofollow ugc\">Eclipse Attacks on Bitcoin’s Peer-to-Peer Network</a></p>\n<p>[3] <a href=\"https://www.academia.edu/download/87294469/3460120.pdf\" rel=\"noopener nofollow ugc\">SyncAttack: Double-spending in Bitcoin Without Mining Power</a></p>\n<p>[4] <a href=\"https://btc-hijack.ethz.ch/files/btc_hijack.pdf\" rel=\"noopener nofollow ugc\">Hijacking Bitcoin: Routing Attacks on Cryptocurrencies</a></p>\n<p>[5] <a href=\"https://www.cs.princeton.edu/~jrex/papers/sico19.pdf\" rel=\"noopener nofollow ugc\">SICO: Surgical Interception Attacks by Manipulating BGP Communities</a></p>\n<p>[6] <a href=\"https://arxiv.org/pdf/2408.09622\" rel=\"noopener nofollow ugc\">Global BGP Attacks that Evade Route Monitoring</a></p>\n<p>[7] <a href=\"https://open.bu.edu/bitstream/2144/29023/2/p101-Gilad.pdf\" rel=\"noopener nofollow ugc\">MaxLength Considered Harmful to the RPKI</a></p>\n<p>[8] <a href=\"https://citeseerx.ist.psu.edu/document?repid=rep1&amp;type=pdf&amp;doi=e9ec2d172b7657a238a467a25a08806dfb1931d1\" rel=\"noopener nofollow ugc\">AS Path Inference by Exploiting Known AS Paths</a></p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 9,
  "updated_at": "2025-09-04T14:08:14.531Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 285,
  "reads": 78,
  "readers_count": 77,
  "score": 1560.6,
  "yours": false,
  "topic_id": 1965,
  "topic_slug": "eclipsing-bitcoin-nodes-with-bgp-interception-attacks",
  "topic_title": "Eclipsing Bitcoin Nodes with BGP Interception Attacks",
  "topic_html_title": "Eclipsing Bitcoin Nodes with BGP Interception Attacks",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 4,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "## Summary\n\nThis post contains a collection of my findings on an attacker being able to eclipse Bitcoin nodes using interception attacks - a stealthier variant of the standard BGP hijack.\n\n**Key takeaways:** The attack seems to be feasible against many nodes in the network, and I was able to produce a proof-of-concept by attacking my own mainnet node in an isolated environment. To hinder this type of attack, I looked into several mitigations, some of which use networking data that the node can observe independently.\n\nThe rest of the post presents the attack in detail, looks into its feasibility, presents findings from a proof-of-concept implementation, discusses networking data that can be used in defenses, and concludes with a description of the proposed mitigations.\n\n[details=\"Paragraphs with more details to them have them in toggle lists like this one. Click to see more.\"]\n* [🪿](https://www.youtube.com/watch?v=dQw4w9WgXcQ)\n\n[/details]\n\n## Background\n\n**BGP and BGP hijacks:** BGP is the protocol used by routers in the backbone of the internet to establish routes between a source and a destination. These routers belong to Autonomous Systems (ASes) (e.g: Verizon, AT&T) and exchange announcements about IP prefixes to form paths to them. Because the protocol lacks authentication, an attacker can perform a BGP hijack by making a false announcement that is preferred over the legitimate one by the BGP best path selection algorithm. The attacker then diverts traffic from the legitimate destination to themselves. An attacker can partition Bitcoin this way (see \\[[4](https://btc-hijack.ethz.ch/files/btc_hijack.pdf)\\]).\n\n**Interception (SICO) attacks:** This is a stealthier variant of traditional BGP hijacks that also makes it easier to intercept and forward traffic to the legitimate destination. The attacker does this by limiting how their malicious announcements spread by tagging them with metadata known as BGP communities. This allows the attacker to evade BGP route monitors that can detect the attack, and maintain a path to the legitimate destination to forward traffic (see \\[[5](https://www.cs.princeton.edu/~jrex/papers/sico19.pdf)\\], \\[[6](https://arxiv.org/pdf/2408.09622)\\] for details).\n\n[details=\"Details on interception attacks\"]\nThe attacker announces malicious BGP routes to the IP prefixes to which they want to intercept traffic. In these announcements the attacker claims to be the origin of the IP prefix or a hop in the path to the prefix. Routers that accept the announcement will route their traffic to the legitimate destination through the adversary.\n\nThe attacker attaches BGP communities (e.g NoExportSelect, LowerPref) to their announcements to limit their propagation to specific ASes. This makes the attack stealthier and more practical, since announcements are observed by fewer ASes and the adversary attracts less traffic. This also allows the multi-homed adversary AS to maintain a route to the legitimate destination and forward traffic to it, turning the attacker into a man-in-the-middle (MITM).\n\n[/details]\n\n**Eclipse attacks:** The goal of the attacker is to control all incoming and outgoing connections to a node. This allows the attacker to waste mining power, do selfish mining, double spend, attack Lightning, etc \\[[1](https://ihchoi12.github.io/assets/tran2020stealthier.pdf)\\]. This was previously done by polluting AddrMan’s tables with IPs that the attacker controlled \\[[2](https://www.usenix.org/system/files/conference/usenixsecurity15/sec15-paper-heilman.pdf)\\], or was on the path to \\[[1](https://ihchoi12.github.io/assets/tran2020stealthier.pdf)\\]. Core has mitigated these eclipsing methods by making changes to AddrMan.\n\n## Attack Description\n\n**Requirements:** The attacker controls a multi-peer AS by either [compromising one](https://www.coinbase.com/blog/celer-bridge-incident-analysis) or [setting up their own](https://nick.bouwhuis.net/posts/2023-02-12-setting-up-a-personal-asn/).\n\nThe attacker aims to intercept or control all victim node connections by the end of the attack by taking the following steps:\n\n1. Continuously attempt to occupy incoming connection slots and avoid being evicted. This is done by using addresses in different network groups, relaying blocks and transactions, and having low latency (see \\[[3](https://www.academia.edu/download/87294469/3460120.pdf)\\] for details).\n\n2. Compromise or set up a new AS as close (in number of AS hops) to the victim node AS as possible. This helps the attacker’s announcements to be preferred over legitimate ones by the BGP best path selection algorithm (AS path length criterion).\n\n3. Build a database of known Bitcoin nodes and their IP prefixes. This is done by running a node or using data like that from Bitnodes snapshots, etc.\n\n4. Sort IP prefixes by number of nodes and hijack them in succession at a rate that will not raise alarms. The attacker attaches BGP communities to limit the spread of the malicious advertisements to as few ASes as possible, and maintain a route to forward traffic to the legitimate destination.\n\n5. Observe the intercepted traffic and identify Bitcoin connections by known IPs and ports from Step 3.\n\n   1. If no Bitcoin traffic is observed for a hijacked prefix, stop hijacking it\n\n   2. If Bitcoin traffic is seen:\n\n      1. If the peer’s IP is public, maintain the hijack as it is possibly an outbound connection\n\n         1. If it’s an [encrypted V2 connection](https://github.com/bitcoin/bips/blob/4d6cd518a04a4101f3cd833cd18b1f31facbc129/bip-0324.mediawiki), continue forwarding and intercepting traffic\n\n         2. If it’s a V1 connection, impersonate it (or continue forwarding and intercepting)\n\n      2. If the peer’s IP is private, the connection is inbound. Reset the connection, and then occupy its slot with an attacker-controlled node. Finally, withdraw the route.\n\n6. Test to see if the victim is eclipsed: submit a transaction to the victim node and drop or delay traffic to the hijacked connections. Then check if the transaction propagates. At this point the attacker only has to maintain up to as many prefix hijacks as the number of connections it intercepts.\n\n[details=\"Note on asymmetric routing\"]\nBecause internet routing can be asymmetric, if the attacker wishes to intercept both directions of the communication, they may have to make one additional prefix announcement for the victim’s prefix that targets the routers on the inbound path.\n\n[/details]\n\n## Attack Feasibility\n\nAn attacker is successful in launching the attack if they manage to remain unnoticed while hijacking prefixes, and if their malicious BGP announcements are preferred over the legitimate ones. To remain stealthy, an attacker evades route monitors by limiting the spread of their announcements using BGP communities (see \\[[6](https://arxiv.org/pdf/2408.09622)\\] for details), hijacking as few prefixes as possible, and doing so at a rate that won’t raise suspicions. The success of the malicious announcement depends on the victim prefixes and the attacker’s position in the network.\n\nTo judge the feasibility of the attack, the rest of this section answers the following questions:\n\n1. How many prefixes does the attacker have to hijack at most?\n\n2. Can the attacker hijack these prefixes at a reasonable time frame?\n\n3. How vulnerable are Bitcoin node prefixes to BGP hijacks?\n\n4. What is the probability that the attacker’s announcements will be preferred over the legitimate ones?\n\n### 1. Number of prefixes\n\nUsing a snapshot from [Bitnodes](https://bitnodes.io/) we can see that **all reachable nodes reside in just 4551 prefixes** (the internet has over [1,155,000 allocated prefixes](https://www.radb.net/)). Furthermore, the attacker can cover more than \\~55% of reachable nodes by hijacking just 1000 prefixes.\n![Distribution of reachable Bitcoin nodes over IP prefixes. 55% of nodes reside in just 1000 prefixes|690x413, 75%](upload://e39uBvtQKejWPz4ubxbGD2yi3zQ.png)\n\n### 2. Hijack rate\n\nSeeking to remain unnoticed, the attacker limits the rate of their announcements and minimizes the duration for which they remain active. In 2024 BGP routers received on average [over 200,000 BGP announcements per day](https://www.potaroo.net/ispcol/2025-01/bgpupd2024.html). An attacker seeking to eclipse a node over the course of 10 days will cause just a 0.23% increase in announcement volume if they have to hijack all reachable node prefixes. Furthermore, because the vast majority of malicious announcements do not have to be long lived, they are more likely blend in with benign misconfigurations.\n\nGraphs: Number of BGP route announcements and withdrawals for IPv4 and IPv6 prefixes as observed by a vantage point. Source: Geoff Huston - [ISP Column - January 2025](https://www.potaroo.net/ispcol/2025-01/bgpupd2024.html)\n![image|690x414, 50%](upload://8sC9DdFJ2PGOACE1keXaTiyqN47.png)![image 1|690x414, 50%](upload://kNSXVBbzeDG3l0gVV6e6gTavPNe.png)\n\n### 3. Prefix vulnerability\n\nWe find that the attacker can **always successfully hijack 41.13% of node prefixes** either because they have overly permissive [ROAs](https://www.arin.net/resources/manage/rpki/roa_request/) or lack an ROA and use a shorter prefix than the longest one that BGP routers will propagate (see detailed analysis below). For the remaining **59.87%** of prefixes, the attacker’s announcement will have to **compete with the legitimate one** if a router receives both announcements.\n\n[details=\"Detailed analysis of IP prefix vulnerability\"]\nFor the attacker to be successful, their route announcement needs to be preferred over the legitimate one by other BGP routers. This depends on a number of factors including the IP prefix having a [Route Origin Authorization (ROA)](https://www.arin.net/resources/manage/rpki/roa_request/) - which only allows the ROA holder to announce the prefix as the origin-, the permissiveness of the ROA, the length of the announced prefix, and the attacker’s topological position in relation to the BGP routers that receive the malicious announcement. We discuss the following 4 possible cases and how the attacker handles them:\n\n**Case 1: No ROA, and legitimate prefix length < maximum length - 13.29% of prefixes**\n\nThe absence of an ROA allows the attacker to announce that they are the origin of the prefix. Because the legitimate prefix announcement is shorter than the maximum length which BGP routers will propagate, the attacker can announce a longer prefix (more-specific), and their announcement will be preferred over the legitimate.\n\n**Case 2: No ROA, and legitimate prefix length == maximum length - 4.39% of prefixes**\n\nThe attacker can still claim to be the origin, and make an announcement with the same prefix length as the legitimate one. The decision between adopting the attacker’s route or the legitimate one will depend on the [BGP best path selection algorithm](https://www.cisco.com/c/en/us/support/docs/ip/border-gateway-protocol-bgp/13753-25.html) as configured on the router that observes the routes.\n\n**Case 3: ROA exists but is overly permissive, and legitimate prefix length < maximum length - 27.84% of prefixes**\n\nThe existence of an ROA prevents the attacker from announcing themselves as the prefix origin, but allows them to make an announcement where they are the second hop in the path. The attacker can do this regardless of them being connected to the legitimate origin. Because the ROA is overly permissive, the attacker can make more specific prefix announcements, making their announcements preferable to the legitimate ones (see \\[[7](https://open.bu.edu/bitstream/2144/29023/2/p101-Gilad.pdf)\\] for details).\n\n**Case 4: ROA exists but is not overly permissive, or legitimate prefix length == maximum length - 54.48% of prefixes**\n\nThe attacker cannot claim to be the origin because of the ROA, and instead claims that they are the second hop in the path. Similar to Case 2, the attacker announces the same prefix as the legitimate one and competes with it. Routers that receive both announcements select a path using the BGP best path selection algorithm.\n\n[/details]\n\n### 4. Malicious announcement acceptance\n\nFor the 59.87% of node prefixes that the attacker’s malicious routes will have to compete with the legitimate ones, the attacker can influence the [BGP best path selection algorithm](https://www.cisco.com/c/en/us/support/docs/ip/border-gateway-protocol-bgp/13753-25.html) in their favor by placing themselves as close to the victim as possible to influence the AS path length criterion.\n\nThe success rate and feasibility of the attack depends on the victim. The figure below quantifies this for a victim node in AS 31034. The x axis represents the number of hops away (in number of ASes) that the adversary AS is from the victim AS. The y axis shows the number of Bitcoin nodes that the adversary intercepts in blue, and in red the number of ASes that exist up to that number of hops away from the victim AS which the attacker can potentially compromise. For instance, an attacker can compromise one of 10,000+ ASes that are 3 or fewer hops away from the victim, and successfully hijack connections to over 85% of reachable nodes.\n\n*Note: some reachable nodes are excluded from the figure (see collapsible section for details).*\n\n![31034_cdf|690x413, 75%](upload://8tCR3bkIL0PCND4PCsKQf5CuPot.png)\n\n[details=\"More details on the malicious announcement acceptance rate study\"]\nThis analysis studies 13 random [“important” nodes (by Bitnodes PIX score)](https://bitnodes.io/nodes/leaderboard/) in different regions as the candidate victims. These are nodes with characteristics such as high uptime, low latency, up-to-date block heights etc. that are desirable in nodes that are relied on for commercial activity.\n\nUsing the IPs of these nodes, we estimate the paths between them and all other reachable Bitcoin nodes using a path estimation algorithm \\[[8](https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=e9ec2d172b7657a238a467a25a08806dfb1931d1)\\]. By taking into consideration the ROAs, prefix lengths, and AS path length (as determined by the adversary’s hop count away from the victim) we can count the number of nodes for which the adversary’s announcement would be preferred over the legitimate one.\n\nThe general trend shown by the figures is that as the distance from the victim node increases, the opportunities for the attacker to compromise or setup their own peering AS also increase, but the number of nodes for which they can successfully make malicious prefix announcements decreases. The plateau that appears on the number of hijackable peers in the graphs is explained by the prefixes that the attacker can always successfully hijack (see Cases 1 & 3 in the collapsible paragraphs in the “Prefix vulnerability” subsection). In cases such as that of the victim node in AS 16125, the attacker can compromise or peer with one of tens of thousands of ASes up to 5 hops away and still be able to make malicious prefix announcements that cover the vast majority of reachable nodes.\n\n*Note:* due to limitations of the path estimation algorithm, we have excluded the reachable nodes for which we could not calculate a valid route.\n\n![3356_cdf|690x413, 50%](upload://xJpRj0vJLnAhUdSpDvVPrAzXSpZ.png)![13259_cdf|690x413, 50%](upload://1vzSHS1yhZ503CPjeuFC9U41FwX.png)![7738_cdf|690x413, 50%](upload://aWKS9dbpvP4gA9dr7LFP3HECjjL.png)![6772_cdf|690x413, 50%](upload://665DOFWhVoXtg8FhqMnMlld2ZYT.png)![4049_cdf|690x413, 50%](upload://mb47vYdsRYv97Euu2KerLuuG8AD.png)![16125_cdf|690x413, 50%](upload://yyTF1GmaepOFzqJjRqbKBf4NRbb.png)![45102_cdf|690x413, 50%](upload://j0u4bBUGaCvbWavi9sjhDHiVDix.png)![34385_cdf|690x413, 50%](upload://ipBHW3t0izqeSzFxps5e0uSgXj6.png)![29686_cdf|690x413, 50%](upload://A9ppmnBNGs3Xvd10Z0vyG6BEvO2.png)![21499_cdf|690x413, 50%](upload://AlT3FiECklkvQez7id4EZUFf09A.png)![55286_cdf|690x413, 50%](upload://pfGrME6XnAgWpvUFPckf8hipx9r.png)![60781_cdf|690x413, 50%](upload://huoELwbaxD37POpJ9HeHbUBdXXg.png)![60414_cdf|690x413, 50%](upload://1mFzJPq7VGGhzJHP61A0bQIe118.png)\n\n[/details]\n\n## Proof of Concept\n\nTo confirm the feasibility of the attack I emulated a simple AS topology with gateways to the real internet, and eclipsed my own Bitcoin node that was connected to the mainnet. This topology is illustrated in the figure below along with the path that traffic took before and after the attack.\n\nWhile performing the attack, I noticed that in certain cases, possibly due to reasons related to the emulation environment, some intercepted connections dropped because of a TCP RST packet sent from one of the hops on the path. To overcome this, I ran the attack script 6 more times, at which point I was intercepting all of my node’s connections, including anchor connections. Because anchor connections exchange less traffic, I had to expand the observation time window to ensure that the the attack script had the chance to observe anchor traffic in hijacked prefixes.\n\n[details=\"Additional emulation details\"]\nI emulated the AS topology shown below using [SEED](https://www.notion.so/24-02-2025-Emulator-work-1a4163ec85c08067be13eabfa406aeff?pvs=21). In this topology, AS 152 hosts the victim Bitcoin node which is connected to the emulator [via a VPN tunnel](https://github.com/seed-labs/seed-emulator/blob/eff5a7fba2412bb90191934ae6f3c8ad1aeb9d25/misc/openvpn-remote-access/README.md). AS 152 peers at Internet Exchange Point (IXP) 101 and peers with AS 2 which provides transit to IXP 100. At IXP 100, AS 998 acts as a provider to AS 2 and is a gateway to the real internet. This means that under normal operation traffic from the victim AS to the real internet flows as follows: 152→ 101→ 2 →100 → 998 → Internet.\n\nThe attacker controls AS 157 which peers at IXP 100 and has ASes 999 and 998 as upstream providers. Like AS 998, AS 999 is a gateway to the real internet. AS 999 and AS 998 have a peer relationship with each other. During the attack, AS 157 makes malicious announcements to AS 998 claiming to be the second hop on the path to all reachable nodes. To avoid AS 999 also adopting the malicious routes, which would prevent AS 157 from intercepting and routing the traffic to the legitimate destination via AS 999, the attacker attaches the NoExport BGP community to its announcements.\n\nThe attacker proceeds to hijack prefixes as described in the attack algorithm making the traffic from the victim AS destined to the hijacked prefixes flow as follows: AS 152 → 101→ 2 →100 → 998 → 100 → 157 → 100 → 999 → Internet.\n\n[/details]\n\n![Simulation topology annotated with the path that traffic took before the attack (green), and that which it took after AS 157 started the interception (red).|690x421, 75%](upload://35IWjWLlvscWHKtIen9w6Bp8KSc.png)\n\n## Feasibility of using locally-observed path data\n\nTo look for solutions that can detect or mitigate this attack, I wanted to evaluate the possibility of using networking data that can be observed directly by the victim node itself. To do this, I emulated nodes in the network and took periodic network measurements from them to a random sample of reachable Bitcoin node hosts that could act as peers.\n\n[details=\"Measurement setup details\"]\nThe measurement setup consists of 6 vantage points deployed in the ASes of Internet Service Providers (ISPs) used by residential users, corporate customers, academic institutions, and cloud providers. These vantage points run CAIDA’s open source [scamper](https://www.caida.org/catalog/software/scamper/) tool and receive instructions from a coordination node to make measurements. The coordination node instructs all vantage point nodes to perform pings and traceroutes to a sample of 350 random reachable Bitcoin node hosts every 4 minutes. Results are then gathered by the coordination node to perform post-processing and analysis.\n\nI have been collecting measurements for over a month at this point. I intend to continue measurement collection, further analyze the data, and prepare it for public release.\n\n[/details]\n\nI share some relevant insights from the collected data:\n\n[details=\"Insight #1: Host churn is low.\"]\nOver the past month, the number of nodes that could not be reached using ICMP pings has increased from 4 to 15-18 in the sample set of 350 reachable nodes.\n\n![Average number of failed pings per measurement round for each vantage point / monitor over the course of 2 weeks. Drops and gaps in measurements on 8/4, 8/8 and 8/9 are artifacts of rebooting the collection system.|690x230](upload://lzvQMmhWADycohT7x1HcBMIcNxr.png)\n\n[/details]\n\n[details=\"Insight #2: Traceroutes have a high success rate.\"]\nAfter post-processing, I confirmed that the traceroutes reached the destination AS in **97% of cases**. In particular, 43.3% of traceroutes reach the actual host, 47.9% stop because they reach the limit of allowable gaps at the end of the path, 8.17% report the host as unreachable, and 0.06% stop because a routing loop is detected.\n\n[/details]\n\n[details=\"Insight #3: Most AS hops on a given path can be reliably inferred.\"]\nThe worst performing vantage point used for measurements had an average AS path completeness of 75.1%, while the best performing one had **92% AS path completeness**. These are conservative estimates where null hops are counted as single ASes. Path inference was done using data collected from [BGP monitor nodes](https://archive.routeviews.org/bgpdata/), and [Internet Routing Registries](https://www.radb.net/) (IRRs), and using an algorithm informed by [AS connectivity and business relationships](http://www.caida.org/catalog/datasets/as-relationships/).\n\n[/details]\n\n[details=\"Insight #4: Paths to reachable nodes are generally stable.\"]\nThis is demonstrated in the figures below that show the number of router hops, number of AS hops, and number of unidentifiable ASes on the paths reported by the traceroute measurements from each vantage point.\n\nIn the boxplot, with the exception of a handful of nodes (marked in red on the axes), all nodes had < 5% measurement outliers (marked with Os). In the vast majority of cases, interquantile ranges are equal to 0.\n\n![39e30c1f-f67d-47b2-942f-aeac465371f5|690x205](upload://lJXmUZyMMvOUqkYCMgWq7PRdqmt.jpeg)\n\nIt’s also the case that the path to a given destination is generally stable with regards to the specific routers (and by extension ASes) that appear on the path. The sankey diagram below presents the path that traffic took from one of our vantage points (left side) to a specific destination (right side) over the course of 2000 probes. Loop artifacts in the presentation are because null hops (marked in orange) at a specific hop count are all aggregated into one block.\n\n![image 4|689x142](upload://FnbnytjKpR1k3zNaKpEs7q6E6E.png)\n\n[/details]\n\n[details=\"Insight #5: AS diversity increases during the first few hops before decreasing.\"]\nThis is illustrated in the sankey diagram below that samples traffic to all 350 nodes and aggregates all destinations and terminal null traceroute hops in the block on the right. All traffic initially flows from AS 25 to 2152 before being it gets split over a set of ASes on the 3rd hop, and then an even larger set on the 4th hop.\n\n![54e53f60-3c9f-49ef-8810-51d2559162b0|690x280](upload://6FwJaYBB9R0tAoujhmhzzGjYvcT.jpeg)\n\nThis is also visualized in the following histogram that shows the number of unique ASes that traffic crosses at a given hop count. After the 4th hop, the number of unique available ASes decreases because most traffic has already reached its destination AS. ASes at hop counts > 8 are mostly artifacts of terminating null hops in our traceroutes (e.g “null_15”).\n\n![image 5|690x408, 75%](upload://ccmXtDLDktNkzOC0pKTSZkRB3R3.png)\n\n[/details]\n\n## Mitigations\n\nThe following are sketches of proposed mitigations that are tagged by them requiring traceroute capabilities by Bitcoin Core \\[x-T\\] or not \\[x-NT\\].\n\n### \\[1-NT\\] Peer rotation\n\n**Description:** We can periodically rotate a subset of our peers, potentially weighted in a way that favors long-term stable connections. This makes it harder for an attacker to settle on a set of hijacked connections and forces them to perpetually be performing hijacks to discover the new connections.\n\n**Pros:** Only requires making changes to AddrMan.\n\n**Cons:**\n\n* Nodes might lose good stable connections\n* Hard to reason about the effects it will have on the overlay network w.r.t connectivity, latency etc. since nodes that have been online for a long time and have settled on long-lasting stable connections will now be rotating them regularly\n\n### \\[2-NT\\] Use dynamic port negotiation\n\n**Description:** Upon first connection, after exchanging version and verack messages, the two peers can optionally negotiate a random pair of ports to continue communications on, making it harder for an attacker who observes traffic beyond the initial interaction to identify connections based on known port numbers. This is inspired by what FTP does in passive mode (PASV).\n\n**Pros:** Generally raises the bar for passive fingerprinting by on-path eavesdroppers.\n\n**Cons:**\n\n* NAT / Firewall traversal: Requires one side to be able to dynamically open public facing ports, or building hole-punching coordination into the client.\n* Protocol changes: Requires introducing a new type of network interaction\n* An adversary with a complete list of Bitcoin node IPs can still spot a connection based on the addresses\n\n### \\[3-NT\\] Favor peers in protected prefixes\n\n**Description:** We can make AddrMan prefer connecting to peers in prefixes that are RPKI-protected and have minimal ROAs, or that use the maximum length propagatable by BGP. This makes the attack harder, as the adversary’s malicious routes need to compete with the legitimate ones.\n\n**Pros:**\n\n* Only requires making local changes to AddrMan\n* Preferring maximum-length prefixes does not introduce any new dependencies\n\n**Cons:**\n\n* Can potentially increase centralization as it will bias connections in favor of peers in protected prefixes\n* To check a prefix’s RPKI status, the client needs access to ROA information. This can be obtained using the RTR protocol and processing this information locally, or by querying a remote service (e.g [a Routinator instance](https://www.nlnetlabs.nl/projects/routing/routinator/)).\n\n### \\[4-T\\] Select at least one peer with the shortest path possible\n\n**Description:** As shown in the Attack Feasibility section, attackers cannot hijack prefixes with minimal ROAs or maximum prefix lengths that are closer to the victim than the attacker. We can thus reserve one of our connection slots for the peer with the shortest AS path from us that is in a protected prefix.\n\n**Pros:**\n\n* Significantly hinders the attack\n* Like \\[3-NT\\] preferring maximum-length prefixes does not introduce new dependencies\n\n**Cons:**\n\n* Requires making Core capable of making periodic traceroutes to candidate peers to judge the lengths of the AS paths to them\n* Like \\[3-NT\\], requires RPKI information\n\n### \\[5-T\\] Route-aware peer selection\n\n**Description:** The idea is similar to that of the [ASmap project](https://asmap.org/), or of using network group buckets for peers. However, instead of selecting based on just *destination diversity,* we do so based on *path diversity*, exponentially favoring peers whose paths introduce new ASes earlier on.\n\n**Pros:**\n\n* Only requires local changes and does not require external collaboration\n* Can potentially readily leverage the efforts made by the ASMap project to resolve IPs to ASes\n\n**Cons:**\n\n* Requires making Core capable of making periodic traceroutes to candidate peers to judge the lengths of the AS paths to them\n\n## Discussion\n\nI am interested in receiving feedback on the proposed mitigations and discussing alternatives that I might have missed. I would also like to hear people’s thoughts on integrating traceroute functionality into core to enable the aforementioned mitigations.\n\n## Acknowledgements\n\nI want to extend my gratitude to the people at Chaincode Labs for their support. Their input has been instrumental in carrying out this research.\n\n## References\n\n\\[1\\] [A Stealthier Partitioning Attack against Bitcoin Peer-to-Peer Network](https://ihchoi12.github.io/assets/tran2020stealthier.pdf)\n\n\\[2\\] [Eclipse Attacks on Bitcoin’s Peer-to-Peer Network](https://www.usenix.org/system/files/conference/usenixsecurity15/sec15-paper-heilman.pdf)\n\n\\[3\\] [SyncAttack: Double-spending in Bitcoin Without Mining Power](https://www.academia.edu/download/87294469/3460120.pdf)\n\n\\[4\\] [Hijacking Bitcoin: Routing Attacks on Cryptocurrencies](https://btc-hijack.ethz.ch/files/btc_hijack.pdf)\n\n\\[5\\] [SICO: Surgical Interception Attacks by Manipulating BGP Communities](https://www.cs.princeton.edu/~jrex/papers/sico19.pdf)\n\n\\[6\\] [Global BGP Attacks that Evade Route Monitoring](https://arxiv.org/pdf/2408.09622)\n\n\\[7\\] [MaxLength Considered Harmful to the RPKI](https://open.bu.edu/bitstream/2144/29023/2/p101-Gilad.pdf)\n\n\\[8\\] [AS Path Inference by Exploiting Known AS Paths](https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=e9ec2d172b7657a238a467a25a08806dfb1931d1)",
  "actions_summary": [
    {
      "id": 2,
      "count": 9
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 894,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "<a name=\"p-5832-summary-1\" class=\"anchor\" href=\"#p-5832-summary-1\"></a>Summary\nThis post contains a collection of my findings on an attacker being able to eclipse Bitcoin nodes using interception attacks - a stealthier variant of the standard BGP hijack. \nKey takeaways: The attack seems to be feasible against many nodes in the network, and I was able to produce a proof&hellip;",
  "truncated": true,
  "post_url": "/t/eclipsing-bitcoin-nodes-with-bgp-interception-attacks/1965/1",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 8
    },
    {
      "id": "heart",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 9,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}