{
  "id": 5893,
  "name": "0xB10C",
  "username": "0xB10C",
  "avatar_template": "/user_avatar/delvingbitcoin.org/0xb10c/{size}/15_2.png",
  "created_at": "2025-09-17T12:08:29.329Z",
  "cooked": "<p>I’ve written about my peer-observer project in <a href=\"https://b10c.me/projects/024-peer-observer/\" class=\"inline-onebox\">peer-observer: A tool and infrastructure for monitoring the Bitcoin P2P network for attacks and anomalies</a> and post about it here for me to share project updates, enable discussion about the project, and for readers to leave ideas further monitoring ideas.</p>\n<p>Since the project relies on  “honeypot nodes”, the actual web front end isn’t publicly accessible (though I’ve set up accounts for a bunch of people over the last years) as the data would make the nodes identifiable. On <a href=\"https://public.peer.observer\">public.peer.observer</a> a list of the nodes and their configurations can be found. Similarly, the fork-observer instance connected to the nodes is also <a href=\"https://public.peer.observer/forks/\">publicly reachable</a>.</p>\n<p>I do however plan to set up a separate demo instance with public dashboards and data (and thus IPs, accepting the fact that some people might see this as invitation to mess with the nodes) soon.</p>\n<p>As for code, the tooling can be found on <a href=\"https://github.com/0xB10C/peer-observer\">github.com/0xB10C/peer-observer</a>, and I have a NixOS package and module in <a href=\"https://github.com/0xb10c/nix/\">github.com/0xb10c/nix</a> that I use to run the tooling. The (opinionated) infrastructure configuration for deploying, managing and connecting the tools to e.g. a Prometheus and Grafana instance, debug.log rotation, addrman-observer, … isn’t public yet, but I hope to publish this with or after the demo set up to enable others to run their own set up similar to mine (to be clear: running this yourself is entirely possible right now, but publishing my infrastructure configuration should make it easier to replicate my setup elsewhere).</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 3,
  "updated_at": "2025-09-17T12:08:29.329Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 75,
  "reads": 36,
  "readers_count": 35,
  "score": 427.2,
  "yours": false,
  "topic_id": 1988,
  "topic_slug": "peer-observer-a-tool-and-infrastructure-for-monitoring-the-bitcoin-p2p-network-for-attacks-and-anomalies",
  "topic_title": "Peer-observer: A tool and infrastructure for monitoring the Bitcoin P2P network for attacks and anomalies",
  "topic_html_title": "Peer-observer: A tool and infrastructure for monitoring the Bitcoin P2P network for attacks and anomalies",
  "category_id": 8,
  "display_username": "0xB10C",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I've written about my peer-observer project in https://b10c.me/projects/024-peer-observer/ and post about it here for me to share project updates, enable discussion about the project, and for readers to leave ideas further monitoring ideas.\n\nSince the project relies on  \"honeypot nodes\", the actual web front end isn't publicly accessible (though I've set up accounts for a bunch of people over the last years) as the data would make the nodes identifiable. On [public.peer.observer](https://public.peer.observer) a list of the nodes and their configurations can be found. Similarly, the fork-observer instance connected to the nodes is also [publicly reachable](https://public.peer.observer/forks/).\n\nI do however plan to set up a separate demo instance with public dashboards and data (and thus IPs, accepting the fact that some people might see this as invitation to mess with the nodes) soon.\n\nAs for code, the tooling can be found on [github.com/0xB10C/peer-observer](https://github.com/0xB10C/peer-observer), and I have a NixOS package and module in [github.com/0xb10c/nix](https://github.com/0xb10c/nix/) that I use to run the tooling. The (opinionated) infrastructure configuration for deploying, managing and connecting the tools to e.g. a Prometheus and Grafana instance, debug.log rotation, addrman-observer, ... isn't public yet, but I hope to publish this with or after the demo set up to enable others to run their own set up similar to mine (to be clear: running this yourself is entirely possible right now, but publishing my infrastructure configuration should make it easier to replicate my setup elsewhere).",
  "actions_summary": [
    {
      "id": 2,
      "count": 4
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 16,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "I’ve written about my peer-observer project in <a href=\"https://b10c.me/projects/024-peer-observer/\" class=\"inline-onebox\">peer-observer: A tool and infrastructure for monitoring the Bitcoin P2P network for attacks and anomalies</a> and post about it here for me to share project updates, enable discussion about the project, and for readers to leave ideas further monitoring idea&hellip;",
  "truncated": true,
  "post_url": "/t/peer-observer-a-tool-and-infrastructure-for-monitoring-the-bitcoin-p2p-network-for-attacks-and-anomalies/1988/1",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 3
    },
    {
      "id": "heart",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 4,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}