{
  "id": 5795,
  "name": "",
  "username": "roconnor-blockstream",
  "avatar_template": "/user_avatar/delvingbitcoin.org/roconnor-blockstream/{size}/427_2.png",
  "created_at": "2025-09-02T23:52:41.332Z",
  "cooked": "<p>In <a href=\"https://delvingbitcoin.org/t/delving-simplicity-part-combinator-completeness-of-simplicity/1935\">Part Ⅱ</a> of this series, we introduced Simplicity’s type system and its core set of computational combinators. However, with only three kinds of type formers and nine core combinators, the language may seem too meager for practical computations. Can we really build any computation using only the three fundamental forms of composition we described in Part Ⅰ of this series? In the same way that computers are built out of logic gates, we start with the humble bit and build up abstractions from it. Let’s delve in.</p>\n<h1><a name=\"p-5795-boolean-logic-1\" class=\"anchor\" href=\"#p-5795-boolean-logic-1\"></a>Boolean Logic</h1>\n<p>In Part Ⅱ, we introduced the Boolean type, which is <code>𝟙 + 𝟙</code>. We use the notation <code>𝟚</code> for this type. It has two values: <code>σᴸ⟨⟩</code> and <code>σᴿ⟨⟩</code>. By convention, we use the notation <code>0</code> or <code>false</code> for <code>σᴸ⟨⟩</code>, and the notation <code>1</code> or <code>true</code> for <code>σᴿ⟨⟩</code>. Using our computational combinators, we can build Boolean logic operators.</p>\n<h2><a name=\"p-5795-and-operation-2\" class=\"anchor\" href=\"#p-5795-and-operation-2\"></a>And operation</h2>\n<p>The logical <code>and : 𝟚 × 𝟚 ⊢ 𝟚</code> operation takes two bits as input and returns one bit as output. Since Simplicity expressions have only a single input type, we use the product of the two input arguments as the input type. There are several ways of implementing this function. One way is to branch on the first bit: if the first bit is <code>false</code>, we return <code>false</code>; otherwise, we return the second bit.</p>\n<pre data-code-wrap=\"none\"><code class=\"lang-none\">and ≔ case (injl unit) (drop iden) : 𝟚 × 𝟚 ⊢ 𝟚\n</code></pre>\n<p>We can check this definition on the input <code>⟨false, false⟩</code> by using equational reasoning:</p>\n<pre data-code-wrap=\"none\"><code class=\"lang-none\">⟦and⟧⟨false, false⟩\n = {expand the notation for false}\n⟦and⟧⟨σᴸ⟨⟩, σᴸ⟨⟩⟩\n = {expand the definition of and}\n⟦case (injl unit) (drop iden)⟧⟨σᴸ⟨⟩, σᴸ⟨⟩⟩\n = {evaluate case for σᴸ}\n⟦injl unit⟧⟨⟨⟩, σᴸ⟨⟩⟩\n = {evaluate injl}\nσᴸ(⟦unit⟧⟨⟨⟩, σᴸ⟨⟩⟩)\n = {evaluate unit}\nσᴸ⟨⟩\n = {by the notation for false}\nfalse\n</code></pre>\n<p>We get the expected result of <code>false</code>.</p>\n<p>Let’s try it again on the input <code>⟨true, true⟩</code>.</p>\n<pre data-code-wrap=\"none\"><code class=\"lang-none\">⟦and⟧⟨true, true⟩\n = {expand the notation for true and the definition of and}\n⟦case (injl unit) (drop iden)⟧⟨σᴿ⟨⟩, σᴿ⟨⟩⟩\n = {evaluate case for σᴿ}\n⟦drop iden⟧⟨⟨⟩, σᴿ⟨⟩⟩\n = {evaluate drop}\n⟦iden⟧(σᴿ⟨⟩)\n = {evaluate iden}\nσᴿ⟨⟩\n = {by the notation for true}\ntrue\n</code></pre>\n<p>Again, we get the expected result of <code>true</code>. We will leave trying the remaining inputs for the curious reader.</p>\n<h2><a name=\"p-5795-other-logic-operations-3\" class=\"anchor\" href=\"#p-5795-other-logic-operations-3\"></a>Other logic operations</h2>\n<p>The definition of the <code>not</code> operation requires a helper combinator:</p>\n<pre data-code-wrap=\"none\"><code class=\"lang-none\">                   f : A ⊢ C    g : B ⊢ C\n-------------------------------------------------------------\ncopair f g ≔ iden ▵ unit ⨾ case (take f) (take g) : A + B ⊢ C\n</code></pre>\n<p>The initial <code>iden ▵ unit : A ⊢ A × 𝟙</code>  adds an empty “environment” to the input, enabling the <code>case</code> combinator to apply. The use of <code>take</code> in the two branches drops this empty environment to execute <code>f</code> or <code>g</code>.</p>\n<p>Now we can define all other Boolean logical operations:</p>\n<ul>\n<li><code>or ≔ case (drop iden) (injr unit) : 𝟚 × 𝟚 ⊢ 𝟚</code></li>\n<li><code>not ≔ copair (injr unit) (injl unit) : 𝟚 ⊢ 𝟚</code></li>\n<li><code>xor ≔ case (drop iden) (drop not) : 𝟚 × 𝟚 ⊢ 𝟚</code></li>\n</ul>\n<h2><a name=\"p-5795-bit-adders-4\" class=\"anchor\" href=\"#p-5795-bit-adders-4\"></a>Bit Adders</h2>\n<p>In digital logic, a “half-adder” is a circuit that takes two bits and adds them, producing a two-bit output: a carry bit and the sum bit. We can implement this in Simplicity by pairing up the <code>and</code> and <code>xor</code> operations:</p>\n<pre data-code-wrap=\"none\"><code class=\"lang-none\">half-adder ≔ and ▵ xor : 𝟚 × 𝟚 ⊢ 𝟚 × 𝟚 \n</code></pre>\n<p>This function has two output bits, so we return a pair of the two output types.</p>\n<p>A “full-adder” takes an additional third “carry-in” bit and adds them all together, producing the same two-bit output. We must use a nested tuple to represent three inputs. We have two choices: <code>𝟚 × (𝟚 × 𝟚)</code> or <code>(𝟚 × 𝟚) × 𝟚</code>. These types are not quite the same, and we must choose one. For this example, we will choose the latter.</p>\n<p>Types in Simplicity are often nested tuples, representing an “environment” of parameters. It is common to use sequences of <code>take</code>, <code>drop</code>, and <code>iden</code> to access specific parameters from such an environment. For sequences of these combinators, a compact notation will be used:</p>\n<ul>\n<li><code>O f</code>  is notation for <code>take f</code>.</li>\n<li><code>I f</code> is notation for <code>drop f</code>.</li>\n<li><code>H</code> is notation for <code>iden</code>.</li>\n</ul>\n<p>For example, <code>I O H</code> means <code>drop (take iden) : A × (B × C) ⊢ B</code>, which extracts the middle value out of its input.</p>\n<p>🛈\nThe use of <code>O</code> and <code>I</code> for <code>take</code> and <code>drop</code> is meant to evoke a sense of binary digits. If we think of a nested tuple as a binary tree and label the tree’s positions with positive binary numbers appropriately, then our notation becomes the reversed binary digits (thinking of <code>H</code> as the leading 1 digit) of a location within that tree from which we are retrieving data. Such expressions form a kind of De Bruijn indices for Simplicity</p>\n<p><img src=\"https://delvingbitcoin.org/images/emoji/twitter/warning.png?v=14\" title=\":warning:\" class=\"emoji only-emoji\" alt=\":warning:\" loading=\"lazy\" width=\"20\" height=\"20\">\nThe <code>I</code>, <code>O</code>, and <code>H</code> notation is only used for subexpressions that consist only of <code>take</code>, <code>drop</code>, and <code>iden</code>. They are not used for other occurrences of <code>take</code> or <code>drop</code>.</p>\n<p>A full-adder is the composition of two half-adders, taking the logical <code>or</code> of the two carry bits:</p>\n<pre data-code-wrap=\"none\"><code class=\"lang-none\">full-adder ≔ take half-adder ▵ I H\n           ⨾ O O H ▵ (O I H ▵ I H ⨾ half-adder)\n           ⨾ (O H ▵ I O H ⨾ or) ▵ I I H\n           : (𝟚 × 𝟚) × 𝟚 ⊢ 𝟚 × 𝟚\n</code></pre>\n<p>In the first line, <code>take half-adder ▵ I H : (𝟚 × 𝟚) × 𝟚 ⊢ (𝟚 × 𝟚) × 𝟚</code>, we run the half-adder on the first two bits, and we save the last bit. In the second line, <code>O O H ▵ (O I H ▵ I H ⨾ half-adder) : (𝟚 × 𝟚) × 𝟚 ⊢ 𝟚 × (𝟚 × 𝟚)</code>, we save the first bit (which is the carry-out bit of the first half-adder) and run the half-adder on the last two bits. In the last line, <code>(O H ▵ I O H ⨾ or) ▵ I I H: 𝟚 × (𝟚 × 𝟚) ⊢ 𝟚 × 𝟚</code>, we take the logical <em>or</em> of the first two bits (which are the carry-outs of the two half-adders) and also return the sum-out bit of the second half-adder.</p>\n<p>This code illustrates how one programs in Simplicity. We use the <code>I</code>, <code>O</code>, and <code>H</code> notation to reference bits of data from the subexpression’s input type, which is then formed into a suitable “environment” that is used to “call” other functions using sequential composition.</p>\n<p>Simplicity users do not have to define such low-level operations themselves. Later in this series, we will discuss our standard library of jets that implement common functions.</p>\n<p>Furthermore, end users are not expected to directly program in Simplicity, in the same way that end users are not expected to directly program with Bitcoin Script. Instead, we expect end users will use higher-level languages, such as SimplicityHL, to generate Simplicity. For example, SimplicityHL manages the “environment” of each subexpression, letting one use named variables, which are compiled into appropriate sequence of <code>take</code>s and <code>drop</code>s.</p>\n<h1><a name=\"p-5795-vectors-5\" class=\"anchor\" href=\"#p-5795-vectors-5\"></a>Vectors</h1>\n<p>Given a Simplicity type <code>A</code>, we can define fixed-length vectors by forming iterated products of <code>A</code>:</p>\n<ul>\n<li><code>A² ≔ A × A</code></li>\n<li><code>A⁴ ≔ A² × A²</code></li>\n<li><code>A⁸ ≔ A⁴ × A⁴</code></li>\n<li><code>…</code></li>\n</ul>\n<p>These types may be alternatively written as <code>A^2</code>, <code>A^4</code>, <code>A^8</code>, etc.</p>\n<p>We will define vectors only for lengths that are powers of two. One can define notation for other powers, but a convention needs to be chosen for how to bracket the product types.</p>\n<p>Given an expression <code>f : A ⊢ B</code>, we can repeatedly pair it with itself in order to “map” it over a vector of any fixed length:</p>\n<ul>\n<li><code>f² ≔ f ▵ f : A² ⊢ B²</code></li>\n<li><code>f⁴ ≔ f² ▵ f² : A⁴ ⊢ B⁴</code></li>\n<li><code>f⁸ ≔ f⁴ ▵ f⁴ : A⁸ ⊢ B⁸</code></li>\n</ul>\n<p>Given a function <code>f : A × B ⊢ B</code>, we can iterate or “fold” it over a vector of any fixed length:</p>\n<ul>\n<li><code>fold-right-2 f ≔ O O H ▵ (O I H ▵ I H ⨾ f) ⨾ f : A² × B ⊢ B</code></li>\n<li><code>fold-right-4 f ≔ fold-right-2 (fold-right-2 f) : A⁴ × B ⊢ B</code></li>\n<li><code>fold-right-8 f ≔ fold-right-2 (fold-right-4 f) : A⁸ × B ⊢ B</code></li>\n</ul>\n<p>There are many variations of these constructions we can implement. Given <code>f : A × B ⊢ C</code>, we can “zip” it over a pair of vectors with <code>zip-n f : (Aⁿ × Bⁿ) ⊢ Cⁿ</code>. Given <code>f : (A × B) × C ⊢ C</code>, we can fold it over a pair of vectors with <code>bifold-right-n f : (Aⁿ × Bⁿ) ⊢ C</code>. We can combine <code>map</code> and <code>fold-right</code> into an accumulating combinator that takes <code>f : A × C ⊢ C × B</code> and results in <code>map-accum-right-n f : Aⁿ × C ⊢ C × Bⁿ</code>. Many more variants are possible.</p>\n<h2><a name=\"p-5795-multi-bit-words-6\" class=\"anchor\" href=\"#p-5795-multi-bit-words-6\"></a>Multi-bit Words</h2>\n<p>A vector of bits gives us multi-bit integers. For example, <code>𝟚³²</code> is a 32-bit word type. <code>𝟚²⁵⁶</code> is a 256-bit word type, which is suitable for hashes and other cryptographic operations.</p>\n<p>Given our “full-adder” on bits, we can use a variant of the vector operations above to define a “ripple carry adder” over multi-bit words:</p>\n<pre data-code-wrap=\"none\"><code class=\"lang-none\">full-adder-n ≔ zip-accum-right-n full-adder : (𝟚ⁿ × 𝟚ⁿ) × 𝟚 ⊢ 𝟚 × 𝟚ⁿ\n</code></pre>\n<p><code>full-adder-n</code> takes two n-bit binary numbers and a one-bit carry-input value and returns a one-bit carry-out flag and an n-bit sum.</p>\n<h3><a name=\"p-5795-sha-256-7\" class=\"anchor\" href=\"#p-5795-sha-256-7\"></a>SHA-256</h3>\n<p>In this manner, we can recursively define all our arithmetic operations on multi-bit words: subtraction, multiplication, division, etc. We can define bit-wise logical operations such as logical <em>and</em>, logical <em>or</em>, logical <em>xor</em>, etc. By repeatedly combining these operations, we can even build SHA-256’s block compression function:</p>\n<p><code>sha256-hash-block ≔ … : 𝟚²⁵⁶ × 𝟚⁵¹² ⊢ 𝟚²⁵⁶</code></p>\n<p>But you don’t have to trust us. <a href=\"https://github.com/BlockstreamResearch/simplicity/blob/a619ab60d1c1e4c67b7e8680237ec811215f7cbc/Coq/Simplicity/SHA256.v#L93-L141\" rel=\"noopener nofollow ugc\">The SHA-256 compression is formally defined using Simplicity</a> within the Rocq proof assistant (formerly named the Coq proof assistant), and it comes with <a href=\"https://github.com/BlockstreamResearch/simplicity/blob/a619ab60d1c1e4c67b7e8680237ec811215f7cbc/Coq/Simplicity/SHA256.v#L235-L236\" rel=\"noopener nofollow ugc\">a formal proof that the <code>sha256-hash-block</code> implementation is correct</a>.</p>\n<p>Of course, the compression runs too slowly to be practical when executing it as raw Simplicity. We will introduce jets later in this series, which are used to execute common functions such as the SHA-256 compression function natively. However, we will still make use of such pure Simplicity implementations as formal specifications for our jets.</p>\n<h1><a name=\"p-5795-option-types-8\" class=\"anchor\" href=\"#p-5795-option-types-8\"></a>Option Types</h1>\n<p>Option types are made by taking a sum with the unit type:</p>\n<p><code>Option A ≔ 𝟙 + A</code></p>\n<p>The type <code>Option A</code> may also be written as <code>A?</code> or <code>𝕊 A</code> (where <code>𝕊</code> stands for “successor”). As with vectors, functions can be “mapped” over the option type:</p>\n<pre data-code-wrap=\"none\"><code class=\"lang-none\">                 f : A ⊢ B\n------------------------------------------\nf? ≔ copair (injl unit) (injr f) : A? ⊢ B?\n</code></pre>\n<p>We can also define monadic combinators such as bind:</p>\n<pre data-code-wrap=\"none\"><code class=\"lang-none\">              f : A ⊢ B?\n---------------------------------------\nbind f ≔ copair (injl unit) f : A? ⊢ B?\n</code></pre>\n<h1><a name=\"p-5795-variable-length-buffers-9\" class=\"anchor\" href=\"#p-5795-variable-length-buffers-9\"></a>Variable Length Buffers</h1>\n<p>We can also define what we call “buffers,” which are types for partially filled vectors.</p>\n<ul>\n<li><code>Aᑉ² ≔ A?</code></li>\n<li><code>Aᑉ⁴ ≔ A²? × Aᑉ²</code></li>\n<li><code>Aᑉ⁸ ≔ A⁴? × Aᑉ⁴</code></li>\n<li><code>…</code></li>\n</ul>\n<p>🛈\nThe type <code>Xᑉ⁸</code> expands to <code>(1 + X⁴) × ((1 + X²) × (1 + X))</code>. If we pretend this is a polynomial and expand it, we get <code>1 + X + X² + X³ + X⁴ + X⁵ + X⁶ + X⁷</code>. Interpreting this polynomial as a type, it is the sum of all possible tuples of X up to 7, including the empty tuple. In other words, it is exactly the type of lists whose length is strictly less than 8.</p>\n<p>As with vectors, we can define various mapping and folding operations over buffers. We can also define stack operations such as <code>push-&lt;n : Aᑉⁿ × A ⊢ Aⁿ + Aᑉⁿ</code> and <code>pop-&lt;n : Aᑉⁿ ⊢ (Aᑉⁿ × A)?</code>. <code>push-&lt;n</code> takes a buffer and a new item and appends it to the buffer, returning a full vector in case the buffer overflows. <code>pop-&lt;n</code> takes a buffer and removes an item, returning the smaller buffer and the item removed, optionally returning nothing in case the original buffer was empty.</p>\n<p>For example, we can define <code>push-&lt;n</code> recursively:</p>\n<ul>\n<li>\n<pre><code class=\"lang-auto\">push-&lt;2 ≔ case (drop (injr (injr iden))) (injl iden)\n</code></pre>\n</li>\n<li>\n<pre><code class=\"lang-auto\">push-&lt;4 ≔ ((O I H ▵ IH) ⨾ push-&lt;2) ▵ O O H\n        ⨾ case (I H ▵ O H ⨾ case (injr (injr (I H) ▵ injl unit)) (injl iden))\n               (injr (I H ▵ O H))\n</code></pre>\n</li>\n<li>\n<pre><code class=\"lang-auto\">push-&lt;8 ≔ ((O I H ▵ IH) ⨾ push-&lt;4) ▵ O O H\n        ⨾ case (I H ▵ O H ⨾ case (injr (injr (I H) ▵ (injl unit ▵ injl unit))) (injl iden))\n               (injr (I H ▵ O H))\n</code></pre>\n</li>\n<li><code>…</code></li>\n</ul>\n<p>As you can see, raw Simplicity becomes inscrutable once one reaches a certain level of complexity. Again, we expect end users to utilize higher-level languages, such as SimplicityHL, that can generate these idiomatic expressions.</p>\n<h1><a name=\"p-5795-conclusion-10\" class=\"anchor\" href=\"#p-5795-conclusion-10\"></a>Conclusion</h1>\n<p>In this part, we illustrated how to build logical operations starting from bits. From these logic operations, we were able to build bit-level arithmetic and illustrate how to reason about their execution. After developing vector types, we showed how to iterate over multi-bit words to define arithmetic. Continuing in this way, we can define cryptographic operations, such as SHA-256 and Schnorr signature validation, using just our computational Simplicity combinators. All of which we have actually defined using Simplicity.</p>\n<p>This part is not meant as a comprehensive guide to the various possible data types and operations that we can build in Simplicity, but instead, it serves to illustrate how it is possible to build practical functionality within Simplicity’s constraints. Even though Simplicity’s types are all finitely bounded, we can still define useful vectors and buffer types and operations that iterate over values within these structures.</p>\n<p>The actual specifications of operations in our standard library are a little different from the definitions used here. For instance, the full-adder in our standard library uses a 3-way <em>xor</em> and a “majority” logic function in its implementation, rather than using two half-adders as shown here.</p>\n<p>Later, we will see that, in practice, Simplicity programs use jets for arithmetic and cryptographic operations. However, jets are limited to replacing expressions. The combinators for iterating over buffers and vectors we have defined cannot be replaced with jets. These defined combinators will appear in actual Simplicity programs. Although, rather than directly using these combinators, we expect end users will use higher-level languages, such as SimplicityHL, to generate such Simplicity expressions.</p>\n<p>A keen-eyed reader may have noticed that our recursively defined combinators appear to grow exponentially in expression size. However, this is not a problem. Later, when we talk about serialization, we will see that expressions are encoded as a DAG (directed acyclic graph) rather than as a tree. So the actual presentation of these expressions will only grow linearly in size.</p>\n<p>So far, we have only been considering pure computations. However, we need some way to interact with transaction data for tasks like signing transactions, and we need to be able to have the program fail somehow if the signature is not valid. In the next part, we will discuss side-effects in Simplicity.</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 1,
  "updated_at": "2025-09-02T23:52:41.332Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 35,
  "reads": 36,
  "readers_count": 35,
  "score": 197.2,
  "yours": false,
  "topic_id": 1956,
  "topic_slug": "delving-simplicity-part-building-data-types",
  "topic_title": "Delving Simplicity Part Ⅲ: Building Data Types",
  "topic_html_title": "Delving Simplicity Part Ⅲ: Building Data Types",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "In [Part Ⅱ](https://delvingbitcoin.org/t/delving-simplicity-part-combinator-completeness-of-simplicity/1935) of this series, we introduced Simplicity’s type system and its core set of computational combinators. However, with only three kinds of type formers and nine core combinators, the language may seem too meager for practical computations. Can we really build any computation using only the three fundamental forms of composition we described in Part Ⅰ of this series? In the same way that computers are built out of logic gates, we start with the humble bit and build up abstractions from it. Let’s delve in.\n\n# Boolean Logic\n\nIn Part Ⅱ, we introduced the Boolean type, which is `𝟙 + 𝟙`. We use the notation `𝟚` for this type. It has two values: `σᴸ⟨⟩` and `σᴿ⟨⟩`. By convention, we use the notation `0` or `false` for `σᴸ⟨⟩`, and the notation `1` or `true` for `σᴿ⟨⟩`. Using our computational combinators, we can build Boolean logic operators.\n\n## And operation\n\nThe logical `and : 𝟚 × 𝟚 ⊢ 𝟚` operation takes two bits as input and returns one bit as output. Since Simplicity expressions have only a single input type, we use the product of the two input arguments as the input type. There are several ways of implementing this function. One way is to branch on the first bit: if the first bit is `false`, we return `false`; otherwise, we return the second bit.\n\n```none\nand ≔ case (injl unit) (drop iden) : 𝟚 × 𝟚 ⊢ 𝟚\n```\n\nWe can check this definition on the input `⟨false, false⟩` by using equational reasoning:\n\n```none\n⟦and⟧⟨false, false⟩\n = {expand the notation for false}\n⟦and⟧⟨σᴸ⟨⟩, σᴸ⟨⟩⟩\n = {expand the definition of and}\n⟦case (injl unit) (drop iden)⟧⟨σᴸ⟨⟩, σᴸ⟨⟩⟩\n = {evaluate case for σᴸ}\n⟦injl unit⟧⟨⟨⟩, σᴸ⟨⟩⟩\n = {evaluate injl}\nσᴸ(⟦unit⟧⟨⟨⟩, σᴸ⟨⟩⟩)\n = {evaluate unit}\nσᴸ⟨⟩\n = {by the notation for false}\nfalse\n```\n\nWe get the expected result of `false`. \n\nLet’s try it again on the input `⟨true, true⟩`.\n\n```none\n⟦and⟧⟨true, true⟩\n = {expand the notation for true and the definition of and}\n⟦case (injl unit) (drop iden)⟧⟨σᴿ⟨⟩, σᴿ⟨⟩⟩\n = {evaluate case for σᴿ}\n⟦drop iden⟧⟨⟨⟩, σᴿ⟨⟩⟩\n = {evaluate drop}\n⟦iden⟧(σᴿ⟨⟩)\n = {evaluate iden}\nσᴿ⟨⟩\n = {by the notation for true}\ntrue\n```\n\nAgain, we get the expected result of `true`. We will leave trying the remaining inputs for the curious reader.\n\n## Other logic operations\n\nThe definition of the `not` operation requires a helper combinator:\n\n```none\n                   f : A ⊢ C    g : B ⊢ C\n-------------------------------------------------------------\ncopair f g ≔ iden ▵ unit ⨾ case (take f) (take g) : A + B ⊢ C\n```\n\nThe initial `iden ▵ unit : A ⊢ A × 𝟙`  adds an empty “environment” to the input, enabling the `case` combinator to apply. The use of `take` in the two branches drops this empty environment to execute `f` or `g`.\n\nNow we can define all other Boolean logical operations:\n\n* `or ≔ case (drop iden) (injr unit) : 𝟚 × 𝟚 ⊢ 𝟚`\n* `not ≔ copair (injr unit) (injl unit) : 𝟚 ⊢ 𝟚`\n* `xor ≔ case (drop iden) (drop not) : 𝟚 × 𝟚 ⊢ 𝟚`\n\n## Bit Adders\n\nIn digital logic, a “half-adder” is a circuit that takes two bits and adds them, producing a two-bit output: a carry bit and the sum bit. We can implement this in Simplicity by pairing up the `and` and `xor` operations:\n\n```none\nhalf-adder ≔ and ▵ xor : 𝟚 × 𝟚 ⊢ 𝟚 × 𝟚 \n```\n\nThis function has two output bits, so we return a pair of the two output types.\n\nA “full-adder” takes an additional third “carry-in” bit and adds them all together, producing the same two-bit output. We must use a nested tuple to represent three inputs. We have two choices: `𝟚 × (𝟚 × 𝟚)` or `(𝟚 × 𝟚) × 𝟚`. These types are not quite the same, and we must choose one. For this example, we will choose the latter.\n\nTypes in Simplicity are often nested tuples, representing an “environment” of parameters. It is common to use sequences of `take`, `drop`, and `iden` to access specific parameters from such an environment. For sequences of these combinators, a compact notation will be used:\n\n* `O f`  is notation for `take f`.\n* `I f` is notation for `drop f`.\n* `H` is notation for `iden`.\n\nFor example, `I O H` means `drop (take iden) : A × (B × C) ⊢ B`, which extracts the middle value out of its input.\n\n\n🛈\nThe use of `O` and `I` for `take` and `drop` is meant to evoke a sense of binary digits. If we think of a nested tuple as a binary tree and label the tree’s positions with positive binary numbers appropriately, then our notation becomes the reversed binary digits (thinking of `H` as the leading 1 digit) of a location within that tree from which we are retrieving data. Such expressions form a kind of De Bruijn indices for Simplicity\n\n⚠\nThe `I`, `O`, and `H` notation is only used for subexpressions that consist only of `take`, `drop`, and `iden`. They are not used for other occurrences of `take` or `drop`.\n\nA full-adder is the composition of two half-adders, taking the logical `or` of the two carry bits:\n\n```none\nfull-adder ≔ take half-adder ▵ I H\n           ⨾ O O H ▵ (O I H ▵ I H ⨾ half-adder)\n           ⨾ (O H ▵ I O H ⨾ or) ▵ I I H\n           : (𝟚 × 𝟚) × 𝟚 ⊢ 𝟚 × 𝟚\n```\n\nIn the first line, `take half-adder ▵ I H : (𝟚 × 𝟚) × 𝟚 ⊢ (𝟚 × 𝟚) × 𝟚`, we run the half-adder on the first two bits, and we save the last bit. In the second line, `O O H ▵ (O I H ▵ I H ⨾ half-adder) : (𝟚 × 𝟚) × 𝟚 ⊢ 𝟚 × (𝟚 × 𝟚)`, we save the first bit (which is the carry-out bit of the first half-adder) and run the half-adder on the last two bits. In the last line, `(O H ▵ I O H ⨾ or) ▵ I I H: 𝟚 × (𝟚 × 𝟚) ⊢ 𝟚 × 𝟚`, we take the logical *or* of the first two bits (which are the carry-outs of the two half-adders) and also return the sum-out bit of the second half-adder.\n\nThis code illustrates how one programs in Simplicity. We use the `I`, `O`, and `H` notation to reference bits of data from the subexpression’s input type, which is then formed into a suitable “environment” that is used to “call” other functions using sequential composition.\n\nSimplicity users do not have to define such low-level operations themselves. Later in this series, we will discuss our standard library of jets that implement common functions.\n\nFurthermore, end users are not expected to directly program in Simplicity, in the same way that end users are not expected to directly program with Bitcoin Script. Instead, we expect end users will use higher-level languages, such as SimplicityHL, to generate Simplicity. For example, SimplicityHL manages the “environment” of each subexpression, letting one use named variables, which are compiled into appropriate sequence of `take`s and `drop`s.\n\n# Vectors\n\nGiven a Simplicity type `A`, we can define fixed-length vectors by forming iterated products of `A`:\n\n* `A² ≔ A × A`\n* `A⁴ ≔ A² × A²`\n* `A⁸ ≔ A⁴ × A⁴`\n* `…`\n\nThese types may be alternatively written as `A^2`, `A^4`, `A^8`, etc.\n\nWe will define vectors only for lengths that are powers of two. One can define notation for other powers, but a convention needs to be chosen for how to bracket the product types.\n\nGiven an expression `f : A ⊢ B`, we can repeatedly pair it with itself in order to “map” it over a vector of any fixed length:\n\n* `f² ≔ f ▵ f : A² ⊢ B²`\n* `f⁴ ≔ f² ▵ f² : A⁴ ⊢ B⁴`\n* `f⁸ ≔ f⁴ ▵ f⁴ : A⁸ ⊢ B⁸`\n\nGiven a function `f : A × B ⊢ B`, we can iterate or “fold” it over a vector of any fixed length:\n\n* `fold-right-2 f ≔ O O H ▵ (O I H ▵ I H ⨾ f) ⨾ f : A² × B ⊢ B`\n* `fold-right-4 f ≔ fold-right-2 (fold-right-2 f) : A⁴ × B ⊢ B`\n* `fold-right-8 f ≔ fold-right-2 (fold-right-4 f) : A⁸ × B ⊢ B`\n\nThere are many variations of these constructions we can implement. Given `f : A × B ⊢ C`, we can “zip” it over a pair of vectors with `zip-n f : (Aⁿ × Bⁿ) ⊢ Cⁿ`. Given `f : (A × B) × C ⊢ C`, we can fold it over a pair of vectors with `bifold-right-n f : (Aⁿ × Bⁿ) ⊢ C`. We can combine `map` and `fold-right` into an accumulating combinator that takes `f : A × C ⊢ C × B` and results in `map-accum-right-n f : Aⁿ × C ⊢ C × Bⁿ`. Many more variants are possible.\n\n## Multi-bit Words\n\nA vector of bits gives us multi-bit integers. For example, `𝟚³²` is a 32-bit word type. `𝟚²⁵⁶` is a 256-bit word type, which is suitable for hashes and other cryptographic operations.\n\nGiven our “full-adder” on bits, we can use a variant of the vector operations above to define a “ripple carry adder” over multi-bit words:\n\n```none\nfull-adder-n ≔ zip-accum-right-n full-adder : (𝟚ⁿ × 𝟚ⁿ) × 𝟚 ⊢ 𝟚 × 𝟚ⁿ\n```\n\n`full-adder-n` takes two n-bit binary numbers and a one-bit carry-input value and returns a one-bit carry-out flag and an n-bit sum.\n\n### SHA-256\n\nIn this manner, we can recursively define all our arithmetic operations on multi-bit words: subtraction, multiplication, division, etc. We can define bit-wise logical operations such as logical *and*, logical *or*, logical *xor*, etc. By repeatedly combining these operations, we can even build SHA-256’s block compression function: \n\n`sha256-hash-block ≔ … : 𝟚²⁵⁶ × 𝟚⁵¹² ⊢ 𝟚²⁵⁶`\n\nBut you don’t have to trust us. [The SHA-256 compression is formally defined using Simplicity](https://github.com/BlockstreamResearch/simplicity/blob/a619ab60d1c1e4c67b7e8680237ec811215f7cbc/Coq/Simplicity/SHA256.v#L93-L141) within the Rocq proof assistant (formerly named the Coq proof assistant), and it comes with [a formal proof that the `sha256-hash-block` implementation is correct](https://github.com/BlockstreamResearch/simplicity/blob/a619ab60d1c1e4c67b7e8680237ec811215f7cbc/Coq/Simplicity/SHA256.v#L235-L236).\n\nOf course, the compression runs too slowly to be practical when executing it as raw Simplicity. We will introduce jets later in this series, which are used to execute common functions such as the SHA-256 compression function natively. However, we will still make use of such pure Simplicity implementations as formal specifications for our jets.\n\n# Option Types\n\nOption types are made by taking a sum with the unit type:\n\n`Option A ≔ 𝟙 + A`\n\nThe type `Option A` may also be written as `A?` or `𝕊 A` (where `𝕊` stands for “successor”). As with vectors, functions can be “mapped” over the option type:\n\n```none\n                 f : A ⊢ B\n------------------------------------------\nf? ≔ copair (injl unit) (injr f) : A? ⊢ B?\n```\n\nWe can also define monadic combinators such as bind:\n\n```none\n              f : A ⊢ B?\n---------------------------------------\nbind f ≔ copair (injl unit) f : A? ⊢ B?\n```\n\n# Variable Length Buffers\n\nWe can also define what we call “buffers,” which are types for partially filled vectors.\n\n* `Aᑉ² ≔ A?`\n* `Aᑉ⁴ ≔ A²? × Aᑉ²`\n* `Aᑉ⁸ ≔ A⁴? × Aᑉ⁴`\n* `…`\n\n\n🛈\nThe type `Xᑉ⁸` expands to `(1 + X⁴) × ((1 + X²) × (1 + X))`. If we pretend this is a polynomial and expand it, we get `1 + X + X² + X³ + X⁴ + X⁵ + X⁶ + X⁷`. Interpreting this polynomial as a type, it is the sum of all possible tuples of X up to 7, including the empty tuple. In other words, it is exactly the type of lists whose length is strictly less than 8.\n\nAs with vectors, we can define various mapping and folding operations over buffers. We can also define stack operations such as `push-<n : Aᑉⁿ × A ⊢ Aⁿ + Aᑉⁿ` and `pop-<n : Aᑉⁿ ⊢ (Aᑉⁿ × A)?`. `push-<n` takes a buffer and a new item and appends it to the buffer, returning a full vector in case the buffer overflows. `pop-<n` takes a buffer and removes an item, returning the smaller buffer and the item removed, optionally returning nothing in case the original buffer was empty.\n\nFor example, we can define `push-<n` recursively:\n\n* ```\n  push-<2 ≔ case (drop (injr (injr iden))) (injl iden)\n* ```\n  push-<4 ≔ ((O I H ▵ IH) ⨾ push-<2) ▵ O O H\n          ⨾ case (I H ▵ O H ⨾ case (injr (injr (I H) ▵ injl unit)) (injl iden))\n                 (injr (I H ▵ O H))\n* ```\n  push-<8 ≔ ((O I H ▵ IH) ⨾ push-<4) ▵ O O H\n          ⨾ case (I H ▵ O H ⨾ case (injr (injr (I H) ▵ (injl unit ▵ injl unit))) (injl iden))\n                 (injr (I H ▵ O H))\n* `…`\n\nAs you can see, raw Simplicity becomes inscrutable once one reaches a certain level of complexity. Again, we expect end users to utilize higher-level languages, such as SimplicityHL, that can generate these idiomatic expressions.\n\n# Conclusion\n\nIn this part, we illustrated how to build logical operations starting from bits. From these logic operations, we were able to build bit-level arithmetic and illustrate how to reason about their execution. After developing vector types, we showed how to iterate over multi-bit words to define arithmetic. Continuing in this way, we can define cryptographic operations, such as SHA-256 and Schnorr signature validation, using just our computational Simplicity combinators. All of which we have actually defined using Simplicity.\n\nThis part is not meant as a comprehensive guide to the various possible data types and operations that we can build in Simplicity, but instead, it serves to illustrate how it is possible to build practical functionality within Simplicity’s constraints. Even though Simplicity’s types are all finitely bounded, we can still define useful vectors and buffer types and operations that iterate over values within these structures.\n\nThe actual specifications of operations in our standard library are a little different from the definitions used here. For instance, the full-adder in our standard library uses a 3-way *xor* and a “majority” logic function in its implementation, rather than using two half-adders as shown here.\n\nLater, we will see that, in practice, Simplicity programs use jets for arithmetic and cryptographic operations. However, jets are limited to replacing expressions. The combinators for iterating over buffers and vectors we have defined cannot be replaced with jets. These defined combinators will appear in actual Simplicity programs. Although, rather than directly using these combinators, we expect end users will use higher-level languages, such as SimplicityHL, to generate such Simplicity expressions.\n\nA keen-eyed reader may have noticed that our recursively defined combinators appear to grow exponentially in expression size. However, this is not a problem. Later, when we talk about serialization, we will see that expressions are encoded as a DAG (directed acyclic graph) rather than as a tree. So the actual presentation of these expressions will only grow linearly in size.\n\nSo far, we have only been considering pure computations. However, we need some way to interact with transaction data for tasks like signing transactions, and we need to be able to have the program fail somehow if the signature is not valid. In the next part, we will discuss side-effects in Simplicity.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 351,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "In <a href=\"https://delvingbitcoin.org/t/delving-simplicity-part-combinator-completeness-of-simplicity/1935\">Part Ⅱ</a> of this series, we introduced Simplicity’s type system and its core set of computational combinators. However, with only three kinds of type formers and nine core combinators, the language may seem too meager for practical computations. Can we really build any computation using only the th&hellip;",
  "truncated": true,
  "post_url": "/t/delving-simplicity-part-building-data-types/1956/1",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}