{
  "id": 3762,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/417_2.png",
  "created_at": "2024-12-12T05:57:47.375Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"fiatjaf\" data-post=\"13\" data-topic=\"1257\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/fiatjaf/48/18_2.png\" class=\"avatar\"> fiatjaf:</div>\n<blockquote>\n<p>t looks like 50 was just the number of precomputed transactions that was stored initially by the miner (and presumably it would run the computation again and store more transactions when it was restarted).</p>\n</blockquote>\n</aside>\n<p>Ah, that makes more sense. Could cache every 4000th hash, and the next 4000 hashes, so you don’t have to recalculate all 5M hashes everytime you run out of cached hashes. Would only be ~20k hashes (640kB) to cache even for the 1000 year case then, and you could save them to disk or precalculate at compile-time.</p>\n<aside class=\"quote no-group\" data-username=\"fiatjaf\" data-post=\"13\" data-topic=\"1257\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/fiatjaf/48/18_2.png\" class=\"avatar\"> fiatjaf:</div>\n<blockquote>\n<p>I ran the demo miners and spacechain nodes for months and tried to get people to use it, but didn’t get much attention, maybe ~10 people played with it at the time.</p>\n</blockquote>\n</aside>\n<p>Yeah, gotta have a marketing plan to build up lots of drama/excitement if you want attention in the NFT/memecoin space. As far as I’m aware, it never even got mentioned in any of the tech spaces I follow (eg bitcoin-dev, optech). OTOH, I expect I would have ignored anything I did see though, since that was around the time of the <a href=\"https://bitcoincore.org/en/2024/10/08/disclose-large-inv-to-send/\">inv-to-send issue</a>. Shame.</p>\n<p>Two things that would probably be interesting, but also perhaps much harder than what you did: a spacechain that includes actual new programming features (simplicity? EVM like RSK? confidential txs? multiple fungible assets? utreexo commitments?), and/or a spacechain with a currency that’s pegged against sBTC in some way (even a boring trusted third-party way like RKS’s or liquid’s multisig federation or whatever WBTC does), so the chain could theoretically help with “overflow txs” during fee spikes. But those are probably hard to do, and it’s better to be simple but implemented than fancy but imaginary.</p>\n<p>Maybe utreexo commitments could be interesting for NFTs – you could have short proofs that you “own” your profile picture NFT; though having the proof potentially change every block might be too awkward in practice… I guess you’d need some way to link the things you mint to some other data though; atm I think soma just lets you create a token that’s tradeable but has no link to anything else? <a href=\"https://gnusha.org/pi/bitcoindev/Y9t%2FNcgRzv1w%2F%2FFx@erisian.com.au/\">Reverse commitments</a>, where the data links to the token (instead of the token containing/committing to the data) might work fine with soma as-is though, though then you’d also need to add an <code>O(n_transfers)</code>-size proof that your utxo matches the token… a spacechain with a chia-esque coin-set model instead of a utxo model could let you avoid that, though…</p>\n<p>How reliable spacechains are in adversarial environments is a big question to me; will people actually fully validate spacechains, or is there a risk that you can just pay to mine lots of “invalid” spacechain blocks and that will be accepted anyway? How easy/disruptive are reorgs – if you can reorg some blocks, doublespend one transaction, but nobody else loses out (because there’s no coinbase fees), will anyone try to prevent the reorg, or is the person being doublespent on their own? Could be fun to explore that sort of thing with a real implementation.</p>\n<aside class=\"quote no-group\" data-username=\"fiatjaf\" data-post=\"13\" data-topic=\"1257\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/fiatjaf/48/18_2.png\" class=\"avatar\"> fiatjaf:</div>\n<blockquote>\n<p>I ran the demo miners and spacechain nodes for months and tried to get people to use it, but didn’t get much attention, maybe ~10 people played with it at the time.</p>\n</blockquote>\n</aside>\n<p>That’s probably similar to the actual usage of the powcoins script, fwiw. Also comparable to bitcoin itself, really; ignoring coinbase txs, there were only 93 txs in its first 3 months (10570 blocks). Sometimes you just have to give these things time.</p>\n<aside class=\"quote no-group\" data-username=\"fiatjaf\" data-post=\"13\" data-topic=\"1257\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/fiatjaf/48/18_2.png\" class=\"avatar\"> fiatjaf:</div>\n<blockquote>\n<p>For the BMM covenant I should have used a provably invalid key (is that what a NUMS mean?),</p>\n</blockquote>\n</aside>\n<p>Yeah, “Nothing Up My Sleeve” – ie, “it’s completely/cryptographically infeasible for me to possibly have a private key/preimage/etc corresponding to this”.</p>\n<aside class=\"quote no-group\" data-username=\"fiatjaf\" data-post=\"13\" data-topic=\"1257\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/fiatjaf/48/18_2.png\" class=\"avatar\"> fiatjaf:</div>\n<blockquote>\n<p>Miners would hold the Lightning payment in-flight while they gathered more transactions from other spacechain users and then try to use the funds they got via Lightning to pay for an onchain BMM transaction,</p>\n</blockquote>\n</aside>\n<p>Sounds a bit complicated for an experiment tbh; though I see you setup a thing to auto pay people’s invoices for them anyway. I think I can see how you could plausibly build up a reputation as a trustworthy miner for people to be willing to go through that process with non-fake coins. Neat.</p>\n<aside class=\"quote no-group\" data-username=\"fiatjaf\" data-post=\"13\" data-topic=\"1257\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/fiatjaf/48/18_2.png\" class=\"avatar\"> fiatjaf:</div>\n<blockquote>\n<p>I thought about keeping a record of the blockchain data, but it was too depressing and the blockchain didn’t really have any value, it probably makes more sense to start a new spacechain now and test again if anyone is interested.</p>\n</blockquote>\n</aside>\n<p>If you do, I’d suggest trying to make something that you can just leave running unattended for ages, and ideally that automatically includes some spacechain content occassionally, even if it’s trivial. Automatically dumping the block data into a github repo once a week might be workable? If the explorer could make static html pages that could also go into the github repo that would maybe be nice, as a low overhead way of making it still explorable even if you don’t want to keep actually maintaining/running the servers?</p>",
  "post_number": 15,
  "post_type": 1,
  "updated_at": "2024-12-12T05:57:47.375Z",
  "reply_count": 0,
  "reply_to_post_number": 13,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 15,
  "readers_count": 14,
  "score": 2.8,
  "yours": false,
  "topic_id": 1257,
  "topic_slug": "ctv-apo-cat-activity-on-signet",
  "topic_title": "CTV, APO, CAT activity on signet",
  "topic_html_title": "CTV, APO, CAT activity on signet",
  "category_id": 8,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"fiatjaf, post:13, topic:1257\"]\nt looks like 50 was just the number of precomputed transactions that was stored initially by the miner (and presumably it would run the computation again and store more transactions when it was restarted).\n[/quote]\n\nAh, that makes more sense. Could cache every 4000th hash, and the next 4000 hashes, so you don't have to recalculate all 5M hashes everytime you run out of cached hashes. Would only be ~20k hashes (640kB) to cache even for the 1000 year case then, and you could save them to disk or precalculate at compile-time.\n\n[quote=\"fiatjaf, post:13, topic:1257\"]\nI ran the demo miners and spacechain nodes for months and tried to get people to use it, but didn’t get much attention, maybe ~10 people played with it at the time.\n[/quote]\n\nYeah, gotta have a marketing plan to build up lots of drama/excitement if you want attention in the NFT/memecoin space. As far as I'm aware, it never even got mentioned in any of the tech spaces I follow (eg bitcoin-dev, optech). OTOH, I expect I would have ignored anything I did see though, since that was around the time of the [inv-to-send issue](https://bitcoincore.org/en/2024/10/08/disclose-large-inv-to-send/). Shame.\n\nTwo things that would probably be interesting, but also perhaps much harder than what you did: a spacechain that includes actual new programming features (simplicity? EVM like RSK? confidential txs? multiple fungible assets? utreexo commitments?), and/or a spacechain with a currency that's pegged against sBTC in some way (even a boring trusted third-party way like RKS's or liquid's multisig federation or whatever WBTC does), so the chain could theoretically help with \"overflow txs\" during fee spikes. But those are probably hard to do, and it's better to be simple but implemented than fancy but imaginary.\n\nMaybe utreexo commitments could be interesting for NFTs -- you could have short proofs that you \"own\" your profile picture NFT; though having the proof potentially change every block might be too awkward in practice... I guess you'd need some way to link the things you mint to some other data though; atm I think soma just lets you create a token that's tradeable but has no link to anything else? [Reverse commitments](https://gnusha.org/pi/bitcoindev/Y9t%2FNcgRzv1w%2F%2FFx@erisian.com.au/), where the data links to the token (instead of the token containing/committing to the data) might work fine with soma as-is though, though then you'd also need to add an `O(n_transfers)`-size proof that your utxo matches the token... a spacechain with a chia-esque coin-set model instead of a utxo model could let you avoid that, though...\n\nHow reliable spacechains are in adversarial environments is a big question to me; will people actually fully validate spacechains, or is there a risk that you can just pay to mine lots of \"invalid\" spacechain blocks and that will be accepted anyway? How easy/disruptive are reorgs -- if you can reorg some blocks, doublespend one transaction, but nobody else loses out (because there's no coinbase fees), will anyone try to prevent the reorg, or is the person being doublespent on their own? Could be fun to explore that sort of thing with a real implementation.\n\n[quote=\"fiatjaf, post:13, topic:1257\"]\nI ran the demo miners and spacechain nodes for months and tried to get people to use it, but didn’t get much attention, maybe ~10 people played with it at the time.\n[/quote]\n\nThat's probably similar to the actual usage of the powcoins script, fwiw. Also comparable to bitcoin itself, really; ignoring coinbase txs, there were only 93 txs in its first 3 months (10570 blocks). Sometimes you just have to give these things time.\n\n[quote=\"fiatjaf, post:13, topic:1257\"]\nFor the BMM covenant I should have used a provably invalid key (is that what a NUMS mean?),\n[/quote]\n\nYeah, \"Nothing Up My Sleeve\" -- ie, \"it's completely/cryptographically infeasible for me to possibly have a private key/preimage/etc corresponding to this\".\n\n[quote=\"fiatjaf, post:13, topic:1257\"]\nMiners would hold the Lightning payment in-flight while they gathered more transactions from other spacechain users and then try to use the funds they got via Lightning to pay for an onchain BMM transaction,\n[/quote]\n\nSounds a bit complicated for an experiment tbh; though I see you setup a thing to auto pay people's invoices for them anyway. I think I can see how you could plausibly build up a reputation as a trustworthy miner for people to be willing to go through that process with non-fake coins. Neat.\n\n[quote=\"fiatjaf, post:13, topic:1257\"]\nI thought about keeping a record of the blockchain data, but it was too depressing and the blockchain didn’t really have any value, it probably makes more sense to start a new spacechain now and test again if anyone is interested.\n[/quote]\n\nIf you do, I'd suggest trying to make something that you can just leave running unattended for ages, and ideally that automatically includes some spacechain content occassionally, even if it's trivial. Automatically dumping the block data into a github repo once a week might be workable? If the explorer could make static html pages that could also go into the github repo that would maybe be nice, as a low overhead way of making it still explorable even if you don't want to keep actually maintaining/running the servers?",
  "actions_summary": [],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}