{
  "id": 3859,
  "name": "Zawy",
  "username": "zawy",
  "avatar_template": "/user_avatar/delvingbitcoin.org/zawy/{size}/750_2.png",
  "created_at": "2024-12-25T14:37:44.061Z",
  "cooked": "<p>They can’t increase the block rate to get 10% more unless they also have &gt; 50% and privately mine for 212 periods to reliably keep the MTP held back. Publicly they’d need something like 99%. But if they do a private mine they get 50% more blocks per time than they would publicly after the 1st adjustment for as long as they mine.</p>\n<p>But they don’t get the 10% gain for the same reason. Delaying 600 s in 1st cycle lowers the difficulty enough for him to get an extra block in the 2nd. But getting 1 more block means difficulty goes up in the 3rd cycle to offset the gain if he doesn’t do the -600 in the next cycle. So he can only maintain getting 1 extra block per cycle. It’s not an advantage that can accumulate. So he gets only 212 blocks which isnt important compared to getting 212 × 2016 excess blocks from doing the private mine (over a public mine). So it’s a 0.05% gain over a private mine and a -3 hour limit is a 0.9% gain.</p>\n<ul>\n<li>cycle =&gt; blocks/cycle at 50% =&gt;  blocks per 2 weeks</li>\n<li>1 =&gt; 1008 (normal before attack) =&gt; 1008</li>\n<li>2 =&gt; 2016 (private mine begin -3 hr timestamp) =&gt; 1008  (takes 4 weeks)</li>\n<li>3=&gt; 2016 (-3 hr) =&gt; took 2 weeks minus 3 hr due to previous stamp</li>\n<li>4 =&gt; 2016 (-3 hr) =&gt; took 2 weeks minus 3 hr</li>\n</ul>\n<p>He keeps the last timestamp in a cycle at current time. There’s not a way to hold it back or push it forward to help. The only thing he gets over a private mine is more time at the end to mine 1 extra week than he otherwise could have. After 112 cycles he would get a gain of 2 weeks to get 2016 +18 blocks more blocks than doing nothing, less than 2% of the “excess” gains of just being a private mine ( 2016/2 * 112).</p>\n<p>I see no reason to dismiss the concerns that -600 will break something. This is my 3rd request that someone explain how it helps.</p>",
  "post_number": 17,
  "post_type": 1,
  "updated_at": "2024-12-26T10:00:35.246Z",
  "reply_count": 0,
  "reply_to_post_number": 16,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 17,
  "readers_count": 16,
  "score": 2.8,
  "yours": false,
  "topic_id": 1326,
  "topic_slug": "timewarp-attack-600-second-grace-period",
  "topic_title": "Timewarp attack 600 second grace period",
  "topic_html_title": "Timewarp attack 600 second grace period",
  "category_id": 7,
  "display_username": "Zawy",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 4,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "AntoineP",
    "name": "Antoine Poinsot",
    "avatar_template": "/user_avatar/delvingbitcoin.org/antoinep/{size}/483_2.png"
  },
  "bookmarked": false,
  "raw": "They can't increase the block rate to get 10% more unless they also have > 50% and privately mine for 212 periods to reliably keep the MTP held back. Publicly they'd need something like 99%. But if they do a private mine they get 50% more blocks per time than they would publicly after the 1st adjustment for as long as they mine. \n\nBut they don't get the 10% gain for the same reason. Delaying 600 s in 1st cycle lowers the difficulty enough for him to get an extra block in the 2nd. But getting 1 more block means difficulty goes up in the 3rd cycle to offset the gain if he doesn't do the -600 in the next cycle. So he can only maintain getting 1 extra block per cycle. It's not an advantage that can accumulate. So he gets only 212 blocks which isnt important compared to getting 212 × 2016 excess blocks from doing the private mine (over a public mine). So it's a 0.05% gain over a private mine and a -3 hour limit is a 0.9% gain.\n\n* cycle => blocks/cycle at 50% =>  blocks per 2 weeks\n* 1 => 1008 (normal before attack) => 1008\n* 2 => 2016 (private mine begin -3 hr timestamp) => 1008  (takes 4 weeks)\n* 3=> 2016 (-3 hr) => took 2 weeks minus 3 hr due to previous stamp\n* 4 => 2016 (-3 hr) => took 2 weeks minus 3 hr\n\nHe keeps the last timestamp in a cycle at current time. There's not a way to hold it back or push it forward to help. The only thing he gets over a private mine is more time at the end to mine 1 extra week than he otherwise could have. After 112 cycles he would get a gain of 2 weeks to get 2016 +18 blocks more blocks than doing nothing, less than 2% of the \"excess\" gains of just being a private mine ( 2016/2 * 112).\n\nI see no reason to dismiss the concerns that -600 will break something. This is my 3rd request that someone explain how it helps.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 502,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}