{
  "id": 3893,
  "name": "moonsettler",
  "username": "moonsettler",
  "avatar_template": "/user_avatar/delvingbitcoin.org/moonsettler/{size}/38_2.png",
  "created_at": "2024-12-30T11:56:20.299Z",
  "cooked": "<p>I think it’s worth pointing out that nothing we currently do is post-quantum. CTV would be quantum resistant as far as SHA256 is, but the scaling related constructs take extensive use of Taproot Schnorr sig aggregation. The current blind Schnorr ecash is not post-quantum either. Someone with access to a quantum computer could easily print infinite amount of “cash” for himself.</p>\n<p>Monero does have a good enough path to mitigate it’s privacy issues as well as providing forward secrecy for a post-quantum era with the FCMP++ and subsequent updates. Afaik they are on track to deliver these updates within 3 years.</p>\n<p>Now ofc many dismiss the quantum threat as FUD, but within 3 to 10 years as far as we “know”, there is a significant chance that this becomes an issue. Bitcoin development especially regarding post-quantum scaling and privacy is simply not on track to deal with this in any plausible manner.</p>\n<p><strong>edit:</strong> inb4 people are working on PQC for bitcoin! That’s great, however to my knowledge the whole body of work is massively anti-scaling and there has been no realistic sounding migration plan proposed.</p>\n<p>PS: shouldn’t this thread be moved to Philosophy from Protocol Design?</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2024-12-30T15:15:55.133Z",
  "reply_count": 0,
  "reply_to_post_number": 2,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 12,
  "readers_count": 11,
  "score": 2.2,
  "yours": false,
  "topic_id": 1303,
  "topic_slug": "op-cat-vs-op-ctv-vs-xmr",
  "topic_title": "op_CAT vs op_CTV vs XMR",
  "topic_html_title": "op_CAT vs op_CTV vs XMR",
  "category_id": 7,
  "display_username": "moonsettler",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "HubertusVIE",
    "name": "HubertusVIE",
    "avatar_template": "/user_avatar/delvingbitcoin.org/hubertusvie/{size}/770_2.png"
  },
  "bookmarked": false,
  "raw": "I think it's worth pointing out that nothing we currently do is post-quantum. CTV would be quantum resistant as far as SHA256 is, but the scaling related constructs take extensive use of Taproot Schnorr sig aggregation. The current blind Schnorr ecash is not post-quantum either. Someone with access to a quantum computer could easily print infinite amount of \"cash\" for himself.\n\nMonero does have a good enough path to mitigate it's privacy issues as well as providing forward secrecy for a post-quantum era with the FCMP++ and subsequent updates. Afaik they are on track to deliver these updates within 3 years.\n\nNow ofc many dismiss the quantum threat as FUD, but within 3 to 10 years as far as we \"know\", there is a significant chance that this becomes an issue. Bitcoin development especially regarding post-quantum scaling and privacy is simply not on track to deal with this in any plausible manner.\n\n**edit:** inb4 people are working on PQC for bitcoin! That's great, however to my knowledge the whole body of work is massively anti-scaling and there has been no realistic sounding migration plan proposed.\n\nPS: shouldn't this thread be moved to Philosophy from Protocol Design?",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 48,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}