{
  "id": 3660,
  "name": "Zawy",
  "username": "zawy",
  "avatar_template": "/user_avatar/delvingbitcoin.org/zawy/{size}/750_2.png",
  "created_at": "2024-12-01T12:00:59.131Z",
  "cooked": "<p>If silence means everyone agrees MTP isn’t secure, isn’t supported by PoW, and shouldn’t be used or recommended for any purpose that makes those assumptions, here’s an alternative that doesn’t require a change to bitcoin. Instead of using MTP, use the highest timestamp out of the prior 11 blocks and the current timestamp. This would be at most 2 hours in future which is consistent with timestamping (whereas being in the past isn’t). This has PoW support and is enforcing monotonicity.</p>\n<p>Miners should enforce monotonicity even if it’s not a requirement, but I guess it’s too early to require other miners to do it.</p>\n<p>My statements are an exaggeration in this sense: if timestamps are observed to monotonically increase, the MTP and the timestamps are valid and have PoW support.  The degree to which they don’t have PoW support is limited by how far out of sequence they get. In other words, if there’s a lack of security and lack of PoW support, it can be seen. The problem is if code, script, apps, or legal contracts depend on them as accurate.</p>",
  "post_number": 60,
  "post_type": 1,
  "updated_at": "2024-12-01T19:06:50.634Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 9,
  "readers_count": 8,
  "score": 1.8,
  "yours": false,
  "topic_id": 710,
  "topic_slug": "great-consensus-cleanup-revival",
  "topic_title": "Great Consensus Cleanup Revival",
  "topic_html_title": "Great Consensus Cleanup Revival",
  "category_id": 7,
  "display_username": "Zawy",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "If silence means everyone agrees MTP isn't secure, isn't supported by PoW, and shouldn't be used or recommended for any purpose that makes those assumptions, here's an alternative that doesn't require a change to bitcoin. Instead of using MTP, use the highest timestamp out of the prior 11 blocks and the current timestamp. This would be at most 2 hours in future which is consistent with timestamping (whereas being in the past isn't). This has PoW support and is enforcing monotonicity. \n\nMiners should enforce monotonicity even if it's not a requirement, but I guess it's too early to require other miners to do it.\n\nMy statements are an exaggeration in this sense: if timestamps are observed to monotonically increase, the MTP and the timestamps are valid and have PoW support.  The degree to which they don't have PoW support is limited by how far out of sequence they get. In other words, if there's a lack of security and lack of PoW support, it can be seen. The problem is if code, script, apps, or legal contracts depend on them as accurate.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 502,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}