{
  "id": 3897,
  "name": "David A. Harding",
  "username": "harding",
  "avatar_template": "/user_avatar/delvingbitcoin.org/harding/{size}/925_2.png",
  "created_at": "2024-12-30T19:22:07.692Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"JeremyRubin\" data-post=\"3\" data-topic=\"1333\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/jeremyrubin/48/264_2.png\" class=\"avatar\"> JeremyRubin:</div>\n<blockquote>\n<p>it makes the stakes far lower on these patches which are an “anti feature”</p>\n</blockquote>\n</aside>\n<p>The main way we lower the risk today is by applying the potentially confiscatory consensus rule first to relay/mining policy.  If nobody complains and there’s no history of rule-violating transactions mined for a long period of time, then confiscation risk is minimal (but not zero).  I think that means the benefit of a transitory soft fork for cleanup at the transaction layer is marginal, bringing an already minimal risk a little closer to zero.</p>\n<p>Feature forks are different.  Almost any feature that can be added can alternatively be emulated by a trusted third party who signs according to the feature’s proposed rules.  This can be implemented directly on Bitcoin or through a layer of indirection (e.g. a sidechain).  However, I’m unaware of any widespread use of this emulation capability, probably because people who are comfortable trusting others are fine keeping their money on exchanges and don’t need new features; those who aren’t comfortable with third-party trust are only interested in new features that are guaranteed trustless.</p>\n<p>For that reason, I think there’s a strong case to use transitory soft forks for proposed new features that meet the technical bar and have strong community support but are opposed by some for reasons that can’t be proved at present (e.g., that the feature may not see significant use, that an alternative may be preferred, that something better may come along later, or that they may disrupt subtle economic incentives).  A transitory soft fork allows trustless use without a permanent commitment.</p>\n<p>However, I suggested that approach as a compromise and I haven’t seen anyone—neither proposers nor detractors/equivocators—say that they’re willing to accept any current proposal being added in a transitory soft fork.  I’ve spent the almost three years since making the transitory proposal wondering if I’m the only person whose concerns about CTV and other proposals would be addressed by a trial run.</p>\n<p>If neither proposers nor detractors/equivocators of feature soft forks are willing to compromise, probably because neither side wants to sign up to relitigate the case a few years in the future (even though we may have better data then), I think it’s asking a lot for proposers and detractors/equivocators of cleanup soft forks to sign up for potential relitigation, especially if the main benefits are a marginal reduction in confiscation risk and potentially simplifying future cleanup code.  If we are considering transitory soft forks, I think it makes the most sense to use them for all initial soft forks—both cleanups and new features—or to not use them at all.</p>",
  "post_number": 5,
  "post_type": 1,
  "updated_at": "2024-12-30T19:22:07.692Z",
  "reply_count": 2,
  "reply_to_post_number": 3,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 18,
  "readers_count": 17,
  "score": 13.6,
  "yours": false,
  "topic_id": 1333,
  "topic_slug": "transitory-soft-forks-for-consensus-cleanup-forks",
  "topic_title": "Transitory Soft Forks for Consensus Cleanup Forks",
  "topic_html_title": "Transitory Soft Forks for Consensus Cleanup Forks",
  "category_id": 7,
  "display_username": "David A. Harding",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"JeremyRubin, post:3, topic:1333\"]\nit makes the stakes far lower on these patches which are an “anti feature”\n[/quote]\n\nThe main way we lower the risk today is by applying the potentially confiscatory consensus rule first to relay/mining policy.  If nobody complains and there's no history of rule-violating transactions mined for a long period of time, then confiscation risk is minimal (but not zero).  I think that means the benefit of a transitory soft fork for cleanup at the transaction layer is marginal, bringing an already minimal risk a little closer to zero.\n\nFeature forks are different.  Almost any feature that can be added can alternatively be emulated by a trusted third party who signs according to the feature's proposed rules.  This can be implemented directly on Bitcoin or through a layer of indirection (e.g. a sidechain).  However, I'm unaware of any widespread use of this emulation capability, probably because people who are comfortable trusting others are fine keeping their money on exchanges and don't need new features; those who aren't comfortable with third-party trust are only interested in new features that are guaranteed trustless.\n\nFor that reason, I think there's a strong case to use transitory soft forks for proposed new features that meet the technical bar and have strong community support but are opposed by some for reasons that can't be proved at present (e.g., that the feature may not see significant use, that an alternative may be preferred, that something better may come along later, or that they may disrupt subtle economic incentives).  A transitory soft fork allows trustless use without a permanent commitment.\n\nHowever, I suggested that approach as a compromise and I haven't seen anyone---neither proposers nor detractors/equivocators---say that they're willing to accept any current proposal being added in a transitory soft fork.  I've spent the almost three years since making the transitory proposal wondering if I'm the only person whose concerns about CTV and other proposals would be addressed by a trial run.\n\nIf neither proposers nor detractors/equivocators of feature soft forks are willing to compromise, probably because neither side wants to sign up to relitigate the case a few years in the future (even though we may have better data then), I think it's asking a lot for proposers and detractors/equivocators of cleanup soft forks to sign up for potential relitigation, especially if the main benefits are a marginal reduction in confiscation risk and potentially simplifying future cleanup code.  If we are considering transitory soft forks, I think it makes the most sense to use them for all initial soft forks---both cleanups and new features---or to not use them at all.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 6,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}