{
  "id": 2278,
  "name": "Bob McElrath",
  "username": "mcelrath",
  "avatar_template": "/user_avatar/delvingbitcoin.org/mcelrath/{size}/521_2.png",
  "created_at": "2024-04-19T14:51:19.173Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"ajtowns\" data-post=\"10\" data-topic=\"805\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ajtowns/48/417_2.png\" class=\"avatar\"> ajtowns:</div>\n<blockquote>\n<p>The idea is that it improves block relay when nodes’ mempool policies differ from miners, by reducing round-trips.</p>\n</blockquote>\n</aside>\n<p>There’s only one reason that miner policies would differ from nodes’ mempool policies: when they’re mining transactions OOB, which they (probably) won’t want to broadcast anyway.</p>\n<p>If there’s another reason that miners want to mine a transaction that is not currently relayed, then they need to participate in the development process and get it added to core. There are good reasons some txs are not relayed, and giving miners an end-run around peer-reviewing their tx idea I think is not a good idea, and we shouldn’t encourage that behavior by working around it.</p>\n<p>There is potentially a good reason to do PoW proofs on txs anyway: a lot of the relay policies have to do with DDoS protection. If a miner wants to mine a zero fee or dust transaction, putting a PoW on it is a good way to make relay of that transaction safe and not a DDoS risk. But I think there are other ways to do this that are lighter-weight than sending around entire blocks. In such a case, the low fee is going to discourage other miners from sniping it and the miner can still be paid OOB while advertising the tx ahead of time for fast block relay.  But even this idea may have problems: adversarial miners could then snipe these low-fee/dust txs in order to deprive their competitor of revenue. (But I can see a way around that in that the miner still gets paid OOB regardless of who mines it) There’s a lot more game theory around this than at first glance…</p>\n<p>Consider for instance a modification of INV that is a PoW proof: weak block header (referencing a known recent parent block) plus Merkle proof that this tx was included. This way just the TX plus some metadata could be propagated in INV instead of entire weak blocks. (Sending around a blob of 2000 txs in a weak block is a very heavy-handed way to get one missing tx, INV is far more efficient if their goal is something other than withholding – can you think of other non-withholding use cases?) I think e.g. Mara mining an entire graffiti block are going to be the exception rather than the rule long term, though in that specific case compact blocks would be more efficient.</p>\n<p>One other point: if part of the motivation is just not having a tx for latency/packet loss/bandwidth reasons, adding another message <em>worsens</em> that problem. And a compact block is a very heavyweight message compared to INV, despite the round trip.</p>\n<p>Finally, I’m happy to see people thinking about this. Weak blocks <em>are</em> mining shares and are fundamental to all mining pools, whether decentralized or not. <img src=\"https://delvingbitcoin.org/images/emoji/twitter/smiley.png?v=12\" title=\":smiley:\" class=\"emoji\" alt=\":smiley:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Cheers,\n– Bob</p>",
  "post_number": 11,
  "post_type": 1,
  "updated_at": "2024-04-19T14:51:19.173Z",
  "reply_count": 2,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 12,
  "readers_count": 11,
  "score": 12.4,
  "yours": false,
  "topic_id": 805,
  "topic_slug": "second-look-at-weak-blocks",
  "topic_title": "Second Look at Weak Blocks",
  "topic_html_title": "Second Look at Weak Blocks",
  "category_id": 8,
  "display_username": "Bob McElrath",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"ajtowns, post:10, topic:805\"]\nThe idea is that it improves block relay when nodes’ mempool policies differ from miners, by reducing round-trips.\n[/quote]\n\nThere's only one reason that miner policies would differ from nodes' mempool policies: when they're mining transactions OOB, which they (probably) won't want to broadcast anyway.\n\nIf there's another reason that miners want to mine a transaction that is not currently relayed, then they need to participate in the development process and get it added to core. There are good reasons some txs are not relayed, and giving miners an end-run around peer-reviewing their tx idea I think is not a good idea, and we shouldn't encourage that behavior by working around it.\n\nThere is potentially a good reason to do PoW proofs on txs anyway: a lot of the relay policies have to do with DDoS protection. If a miner wants to mine a zero fee or dust transaction, putting a PoW on it is a good way to make relay of that transaction safe and not a DDoS risk. But I think there are other ways to do this that are lighter-weight than sending around entire blocks. In such a case, the low fee is going to discourage other miners from sniping it and the miner can still be paid OOB while advertising the tx ahead of time for fast block relay.  But even this idea may have problems: adversarial miners could then snipe these low-fee/dust txs in order to deprive their competitor of revenue. (But I can see a way around that in that the miner still gets paid OOB regardless of who mines it) There's a lot more game theory around this than at first glance...\n\nConsider for instance a modification of INV that is a PoW proof: weak block header (referencing a known recent parent block) plus Merkle proof that this tx was included. This way just the TX plus some metadata could be propagated in INV instead of entire weak blocks. (Sending around a blob of 2000 txs in a weak block is a very heavy-handed way to get one missing tx, INV is far more efficient if their goal is something other than withholding -- can you think of other non-withholding use cases?) I think e.g. Mara mining an entire graffiti block are going to be the exception rather than the rule long term, though in that specific case compact blocks would be more efficient.\n\nOne other point: if part of the motivation is just not having a tx for latency/packet loss/bandwidth reasons, adding another message *worsens* that problem. And a compact block is a very heavyweight message compared to INV, despite the round trip.\n\nFinally, I'm happy to see people thinking about this. Weak blocks *are* mining shares and are fundamental to all mining pools, whether decentralized or not. :smiley:\n\nCheers,\n-- Bob",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 406,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}