{
  "id": 2268,
  "name": "Garlo Nicon",
  "username": "garlonicon",
  "avatar_template": "/letter_avatar_proxy/v4/letter/g/278dde/{size}.png",
  "created_at": "2024-04-18T11:16:26.881Z",
  "cooked": "<blockquote>\n<p>What level of validation of weak blocks is required to share the weak block transactions?</p>\n</blockquote>\n<p>Well, it is possible to introduce “delayed validation”. For example: validating the block hashes would be the first step, then validating only the coinbase transaction (because it contains the basic block reward), and later, validating a single high-fee-paying transaction (and when we will run out of the basic block reward, people will focus on those). Because I guess you don’t have to validate 100% of the block, if it does not meet all consensus rules. It is “purely informational”, and can be used for example to distribute the coinbase reward, by handling “weak blocks” as “shares”. Also, when it comes to header-only validation, it may be useful to trace all valid block headers, to properly calculate the global difficulty.</p>\n<blockquote>\n<p>What PoW “multiplier”(factor decrease from consensus-required) should we set?</p>\n</blockquote>\n<p>It could be “difficulty per X seconds, based on valid received blocks”. Which means, that if your node receives more block headers, it will raise the locally accepted difficulty, and if there is nothing for a longer time, then weaker blocks are accepted. So, it could be locally adjusted, based on the traffic. And of course, not every node needs every block, because they are “outside consensus rules” anyway.</p>\n<blockquote>\n<p>How many blocks should we buffer?</p>\n</blockquote>\n<p>This is similar question to “how many blocks should we prune?”. And I guess, that the proper answer is similar, and could be expressed by the stored bytes, instead of the number of blocks (or could be both, like in pruning, for example 550 MB, and 288 blocks).</p>",
  "post_number": 5,
  "post_type": 1,
  "updated_at": "2024-04-18T11:16:26.881Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 13,
  "readers_count": 12,
  "score": 2.4,
  "yours": false,
  "topic_id": 805,
  "topic_slug": "second-look-at-weak-blocks",
  "topic_title": "Second Look at Weak Blocks",
  "topic_html_title": "Second Look at Weak Blocks",
  "category_id": 8,
  "display_username": "Garlo Nicon",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "> What level of validation of weak blocks is required to share the weak block transactions?\n\nWell, it is possible to introduce \"delayed validation\". For example: validating the block hashes would be the first step, then validating only the coinbase transaction (because it contains the basic block reward), and later, validating a single high-fee-paying transaction (and when we will run out of the basic block reward, people will focus on those). Because I guess you don't have to validate 100% of the block, if it does not meet all consensus rules. It is \"purely informational\", and can be used for example to distribute the coinbase reward, by handling \"weak blocks\" as \"shares\". Also, when it comes to header-only validation, it may be useful to trace all valid block headers, to properly calculate the global difficulty.\n\n> What PoW “multiplier”(factor decrease from consensus-required) should we set?\n\nIt could be \"difficulty per X seconds, based on valid received blocks\". Which means, that if your node receives more block headers, it will raise the locally accepted difficulty, and if there is nothing for a longer time, then weaker blocks are accepted. So, it could be locally adjusted, based on the traffic. And of course, not every node needs every block, because they are \"outside consensus rules\" anyway.\n\n> How many blocks should we buffer?\n\nThis is similar question to \"how many blocks should we prune?\". And I guess, that the proper answer is similar, and could be expressed by the stored bytes, instead of the number of blocks (or could be both, like in pruning, for example 550 MB, and 288 blocks).",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 372,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}