{
  "id": 2177,
  "name": "",
  "username": "azz",
  "avatar_template": "/user_avatar/delvingbitcoin.org/azz/{size}/405_2.png",
  "created_at": "2024-04-06T13:53:54.309Z",
  "cooked": "<p>-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA256</p>\n<div data-theme-toc=\"true\"> </div>\n<p>Hi all,</p>\n<p>I’m looking for funding for a project I’m working on so have decided to ask for technical feedback here. This will not be a definitive proposal as the design is still being iterated upon. Note all the terms to identify concepts are also a WIP, as they should be clear but should not be confused with concepts at lower layers.</p>\n<p>I’m working on a L3 protocol on top of Lightning called <strong>Constellation</strong>. The main goal is to mitigate UX issues seen at the two lower levels, such as non-instant transaction confirmation (L1), rising transaction fees (L1), channel liquidity issues (whether routing or inbound) (L2) and throughput bottlenecks (L1) by making use of various different protocols and technologies either finalised or in active development. All funds on L3 are 1:1 backed by funds held in L2 channels.</p>\n<h2><a name=\"the-complicated-stuff-1\" class=\"anchor\" href=\"#the-complicated-stuff-1\"></a>the complicated stuff</h2>\n<p>Constellation has a <strong>federated security model that’s enforced via ROAST</strong>, a wrapper around the FROST protocol to create BIP 340 compatible Schnorr signatures. However, unlike other federated scaling layers, <strong>Constellation is a network of multiple, interoperable federations</strong> which settle differences via Lightning. This means that <strong>any trust model is possible</strong> with Constellation. Entities who have the capabilities to run their own nodes and funds to pay for on-chain Lightning channel operations can be fully self-sovereign and self-sufficient. Entities that would prefer not to run their own nodes, likely the majority of people, can opt to choose a federation with a trust model that suits them, nominally a guild consisting of many independent operators.</p>\n<p>These federations are referred to as <strong>guilds</strong>, and the members that they consist of are called <strong>operators</strong>. While guilds can increase their security linearly by adding more (honest) operators, the performance loss scales roughly only logarithmically, due to how L3’s ledgers work.</p>\n<p>Unlike another federated layer like Liquid, operators have individual ledgers and their own underlying Lightning node(s). Constellation’s ledgers are very different from how other ledgers work. They are UTXO-based, like Bitcoin, as opposed to account based. However, a single operator actually operates 2^16 distinct partitions. A given transaction on L3 may be present on multiple partitions, each of which is able to determine a “leader” partition. We exploit the seemingly random nature of hashes, as each input and output will have a random “identifier”. We can partition transactions using these hashes, to run 65536 interlinked, communicating ledgers per operator.</p>\n<p>As a basic example, we have a transaction A + B → C + D, where A and B are inputs and C and D are outputs. When received, this transaction will be partitioned based on its inputs - determining the physical CPU core(s) that process the transaction. Upon receiving a transaction, it’s in the unconfirmed state. Let’s say that A and C both are in the same partition, P1 (via this hashing prefix mechanism) and B and D are on different partitions, P2 and P3 respectively. That means we have 3 partitions that this transaction should be present on. Next,  we work out what physical CPU core each of those partitions is on. P1, P2 and P3 may all actually be on the same CPU core. They may be on different CPU cores, even different machines (an operator is enforced to run multiple machines). A CPU core will operate at least one partition - this enables an operator to scale their potential throughput up and down by adding and removing CPU cores.</p>\n<p>One of these partitions is determined as the “leader” of this transaction. The leader is responsible for deciding when a transaction is confirmed. Each partition will only have a subset of the data, either input or output. If P1 is chosen as the leader, it will validate the script of A. P2 and P3 will receive copies of the transaction and P2 will validate the spending script for B. All partitions will persist their copy of the transaction to disk, and P2 and P3 will message P1 when they’ve applied the transaction to their local ledger. Once P1 receives confirmation from the others, it will confirm the transaction in its own ledger and inform the other partitions to confirm it too. Once they all respond confirming the transaction, the transaction is confirmed within a single operator.</p>\n<p>Note that while I say it confirms the transaction, it actually batches these in “blocks”. These blocks are limited in size, but have strict local deadlines of 50µs. If the size limit is hit before the deadline, the block is sent onwards - else it is sent upon hitting the deadline. Transactions are processed in batches to reduce overhead. Batches moving between partitions during the confirmation stage move in <em>packages</em>, and each partition advances its ledger using batches of transactions called blocks. Once there are transactions that have finished validation, they’ll be put into blocks as fast as they’re required.</p>\n<p>Transactions will often, even mostly, be contained within multiple blocks. When a leader of a partition creates a block, it tells its replicants. The replicants reply when they’ve validated and successfully persisted the block. When the leader hears back from the majority of operators in this replica (note: <em>not</em> majority of replicants), it confirms the block locally and tells the replicants to confirm it, advancing their copies of the partition. Unlike Bitcoin, two blocks at the same “height” may never be created. There can only possibly be one leader at a time, as it needs a majority of operators to confirm. If the block is invalid, the other operators may reject it and elect a new leader.</p>\n<p>Let’s say we have a basic 2-of-3 guild (2 operators need to confirm, 3 operators total) made of O1, O2 and O3. Each operator maintains 2^16 partitions. Partitions are replicated twice within every operator, ensured to be on separate machines. Therefore, O1 has 2^17 partitions for itself, 2^17 for replicating O2, and 2^17 for replicating O3. This is the same for every operator. This ensures incredible redundancy against attacks and failures, but makes the time-to-confirm for a transaction longer. Theoretically. Practically, the time-to-confirm still appears near-instant, faster than Lightning even. For a transaction to confirm, it needs all involved partitions to confirm. Each partition is its own state machine, replicated using this modified Raft consensus model. A given partition, for example O1-12345 has <em>2</em>3=6 copies* and <em>1 leader</em>. By default, this leader is operated by O1. If the leader dies, the replica inside O1 should take over. If neither is available, or if the operator is designated as malicious, O2 and O3 will start elect a leader between themselves. As majority holders, they can over-rule O1.</p>\n<p>While complex, this model allows for extremely high transactional throughput. 2^16 leaders per operator mean each operator is limited to the transactional throughput of 65,536 CPU cores. Starlight, the official (Rust-based <img src=\"https://delvingbitcoin.org/images/emoji/twitter/crab.png?v=12\" title=\":crab:\" class=\"emoji\" alt=\":crab:\" loading=\"lazy\" width=\"20\" height=\"20\"><img src=\"https://delvingbitcoin.org/images/emoji/twitter/crab.png?v=12\" title=\":crab:\" class=\"emoji\" alt=\":crab:\" loading=\"lazy\" width=\"20\" height=\"20\">) “node”/server implementation of Constellation will offload networking, signature verification, hashing and other heavier operations to different physical CPU cores to those that operate the partitions. This means Starlight will be able to achieve payment throughputs never really seen before, easily beating legacy fiat and bLocKcHaiNs while maintaining reasonable latency (&lt; 3 sec, perhaps lower/higher, but fast) for payments.</p>\n<h2><a name=\"the-less-complicated-stuff-2\" class=\"anchor\" href=\"#the-less-complicated-stuff-2\"></a>the less complicated stuff</h2>\n<h3><a name=\"depositswithdrawals-3\" class=\"anchor\" href=\"#depositswithdrawals-3\"></a>deposits/withdrawals</h3>\n<p>Both are handled via eCash:</p>\n<ul>\n<li>\n<ul>\n<li>minted via depositing funds over L2 or L1 to somewhere (LN channel or P2TR output) controlled by the ROAST threshold signature.</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>The notes are then redeemed into the L3 ledgers to a L3 address controlled by the depositor.</li>\n<li>This breaks the link between a user’s depositing funds and the coins created on L3.</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>These funds are then spliced into the L2 channels that back each operator.</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>The L3 ledger will always have a total UTXO set valuing &lt;= amount held on chain by the threshold multisig. eCash total amount + L3 ledger total amount = amount held in L2 channel local balances. Similar onchain mechanism to how phoenix does their magic stuff</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>withdrawals are also handled by eCash, in mostly the same way but in reverse</li>\n</ul>\n</li>\n</ul>\n<p>“Withdrawals” can also be used for complete backwards compatibility, meaning a L3-based wallet can pay a L3 address, a L2 invoice or an L1 address from a single QR scan. UX is good.</p>\n<h3><a name=\"cross-operatorcross-guild-transactions-4\" class=\"anchor\" href=\"#cross-operatorcross-guild-transactions-4\"></a>cross operator/cross guild transactions?</h3>\n<p><em>sorry i’ve run out of capital letters</em></p>\n<p>complicated but not really</p>\n<p>each input and output will be identified by the operator that looks after it. all L3 funds are held in L2 local balances of channels with other operators. constellation is just a wrapper on top of lightning. except when you’re dealing with billions of $s of bitcoin, liquidity issues don’t exist anymore. your $100k soyboy EV payment won’t have to completely ruin your channel balancing. any big liquidity balance issues will be autonomously resolved by splicing in and out, because if a channel manages billions, the few thousand dollars of onchain fees to pay for the splice are pocket change.</p>\n<p>when a transaction is made between operators (it doesn’t matter if they’re in the same guild or not), the funds are settled over LN. the funds will instantly show up as unavailable for each receiver, and these transactions can be queued. when the sending operator settles their differences (batching used, probably every second), the receiver works out how many of those queued transactions have now been paid off and can then make those funds available.</p>\n<h3><a name=\"addingremoving-machines-to-operators-and-operators-to-guilds-5\" class=\"anchor\" href=\"#addingremoving-machines-to-operators-and-operators-to-guilds-5\"></a>adding/removing machines to operators and operators to guilds?</h3>\n<p>constellation supports all four operations autonomously. these are all possible but i won’t go into the details of how this works in this post</p>\n<h3><a name=\"how-will-devs-use-this-6\" class=\"anchor\" href=\"#how-will-devs-use-this-6\"></a>how will devs use this?</h3>\n<h4><a name=\"wallets-7\" class=\"anchor\" href=\"#wallets-7\"></a>wallets</h4>\n<p>devs can build L3 wallets in a very similar way to L1 wallets. we’d probably nab Bitcoin’s UTXO and scripting language so stuff that works on L1 works without a huge amount of changes on L3. this would make updating hardware wallets “pretty easy” too.</p>\n<p>for UX, maybe we can share a raw taproot public key derived via a HD wallet with each contact. they’d be able to create new addresses for the receiver by tweaking it, and they wouldn’t be able to see any other coins owned by the receiver apart from those that they sent to them. offline sending? done.</p>\n<h4><a name=\"electrs-mempoolspace-help-8\" class=\"anchor\" href=\"#electrs-mempoolspace-help-8\"></a>electrs? mempool.space? Help?</h4>\n<p>Constellation will be both a node protocol and a light client protocol to enable standardised communication with operators. This will allow electrum-like API stuff directly to the operators. It’ll inherit a lot of the performance and security designs of the actual operator architecture. While federated, the ledgers will still be publicly accessible and verifiable just like liquid… ish.</p>\n<h3><a name=\"but-its-not-trustless-9\" class=\"anchor\" href=\"#but-its-not-trustless-9\"></a>but it’s not trustless</h3>\n<p>no it’s not, but Constellation makes reasonable tradeoffs that give humanity an incredibly advanced and capable financial interconnect while letting you run your own guild and maintaining full sovereignty. if you can afford the onchain fees.</p>\n<h2><a name=\"summary-10\" class=\"anchor\" href=\"#summary-10\"></a>summary</h2>\n<p>thank you for reading, i’m working on a blog post that will talk in more detail but i might just start writing the code instead. please let me know any technical feedback or thoughts or questions you may have. i appreciate all of y’all.\n-----BEGIN PGP SIGNATURE-----</p>\n<p>iHUEARYIAB0WIQTZqB4RHv8az8qZrF37Dus/ZKINRAUCZhF41AAKCRD7Dus/ZKIN\nRLebAP4kpmWAsFLocxFsojErWBuSZJXA7j+47ohT7r17HYS/1wEAoHxW6aLh4soA\nIWAVBMqhsZH7yxFK5fGOWAjpAbk59Qo=\n=kvMw\n-----END PGP SIGNATURE-----</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-04-06T16:31:23.976Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 8,
  "reads": 17,
  "readers_count": 16,
  "score": 38.2,
  "yours": false,
  "topic_id": 775,
  "topic_slug": "constellation-a-high-performance-lightning-based-l3-feedback-wanted",
  "topic_title": "Constellation - a high performance Lightning-based L3. Feedback wanted",
  "topic_html_title": "Constellation - a high performance Lightning-based L3. Feedback wanted",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 4,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA256\n\n<div data-theme-toc=\"true\"> </div>\n\nHi all,\n\nI'm looking for funding for a project I'm working on so have decided to ask for technical feedback here. This will not be a definitive proposal as the design is still being iterated upon. Note all the terms to identify concepts are also a WIP, as they should be clear but should not be confused with concepts at lower layers. \n\nI'm working on a L3 protocol on top of Lightning called **Constellation**. The main goal is to mitigate UX issues seen at the two lower levels, such as non-instant transaction confirmation (L1), rising transaction fees (L1), channel liquidity issues (whether routing or inbound) (L2) and throughput bottlenecks (L1) by making use of various different protocols and technologies either finalised or in active development. All funds on L3 are 1:1 backed by funds held in L2 channels. \n\n## the complicated stuff\n\nConstellation has a **federated security model that's enforced via ROAST**, a wrapper around the FROST protocol to create BIP 340 compatible Schnorr signatures. However, unlike other federated scaling layers, **Constellation is a network of multiple, interoperable federations** which settle differences via Lightning. This means that **any trust model is possible** with Constellation. Entities who have the capabilities to run their own nodes and funds to pay for on-chain Lightning channel operations can be fully self-sovereign and self-sufficient. Entities that would prefer not to run their own nodes, likely the majority of people, can opt to choose a federation with a trust model that suits them, nominally a guild consisting of many independent operators. \n\nThese federations are referred to as **guilds**, and the members that they consist of are called **operators**. While guilds can increase their security linearly by adding more (honest) operators, the performance loss scales roughly only logarithmically, due to how L3's ledgers work.\n\nUnlike another federated layer like Liquid, operators have individual ledgers and their own underlying Lightning node(s). Constellation's ledgers are very different from how other ledgers work. They are UTXO-based, like Bitcoin, as opposed to account based. However, a single operator actually operates 2^16 distinct partitions. A given transaction on L3 may be present on multiple partitions, each of which is able to determine a \"leader\" partition. We exploit the seemingly random nature of hashes, as each input and output will have a random \"identifier\". We can partition transactions using these hashes, to run 65536 interlinked, communicating ledgers per operator. \n\nAs a basic example, we have a transaction A + B -> C + D, where A and B are inputs and C and D are outputs. When received, this transaction will be partitioned based on its inputs - determining the physical CPU core(s) that process the transaction. Upon receiving a transaction, it's in the unconfirmed state. Let's say that A and C both are in the same partition, P1 (via this hashing prefix mechanism) and B and D are on different partitions, P2 and P3 respectively. That means we have 3 partitions that this transaction should be present on. Next,  we work out what physical CPU core each of those partitions is on. P1, P2 and P3 may all actually be on the same CPU core. They may be on different CPU cores, even different machines (an operator is enforced to run multiple machines). A CPU core will operate at least one partition - this enables an operator to scale their potential throughput up and down by adding and removing CPU cores.\n\nOne of these partitions is determined as the \"leader\" of this transaction. The leader is responsible for deciding when a transaction is confirmed. Each partition will only have a subset of the data, either input or output. If P1 is chosen as the leader, it will validate the script of A. P2 and P3 will receive copies of the transaction and P2 will validate the spending script for B. All partitions will persist their copy of the transaction to disk, and P2 and P3 will message P1 when they've applied the transaction to their local ledger. Once P1 receives confirmation from the others, it will confirm the transaction in its own ledger and inform the other partitions to confirm it too. Once they all respond confirming the transaction, the transaction is confirmed within a single operator. \n\nNote that while I say it confirms the transaction, it actually batches these in \"blocks\". These blocks are limited in size, but have strict local deadlines of 50µs. If the size limit is hit before the deadline, the block is sent onwards - else it is sent upon hitting the deadline. Transactions are processed in batches to reduce overhead. Batches moving between partitions during the confirmation stage move in *packages*, and each partition advances its ledger using batches of transactions called blocks. Once there are transactions that have finished validation, they'll be put into blocks as fast as they're required. \n\nTransactions will often, even mostly, be contained within multiple blocks. When a leader of a partition creates a block, it tells its replicants. The replicants reply when they've validated and successfully persisted the block. When the leader hears back from the majority of operators in this replica (note: *not* majority of replicants), it confirms the block locally and tells the replicants to confirm it, advancing their copies of the partition. Unlike Bitcoin, two blocks at the same \"height\" may never be created. There can only possibly be one leader at a time, as it needs a majority of operators to confirm. If the block is invalid, the other operators may reject it and elect a new leader. \n\nLet's say we have a basic 2-of-3 guild (2 operators need to confirm, 3 operators total) made of O1, O2 and O3. Each operator maintains 2^16 partitions. Partitions are replicated twice within every operator, ensured to be on separate machines. Therefore, O1 has 2^17 partitions for itself, 2^17 for replicating O2, and 2^17 for replicating O3. This is the same for every operator. This ensures incredible redundancy against attacks and failures, but makes the time-to-confirm for a transaction longer. Theoretically. Practically, the time-to-confirm still appears near-instant, faster than Lightning even. For a transaction to confirm, it needs all involved partitions to confirm. Each partition is its own state machine, replicated using this modified Raft consensus model. A given partition, for example O1-12345 has *2*3=6 copies* and *1 leader*. By default, this leader is operated by O1. If the leader dies, the replica inside O1 should take over. If neither is available, or if the operator is designated as malicious, O2 and O3 will start elect a leader between themselves. As majority holders, they can over-rule O1.\n\nWhile complex, this model allows for extremely high transactional throughput. 2^16 leaders per operator mean each operator is limited to the transactional throughput of 65,536 CPU cores. Starlight, the official (Rust-based 🦀🦀) \"node\"/server implementation of Constellation will offload networking, signature verification, hashing and other heavier operations to different physical CPU cores to those that operate the partitions. This means Starlight will be able to achieve payment throughputs never really seen before, easily beating legacy fiat and bLocKcHaiNs while maintaining reasonable latency (< 3 sec, perhaps lower/higher, but fast) for payments. \n\n## the less complicated stuff\n\n### deposits/withdrawals\nBoth are handled via eCash:\n- - minted via depositing funds over L2 or L1 to somewhere (LN channel or P2TR output) controlled by the ROAST threshold signature. \n- - The notes are then redeemed into the L3 ledgers to a L3 address controlled by the depositor. \n  - This breaks the link between a user's depositing funds and the coins created on L3. \n- - These funds are then spliced into the L2 channels that back each operator. \n- - The L3 ledger will always have a total UTXO set valuing <= amount held on chain by the threshold multisig. eCash total amount + L3 ledger total amount = amount held in L2 channel local balances. Similar onchain mechanism to how phoenix does their magic stuff\n- - withdrawals are also handled by eCash, in mostly the same way but in reverse\n\n\"Withdrawals\" can also be used for complete backwards compatibility, meaning a L3-based wallet can pay a L3 address, a L2 invoice or an L1 address from a single QR scan. UX is good. \n\n### cross operator/cross guild transactions?\n\n*sorry i've run out of capital letters*\n\ncomplicated but not really\n\neach input and output will be identified by the operator that looks after it. all L3 funds are held in L2 local balances of channels with other operators. constellation is just a wrapper on top of lightning. except when you're dealing with billions of $s of bitcoin, liquidity issues don't exist anymore. your $100k soyboy EV payment won't have to completely ruin your channel balancing. any big liquidity balance issues will be autonomously resolved by splicing in and out, because if a channel manages billions, the few thousand dollars of onchain fees to pay for the splice are pocket change.\n\nwhen a transaction is made between operators (it doesn't matter if they're in the same guild or not), the funds are settled over LN. the funds will instantly show up as unavailable for each receiver, and these transactions can be queued. when the sending operator settles their differences (batching used, probably every second), the receiver works out how many of those queued transactions have now been paid off and can then make those funds available. \n\n### adding/removing machines to operators and operators to guilds?\n\nconstellation supports all four operations autonomously. these are all possible but i won't go into the details of how this works in this post\n\n### how will devs use this?\n\n#### wallets\n\ndevs can build L3 wallets in a very similar way to L1 wallets. we'd probably nab Bitcoin's UTXO and scripting language so stuff that works on L1 works without a huge amount of changes on L3. this would make updating hardware wallets \"pretty easy\" too.\n\nfor UX, maybe we can share a raw taproot public key derived via a HD wallet with each contact. they'd be able to create new addresses for the receiver by tweaking it, and they wouldn't be able to see any other coins owned by the receiver apart from those that they sent to them. offline sending? done.\n\n#### electrs? mempool.space? Help?\n\nConstellation will be both a node protocol and a light client protocol to enable standardised communication with operators. This will allow electrum-like API stuff directly to the operators. It'll inherit a lot of the performance and security designs of the actual operator architecture. While federated, the ledgers will still be publicly accessible and verifiable just like liquid... ish.\n\n### but it's not trustless\n\nno it's not, but Constellation makes reasonable tradeoffs that give humanity an incredibly advanced and capable financial interconnect while letting you run your own guild and maintaining full sovereignty. if you can afford the onchain fees. \n\n## summary\n\nthank you for reading, i'm working on a blog post that will talk in more detail but i might just start writing the code instead. please let me know any technical feedback or thoughts or questions you may have. i appreciate all of y'all.\n-----BEGIN PGP SIGNATURE-----\n\niHUEARYIAB0WIQTZqB4RHv8az8qZrF37Dus/ZKINRAUCZhF41AAKCRD7Dus/ZKIN\nRLebAP4kpmWAsFLocxFsojErWBuSZJXA7j+47ohT7r17HYS/1wEAoHxW6aLh4soA\nIWAVBMqhsZH7yxFK5fGOWAjpAbk59Qo=\n=kvMw\n-----END PGP SIGNATURE-----",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 334,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}