{
  "id": 2242,
  "name": "Gregory Sanders",
  "username": "instagibbs",
  "avatar_template": "/user_avatar/delvingbitcoin.org/instagibbs/{size}/28_2.png",
  "created_at": "2024-04-16T16:51:26.265Z",
  "cooked": "<p><a href=\"https://bitcoinsearch.xyz/?search=weak+blocks\">Weak blocks</a>, or “near blocks” are not a new idea.</p>\n<p>In short, have miners propagate what amounts to mining shares over the p2p network, which allows PoW-backed sharing of data.</p>\n<p><a href=\"https://gnusha.org/bitcoin-wizards/2015-12-02.log\">Historical discussions</a> of weak blocks centered around the <a href=\"https://btctranscripts.com/scalingbitcoin/hong-kong-2015/invertible-bloom-lookup-tables-and-weak-block-propagation-performance/\">blocksize and scaling debate</a>, which means there was intense focus on reducing the marginal bytes sent per weak block to aid “gigameg blocks”. There was seemingly a lot of focus on creating DAGs, extra-consensus chains, and similar mechanisms for increasing the blocksize safely.</p>\n<p>Almost 10 years have passed, communities have split, basically everyone is a small blocker of some kind. Ignoring blocksize increases as a motivation, <em>is there value in reconsidering this type of proposal?</em></p>\n<p>Some considerations jumped out to me:</p>\n<ol>\n<li>We have compact blocks deployed for an off-the-shelf toolset to reduce the amount of bandwidth necessary to transmit these weak blocks.</li>\n<li>We are seeing diverging mempool policies for a number of reasons, which along with mempool churn, results in additional round-trips and delays for final block propagation, which hurts mining fairness and thus decentralization.</li>\n</ol>\n<p><strong>What if we can use compact blocks-derived infrastructure to enable weak blocks, which in turn makes compact block relay perform better by reducing round trips?</strong></p>\n<h1><a name=\"specification-1\" class=\"anchor\" href=\"#specification-1\"></a>“Specification”</h1>\n<p>Re-use a variant of <a href=\"https://github.com/bitcoin/bips/blob/b3701faef2bdb98a0d7ace4eedbeefa2da4c89ed/bip-0152.mediawiki\">compact blocks messages</a> to support propagation of “weak compact blocks”. Don’t make a DAG or require consensus over these messages, just use them as a DoS-resistant messaging layer for things miners appear to be working on.</p>\n<p>It’s ok for these messages to be slower or fail, as long as the PoW is validated carefully. They are not as speed-critical as regular compact blocks.</p>\n<p>Open questions:</p>\n<ol>\n<li>What level of validation of weak blocks is required to share the weak block transactions?</li>\n<li>Since we don’t want to require persistence of weak blocks to disk, we need to allow for a full weak block to be “forgotten” even after being advertised via a weak compact block. Add a <code>notfound</code> type response?</li>\n</ol>\n<h1><a name=\"implementation-2\" class=\"anchor\" href=\"#implementation-2\"></a>Implementation</h1>\n<p>Basic <a href=\"https://github.com/instagibbs/bitcoin/commits/2024-03-weakblocks_poc/\">PoC here</a> with light tests only to demonstrate the high level idea.</p>\n<p>When a weak block comes in, we fetch the missing transactions from our peer using <code>getwblocktxns</code>, then once the weak block is validated as structurally sound, attempt to insert any transactions we don’t have yet into our mempool, and relay the weak block via weak compact blocks in turn.</p>\n<p>Everything is held in a “holding cell”, even if rejected from the mempool(possibly for standardness reasons).</p>\n<p>The implementation is only doing a “best effort” last seen weak block, but clearly this will be insufficient for a full implementation.</p>\n<p>Open questions:</p>\n<ol>\n<li>What PoW “multiplier”(factor decrease from consensus-required) should we set? For the PoC branch I set this to 2 simply for testing. Increasing this value increases the expected number of weak blocks per block interval.</li>\n<li>How many blocks should we buffer?</li>\n<li>Do we have to buffer the transactions even if they’re in the mempool already? If we’re asked for them via <code>getwblocktxns</code>, we need to respond somehow even if they’ve been cycled out of your mempool.</li>\n<li>Should we support the “low bandwidth” path, with an additional round-trip via <code>weak headers</code> message? Should we even support the “high bandwidth” path?</li>\n</ol>\n<h1><a name=\"bonus-use-cases-3\" class=\"anchor\" href=\"#bonus-use-cases-3\"></a>Bonus use-cases</h1>\n<p><a href=\"https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2021-October/019578.html\">“Forcible insertion”</a> of transactions that are incentive-compatible but violate anti-DoS rules? (e.g., “pinning replacement”)</p>\n<p>Next-block fee estimation?</p>\n<h1><a name=\"next-steps-4\" class=\"anchor\" href=\"#next-steps-4\"></a>Next Steps</h1>\n<ol>\n<li>Gather higher-level feedback on a proposed specification/implementation</li>\n<li>If there’s general enthusiasm for such a proposal among developers, figure out if/how miners would actually use this. Do miners use RPCs to submit blocks? Should we support a (whitelisted peer only) protocol to submit non-compact versions of weak blocks to nodes for initial propagation? Would miners actually want to run this? Market research is required, although small miners can run these on their own and benefit from the increased network convergence.</li>\n</ol>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-04-16T17:45:35.589Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 75,
  "reads": 26,
  "readers_count": 25,
  "score": 410.0,
  "yours": false,
  "topic_id": 805,
  "topic_slug": "second-look-at-weak-blocks",
  "topic_title": "Second Look at Weak Blocks",
  "topic_html_title": "Second Look at Weak Blocks",
  "category_id": 8,
  "display_username": "Gregory Sanders",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 3,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[Weak blocks](https://bitcoinsearch.xyz/?search=weak+blocks), or \"near blocks\" are not a new idea.\n\nIn short, have miners propagate what amounts to mining shares over the p2p network, which allows PoW-backed sharing of data.\n\n[Historical discussions](https://gnusha.org/bitcoin-wizards/2015-12-02.log) of weak blocks centered around the [blocksize and scaling debate](https://btctranscripts.com/scalingbitcoin/hong-kong-2015/invertible-bloom-lookup-tables-and-weak-block-propagation-performance/), which means there was intense focus on reducing the marginal bytes sent per weak block to aid \"gigameg blocks\". There was seemingly a lot of focus on creating DAGs, extra-consensus chains, and similar mechanisms for increasing the blocksize safely.\n\nAlmost 10 years have passed, communities have split, basically everyone is a small blocker of some kind. Ignoring blocksize increases as a motivation, *is there value in reconsidering this type of proposal?*\n\nSome considerations jumped out to me:\n1. We have compact blocks deployed for an off-the-shelf toolset to reduce the amount of bandwidth necessary to transmit these weak blocks.\n2. We are seeing diverging mempool policies for a number of reasons, which along with mempool churn, results in additional round-trips and delays for final block propagation, which hurts mining fairness and thus decentralization.\n\n **What if we can use compact blocks-derived infrastructure to enable weak blocks, which in turn makes compact block relay perform better by reducing round trips?**\n\n\"Specification\" \n===\nRe-use a variant of [compact blocks messages](https://github.com/bitcoin/bips/blob/b3701faef2bdb98a0d7ace4eedbeefa2da4c89ed/bip-0152.mediawiki) to support propagation of \"weak compact blocks\". Don't make a DAG or require consensus over these messages, just use them as a DoS-resistant messaging layer for things miners appear to be working on.\n\nIt's ok for these messages to be slower or fail, as long as the PoW is validated carefully. They are not as speed-critical as regular compact blocks.\n\nOpen questions:\n\n1. What level of validation of weak blocks is required to share the weak block transactions?\n2. Since we don't want to require persistence of weak blocks to disk, we need to allow for a full weak block to be \"forgotten\" even after being advertised via a weak compact block. Add a `notfound` type response?\n\nImplementation\n===\n\nBasic [PoC here](https://github.com/instagibbs/bitcoin/commits/2024-03-weakblocks_poc/) with light tests only to demonstrate the high level idea.\n\nWhen a weak block comes in, we fetch the missing transactions from our peer using `getwblocktxns`, then once the weak block is validated as structurally sound, attempt to insert any transactions we don't have yet into our mempool, and relay the weak block via weak compact blocks in turn.\n\nEverything is held in a \"holding cell\", even if rejected from the mempool(possibly for standardness reasons).\n\nThe implementation is only doing a \"best effort\" last seen weak block, but clearly this will be insufficient for a full implementation.\n\nOpen questions:\n\n1. What PoW \"multiplier\"(factor decrease from consensus-required) should we set? For the PoC branch I set this to 2 simply for testing. Increasing this value increases the expected number of weak blocks per block interval.\n1. How many blocks should we buffer?\n1. Do we have to buffer the transactions even if they're in the mempool already? If we're asked for them via `getwblocktxns`, we need to respond somehow even if they've been cycled out of your mempool.\n1. Should we support the \"low bandwidth\" path, with an additional round-trip via `weak headers` message? Should we even support the \"high bandwidth\" path?\n\nBonus use-cases\n===\n[\"Forcible insertion\"](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2021-October/019578.html) of transactions that are incentive-compatible but violate anti-DoS rules? (e.g., \"pinning replacement\")\n\nNext-block fee estimation?\n\nNext Steps\n===\n1. Gather higher-level feedback on a proposed specification/implementation\n2. If there's general enthusiasm for such a proposal among developers, figure out if/how miners would actually use this. Do miners use RPCs to submit blocks? Should we support a (whitelisted peer only) protocol to submit non-compact versions of weak blocks to nodes for initial propagation? Would miners actually want to run this? Market research is required, although small miners can run these on their own and benefit from the increased network convergence.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 31,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    },
    {
      "id": "thinking",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false
}