{
  "id": 4862,
  "name": "Pieter Wuille",
  "username": "sipa",
  "avatar_template": "/user_avatar/delvingbitcoin.org/sipa/{size}/1100_2.png",
  "created_at": "2025-04-23T14:19:56.589Z",
  "cooked": "<p>An interesting property which in hindsight seems obvious, but still worth noting:</p>\n<p>For a given cluster, every linearization for which the <strong>unconvexified</strong> area under the fee-size diagram is maximal (among all topologically-valid linearizations), is an optimal linearization as defined above (which means its convex diagram is in every point as high as every other convex linearization diagram, which in turns implies its convexified area under the diagram is also maximal).</p>\n<p>Optimality of a linearization, being defined in function of the convex diagram, ignores the ordering of transactions within each chunk. However, the area under the unconvexified diagram does depend on the exact ordering. Furthermore, the area under the unconvexified diagram is directly proportional to the average feerate that can be obtained in a block, if one only <a href=\"https://delvingbitcoin.org/t/cluster-mempool-block-building-with-sub-chunk-granularity/1044\">considers prefixes of the linearization</a>, assuming the block boundary falls uniformly randomly within the cluster. Thus, I think it makes sense to define a <strong>sub-chunk-optimal linearization</strong> simply as one whose area under the unconvexified diagram is maximal, knowing that this is a subset of the optimal linearizations as defined earlier.</p>\n<p>I do not know of any efficient algorithm to compute these sub-chunk-optimal linearizations. However, the <a href=\"https://delvingbitcoin.org/t/linearization-post-processing-o-n-2-fancy-chunking/201\">post-linearization</a> algorithm is (among other things) a sub-chunk-optimizer, in the sense that it will never worsen this unconvexified area under the diagram.</p>",
  "post_number": 21,
  "post_type": 1,
  "posts_count": 21,
  "updated_at": "2025-04-23T14:46:29.667Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 2,
  "reads": 23,
  "readers_count": 22,
  "score": 74.6,
  "yours": false,
  "topic_id": 202,
  "topic_slug": "cluster-mempool-definitions-theory",
  "topic_title": "Cluster mempool definitions & theory",
  "topic_html_title": "Cluster mempool definitions &amp; theory",
  "category_id": 8,
  "display_username": "Pieter Wuille",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "An interesting property which in hindsight seems obvious, but still worth noting:\n\nFor a given cluster, every linearization for which the **unconvexified** area under the fee-size diagram is maximal (among all topologically-valid linearizations), is an optimal linearization as defined above (which means its convex diagram is in every point as high as every other convex linearization diagram, which in turns implies its convexified area under the diagram is also maximal).\n\nOptimality of a linearization, being defined in function of the convex diagram, ignores the ordering of transactions within each chunk. However, the area under the unconvexified diagram does depend on the exact ordering. Furthermore, the area under the unconvexified diagram is directly proportional to the average feerate that can be obtained in a block, if one only [considers prefixes of the linearization](https://delvingbitcoin.org/t/cluster-mempool-block-building-with-sub-chunk-granularity/1044), assuming the block boundary falls uniformly randomly within the cluster. Thus, I think it makes sense to define a **sub-chunk-optimal linearization** simply as one whose area under the unconvexified diagram is maximal, knowing that this is a subset of the optimal linearizations as defined earlier.\n\nI do not know of any efficient algorithm to compute these sub-chunk-optimal linearizations. However, the [post-linearization](https://delvingbitcoin.org/t/linearization-post-processing-o-n-2-fancy-chunking/201) algorithm is (among other things) a sub-chunk-optimizer, in the sense that it will never worsen this unconvexified area under the diagram.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 96,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "An interesting property which in hindsight seems obvious, but still worth noting: \nFor a given cluster, every linearization for which the unconvexified area under the fee-size diagram is maximal (among all topologically-valid linearizations), is an optimal linearization as defined above (which means&hellip;",
  "truncated": true,
  "post_url": "/t/cluster-mempool-definitions-theory/202/21",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}