{
  "id": 4739,
  "name": "Robin Linus",
  "username": "RobinLinus",
  "avatar_template": "/user_avatar/delvingbitcoin.org/robinlinus/{size}/130_2.png",
  "created_at": "2025-04-10T01:49:13.085Z",
  "cooked": "<p><strong>TL;DR:</strong> CTV fundamentally improves BitVM bridges by eliminating the need for a presigning committee and the existential honesty assumption for safety. Additionally, CSFS drastically improves capital efficiency and reduces setup overhead.</p>\n<h3><a name=\"p-4739-introduction-1\" class=\"anchor\" href=\"#p-4739-introduction-1\"></a>Introduction</h3>\n<p>In BitVM, we use input-committing covenants to represent state. E.g., we express “the operator can withdraw funds from the bridge if no challenge occurred” with a specific output that challengers may burn to indicate that they believe the operator’s withdrawal request was malicious, forcing the operator to go through the challenge process. In contrast, in the happy path, if that output “survives” the challenge period then the operator can use it to execute the withdrawal transaction.</p>\n<p>The current BitVM bridge design relies on emulated covenants to guarantee safety of the deposits. This committee requires a 1-of-n trust assumption and introduces various undesirable complexities in practice. Up until recently we had assumed that CTV is not sufficient to replace the committee because CTV is designed to commit only to <em>outputs</em> but not to <em>inputs</em>. However, it turned out that there is a trick that enables the functionality that we need.</p>\n<h3><a name=\"p-4739-the-scriptsig-trick-2\" class=\"anchor\" href=\"#p-4739-the-scriptsig-trick-2\"></a>The scriptSig Trick</h3>\n<p>The key idea is to use the fact that CTV commits to the scriptSig of all inputs.\nSay we want to express “inputA is spendable only together with inputB”.</p>\n<ol>\n<li>Define inputB to be a (legacy) P2SH output.</li>\n<li>Presign a signature using sighash <code>SINGLE|NONE</code>, effectively signing only inputB. This signature commits to inputB and since P2SH is not SegWit the signature will be in inputB’s scriptSig.</li>\n<li>Define inputA to be a P2TR output and contain a CTV condition with a template hash that commits to the scriptSigs, including the signature for inputB.</li>\n</ol>\n<p>The result: <strong>inputA</strong> commits to the signature for <strong>inputB</strong>, which itself commits to <strong>inputB</strong>. So <strong>inputA</strong> becomes spendable only in conjunction with <strong>inputB</strong>.</p>\n<h3><a name=\"p-4739-details-3\" class=\"anchor\" href=\"#p-4739-details-3\"></a>Details</h3>\n<p>These commitments are one-way: <strong>inputA</strong> commits to <strong>inputB</strong>, but not vice versa. Two-way commitment would ideally be desirable but is impossible due to hash cycles (even with <code>TXHASH</code> or introspection opcodes).</p>\n<p>For our bridge it would be sufficient to constrain <strong>inputB</strong> to always be burned. But that too is unachievable with CTV—its template hash would have to commit to its own <code>scriptSig</code>, which already commits to <strong>inputB</strong>, and therefore its TXID—creating a hash cycle.</p>\n<p>To work around this, we redesigned the transaction graph such that the contract remains secure even if <strong>inputB</strong> is spent independently of <strong>inputA</strong>. The exact mechanics of that redesign are beyond the scope of this post, as they require a deeper dive into the bridge contract architecture.</p>\n<h3><a name=\"p-4739-concrete-improvements-4\" class=\"anchor\" href=\"#p-4739-concrete-improvements-4\"></a>Concrete Improvements</h3>\n<ul>\n<li>\n<p><strong>CTV enables unconditional safety of deposits.</strong> Even if <strong>all</strong> operators are malicious, they cannot steal from the bridge. While we still rely on an <strong>existential liveness assumption</strong> to ensure withdrawals, the simplified setup allows us to scale the operator set significantly—potentially by an order of magnitude. This makes it far more likely that at least one operator remains live.</p>\n</li>\n<li>\n<p><strong>CSFS replaces Lamport signatures</strong>, reducing transaction sizes by approximately <strong>10x</strong>. This dramatically lowers the capital cost required for bridge operations.</p>\n</li>\n<li>\n<p><strong>Non-hardened key derivation</strong> becomes possible with CSFS, enabling anyone to compute the operator’s public keys <strong>non-interactively</strong>. This greatly simplifies the peg-in process by reducing the amount of data operators need to provide.</p>\n</li>\n<li>\n<p>In the current design, <strong>peg-ins still require an operator signature</strong>, which allows for censorship. While this can be mitigated in the side system, our long-term goal is to <strong>eliminate this interaction entirely</strong> by modifying the bridge contract to support fully non-interactive peg-ins.</p>\n</li>\n</ul>\n<p>For these reasons, the BitVM Alliance strongly supports the <a href=\"https://delvingbitcoin.org/t/ctv-csfs-can-we-reach-consensus-on-a-first-step-towards-covenants/1509/11\">CTV + CSFS</a> proposal.</p>\n<h3><a name=\"p-4739-conclusion-5\" class=\"anchor\" href=\"#p-4739-conclusion-5\"></a>Conclusion</h3>\n<p>This trick demonstrates that with a clever use of CTV and CSFS, we can dramatically simplify BitVM bridge construction while improving both safety and efficiency. By removing the need for a presigning committee and eliminating the existential honesty assumption, CTV enables bridges with unconditional safety guarantees. At the same time, CSFS reduces capital costs and operational complexity, paving the way for more scalable and decentralized bridges. While a few open challenges remain—such as making peg-ins fully non-interactive—this design represents a significant step forward in practical, trust-minimized Bitcoin interoperability.</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 1,
  "updated_at": "2025-04-10T02:30:33.330Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 106,
  "reads": 9,
  "readers_count": 8,
  "score": 561.8,
  "yours": false,
  "topic_id": 1591,
  "topic_slug": "how-ctv-csfs-improves-bitvm-bridges",
  "topic_title": "How CTV+CSFS improves BitVM bridges",
  "topic_html_title": "How CTV+CSFS improves BitVM bridges",
  "category_id": 7,
  "display_username": "Robin Linus",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 4,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "**TL;DR:** CTV fundamentally improves BitVM bridges by eliminating the need for a presigning committee and the existential honesty assumption for safety. Additionally, CSFS drastically improves capital efficiency and reduces setup overhead.\n\n### Introduction\nIn BitVM, we use input-committing covenants to represent state. E.g., we express \"the operator can withdraw funds from the bridge if no challenge occurred\" with a specific output that challengers may burn to indicate that they believe the operator's withdrawal request was malicious, forcing the operator to go through the challenge process. In contrast, in the happy path, if that output \"survives\" the challenge period then the operator can use it to execute the withdrawal transaction.\n\n\nThe current BitVM bridge design relies on emulated covenants to guarantee safety of the deposits. This committee requires a 1-of-n trust assumption and introduces various undesirable complexities in practice. Up until recently we had assumed that CTV is not sufficient to replace the committee because CTV is designed to commit only to _outputs_ but not to _inputs_. However, it turned out that there is a trick that enables the functionality that we need.\n\n### The scriptSig Trick\nThe key idea is to use the fact that CTV commits to the scriptSig of all inputs.\nSay we want to express \"inputA is spendable only together with inputB\". \n1. Define inputB to be a (legacy) P2SH output. \n2. Presign a signature using sighash `SINGLE|NONE`, effectively signing only inputB. This signature commits to inputB and since P2SH is not SegWit the signature will be in inputB's scriptSig.\n3. Define inputA to be a P2TR output and contain a CTV condition with a template hash that commits to the scriptSigs, including the signature for inputB. \n\nThe result: **inputA** commits to the signature for **inputB**, which itself commits to **inputB**. So **inputA** becomes spendable only in conjunction with **inputB**.\n\n### Details\nThese commitments are one-way: **inputA** commits to **inputB**, but not vice versa. Two-way commitment would ideally be desirable but is impossible due to hash cycles (even with `TXHASH` or introspection opcodes).\n\nFor our bridge it would be sufficient to constrain **inputB** to always be burned. But that too is unachievable with CTV—its template hash would have to commit to its own `scriptSig`, which already commits to **inputB**, and therefore its TXID—creating a hash cycle.\n\nTo work around this, we redesigned the transaction graph such that the contract remains secure even if **inputB** is spent independently of **inputA**. The exact mechanics of that redesign are beyond the scope of this post, as they require a deeper dive into the bridge contract architecture.\n\n\n### Concrete Improvements\n\n- **CTV enables unconditional safety of deposits.** Even if **all** operators are malicious, they cannot steal from the bridge. While we still rely on an **existential liveness assumption** to ensure withdrawals, the simplified setup allows us to scale the operator set significantly—potentially by an order of magnitude. This makes it far more likely that at least one operator remains live.\n\n- **CSFS replaces Lamport signatures**, reducing transaction sizes by approximately **10x**. This dramatically lowers the capital cost required for bridge operations.\n\n- **Non-hardened key derivation** becomes possible with CSFS, enabling anyone to compute the operator's public keys **non-interactively**. This greatly simplifies the peg-in process by reducing the amount of data operators need to provide.\n\n- In the current design, **peg-ins still require an operator signature**, which allows for censorship. While this can be mitigated in the side system, our long-term goal is to **eliminate this interaction entirely** by modifying the bridge contract to support fully non-interactive peg-ins.\n\nFor these reasons, the BitVM Alliance strongly supports the [CTV + CSFS](https://delvingbitcoin.org/t/ctv-csfs-can-we-reach-consensus-on-a-first-step-towards-covenants/1509/11) proposal.\n\n### Conclusion\nThis trick demonstrates that with a clever use of CTV and CSFS, we can dramatically simplify BitVM bridge construction while improving both safety and efficiency. By removing the need for a presigning committee and eliminating the existential honesty assumption, CTV enables bridges with unconditional safety guarantees. At the same time, CSFS reduces capital costs and operational complexity, paving the way for more scalable and decentralized bridges. While a few open challenges remain—such as making peg-ins fully non-interactive—this design represents a significant step forward in practical, trust-minimized Bitcoin interoperability.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 131,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "TL;DR: CTV fundamentally improves BitVM bridges by eliminating the need for a presigning committee and the existential honesty assumption for safety. Additionally, CSFS drastically improves capital efficiency and reduces setup overhead. \n<a name=\"p-4739-introduction-1\" class=\"anchor\" href=\"#p-4739-introduction-1\"></a>Introduction\nIn BitVM, we use input-committing covenants to re&hellip;",
  "truncated": true,
  "post_url": "/t/how-ctv-csfs-improves-bitvm-bridges/1591/1",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false
}