{
  "id": 4785,
  "name": "Steven Roose",
  "username": "stevenroose",
  "avatar_template": "/user_avatar/delvingbitcoin.org/stevenroose/{size}/1087_2.png",
  "created_at": "2025-04-15T11:49:38.227Z",
  "cooked": "<p>Last weekend at OP_NEXT I outlined a novel variation of Ark that removes all need for user interacty in rounds, dubbed Erk. In this post, Erik De Smedt and I want to formalize Erk and some other improvements on the protocol that leverage CTV (<a href=\"https://github.com/bitcoin/bips/blob/c5220f8c3b43821efa3841a6c5e90af9ce5519e8/bip-0119.mediawiki\" rel=\"noopener nofollow ugc\"><code>OP_CHECKTEMPLATEVERIFY</code></a>) and CFSF (<a href=\"https://github.com/bitcoin/bips/blob/c5220f8c3b43821efa3841a6c5e90af9ce5519e8/bip-0348.md\" rel=\"noopener nofollow ugc\"><code>OP_CHECKSIGFROMSTACK</code></a>).</p>\n<p>As a TL;DR, we came up with <em><strong>two</strong></em> alternative protocols for Ark, which have the following properties:</p>\n<ul>\n<li>“Erk”:\n<ul>\n<li>no user interactivity for rounds</li>\n<li>offline refresh (server can refresh for a user)</li>\n<li>perpetual offline refresh (server can keep refreshing for a user indefinitely)</li>\n<li>works best with single input and single output vtxo</li>\n<li>requires CTV + CSFS</li>\n</ul>\n</li>\n<li>“hArk”:\n<ul>\n<li>no user interactivity for rounds</li>\n<li>very efficient, also for multiple inputs</li>\n<li>no offline refresh possible (so far)</li>\n<li>requires CTV only</li>\n</ul>\n</li>\n</ul>\n<h1><a name=\"p-4785-a-primer-on-ark-1\" class=\"anchor\" href=\"#p-4785-a-primer-on-ark-1\"></a>A primer on Ark</h1>\n<p>Below we will briefly summarize the existing ctv-based Ark and MuSig-based clArk protocols, followed by a detailed explanation of the new Erk and hArk variants.</p>\n<p>First, we summarize some of the core concepts that we will use in the subsequent explanations.</p>\n<p>We denote the Ark server’s public key with <span class=\"math\">S</span> and users’ public keys with <span class=\"math\">A</span>, <span class=\"math\">B</span>, …</p>\n<p>The basic building block is a transaction tree that allows users to share an onchain UTXO. The sketch below shows a transaction tree where Alice (<span class=\"math\">A</span>) owns 4 bitcoin, Bob <span class=\"math\">B</span> owns 3 bitcoin, Caroll <span class=\"math\">C</span> owns 2 bitcoin and Dave <span class=\"math\">D</span> owns 1 bitcoin. Ark is an off-chain protocol, so in the happy path only the funding transaction will ever be confirmed on chain.</p>\n<pre><code class=\"lang-plaintext\">(each box is a bitcoin transaction)\n\n                 +------------+\n                 |  FUNDING   |\n                 +------------+\n                       | 10₿\n                 +-----+------+\n                 |   NODE 1   | \n                 +-----+------+\n             +---------┴--------------+\n          7₿ |                        | 3₿\n        +----+----+              +----+----+\n        | NODE 2  |              | NODE 3  |\n        +----+----+              +----+----+\n             |                        |\n       +-----+-----+            +-----+-----+\n    4₿ |        3₿ |       2₿   |           | 1₿\n    +---+----+  +---+----+   +---+----+  +---+----+\n    | EXIT A |  | EXIT B |   | EXIT C |  | EXIT D |\n    +--------+  +--------+   +--------+  +--------+\n</code></pre>\n<p>In this setup, Alice can perform a unilateral exit by broadcasting her branch of the tree to claim her funds. Her branch here consists of the txs <em>FUNDING</em>, <em>NODE 1</em>, <em>NODE 2</em> and <em>EXIT A</em>. We say that Alice owns a vtxo when she knows these transactions (and required witness data) and can spend for pubkey <span class=\"math\">A</span>.</p>\n<p>Ark vtxos have an expiry time, before which each vtxo has to be either spent or refreshed. Refreshing a vtxo essentially means swapping it for a new one with a fresh expiry time. This happens during Ark rounds, an interactive process between the Ark server and its users.</p>\n<p>After expiry, the server can sweep the tree. In the ideal case, the server can directly sweep the funding tx, but if some users have performed a unilateral exit, it can sweep all the remaining nodes of the tree that have not been exited.</p>\n<h3><a name=\"p-4785-arkoor-2\" class=\"anchor\" href=\"#p-4785-arkoor-2\"></a>Arkoor</h3>\n<p>If Alice holds a vtxo and wants to pay Bob, she can create a new off-chain tx, called an <em>arkoor tx</em>, that spends her vtxo, i.e. the output of her exit tx, and creates a new vtxo for Bob. Bob can now store all the txs that made up Alice’s vtxo, plus the arkoor tx, as his new <em>arkoor vtxo</em>.</p>\n<h3><a name=\"p-4785-output-policies-3\" class=\"anchor\" href=\"#p-4785-output-policies-3\"></a>Output policies</h3>\n<p>We identify three different output policies used in Ark protocols:</p>\n<ul>\n<li><em><strong>node policy</strong></em>: the policy used in all node txs, including the funding tx</li>\n<li><em><strong>leaf policy</strong></em>: the policy of the final node output, paying into an exit tx</li>\n<li><em><strong>exit policy</strong></em>: the policy used in the exit tx, which is the tx at the leaf of the tree and is used by the user to perform a unilateral exit</li>\n</ul>\n<p>Logically, one can think of these three policies following each other. Below is a diagram indicating the output policies used in some of the different txs used above. The exit tx can be followed by either arkoor (out-of-round) spends or forfeit spends.</p>\n<pre><code class=\"lang-plaintext\">FUNDING\n+-------------+-----+\n| node policy | 10₿ |\n+-------------+-----+\n\nNODE 1\n+-------------+-----+\n| node policy |  7₿ |\n+-------------+-----+\n| node policy |  3₿ |\n+-------------+-----+\n\nNODE 2\n+-------------+-----+\n| leaf policy |  4₿ |\n+-------------+-----+\n| leaf policy |  3₿ |\n+-------------+-----+\n\nEXIT A\n+-------------+-----+\n| exit policy |  4₿ |\n+-------------+-----+\n</code></pre>\n<p>All variants have the following properties in common:</p>\n<ul>\n<li>\n<p>Every round has an <em><strong>expiry height <span class=\"math\">T_{exp}</span></strong></em>, after which the funds can be swept by the Ark servers key.</p>\n</li>\n<li>\n<p>Both the <em>node policy</em> and <em>leaf policy</em> function to continue the tree branch of txs and have an alternative spend path that allows the server to sweep after the expiry.</p>\n</li>\n<li>\n<p>The liveness requirement for a user is that they should come online a certain time before <span class=\"math\">T_{exp}</span>, either to refresh their vtxos, or to perform a unilateral exit if the server or any previous owner of the arkoor vtxo misbehaved.</p>\n</li>\n<li>\n<p>Once the exit tx is confirmed, the expiry is averted and the funds enter the <em>exit policy</em>. The exit policy has two main functions and corresponding <em>clauses</em>:</p>\n<ul>\n<li>the <em><strong>spend clause</strong></em> provides a way for the user and the server to collaboratively create immediate spends (used for arkoor txs and forfeit txs)</li>\n<li>the <em><strong>exit clause</strong></em> provides a way for the user to access the funds if no immediate spends have been made.</li>\n</ul>\n<p>Initial designs of the <em>exit policy</em> used a relative timelock in the <em>exit clause</em>, but all our newer designs combine both an absolute timeout <span class=\"math\">T_{exp}</span> and a relative timelock <span class=\"math\">\\Delta t</span>.</p>\n<ul>\n<li>The relative timelock ensures that the <em>spend clause</em> takes precedence over the <em>exit clause</em>.</li>\n<li>The absolute timelock ensures that any subsequent owner of this vtxo (who might have received the vtxo through an arkoor tx using the <em>spend clause</em>) has no further liveness requirement than to come online some time before <span class=\"math\">T_{exp}</span>.</li>\n</ul>\n</li>\n</ul>\n<h1><a name=\"p-4785-some-variants-in-more-detail-4\" class=\"anchor\" href=\"#p-4785-some-variants-in-more-detail-4\"></a>Some variants in more detail</h1>\n<h2><a name=\"p-4785-ark-5\" class=\"anchor\" href=\"#p-4785-ark-5\"></a>Ark</h2>\n<p>The initial design of Ark was based on CTV. Our latest iteration on the idea looks as follows.</p>\n<p>Both the <em>node policy</em> and the <em>leave policy</em> use <code>OP_CTV</code> with a commitment to the next tx.</p>\n<ul>\n<li><em>node policy</em> and <em>leaf policy</em>: <span class=\"math\">CTV \\space or \\space (S + T_{exp})</span></li>\n<li><em>exit policy</em>: <span class=\"math\">(A + S) \\space or \\space (A + T_{exp} + \\Delta t)</span></li>\n</ul>\n<p>During rounds, users will sign a <em>forfeit tx</em> which forfeits their vtxo to the server and is conditional on the correct termination of the next round. A <em>connector</em> is a special-purpose descendant of the next round’s funding tx, so when used as an input to the <em>forfeit tx</em>, it ensures the server can only enforce the forfeit if the next round succesfully confirmed. Once all users have signed forfeit txs for their input vtxos, the server can sign the funding txs and broadcast it to the network.</p>\n<p>Forfeit txs take two inputs:</p>\n<ul>\n<li>the output of the exit tx, using the <em>spend clause</em> of the <em>exit policy</em></li>\n<li>the connector input which is an output resulting from a series of descendant txs from the new round’s funding tx.</li>\n</ul>\n<p>Forfeit txs have one output, sending all the money to the server.</p>\n<pre><code class=\"lang-plaintext\">forfeit tx:\n| inputs    | outputs | \n+===========+=========+\n| exit tx   |       S | \n+-----------+---------+\n| connector |         | \n+-----------+---------+\n</code></pre>\n<h2><a name=\"p-4785-clark-covenant-less-ark-6\" class=\"anchor\" href=\"#p-4785-clark-covenant-less-ark-6\"></a>clArk, “covenant-less Ark”</h2>\n<p>clArk is very similar to Ark, but uses recursive multisigs in the tree. Each <em>node policy</em> contains a multisig with all the public keys of all the leaves below it.</p>\n<ul>\n<li><em>node policy</em>: <span class=\"math\">(A + B + C + ... + S) \\space or \\space (S + T_{exp})</span></li>\n<li><em>leaf policy</em>: <span class=\"math\">(A + S) \\space or \\space (S + T_{exp})</span></li>\n<li><em>exit policy</em>: <span class=\"math\">(A + S) \\space or \\space (A + T_{exp} + \\Delta t)</span></li>\n</ul>\n<p>The round mechanism is identical and uses <em>connectors</em> as well. The only difference is that the coordination requires an extra phase in which all clients sign (their branch of) the tree.</p>\n<h2><a name=\"p-4785-erk-ark-by-erik-7\" class=\"anchor\" href=\"#p-4785-erk-ark-by-erik-7\"></a>Erk, “Ark, by Erik”</h2>\n<p>We made some additional improvements to Erk after I presented it at OP_NEXT.</p>\n<p>The policies in Erk are identical to the policies in Ark, but we make the signatures <em><strong>rebindable</strong></em> (rebindable signatures are signatures with APO semantics, meaning they don’t commit to the input utxos so that they can be used to spend from any output containing the same pubkey). We can use CTV+CSFS to implement rebindable signatures.</p>\n<ul>\n<li><em>node policy</em> and <em>leaf policy</em>: <span class=\"math\">CTV \\space or \\space (S + T_{exp})</span></li>\n<li><em>exit policy</em>: <span class=\"math\">(A + S) \\space or \\space (A + T_{exp} + \\Delta t)</span></li>\n</ul>\n<p>It is the <span class=\"math\">A+S</span> part in the <em>exit policy</em> that we will make rebindable.</p>\n<p>The core and fundamental principle of Erk rests on the following tx, which we call a <em>refund tx</em>.</p>\n<pre><code class=\"lang-plaintext\">refund tx:\n| inputs             |        outputs | \n+====================+================+\n| old exit tx for A  | exit policy A' | \n+--------------------+----------------+\n| new exit tx for A' |              S | \n+--------------------+----------------+\n</code></pre>\n<p>Erk rounds have no user interaction (in the sense that users have to take actions synchronously together). Users sign up for a round by sending a new pubkey (<span class=\"math\">A'</span>) and a signed refund tx to the server. Note that one input of the refund tx is signed with the vtxo’s current pubkey <span class=\"math\">A</span> and the other input with the newly provided pubkey <span class=\"math\">A'</span>.</p>\n<p>At that point, the server can safely create a new vtxo tree, issuing the same vtxo (minus some fee) for the user. This new vtxo has an <em>exit policy</em> with the user’s new key <span class=\"math\">A'</span>.</p>\n<p>Users can safely sign this refund tx at any time, because they still receive their money in one of its outputs. So if these txs would be used by the server maliciously, users won’t lose any money.</p>\n<p>The server can safely create the round after having received signed refund txs for all inputs because in the case the user tries to (maliciously) exit the original old vtxo, the server can unroll the new vtxo and spend both vtxos together, taking the part that the user has no right to.</p>\n<h3><a name=\"p-4785-arkoor-8\" class=\"anchor\" href=\"#p-4785-arkoor-8\"></a>Arkoor</h3>\n<p>Care needs to be taken to implement arkoor txs in the Erk variant. Imagine if user Alice sends their new vtxo to Bob using an arkoor tx, and then maliciously tries to exit the old vtxo. The server will be forced to broadcast the new vtxo and use the refund tx, invalidating Bob’s arkoor vtxo.</p>\n<p>However, since both the tree leaf exit tx and the refund tx have the same output policy for <span class=\"math\">A'</span>, the rebindable arkoor signatures that Bob received from Alice can be applied to both possible outputs. (Note that always only one of them can possibly exist at the same time, because the refund tx is a child of the exit tx.)</p>\n<p>This design for arkoor txs for Erk works well in cases where each new vtxo comes from a single input vtxo. When we try to generalize this to work for multiple inputs being consolidated into a single output vtxo, the arkoor constructions become unworkable.</p>\n<h3><a name=\"p-4785-offline-refresh-9\" class=\"anchor\" href=\"#p-4785-offline-refresh-9\"></a>Offline refresh</h3>\n<p>Now, imagine if the user already pre-signs a refund tx for his vtxo right after a round, hands the signatures to the server and then goes offline. This means that the server can at any time safely re-issue the vtxo, holding the refund tx that guarantees the user can never claim both. This means that if a user forgets to manually refresh, the server can do it automatically. It is also possible for watchtowers to monitor the Ark and notify an Ark user in case the server is not refreshing their vtxo.</p>\n<p>Furthermore, imagine if one refresh changes the key <span class=\"math\">A</span> to <span class=\"math\">A'</span>, Alice can <em>also</em> already pre-sign a refund tx for the future vtxo <span class=\"math\">A'</span>, which refreshes into <span class=\"math\">A''</span>! In fact, Alice can already pre-sign any number of future refreshes, each into a new key (and probably each subtracting a small amount from the vtxo’s value as fee). This way a server can perpetually refresh a vtxo without the user ever having to come online unless a watchtower warns it that the server is not acting as promised.</p>\n<p>Possibly a malicious server could try to apply all the refund txs in rapid succession in order to claim the fees (note that this is unlikely to be economical because he has to pay mining fees for each tx). This can be avoided if each refund tx has an absolute locktime that ensures the server can only use the refund txs at points in the future that match the predicted round times.</p>\n<h2><a name=\"p-4785-hark-hash-lock-ark-10\" class=\"anchor\" href=\"#p-4785-hark-hash-lock-ark-10\"></a>hArk, “hash-lock Ark”</h2>\n<p>Erk seems quite awesome (though we discarded aArk as a possible codename), but still has two main drawbacks:</p>\n<ul>\n<li>In order for the server to “retaliate” a malicious exit, he has to unroll the entire new vtxo’s tx tree branch. This is particularly problematic for onboard vtxos (vtxos that are created by users themselves when moving new money into the Ark). Onboard vtxos consist of only a funding tx that directly has the <em>leaf policy</em> and an exit tx on top. This means that the cost for a user to attempt a malicious exit is low, while the cost for the server to retaliate is high.</li>\n<li>Erk is only workable for single-input refreshes.</li>\n</ul>\n<p>hArk is not a variation of Erk, but an entirely different variant of Ark. It also doesn’t require any user interaction for rounds, it’s footprint-minimal and works perfectly for multiple inputs.</p>\n<p>In hArk, the <em>leaf policy</em> is different from the <em>node policy</em>, in that it requires a secret to be known to use.</p>\n<ul>\n<li><em>node policy</em>: <span class=\"math\">CTV \\space or \\space (S + T_{exp})</span></li>\n<li><em>leaf policy</em>: conceptually <span class=\"math\">(CTV + \\text{secret}) \\space or \\space (S + T_{exp})</span>, but alternatively <span class=\"math\">(A + S + \\text{secret tweak}) \\space or \\space (S + T_{exp})</span> to be able to use keyspend which is more efficient</li>\n<li><em>exit policy</em>: <span class=\"math\">(A + S) \\space or \\space (A + T_{exp} + \\Delta t)</span></li>\n</ul>\n<p>During rounds in hArk, users submit the input vtxos they want to refresh. The server generates a secret for each new vtxo in the tree. Since only the server knows the secret initially, it can safely fund the round. Initially none of the new vtxo will be accessible by its users because all secrets are still secret.</p>\n<p>After the round funding tx has confirmed, users sign a <em>forfeit tx</em>. The forfeit tx looks different than Ark and clArk forfeit txs. It allows the server to claim the input vtxo by revealing the secret.</p>\n<p>The output policy of the forfeit tx is <span class=\"math\">(S + \\text{secret}) \\space or \\space (A + \\Delta t)</span>. Naively the revealing of the secret can be implemented using a simple hash preimage, but possibly an adaptor signature can be used in the keyspend path to save some bytes.</p>\n<pre><code class=\"lang-plaintext\">forfeit tx:\n| inputs  |    outputs | \n+=========+============+\n| exit tx | S + secret |\n|         | or  A + Δt |\n+---------+------------+\n</code></pre>\n<p>After the user has signed this forfeit tx, the server tells the user the secret. This way, the user has access to its new vtxo.</p>\n<p>If the server refuses to hand over the secret after the user signed the forfeit tx, the user is required to perform a unilateral exit attempt, which either gives it its money back or forces the server to reveal the secret onchain.</p>\n<h2><a name=\"p-4785-conclusion-11\" class=\"anchor\" href=\"#p-4785-conclusion-11\"></a>Conclusion</h2>\n<p>Having CTV available allows us to fully eliminate all user interactivity during Ark rounds. Refreshing becomes an entirely asynchronous process where users can sign up, the server can independently issue new vtxos and the users later come back to finish the process.</p>\n<p>Having CSFS available on top of CTV, allows for a form of offline refresh that can even be used recursively. This allows the server to refresh without the user’s presence and it allows the user to delegate monitoring for correct behavior for its vtxos to a third party (watchtower).</p>\n<p>Both Erk and hArk can be used together. Users can always pre-emptively sign Erk refund txs just in case they don’t show up, but still manually perform rounds using hArk, for example to consolidate multiple vtxos into a single one, or simply because they prefer to refresh sooner.</p>\n<p>We believe the above schemes greatly enhance the user experience for Ark, its viability in the mobile setting and the functionality that can be offered by Ark servers.</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 2,
  "updated_at": "2025-04-15T11:54:40.401Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 78,
  "reads": 13,
  "readers_count": 12,
  "score": 437.6,
  "yours": false,
  "topic_id": 1602,
  "topic_slug": "evolving-the-ark-protocol-using-ctv-and-csfs",
  "topic_title": "Evolving the Ark protocol using CTV and CSFS",
  "topic_html_title": "Evolving the Ark protocol using CTV and CSFS",
  "category_id": 7,
  "display_username": "Steven Roose",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Last weekend at OP_NEXT I outlined a novel variation of Ark that removes all need for user interacty in rounds, dubbed Erk. In this post, Erik De Smedt and I want to formalize Erk and some other improvements on the protocol that leverage CTV ([`OP_CHECKTEMPLATEVERIFY`](https://github.com/bitcoin/bips/blob/c5220f8c3b43821efa3841a6c5e90af9ce5519e8/bip-0119.mediawiki)) and CFSF ([`OP_CHECKSIGFROMSTACK`](https://github.com/bitcoin/bips/blob/c5220f8c3b43821efa3841a6c5e90af9ce5519e8/bip-0348.md)).\n\nAs a TL;DR, we came up with ***two*** alternative protocols for Ark, which have the following properties:\n\n* \"Erk\":\n  - no user interactivity for rounds\n  - offline refresh (server can refresh for a user)\n  - perpetual offline refresh (server can keep refreshing for a user indefinitely)\n  - works best with single input and single output vtxo\n  - requires CTV + CSFS\n* \"hArk\":\n  - no user interactivity for rounds\n  - very efficient, also for multiple inputs\n  - no offline refresh possible (so far)\n  - requires CTV only\n\n# A primer on Ark\n\nBelow we will briefly summarize the existing ctv-based Ark and MuSig-based clArk protocols, followed by a detailed explanation of the new Erk and hArk variants.\n\nFirst, we summarize some of the core concepts that we will use in the subsequent explanations.\n\nWe denote the Ark server's public key with $S$ and users' public keys with $A$, $B$, ...\n\nThe basic building block is a transaction tree that allows users to share an onchain UTXO. The sketch below shows a transaction tree where Alice ($A$) owns 4 bitcoin, Bob $B$ owns 3 bitcoin, Caroll $C$ owns 2 bitcoin and Dave $D$ owns 1 bitcoin. Ark is an off-chain protocol, so in the happy path only the funding transaction will ever be confirmed on chain.\n\n\n```text\n(each box is a bitcoin transaction)\n\n                 +------------+\n                 |  FUNDING   |\n                 +------------+\n                       | 10₿\n                 +-----+------+\n                 |   NODE 1   | \n                 +-----+------+\n             +---------┴--------------+\n          7₿ |                        | 3₿\n        +----+----+              +----+----+\n        | NODE 2  |              | NODE 3  |\n        +----+----+              +----+----+\n             |                        |\n       +-----+-----+            +-----+-----+\n    4₿ |        3₿ |       2₿   |           | 1₿\n    +---+----+  +---+----+   +---+----+  +---+----+\n    | EXIT A |  | EXIT B |   | EXIT C |  | EXIT D |\n    +--------+  +--------+   +--------+  +--------+\n```\n\nIn this setup, Alice can perform a unilateral exit by broadcasting her branch of the tree to claim her funds. Her branch here consists of the txs _FUNDING_, _NODE 1_, _NODE 2_ and _EXIT A_. We say that Alice owns a vtxo when she knows these transactions (and required witness data) and can spend for pubkey $A$.\n\nArk vtxos have an expiry time, before which each vtxo has to be either spent or refreshed. Refreshing a vtxo essentially means swapping it for a new one with a fresh expiry time. This happens during Ark rounds, an interactive process between the Ark server and its users.\n\nAfter expiry, the server can sweep the tree. In the ideal case, the server can directly sweep the funding tx, but if some users have performed a unilateral exit, it can sweep all the remaining nodes of the tree that have not been exited.\n\n\n### Arkoor\n\nIf Alice holds a vtxo and wants to pay Bob, she can create a new off-chain tx, called an _arkoor tx_, that spends her vtxo, i.e. the output of her exit tx, and creates a new vtxo for Bob. Bob can now store all the txs that made up Alice's vtxo, plus the arkoor tx, as his new _arkoor vtxo_.\n\n\n### Output policies\n\nWe identify three different output policies used in Ark protocols:\n\n* ***node policy***: the policy used in all node txs, including the funding tx\n* ***leaf policy***: the policy of the final node output, paying into an exit tx\n* ***exit policy***: the policy used in the exit tx, which is the tx at the leaf of the tree and is used by the user to perform a unilateral exit\n\nLogically, one can think of these three policies following each other. Below is a diagram indicating the output policies used in some of the different txs used above. The exit tx can be followed by either arkoor (out-of-round) spends or forfeit spends.\n\n```text\nFUNDING\n+-------------+-----+\n| node policy | 10₿ |\n+-------------+-----+\n\nNODE 1\n+-------------+-----+\n| node policy |  7₿ |\n+-------------+-----+\n| node policy |  3₿ |\n+-------------+-----+\n\nNODE 2\n+-------------+-----+\n| leaf policy |  4₿ |\n+-------------+-----+\n| leaf policy |  3₿ |\n+-------------+-----+\n\nEXIT A\n+-------------+-----+\n| exit policy |  4₿ |\n+-------------+-----+\n```\n\n\nAll variants have the following properties in common:\n\n* Every round has an ***expiry height $T_{exp}$***, after which the funds can be swept by the Ark servers key.\n \n* Both the _node policy_ and _leaf policy_ function to continue the tree branch of txs and have an alternative spend path that allows the server to sweep after the expiry.\n \n* The liveness requirement for a user is that they should come online a certain time before $T_{exp}$, either to refresh their vtxos, or to perform a unilateral exit if the server or any previous owner of the arkoor vtxo misbehaved.\n\n* Once the exit tx is confirmed, the expiry is averted and the funds enter the _exit policy_. The exit policy has two main functions and corresponding _clauses_:\n\n  - the ***spend clause*** provides a way for the user and the server to collaboratively create immediate spends (used for arkoor txs and forfeit txs)\n  - the ***exit clause*** provides a way for the user to access the funds if no immediate spends have been made.\n  \n  Initial designs of the _exit policy_ used a relative timelock in the _exit clause_, but all our newer designs combine both an absolute timeout $T_{exp}$ and a relative timelock $\\Delta t$.\n  - The relative timelock ensures that the _spend clause_ takes precedence over the _exit clause_.\n  - The absolute timelock ensures that any subsequent owner of this vtxo (who might have received the vtxo through an arkoor tx using the _spend clause_) has no further liveness requirement than to come online some time before $T_{exp}$.\n\n\n\n# Some variants in more detail\n\n## Ark\n\nThe initial design of Ark was based on CTV. Our latest iteration on the idea looks as follows.\n\nBoth the _node policy_ and the _leave policy_ use `OP_CTV` with a commitment to the next tx.\n\n* _node policy_ and _leaf policy_: $CTV \\space or \\space (S + T_{exp})$\n* _exit policy_: $(A + S) \\space or \\space (A + T_{exp} + \\Delta t)$\n\nDuring rounds, users will sign a _forfeit tx_ which forfeits their vtxo to the server and is conditional on the correct termination of the next round. A _connector_ is a special-purpose descendant of the next round's funding tx, so when used as an input to the _forfeit tx_, it ensures the server can only enforce the forfeit if the next round succesfully confirmed. Once all users have signed forfeit txs for their input vtxos, the server can sign the funding txs and broadcast it to the network.\n\nForfeit txs take two inputs:\n- the output of the exit tx, using the _spend clause_ of the _exit policy_\n- the connector input which is an output resulting from a series of descendant txs from the new round's funding tx.\n\nForfeit txs have one output, sending all the money to the server.\n\n```text\nforfeit tx:\n| inputs    | outputs | \n+===========+=========+\n| exit tx   |       S | \n+-----------+---------+\n| connector |         | \n+-----------+---------+\n```\n\n## clArk, \"covenant-less Ark\"\n\nclArk is very similar to Ark, but uses recursive multisigs in the tree. Each _node policy_ contains a multisig with all the public keys of all the leaves below it.\n\n* _node policy_: $(A + B + C + ... + S) \\space or \\space (S + T_{exp})$\n* _leaf policy_: $(A + S) \\space or \\space (S + T_{exp})$\n* _exit policy_: $(A + S) \\space or \\space (A + T_{exp} + \\Delta t)$\n\nThe round mechanism is identical and uses _connectors_ as well. The only difference is that the coordination requires an extra phase in which all clients sign (their branch of) the tree.\n\n## Erk, \"Ark, by Erik\"\n\nWe made some additional improvements to Erk after I presented it at OP_NEXT.\n\nThe policies in Erk are identical to the policies in Ark, but we make the signatures ***rebindable*** (rebindable signatures are signatures with APO semantics, meaning they don't commit to the input utxos so that they can be used to spend from any output containing the same pubkey). We can use CTV+CSFS to implement rebindable signatures.\n\n* _node policy_ and _leaf policy_: $CTV \\space or \\space (S + T_{exp})$\n* _exit policy_: $(A + S) \\space or \\space (A + T_{exp} + \\Delta t)$\n\nIt is the $A+S$ part in the _exit policy_ that we will make rebindable.\n\nThe core and fundamental principle of Erk rests on the following tx, which we call a _refund tx_.\n\n```text\nrefund tx:\n| inputs             |        outputs | \n+====================+================+\n| old exit tx for A  | exit policy A' | \n+--------------------+----------------+\n| new exit tx for A' |              S | \n+--------------------+----------------+\n```\n\nErk rounds have no user interaction (in the sense that users have to take actions synchronously together). Users sign up for a round by sending a new pubkey ($A'$) and a signed refund tx to the server. Note that one input of the refund tx is signed with the vtxo's current pubkey $A$ and the other input with the newly provided pubkey $A'$.\n\nAt that point, the server can safely create a new vtxo tree, issuing the same vtxo (minus some fee) for the user. This new vtxo has an _exit policy_ with the user's new key $A'$.\n\nUsers can safely sign this refund tx at any time, because they still receive their money in one of its outputs. So if these txs would be used by the server maliciously, users won't lose any money.\n\nThe server can safely create the round after having received signed refund txs for all inputs because in the case the user tries to (maliciously) exit the original old vtxo, the server can unroll the new vtxo and spend both vtxos together, taking the part that the user has no right to.\n\n### Arkoor\n\nCare needs to be taken to implement arkoor txs in the Erk variant. Imagine if user Alice sends their new vtxo to Bob using an arkoor tx, and then maliciously tries to exit the old vtxo. The server will be forced to broadcast the new vtxo and use the refund tx, invalidating Bob's arkoor vtxo.\n\nHowever, since both the tree leaf exit tx and the refund tx have the same output policy for $A'$, the rebindable arkoor signatures that Bob received from Alice can be applied to both possible outputs. (Note that always only one of them can possibly exist at the same time, because the refund tx is a child of the exit tx.)\n\nThis design for arkoor txs for Erk works well in cases where each new vtxo comes from a single input vtxo. When we try to generalize this to work for multiple inputs being consolidated into a single output vtxo, the arkoor constructions become unworkable.\n\n### Offline refresh\n\nNow, imagine if the user already pre-signs a refund tx for his vtxo right after a round, hands the signatures to the server and then goes offline. This means that the server can at any time safely re-issue the vtxo, holding the refund tx that guarantees the user can never claim both. This means that if a user forgets to manually refresh, the server can do it automatically. It is also possible for watchtowers to monitor the Ark and notify an Ark user in case the server is not refreshing their vtxo.\n\nFurthermore, imagine if one refresh changes the key $A$ to $A'$, Alice can _also_ already pre-sign a refund tx for the future vtxo $A'$, which refreshes into $A''$! In fact, Alice can already pre-sign any number of future refreshes, each into a new key (and probably each subtracting a small amount from the vtxo's value as fee). This way a server can perpetually refresh a vtxo without the user ever having to come online unless a watchtower warns it that the server is not acting as promised.\n\nPossibly a malicious server could try to apply all the refund txs in rapid succession in order to claim the fees (note that this is unlikely to be economical because he has to pay mining fees for each tx). This can be avoided if each refund tx has an absolute locktime that ensures the server can only use the refund txs at points in the future that match the predicted round times.\n\n\n## hArk, \"hash-lock Ark\"\n\nErk seems quite awesome (though we discarded aArk as a possible codename), but still has two main drawbacks:\n\n- In order for the server to \"retaliate\" a malicious exit, he has to unroll the entire new vtxo's tx tree branch. This is particularly problematic for onboard vtxos (vtxos that are created by users themselves when moving new money into the Ark). Onboard vtxos consist of only a funding tx that directly has the _leaf policy_ and an exit tx on top. This means that the cost for a user to attempt a malicious exit is low, while the cost for the server to retaliate is high.\n- Erk is only workable for single-input refreshes.\n\nhArk is not a variation of Erk, but an entirely different variant of Ark. It also doesn't require any user interaction for rounds, it's footprint-minimal and works perfectly for multiple inputs.\n\nIn hArk, the _leaf policy_ is different from the _node policy_, in that it requires a secret to be known to use.\n\n* _node policy_: $CTV \\space or \\space (S + T_{exp})$\n* _leaf policy_: conceptually $(CTV + \\text{secret}) \\space or \\space (S + T_{exp})$, but alternatively $(A + S + \\text{secret tweak}) \\space or \\space (S + T_{exp})$ to be able to use keyspend which is more efficient\n* _exit policy_: $(A + S) \\space or \\space (A + T_{exp} + \\Delta t)$\n\nDuring rounds in hArk, users submit the input vtxos they want to refresh. The server generates a secret for each new vtxo in the tree. Since only the server knows the secret initially, it can safely fund the round. Initially none of the new vtxo will be accessible by its users because all secrets are still secret.\n\nAfter the round funding tx has confirmed, users sign a _forfeit tx_. The forfeit tx looks different than Ark and clArk forfeit txs. It allows the server to claim the input vtxo by revealing the secret.\n\nThe output policy of the forfeit tx is $(S + \\text{secret}) \\space or \\space (A + \\Delta t)$. Naively the revealing of the secret can be implemented using a simple hash preimage, but possibly an adaptor signature can be used in the keyspend path to save some bytes.\n\n```text\nforfeit tx:\n| inputs  |    outputs | \n+=========+============+\n| exit tx | S + secret |\n|         | or  A + Δt |\n+---------+------------+\n```\n\nAfter the user has signed this forfeit tx, the server tells the user the secret. This way, the user has access to its new vtxo.\n\nIf the server refuses to hand over the secret after the user signed the forfeit tx, the user is required to perform a unilateral exit attempt, which either gives it its money back or forces the server to reveal the secret onchain.\n\n\n## Conclusion\n\nHaving CTV available allows us to fully eliminate all user interactivity during Ark rounds. Refreshing becomes an entirely asynchronous process where users can sign up, the server can independently issue new vtxos and the users later come back to finish the process.\n\nHaving CSFS available on top of CTV, allows for a form of offline refresh that can even be used recursively. This allows the server to refresh without the user's presence and it allows the user to delegate monitoring for correct behavior for its vtxos to a third party (watchtower).\n\nBoth Erk and hArk can be used together. Users can always pre-emptively sign Erk refund txs just in case they don't show up, but still manually perform rounds using hArk, for example to consolidate multiple vtxos into a single one, or simply because they prefer to refresh sooner.\n\nWe believe the above schemes greatly enhance the user experience for Ark, its viability in the mobile setting and the functionality that can be offered by Ark servers.",
  "actions_summary": [
    {
      "id": 2,
      "count": 3
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 76,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Last weekend at OP_NEXT I outlined a novel variation of Ark that removes all need for user interacty in rounds, dubbed Erk. In this post, Erik De Smedt and I want to formalize Erk and some other improvements on the protocol that leverage CTV (<a href=\"https://github.com/bitcoin/bips/blob/c5220f8c3b43821efa3841a6c5e90af9ce5519e8/bip-0119.mediawiki\" rel=\"noopener nofollow ugc\">OP_CHECKTEMPLATEVERIFY</a>) and CFSF (<a href=\"https://github.com/bitcoin/bips/blob/c5220f8c3b43821efa3841a6c5e90af9ce5519e8/bip-0348.md\" rel=\"noopener nofollow ugc\">OP_CHECKSIGFROMSTACK</a>). \n&hellip;",
  "truncated": true,
  "post_url": "/t/evolving-the-ark-protocol-using-ctv-and-csfs/1602/1",
  "reactions": [
    {
      "id": "heart",
      "type": "emoji",
      "count": 3
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 3,
  "current_user_used_main_reaction": false
}