{
  "id": 4877,
  "name": null,
  "username": "JohnLaw",
  "avatar_template": "/letter_avatar_proxy/v4/letter/j/58956e/{size}.png",
  "created_at": "2025-04-25T21:17:55.471Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"ClaraShk\" data-post=\"6\" data-topic=\"1524\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/clarashk/48/370_2.png\" class=\"avatar\"> ClaraShk:</div>\n<blockquote>\n<p>Is the idea that each channel with capacity of <span class=\"math\">m</span> sats would also lock an additional <span class=\"math\">m</span> sats solely as collateral to mitigate jamming attacks? Do you have any estimates of the associated costs, such as the opportunity cost of locking up these funds?</p>\n</blockquote>\n</aside>\n<p>No, there is no need to devote am amount equal lto the channel capacity as collateral to mitigate jamming. That would be very inefficient!</p>\n<p>The amount that one has to stake for Upfront and Hold fees is just the maximum amount of those fees that would be required for the currently-outstanding HTLCs (plus some frixed fraction in matching funds, where the amount of matching funds is a function of the maximum possible Upfront and Hold fees, not the channel capacity).</p>\n<p>Yes I’ve definitely thought about the behavioral dynamics. The general principle is that one doesn’t like to lose one’s own funds, so one is generally unlikely to do so. The ultimatum game captures one of the few cases where people are sometimes willing to give up their own funds (or at least not maximize them), namely when they feel they are bing taken advantage of. In fact, that desire to “not be a sucker” is discussed in the related OPR paper. In that paper, the main way to prevent being taken advantage of is to rely on programmatic control. However, as the utlimatum game shows, even if one gets to make a human decision, allowing oneself to be ripped off if the one time when one may be willing to forego wealth. This is required to avoid a “bullying” attack, as described in the OPR paper.</p>\n<p>Thanks for your suggestion to include a numeric example, I’ll work one up.</p>",
  "post_number": 7,
  "post_type": 1,
  "posts_count": 19,
  "updated_at": "2025-04-25T21:17:55.471Z",
  "reply_count": 2,
  "reply_to_post_number": 6,
  "quote_count": 1,
  "incoming_link_count": 1,
  "reads": 38,
  "readers_count": 37,
  "score": 22.6,
  "yours": false,
  "topic_id": 1524,
  "topic_slug": "fee-based-spam-prevention-for-lightning",
  "topic_title": "Fee-Based Spam Prevention For Lightning",
  "topic_html_title": "Fee-Based Spam Prevention For Lightning",
  "category_id": 7,
  "display_username": null,
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"ClaraShk, post:6, topic:1524\"]\nIs the idea that each channel with capacity of $m$ sats would also lock an additional $m$ sats solely as collateral to mitigate jamming attacks? Do you have any estimates of the associated costs, such as the opportunity cost of locking up these funds?\n[/quote]\n\nNo, there is no need to devote am amount equal lto the channel capacity as collateral to mitigate jamming. That would be very inefficient!\n\nThe amount that one has to stake for Upfront and Hold fees is just the maximum amount of those fees that would be required for the currently-outstanding HTLCs (plus some frixed fraction in matching funds, where the amount of matching funds is a function of the maximum possible Upfront and Hold fees, not the channel capacity).\n\nYes I've definitely thought about the behavioral dynamics. The general principle is that one doesn't like to lose one's own funds, so one is generally unlikely to do so. The ultimatum game captures one of the few cases where people are sometimes willing to give up their own funds (or at least not maximize them), namely when they feel they are bing taken advantage of. In fact, that desire to \"not be a sucker\" is discussed in the related OPR paper. In that paper, the main way to prevent being taken advantage of is to rely on programmatic control. However, as the utlimatum game shows, even if one gets to make a human decision, allowing oneself to be ripped off if the one time when one may be willing to forego wealth. This is required to avoid a \"bullying\" attack, as described in the OPR paper.\n\nThanks for your suggestion to include a numeric example, I'll work one up.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 279,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "No, there is no need to devote am amount equal lto the channel capacity as collateral to mitigate jamming. That would be very inefficient! \nThe amount that one has to stake for Upfront and Hold fees is just the maximum amount of those fees that would be required for the currently-outstanding HTLCs &hellip;",
  "truncated": true,
  "post_url": "/t/fee-based-spam-prevention-for-lightning/1524/7",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}