{
  "id": 6736,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/417_2.png",
  "created_at": "2026-02-04T07:15:32.937Z",
  "cooked": "<p>They define a block as “full” if “if at most an additional 2,000 weight units could have been processed in that block.”</p>\n<p>For comparison, there are two values that control how much free capacity a block has in the code; there’s the <code>-blockreservedweight</code> which defaults to 8000 weight units and is limited to a minimum of 2000 units, which is reserved capacity for the coinbase transaction, and the hardcoded <code>BLOCK_FULL_ENOUGH_WEIGHT_DELTA</code> fixed at 4000 weight units which indicates when the block is “full enough” and should limit how many more txs are tried.</p>\n<p>With those figures, I think if miners were not tweaking the defaults and thus were optimising fee income on a per-block basis, that you’d expect that the free space in a block plus the size of the block’s coinbase transaction to be around 8000 weight units, and that seems to be what you observe in practice:</p>\n<pre data-code-wrap=\"sh\"><code class=\"lang-sh\">$ # one-liner to report (block-height coinbase-weight block-freespace sum)\n$ (b=$(bitcoin-cli getblockcount); for a in `seq 0 500`; do bitcoin-cli getblock $(bitcoin-cli getblockhash $(($b-$a)) ) 2 | jq -j '.height, \" \", .tx[0].weight, \" \", 4000000-.weight, \" \", 4000000-.weight+.tx[0].weight, \"\\n\"'; done)\n934948 1404 6394 7798\n934947 1404 6544 7948\n934946 1776 5970 7746\n934945 1404 6896 8300\n934944 2032 1836 3868\n934943 1404 6297 7701\n934942 1404 6603 8007\n...\n</code></pre>\n<p>They also define “priority violations” in a way that seems like it will hit any time a miner uses “prioritisetransaction”: “A priority violation occurs if a block contains a transaction and there are at least five transactions waiting in the mempool that [have a higher fee]”. If the minimum feerate for a block is 5 sats/vb, and there are 4 sats/vb transactions available, then including a 1sat/vb (even if it has been paid for out of band via mempool.space accelerator) would match under this scheme, which doesn’t seem appropriate. The definition is also written in terms of absolute fees, rather than fee rates, which would also lead to meaningless results, when large transactions paying modest fees are ignored in favour of smaller transactions with smaller fees on an individual basis, but that pay a higher fee when aggregated.</p>\n<p>There is some later talk about stale blocks (“orphan blocks” in the paper) that uses a sample of 57 stale blocks from 2016-2019. That seems a pretty small number; the <a href=\"https://github.com/bitcoin-data/stale-blocks/\">stale-blocks</a> repo has 290 stale blocks (202 with full block data) over roughly the specified period (blocks 391000 to 590000?). They compare the orphan block to a window of “8000 blocks (approximately 4 days)”, however 8000 blocks is actually about two months (4 days would be ~600 blocks), and in any event, it’s not clear what relevance a block even a few hour later has to a stale block.</p>\n<p>So, I don’t find the conclusions about what miners are doing in practice to be well founded.</p>",
  "post_number": 2,
  "post_type": 1,
  "posts_count": 4,
  "updated_at": "2026-02-04T15:26:34.056Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 21,
  "readers_count": 20,
  "score": 39.2,
  "yours": false,
  "topic_id": 2225,
  "topic_slug": "lehar-parlour-paper",
  "topic_title": "Lehar / Parlour Paper",
  "topic_html_title": "Lehar / Parlour Paper",
  "category_id": 6,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "They define a block as \"full\" if \"if at most an additional 2,000 weight units could have been processed in that block.\"\n\nFor comparison, there are two values that control how much free capacity a block has in the code; there's the `-blockreservedweight` which defaults to 8000 weight units and is limited to a minimum of 2000 units, which is reserved capacity for the coinbase transaction, and the hardcoded `BLOCK_FULL_ENOUGH_WEIGHT_DELTA` fixed at 4000 weight units which indicates when the block is \"full enough\" and should limit how many more txs are tried.\n\nWith those figures, I think if miners were not tweaking the defaults and thus were optimising fee income on a per-block basis, that you'd expect that the free space in a block plus the size of the block's coinbase transaction to be around 8000 weight units, and that seems to be what you observe in practice:\n\n```sh\n$ # one-liner to report (block-height coinbase-weight block-freespace sum)\n$ (b=$(bitcoin-cli getblockcount); for a in `seq 0 500`; do bitcoin-cli getblock $(bitcoin-cli getblockhash $(($b-$a)) ) 2 | jq -j '.height, \" \", .tx[0].weight, \" \", 4000000-.weight, \" \", 4000000-.weight+.tx[0].weight, \"\\n\"'; done)\n934948 1404 6394 7798\n934947 1404 6544 7948\n934946 1776 5970 7746\n934945 1404 6896 8300\n934944 2032 1836 3868\n934943 1404 6297 7701\n934942 1404 6603 8007\n...\n```\n\nThey also define \"priority violations\" in a way that seems like it will hit any time a miner uses \"prioritisetransaction\": \"A priority violation occurs if a block contains a transaction and there are at least five transactions waiting in the mempool that [have a higher fee]\". If the minimum feerate for a block is 5 sats/vb, and there are 4 sats/vb transactions available, then including a 1sat/vb (even if it has been paid for out of band via mempool.space accelerator) would match under this scheme, which doesn't seem appropriate. The definition is also written in terms of absolute fees, rather than fee rates, which would also lead to meaningless results, when large transactions paying modest fees are ignored in favour of smaller transactions with smaller fees on an individual basis, but that pay a higher fee when aggregated.\n\nThere is some later talk about stale blocks (\"orphan blocks\" in the paper) that uses a sample of 57 stale blocks from 2016-2019. That seems a pretty small number; the [stale-blocks](https://github.com/bitcoin-data/stale-blocks/) repo has 290 stale blocks (202 with full block data) over roughly the specified period (blocks 391000 to 590000?). They compare the orphan block to a window of \"8000 blocks (approximately 4 days)\", however 8000 blocks is actually about two months (4 days would be ~600 blocks), and in any event, it's not clear what relevance a block even a few hour later has to a stale block.\n\nSo, I don't find the conclusions about what miners are doing in practice to be well founded.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "They define a block as “full” if “if at most an additional 2,000 weight units could have been processed in that block.” \nFor comparison, there are two values that control how much free capacity a block has in the code; there’s the -blockreservedweight which defaults to 8000 weight units and is limit&hellip;",
  "truncated": true,
  "post_url": "/t/lehar-parlour-paper/2225/2",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}