{
  "id": 6911,
  "name": "Jon",
  "username": "jgmcalpine",
  "avatar_template": "/user_avatar/delvingbitcoin.org/jgmcalpine/{size}/1840_2.png",
  "created_at": "2026-02-20T13:38:34.018Z",
  "cooked": "<p>Hi Neil, thanks for taking the time to read through the proposal and for the feedback.</p>\n<p>You are completely right to call out the framing, and I own that misrepresentation. Using the phrase “proprietary environment” was simply the wrong terminology. I know Bark is fully open-source and that all exit paths are cryptographically verifiable from the off-chain data alone.</p>\n<p>My intent was to highlight the friction of Client-Stack Dependency in highly constrained, <code>no_std</code> environments. Even with open-source node software, a hardware wallet can’t easily import a heavy, implementation-specific software stack just to parse a VTXO and verify an exit path. The goal of vpack is to act as a neutral, lightweight translation layer so hardware wallets can verify that data without needing to “know” the entire Bark or Arkade codebase. I let the wording drift into an adversarial tone (“Implementation-Coupled Custody”), which doesn’t reflect the open nature of what your team is building. I appreciate you checking me on that and am pivoting the V-PACK documentation to focus on <strong>Implementation-Agnostic Verification</strong> rather than ‘custody’ to better reflect these technical realities.</p>\n<p>Regarding the mempool policy: that is an excellent point. I painted the TRUC depth limit as a universal “Policy Trap,” but Bark’s adoption of package relay and CPFP for emergency exits is exactly the kind of robust engineering that solves this. An independent verifier needs to correctly recognize Bark’s specific CPFP architecture so it doesn’t falsely warn a user about a policy trap that your implementation has already neutralized.</p>\n<p>I’m looking forward to digging deeper into the Bark architecture to ensure the <code>VtxoIngredient</code> schema accurately accommodates your package relay designs. Thanks again for the constructive pushback!</p>",
  "post_number": 3,
  "post_type": 1,
  "posts_count": 4,
  "updated_at": "2026-02-20T13:38:34.229Z",
  "reply_count": 1,
  "reply_to_post_number": 2,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 10,
  "readers_count": 9,
  "score": 22.0,
  "yours": false,
  "topic_id": 2267,
  "topic_slug": "stateless-vtxo-verification-decoupling-custody-from-implementation-specific-stacks",
  "topic_title": "Stateless VTXO Verification: Decoupling Custody from Implementation-Specific Stacks",
  "topic_html_title": "Stateless VTXO Verification: Decoupling Custody from Implementation-Specific Stacks",
  "category_id": 7,
  "display_username": "Jon",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": "",
  "reply_to_user": {
    "id": 1100,
    "username": "nwoodfine",
    "name": "",
    "avatar_template": "/user_avatar/delvingbitcoin.org/nwoodfine/{size}/1848_2.png"
  },
  "bookmarked": false,
  "raw": "Hi Neil, thanks for taking the time to read through the proposal and for the feedback. \n\nYou are completely right to call out the framing, and I own that misrepresentation. Using the phrase \"proprietary environment\" was simply the wrong terminology. I know Bark is fully open-source and that all exit paths are cryptographically verifiable from the off-chain data alone.\n\nMy intent was to highlight the friction of Client-Stack Dependency in highly constrained, `no_std` environments. Even with open-source node software, a hardware wallet can't easily import a heavy, implementation-specific software stack just to parse a VTXO and verify an exit path. The goal of vpack is to act as a neutral, lightweight translation layer so hardware wallets can verify that data without needing to \"know\" the entire Bark or Arkade codebase. I let the wording drift into an adversarial tone (\"Implementation-Coupled Custody\"), which doesn't reflect the open nature of what your team is building. I appreciate you checking me on that and am pivoting the V-PACK documentation to focus on **Implementation-Agnostic Verification** rather than 'custody' to better reflect these technical realities.\n\nRegarding the mempool policy: that is an excellent point. I painted the TRUC depth limit as a universal \"Policy Trap,\" but Bark’s adoption of package relay and CPFP for emergency exits is exactly the kind of robust engineering that solves this. An independent verifier needs to correctly recognize Bark's specific CPFP architecture so it doesn't falsely warn a user about a policy trap that your implementation has already neutralized.\n\nI'm looking forward to digging deeper into the Bark architecture to ensure the `VtxoIngredient` schema accurately accommodates your package relay designs. Thanks again for the constructive pushback!",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 1023,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Automatically removed quote of whole previous post.",
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Hi Neil, thanks for taking the time to read through the proposal and for the feedback. \nYou are completely right to call out the framing, and I own that misrepresentation. Using the phrase “proprietary environment” was simply the wrong terminology. I know Bark is fully open-source and that all exit &hellip;",
  "truncated": true,
  "post_url": "/t/stateless-vtxo-verification-decoupling-custody-from-implementation-specific-stacks/2267/3",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}