{
  "id": 6821,
  "name": "Antoine Poinsot",
  "username": "AntoineP",
  "avatar_template": "/user_avatar/delvingbitcoin.org/antoinep/{size}/483_2.png",
  "created_at": "2026-02-13T15:04:59.589Z",
  "cooked": "<p>A year ago i posted a call to action regarding Bitcoin Core’s priorities, which led to interesting discussions between some Bitcoin Core contributors and some community members in <a href=\"https://delvingbitcoin.org/t/antoine-poinsot-on-bitcoin-cores-priorities/1470\">this thread</a>. Not much has really happened since, in terms of taking a decision on priorities, or even on agreeing to a common goal for the project. Until today, when the Bitcoin Core GUI maintainer <a href=\"https://www.erisian.com.au/bitcoin-core-dev/log-2026-02-12.html#l-203\">called during the weekly Bitcoin Core meeting</a> for the deprecation of the GUI (which has been on life support for half a decade) and its eventual removal.</p>\n<p>I open this thread to revisit this topic in light of this update and enable a longer form -and hopefully more productive- discussion than the IRC meeting allows for.</p>\n<p>First and foremost, i must say it is frustrating how much wishful thinking is involved every single time this topic is brought up. I hope we can have a discussion without speaking in absolutes but considering the reality of the limited resources of the project.</p>\n<details>\n<summary>Click to expand longer rant on wishful thinking</summary> \n<p>During this week’s meeting we again read statements such as “users should (<img src=\"https://delvingbitcoin.org/images/emoji/twitter/tm.png?v=15\" title=\":tm:\" class=\"emoji\" alt=\":tm:\" loading=\"lazy\" width=\"20\" height=\"20\">) be able to use Bitcoin without a third-party frontend”, or “we must ship a GUI”. Of course any contributor to Bitcoin Core would agree that all other things equal, making Bitcoin Core more useful and accessible is better! The point is obviously that all other things are <strong>not equal</strong>, and the decision for Bitcoin Core to ship a GUI should not be met with an unrealistic “We Must (<img src=\"https://delvingbitcoin.org/images/emoji/twitter/tm.png?v=15\" title=\":tm:\" class=\"emoji\" alt=\":tm:\" loading=\"lazy\" width=\"20\" height=\"20\">)”, but rather beg the question “at what costs?”. Costs related to shipping a GUI come in various forms:</p>\n<ul>\n<li>direct burden related to maintenance of this component (bug fixing, build system compatibility, etc..);</li>\n<li>indirect burden related to both the presence and the active development of this component (unrelated maintenance of more important parts of the codebase ends up affecting this component, which needs fixing, or just concurrent development of this component conflicting with development in other parts of the software);</li>\n<li>direct risks related to shipping this component when it is significantly less reviewed and maintained than other parts of the software, and pulls significantly more less well-reviewed or naturally more at-risk dependencies;</li>\n<li>indirect risks related to shipping this component (risks from one component could <a href=\"https://github.com/bitcoin/bitcoin/issues/29914\">leak</a> into another, it invites code churns, and of course any limited resource spent on derisking shipping this component is not allocated to derisking more critical components);</li>\n</ul>\n<p>The costs exist. You may argue they are manageable, or that the benefits of shipping a GUI outweigh them. But simply stating that we must push through no matter the costs is absolutely unconvincing, and growingly frustrating after years of no development, barely any maintenance and tons of funding poured in dead-end projects that bring more churn (and therefore risk) to the project than they solve real world problems.</p>\n</details>\n<p>With that being said, let me try to summarize what i think are compelling points made during the meeting to try and kick-off discussions.</p>\n<p><a class=\"mention\" href=\"/u/hebasto\">@Hebasto</a> starts off by stating:</p>\n<blockquote>\n<p>Deprecate and abandon the Bitcoin Core GUI. It is insufficiently developed and reviewed, and current users have viable alternatives.</p>\n</blockquote>\n<p>That is in my opinion one of the main points of this discussion, and it was barely even discussed during the meeting. What should be our quality threshold for software we release? What should we do if we are unable to meet that threshold?</p>\n<p>Others, some who have been involved with the GUI, <a href=\"https://www.erisian.com.au/bitcoin-core-dev/log-2026-02-12.html#l-257\">pointed</a> out they disagreed with the assessment. That seems like a <strong>good starting point</strong> for a discussion. If we can’t agree on whether the GUI is in a shippable state, it’s unlikely that we will find much agreement regarding what to do of it.</p>\n<p>The other point raised in the gist is to call for an IPC interface for anyone to build a GUI, without the need to be tightly coupled to Bitcoin Core’s internals. Making Bitcoin Core more modular, and creating public interfaces to expose functionalities to external software, appear to me entirely uncontroversial among the current group of contributors. So i think it’s better to focus the discussion on the previous point of contention, that is deprecating the GUI.</p>\n<p>Another point that was brought up is how the Bitcoin Core GUI is the only way for non-technical users to interface with a Bitcoin Core wallet. If we stopped shipping the GUI in version 34.0 (roughly, end of 2027) as per the GUI maintainer’s suggested plan, users would either not be able to upgrade anymore or be forced to use the CLI. So a followup question to the previous point is assuming that we believe the GUI does not meet the bar to be shipped by Bitcoin Core, do we believe that shipping it is still the least bad option in practice, because it would otherwise lead to users not being able to upgrade?</p>\n<p>An alternative of course is that by the time we stop shipping the GUI, a replacement based on the IPC interface would be available to users. Some people <a href=\"https://www.erisian.com.au/bitcoin-core-dev/log-2026-02-12.html#l-294\">raised concerns</a> that since Bitcoin Core has shipped a GUI for so long, it disappearing in favour of alternatives not distributed by Bitcoin Core may be a fertile ground for distributing malware. If reasonable independently-distributed alternative(s) exist, do we believe we can then stop releasing a GUI? Or should we keep releasing one forever?</p>\n<p>It’s worth pointing out the IPC interface for those alternatives is not currently available in any released version of Bitcoin Core, and most likely also won’t be included in the upcoming version 31. That being said, multiple contributors pointed out that IPC is not a strict requirement for a GUI. The available RPC interface enables an application to have access to wallet functionalities and therefore be compatible with Bitcoin Core wallets. Nobody has ever built an RPC-based GUI specifically to manage a Bitcoin Core wallet, although there exists GUIs built on top of the Bitcoin Core RPC interface to manage a more modern wallet (backed by a watchonly Core wallet for monitoring the chain).</p>\n<p>Finally, all those points raised during the meeting are about direct costs (is it reasonable to ship the GUI? Who will take care of maintaining it?), but i’m also interested in what people think about indirect costs and risk. Do we think the indirect burden and risks of keeping the GUI around is worth it? If so, who will make sure it at least does not break, or better yet maintain it?</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 3,
  "updated_at": "2026-02-13T15:04:59.589Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 4,
  "reads": 27,
  "readers_count": 26,
  "score": 30.4,
  "yours": false,
  "topic_id": 2253,
  "topic_slug": "the-future-of-the-bitcoin-core-gui",
  "topic_title": "The future of the Bitcoin Core GUI",
  "topic_html_title": "The future of the Bitcoin Core GUI",
  "category_id": 8,
  "display_username": "Antoine Poinsot",
  "primary_group_name": null,
  "flair_name": "wg-consensus-cleanup",
  "flair_url": "/uploads/default/original/1X/856d779f9ec58484f3a96285a21a813538b689f6.png",
  "flair_bg_color": "",
  "flair_color": "",
  "flair_group_id": 43,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": "Regular",
  "title_is_group": false,
  "bookmarked": false,
  "raw": "A year ago i posted a call to action regarding Bitcoin Core's priorities, which led to interesting discussions between some Bitcoin Core contributors and some community members in [this thread](https://delvingbitcoin.org/t/antoine-poinsot-on-bitcoin-cores-priorities/1470). Not much has really happened since, in terms of taking a decision on priorities, or even on agreeing to a common goal for the project. Until today, when the Bitcoin Core GUI maintainer [called during the weekly Bitcoin Core meeting](https://www.erisian.com.au/bitcoin-core-dev/log-2026-02-12.html#l-203) for the deprecation of the GUI (which has been on life support for half a decade) and its eventual removal.\n\nI open this thread to revisit this topic in light of this update and enable a longer form -and hopefully more productive- discussion than the IRC meeting allows for.\n\nFirst and foremost, i must say it is frustrating how much wishful thinking is involved every single time this topic is brought up. I hope we can have a discussion without speaking in absolutes but considering the reality of the limited resources of the project.\n\n<details>\n<summary>Click to expand longer rant on wishful thinking</summary> \n\n During this week's meeting we again read statements such as \"users should (:tm:) be able to use Bitcoin without a third-party frontend\", or \"we must ship a GUI\". Of course any contributor to Bitcoin Core would agree that all other things equal, making Bitcoin Core more useful and accessible is better! The point is obviously that all other things are **not equal**, and the decision for Bitcoin Core to ship a GUI should not be met with an unrealistic \"We Must (:tm:)\", but rather beg the question \"at what costs?\". Costs related to shipping a GUI come in various forms:\n- direct burden related to maintenance of this component (bug fixing, build system compatibility, etc..);\n- indirect burden related to both the presence and the active development of this component (unrelated maintenance of more important parts of the codebase ends up affecting this component, which needs fixing, or just concurrent development of this component conflicting with development in other parts of the software);\n- direct risks related to shipping this component when it is significantly less reviewed and maintained than other parts of the software, and pulls significantly more less well-reviewed or naturally more at-risk dependencies;\n- indirect risks related to shipping this component (risks from one component could [leak](https://github.com/bitcoin/bitcoin/issues/29914) into another, it invites code churns, and of course any limited resource spent on derisking shipping this component is not allocated to derisking more critical components);\n\nThe costs exist. You may argue they are manageable, or that the benefits of shipping a GUI outweigh them. But simply stating that we must push through no matter the costs is absolutely unconvincing, and growingly frustrating after years of no development, barely any maintenance and tons of funding poured in dead-end projects that bring more churn (and therefore risk) to the project than they solve real world problems.\n\n</details>\n\nWith that being said, let me try to summarize what i think are compelling points made during the meeting to try and kick-off discussions.\n\n@Hebasto starts off by stating:\n> Deprecate and abandon the Bitcoin Core GUI. It is insufficiently developed and reviewed, and current users have viable alternatives.\n\nThat is in my opinion one of the main points of this discussion, and it was barely even discussed during the meeting. What should be our quality threshold for software we release? What should we do if we are unable to meet that threshold?\n\nOthers, some who have been involved with the GUI, [pointed](https://www.erisian.com.au/bitcoin-core-dev/log-2026-02-12.html#l-257) out they disagreed with the assessment. That seems like a **good starting point** for a discussion. If we can't agree on whether the GUI is in a shippable state, it's unlikely that we will find much agreement regarding what to do of it.\n\nThe other point raised in the gist is to call for an IPC interface for anyone to build a GUI, without the need to be tightly coupled to Bitcoin Core's internals. Making Bitcoin Core more modular, and creating public interfaces to expose functionalities to external software, appear to me entirely uncontroversial among the current group of contributors. So i think it's better to focus the discussion on the previous point of contention, that is deprecating the GUI.\n\nAnother point that was brought up is how the Bitcoin Core GUI is the only way for non-technical users to interface with a Bitcoin Core wallet. If we stopped shipping the GUI in version 34.0 (roughly, end of 2027) as per the GUI maintainer's suggested plan, users would either not be able to upgrade anymore or be forced to use the CLI. So a followup question to the previous point is assuming that we believe the GUI does not meet the bar to be shipped by Bitcoin Core, do we believe that shipping it is still the least bad option in practice, because it would otherwise lead to users not being able to upgrade?\n\nAn alternative of course is that by the time we stop shipping the GUI, a replacement based on the IPC interface would be available to users. Some people [raised concerns](https://www.erisian.com.au/bitcoin-core-dev/log-2026-02-12.html#l-294) that since Bitcoin Core has shipped a GUI for so long, it disappearing in favour of alternatives not distributed by Bitcoin Core may be a fertile ground for distributing malware. If reasonable independently-distributed alternative(s) exist, do we believe we can then stop releasing a GUI? Or should we keep releasing one forever?\n\nIt's worth pointing out the IPC interface for those alternatives is not currently available in any released version of Bitcoin Core, and most likely also won't be included in the upcoming version 31. That being said, multiple contributors pointed out that IPC is not a strict requirement for a GUI. The available RPC interface enables an application to have access to wallet functionalities and therefore be compatible with Bitcoin Core wallets. Nobody has ever built an RPC-based GUI specifically to manage a Bitcoin Core wallet, although there exists GUIs built on top of the Bitcoin Core RPC interface to manage a more modern wallet (backed by a watchonly Core wallet for monitoring the chain).\n\nFinally, all those points raised during the meeting are about direct costs (is it reasonable to ship the GUI? Who will take care of maintaining it?), but i'm also interested in what people think about indirect costs and risk. Do we think the indirect burden and risks of keeping the GUI around is worth it? If so, who will make sure it at least does not break, or better yet maintain it?",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 12,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "A year ago i posted a call to action regarding Bitcoin Core’s priorities, which led to interesting discussions between some Bitcoin Core contributors and some community members in <a href=\"https://delvingbitcoin.org/t/antoine-poinsot-on-bitcoin-cores-priorities/1470\">this thread</a>. Not much has really happened since, in terms of taking a decision on priorities, or even on agreeing to a c&hellip;",
  "truncated": true,
  "post_url": "/t/the-future-of-the-bitcoin-core-gui/2253/1",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}