{
  "id": 260,
  "name": "Steven Roose",
  "username": "stevenroose",
  "avatar_template": "/letter_avatar_proxy/v4/letter/s/8edcca/{size}.png",
  "created_at": "2023-10-02T14:01:27.807Z",
  "cooked": "<p>I would have to spend time looking up examples I read before, and I’m on the phone right now. But I do recall that in times of hard money usage, mostly government-minted gold and silver coins, it wasn’t uncommon for the government to set a list of prices of common goods. This was mostly so that people that didn’t have money (hard money was, uh, hard to get for most people) could pay either fines or their debtors using things they could get their hands on or so that thefts could be valued.</p>\n<p>In any way, these price lists obviously became a reference for people to value things at. Such a system isn’t much different from what you’re describing where the government basically maintains a unit of account without anything else. It’s a very interesting idea. I have long been interested in “social money” or “pure p2p debt money” a la hawalla, such as the original RipplePay. Such systems usually have the problem that they rely on an external unit of account the role of which usually gets fulfilled by an actual hard currency that exists in parallel with this money system. But a centralized “unit of account” publishing entity, however much as it comes with its own obvious problems, is an interesting potential solution for this problem.</p>",
  "post_number": 5,
  "post_type": 1,
  "updated_at": "2023-10-02T14:01:27.807Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 2,
  "readers_count": 1,
  "score": 45.4,
  "yours": false,
  "topic_id": 22,
  "topic_slug": "deflationary-money-is-a-good-thing",
  "topic_title": "Deflationary money is a Good Thing",
  "topic_html_title": "Deflationary money is a Good Thing",
  "category_id": 5,
  "display_username": "Steven Roose",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I would have to spend time looking up examples I read before, and I'm on the phone right now. But I do recall that in times of hard money usage, mostly government-minted gold and silver coins, it wasn't uncommon for the government to set a list of prices of common goods. This was mostly so that people that didn't have money (hard money was, uh, hard to get for most people) could pay either fines or their debtors using things they could get their hands on or so that thefts could be valued.\n\nIn any way, these price lists obviously became a reference for people to value things at. Such a system isn't much different from what you're describing where the government basically maintains a unit of account without anything else. It's a very interesting idea. I have long been interested in \"social money\" or \"pure p2p debt money\" a la hawalla, such as the original RipplePay. Such systems usually have the problem that they rely on an external unit of account the role of which usually gets fulfilled by an actual hard currency that exists in parallel with this money system. But a centralized \"unit of account\" publishing entity, however much as it comes with its own obvious problems, is an interesting potential solution for this problem.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 76,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false
}