{
  "id": 279,
  "name": "",
  "username": "dgpv",
  "avatar_template": "/user_avatar/delvingbitcoin.org/dgpv/{size}/75_2.png",
  "created_at": "2023-10-04T09:21:19.100Z",
  "cooked": "<p>Hello forum,</p>\n<p>I’ve recently had some free time and decided to implement a plugin for some covenant opcode - mainly as a way to look at how easy new complex opcodes can be added to B’SST (<a href=\"https://github.com/dgpv/bsst\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - dgpv/bsst: B'SST: Bitcoin-like Script Symbolic Tracer</a>) and what limitations of the (totaly unstable and undefined at the moment) API it would uncover.</p>\n<p>I don’t have any preference for this or that opcode, but I have chosen <code>CHECKCONTRACTVERIFY</code> because it has plenty of rules it imposes on its arguments, and <a href=\"https://github.com/halseth/mattlab/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - halseth/mattlab</a> repo had some scripts that use the opcode, that I can use to test the plugin.</p>\n<p>Writing the plugin helped to uncover some wrinkles with B’SST, which can be ironed out in the future, so I think writing plugins for other opcodes might help uncover more wrinkles.</p>\n<p>You can find B’SST plugin for <code>CHECKCONTRACTVERIFY</code> at <a href=\"https://gist.github.com/dgpv/8e8e8f5fe12a9fae3133da9bd172c925\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">B'SST plugin for CHECKCONTRACTVERIFY · GitHub</a> – note that it is not fully tested, I will wait for mattlab repo to update their opcode implementation to match reference implementation, to test on their scripts.</p>\n<p>To run <code>bsst-cli</code> with this plugin: <code>/bsst-cli --op-plugins=examples/checkcontractverify_op_plugin.py</code> (assuming the file is placed in the <code>examples</code> dir). For now, to also have access to <code>CAT</code> you need to enable Elements mode with <code>--is-elements=true</code>. In the future, I may add a setting to selectively enable opcodes.</p>\n<p>If you think you could use B’SST to experiment with your preferred opcode and think that it would be convenient to have a plugin for it, please write below the name of the opcode and a link to reference implementation. When I have another chunk of free time, I might implement more plugins.</p>\n<p>I need a link to the reference implementation because figuring out the constraints an opcode puts on values is much easier when looking at reference code, but it is sometimes not easy to locate a reference implementation for someone who do not track the development very closely, and I can say that I don’t track that closely.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2023-10-04T09:23:01.038Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 2,
  "readers_count": 1,
  "score": 0.4,
  "yours": false,
  "topic_id": 137,
  "topic_slug": "bsst-plugins-for-covenant-opcodes",
  "topic_title": "B'SST plugins for covenant opcodes",
  "topic_html_title": "B&rsquo;SST plugins for covenant opcodes",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": "",
  "bookmarked": false,
  "raw": "Hello forum,\n\nI've recently had some free time and decided to implement a plugin for some covenant opcode - mainly as a way to look at how easy new complex opcodes can be added to B'SST (https://github.com/dgpv/bsst) and what limitations of the (totaly unstable and undefined at the moment) API it would uncover.\n\nI don't have any preference for this or that opcode, but I have chosen `CHECKCONTRACTVERIFY` because it has plenty of rules it imposes on its arguments, and https://github.com/halseth/mattlab/ repo had some scripts that use the opcode, that I can use to test the plugin.\n\nWriting the plugin helped to uncover some wrinkles with B'SST, which can be ironed out in the future, so I think writing plugins for other opcodes might help uncover more wrinkles.\n\nYou can find B'SST plugin for `CHECKCONTRACTVERIFY` at https://gist.github.com/dgpv/8e8e8f5fe12a9fae3133da9bd172c925 -- note that it is not fully tested, I will wait for mattlab repo to update their opcode implementation to match reference implementation, to test on their scripts.\n\nTo run `bsst-cli` with this plugin: `/bsst-cli --op-plugins=examples/checkcontractverify_op_plugin.py` (assuming the file is placed in the `examples` dir). For now, to also have access to `CAT` you need to enable Elements mode with `--is-elements=true`. In the future, I may add a setting to selectively enable opcodes.\n\nIf you think you could use B'SST to experiment with your preferred opcode and think that it would be convenient to have a plugin for it, please write below the name of the opcode and a link to reference implementation. When I have another chunk of free time, I might implement more plugins.\n\nI need a link to the reference implementation because figuring out the constraints an opcode puts on values is much easier when looking at reference code, but it is sometimes not easy to locate a reference implementation for someone who do not track the development very closely, and I can say that I don't track that closely.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 85,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}