{
  "id": 282,
  "name": "Lloyd Fournier",
  "username": "LLFourn",
  "avatar_template": "/user_avatar/delvingbitcoin.org/llfourn/{size}/74_2.png",
  "created_at": "2023-10-05T01:05:56.900Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"harding\" data-post=\"11\" data-topic=\"98\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/harding/48/6_2.png\" class=\"avatar\"> harding:</div>\n<blockquote>\n<p><strong>More efficient DLCs:</strong> if this is referring to <a href=\"https://bitcoinops.org/en/newsletters/2022/02/02/#improving-dlc-efficiency-by-changing-script\" rel=\"noopener nofollow ugc\">what I think </a>, this efficiency boost is just in the amount of offchain operations DLC users need to generate and store; it doesn’t significantly change the onchain footprint of DLCs. DLCs have been operational for several years but have not seen any major use that I’m aware of; I believe this is partly due to their poor scalability characteristics. Every DLC-based trade needs to be anchored onchain; it’s possible to use the same anchor for multiple trades, but only if you use the same trading partner(s) for all of them. By comparison, a centralized trading clearinghouse (e.g. an exchange) requires trust but can pair any seller with any buyer. AFAIK, there are no proposed solutions for the scalability problem of DLCs.</p>\n</blockquote>\n</aside>\n<p>Your main point is well made. There are other reasons that DLCs haven’t “taken off” yet than performance issues. My opinions are well known to the people doing DLC development so I’ll leave them out here. The performance issues are significant and it’s difficult for the developers to judge what to solve next while performance haggars the UX so much. There are other solutions to that as well though. For example the amount of computation/bandwidth required can be exponentially reduced by using more than one output for the DLC. i.e. instead of doing 2^10 signatures for transactions spending from one DLC funding output you can instead have 10 outputs on the funding tx each with two signatures spending from it each. This trades bandwidth and computation for on-chain data.</p>\n<aside class=\"quote no-group\" data-username=\"harding\" data-post=\"11\" data-topic=\"98\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/harding/48/6_2.png\" class=\"avatar\"> harding:</div>\n<blockquote>\n<ul>\n<li><strong>Non-interactive channel openings:</strong> I haven’t looked into this in detail, but this looks to me like a version of <a href=\"https://bitcoinops.org/en/newsletters/2023/01/11/#non-interactive-ln-channel-open-commitments\" rel=\"noopener nofollow ugc\">swap in potentiam </a>, which is possible today and with (I’d guess) about the same onchain cost as using CTV.</li>\n</ul>\n</blockquote>\n</aside>\n<p>I think the right way to characterize the relationship between the two is that “non-interactive channel openings” and “swap in potentiam” are both suboptimal proposals making different trade offs because the ideal solution is not available. Non-interactive channel openings with CTV means you have to know the value that is going to go into the channel before you fund the script pubkey. This means you shouldn’t give this address out to others (e.g. withdraw from an exchange to it) in case something weird happens and you don’t get the amount you expected (which could mean you’ve lost the funds forever).</p>\n<p>With swap in potentiam you can give out the address without committing to the value up front but the channel opening will take two transactions instead of one. This is pretty much a deal breaker for using this kind of address as your main wallet address type.</p>\n<p>Why can’t making a payment channel with counterparty X be as simple as sending funds to an address? It turns out despite being simple to describe the tx inspection powers you need are a bit more powerful than is being proposed here. Still I feel that these “channel addresses” are the main “pants on fire” problem that needs to be solved by covenants. I am mostly saying this as a user rather than developer – every Bitcoin service I use suffers from the interactivity requirements of setting up a lightning channel.</p>",
  "post_number": 22,
  "post_type": 1,
  "updated_at": "2023-10-05T01:05:56.900Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 3,
  "reads": 10,
  "readers_count": 9,
  "score": 37.0,
  "yours": false,
  "topic_id": 98,
  "topic_slug": "covenant-tools-softfork",
  "topic_title": "Covenant tools softfork",
  "topic_html_title": "Covenant tools softfork",
  "category_id": 7,
  "display_username": "Lloyd Fournier",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "\n[quote=\"harding, post:11, topic:98\"]\n**More efficient DLCs:** if this is referring to [what I think ](https://bitcoinops.org/en/newsletters/2022/02/02/#improving-dlc-efficiency-by-changing-script), this efficiency boost is just in the amount of offchain operations DLC users need to generate and store; it doesn’t significantly change the onchain footprint of DLCs. DLCs have been operational for several years but have not seen any major use that I’m aware of; I believe this is partly due to their poor scalability characteristics. Every DLC-based trade needs to be anchored onchain; it’s possible to use the same anchor for multiple trades, but only if you use the same trading partner(s) for all of them. By comparison, a centralized trading clearinghouse (e.g. an exchange) requires trust but can pair any seller with any buyer. AFAIK, there are no proposed solutions for the scalability problem of DLCs.\n[/quote]\n\nYour main point is well made. There are other reasons that DLCs haven't \"taken off\" yet than performance issues. My opinions are well known to the people doing DLC development so I'll leave them out here. The performance issues are significant and it's difficult for the developers to judge what to solve next while performance haggars the UX so much. There are other solutions to that as well though. For example the amount of computation/bandwidth required can be exponentially reduced by using more than one output for the DLC. i.e. instead of doing 2^10 signatures for transactions spending from one DLC funding output you can instead have 10 outputs on the funding tx each with two signatures spending from it each. This trades bandwidth and computation for on-chain data.\n\n[quote=\"harding, post:11, topic:98\"]\n* **Non-interactive channel openings:** I haven’t looked into this in detail, but this looks to me like a version of [swap in potentiam ](https://bitcoinops.org/en/newsletters/2023/01/11/#non-interactive-ln-channel-open-commitments), which is possible today and with (I’d guess) about the same onchain cost as using CTV.\n[/quote]\n\nI think the right way to characterize the relationship between the two is that \"non-interactive channel openings\" and \"swap in potentiam\" are both suboptimal proposals making different trade offs because the ideal solution is not available. Non-interactive channel openings with CTV means you have to know the value that is going to go into the channel before you fund the script pubkey. This means you shouldn't give this address out to others (e.g. withdraw from an exchange to it) in case something weird happens and you don't get the amount you expected (which could mean you've lost the funds forever).\n\nWith swap in potentiam you can give out the address without committing to the value up front but the channel opening will take two transactions instead of one. This is pretty much a deal breaker for using this kind of address as your main wallet address type.\n\nWhy can't making a payment channel with counterparty X be as simple as sending funds to an address? It turns out despite being simple to describe the tx inspection powers you need are a bit more powerful than is being proposed here. Still I feel that these \"channel addresses\" are the main \"pants on fire\" problem that needs to be solved by covenants. I am mostly saying this as a user rather than developer -- every Bitcoin service I use suffers from the interactivity requirements of setting up a lightning channel.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 84,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false
}