{
  "id": 45,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/3_2.png",
  "created_at": "2022-08-24T16:14:37.270Z",
  "cooked": "<p>Redoing/expanding on a <a href=\"https://twitter.com/ajtowns/status/1555784595873751040\">tweet thread</a>:</p>\n<p>If you want a passive investment, there’s really two options: one is you can just keep cash in a mattress; the other is you can buy some real assets and ignore them.</p>\n<p>There are lots of ways you can buy real assets: you could buy some land that you just sit on, or gold that you leave in a vault, or shares in a company where you don’t participate in running it, or give a bank your money and let them loan it out and hope they’ll be able to pay it all back to you with interest at some point, but never actually be involved in vetting the borrowers or helping them make a profit to be able to pay your investment back.</p>\n<p>There are likewise many of ways you can be an active investor in similar schemes: you can buy some land and build/remodel it, or you can buy a house and rent it out taking care to ensure your tenants are both careful and happy, or you can be a significant shareholder with a seat on the board or an executive role helping to make the business more profitable, or be an angel investor or offer microloans and actively help borrowers.</p>\n<p>Another method of passive investing is to buy an asset, and then pay someone else to do all the active work – a rental agent, or an ETF provider or CEO, or an investment firm.</p>\n<p>My argument is all those passive investments are bad for society, and it would be better if those assets were owned by active investors instead.</p>\n<p>Taking the last example first: hiring an agent to do all the work for you creates the principal/agent problem: the agent is incentivised to do the least work necessary to keep earning their commission, whereas what the principal would like is for the value of the asset to be maintained or increased as much as possible. Whether that be a real estate agent that doesn’t really care about getting basic repairs done promptly, or a CEO who’s more interested in getting big bonuses versus building the company for the long term.</p>\n<p>Apart from the agency problem, passive investments will otherwise end up with underutilised real assets: property that’s underdeveloped or underutilised, art that’s kept locked away as an investment rather than displayed, commodities that are sitting in a vault rather than being used in production or as consumer goods, etc.</p>\n<p>And what happens if passive investors suddenly exit the market for all those goods? Demand decreases, and so do prices: making it cheaper to buy a home instead of renting, cheaper to own a controlling interest in a company rather than a small percentage of shares, cheaper to retain ownership and control of a company you built rather than selling it off or more affordable to get promoted from an employee to a partner in a business, cheaper to buy consumables and capital for your business, and thus cheaper to produce consumer goods. All good things!</p>\n<p>So why don’t passive investors exit the market for all those goods? Because their alternative is sitting on cash, which is designed to lose value slowly over time even in the normal case, and regularly loses value in large jumps due to government mismanagement.</p>\n<p>The only way that doesn’t happen is if the value of holding cash over time is more than the value of holding real assets over time: if you can buy an empty plot of land today for $100,000, do nothing, and in ten years expect to sell it for $200,000 (about 7% pa), you’d be a fool to sit on your money; but if in ten years it would only sell for $90,000 (about -1% pa), sitting on your money doesn’t look so bad.</p>\n<p>Of course, in either case, if you were actively investing, then spending $100,000 to buy the land, and $50,000 to develop it, might then net you $20,000 pa in profit from renting it out, which leaves you with a net profit of $50,000 after ten years, even ignoring whatever the residual value of the asset ends up being. So active investment is still worthwhile even in a deflationary environment.</p>\n<p>Likewise it doesn’t mean every good will be immediately consumed by business: if businesses expect they can sell 1000 units of some commodity today for $100, or could sell 50 units today for $80 and the remaining 50 units in a decade for $70 then it still makes sense to preserve the goods rather than selling them immediately.</p>\n<p>So might a deflationary currency – like Bitcoin with its fixed supply – not be such a scary idea after all?</p>\n<p>There are, still, two meaningful potential downsides to a regime other than “controlled low inflation in the 2%-3% range”.</p>\n<p>The first is that governments can’t trivially fund projects by printing money. However this is largely incompatible with “controlled low inflation” anyway – either only covering a small fraction of government projects (perhaps 20% of federal government spending in Australia, eg), or funding insurance programs where inflation will be out of control if the event being insured against eventuates (eg insuring deposits in the banking system), or creating a hyperinflationary cycle. So for the cases where the scheme is compatible with the goal of controlled low inflation, funding seems likely to be relatively easily replaced by some other model (taxes or borrowing).</p>\n<p>The second is that a deflationary currency might not be very predictable. People’s preference between saving for the future versus enjoying in the present isn’t constant, even averaged across an entire country. If “consumer confidence” goes down, people may prefer to save rather than spend, driving the relative value of the things they consider “saving” up, and the value of the things they consider “consumables” down. With an inflationary fiat currency, central banks can recognise this behaviour, and tweak the money supply and interest rates, so that wages and the average cost of consumables continues to rise slowly, and almost all of the volatility in prices is confined to things like real estate, and the stock market. With a fixed, deflationary currency that is heavily used for saving, however, the pricing volatility will naturally hit both consumer goods and the labor market: forcing businesses to mark down their goods, and then either fire or cut the salaries of their employees. After all, firing necessary employees because they won’t accept a necessary cut in wages will damage the business; but being willing to accept a wage cut just because the employer claims it’s necessary will result in never earning what you’re worth. So (contrary to <a href=\"https://twitter.com/ajtowns/status/1555784636927655937\">what I wrote in the tweet thread</a>) this does seem like a legitimate way that a responsibly managed fiat currency can reduce or avoid recessions.</p>\n<p>But this also seems to me like a real case where central banks economists and financial engineers have a meaningful future, even in an all Bitcoin future. The central bank could, for instance, issue an inflationary currency backed by deflationary one – if you say $10,000 today is worth 0.5 BTC, and inflate the dollar while deflating BTC, you end up with, perhaps $10,250 in a year being worth 0.495 BTC. But of course that’s only if it’s reliable – if BTC becomes inflationary (due to the savings rate dropping massively), perhaps your $10,250 requires 0.525 BTC to back it, and you’re screwed. But if everyone is really interested in holding BTC anyway, the central bank doesn’t actually need to issue a token – all it really needs to do is release an exchange rate. 1 BTC = $20,000 today, 1 BTC = $20707 in a year, 1 BTC = $19,523 when the savings rate plummets. Wages and goods can then be priced in dollars, but paid in BTC, with no one actually holding dollars, and no one suffering a risk of a bank run due to holding dollars that are suddenly unbacked.</p>\n<p>That system would have some strange behaviours (if it is even possible to implement in the real world). In particular, a rise in the “savings rate”, once reflected in the changing exchange rate of the dollar, would, in dollar terms, immediately increase the value of everyone’s savings, presumably to the point where, again in dollar terms, everyone is still willing to buy roughly as many goods and services as they were previously (avoding a drop in GDP and a recession). However in bitcoin terms, the new exchange rate and their wages/income being fixed in dollar terms, would mean that they receive less BTC every month, making it harder to continue to grow their savings in percentage terms. Perhaps that simply means that if the desire for savings increases again, then the central bank will adapt by again decreasing the exchange rate, and everyone will be satisfied, but it’s not clear to me that there wouldn’t be some more complicated result.</p>\n<p>In any event, the key issue there is simply one of collective bargaining: businesses and workers and consumers agree to coordinate automatic mild price cuts (in BTC terms) via their national central bank for both wages and goods. In all cases they can opt out of this, either by changing their prices or by renegotiating their salary; but in the normal case, (if it’s workable) it provides an easy way to address bumps in the economy in a way that, hopefully, affects everyone equally.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2022-08-24T16:14:37.270Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 10,
  "reads": 15,
  "readers_count": 14,
  "score": 53.0,
  "yours": false,
  "topic_id": 22,
  "topic_slug": "deflationary-money-is-a-good-thing",
  "topic_title": "Deflationary money is a Good Thing",
  "topic_html_title": "Deflationary money is a Good Thing",
  "category_id": 5,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Redoing/expanding on a [tweet thread](https://twitter.com/ajtowns/status/1555784595873751040):\n\nIf you want a passive investment, there's really two options: one is you can just keep cash in a mattress; the other is you can buy some real assets and ignore them.\n\nThere are lots of ways you can buy real assets: you could buy some land that you just sit on, or gold that you leave in a vault, or shares in a company where you don't participate in running it, or give a bank your money and let them loan it out and hope they'll be able to pay it all back to you with interest at some point, but never actually be involved in vetting the borrowers or helping them make a profit to be able to pay your investment back.\n\nThere are likewise many of ways you can be an active investor in similar schemes: you can buy some land and build/remodel it, or you can buy a house and rent it out taking care to ensure your tenants are both careful and happy, or you can be a significant shareholder with a seat on the board or an executive role helping to make the business more profitable, or be an angel investor or offer microloans and actively help borrowers.\n\nAnother method of passive investing is to buy an asset, and then pay someone else to do all the active work -- a rental agent, or an ETF provider or CEO, or an investment firm.\n\nMy argument is all those passive investments are bad for society, and it would be better if those assets were owned by active investors instead.\n\nTaking the last example first: hiring an agent to do all the work for you creates the principal/agent problem: the agent is incentivised to do the least work necessary to keep earning their commission, whereas what the principal would like is for the value of the asset to be maintained or increased as much as possible. Whether that be a real estate agent that doesn't really care about getting basic repairs done promptly, or a CEO who's more interested in getting big bonuses versus building the company for the long term.\n\nApart from the agency problem, passive investments will otherwise end up with underutilised real assets: property that's underdeveloped or underutilised, art that's kept locked away as an investment rather than displayed, commodities that are sitting in a vault rather than being used in production or as consumer goods, etc.\n\nAnd what happens if passive investors suddenly exit the market for all those goods? Demand decreases, and so do prices: making it cheaper to buy a home instead of renting, cheaper to own a controlling interest in a company rather than a small percentage of shares, cheaper to retain ownership and control of a company you built rather than selling it off or more affordable to get promoted from an employee to a partner in a business, cheaper to buy consumables and capital for your business, and thus cheaper to produce consumer goods. All good things!\n\nSo why don't passive investors exit the market for all those goods? Because their alternative is sitting on cash, which is designed to lose value slowly over time even in the normal case, and regularly loses value in large jumps due to government mismanagement.\n\nThe only way that doesn't happen is if the value of holding cash over time is more than the value of holding real assets over time: if you can buy an empty plot of land today for $100,000, do nothing, and in ten years expect to sell it for $200,000 (about 7% pa), you'd be a fool to sit on your money; but if in ten years it would only sell for $90,000 (about -1% pa), sitting on your money doesn't look so bad.\n\nOf course, in either case, if you were actively investing, then spending $100,000 to buy the land, and $50,000 to develop it, might then net you $20,000 pa in profit from renting it out, which leaves you with a net profit of $50,000 after ten years, even ignoring whatever the residual value of the asset ends up being. So active investment is still worthwhile even in a deflationary environment.\n\nLikewise it doesn't mean every good will be immediately consumed by business: if businesses expect they can sell 1000 units of some commodity today for $100, or could sell 50 units today for $80 and the remaining 50 units in a decade for $70 then it still makes sense to preserve the goods rather than selling them immediately.\n\nSo might a deflationary currency -- like Bitcoin with its fixed supply -- not be such a scary idea after all?\n\nThere are, still, two meaningful potential downsides to a regime other than \"controlled low inflation in the 2%-3% range\".\n\nThe first is that governments can't trivially fund projects by printing money. However this is largely incompatible with \"controlled low inflation\" anyway -- either only covering a small fraction of government projects (perhaps 20% of federal government spending in Australia, eg), or funding insurance programs where inflation will be out of control if the event being insured against eventuates (eg insuring deposits in the banking system), or creating a hyperinflationary cycle. So for the cases where the scheme is compatible with the goal of controlled low inflation, funding seems likely to be relatively easily replaced by some other model (taxes or borrowing).\n\nThe second is that a deflationary currency might not be very predictable. People's preference between saving for the future versus enjoying in the present isn't constant, even averaged across an entire country. If \"consumer confidence\" goes down, people may prefer to save rather than spend, driving the relative value of the things they consider \"saving\" up, and the value of the things they consider \"consumables\" down. With an inflationary fiat currency, central banks can recognise this behaviour, and tweak the money supply and interest rates, so that wages and the average cost of consumables continues to rise slowly, and almost all of the volatility in prices is confined to things like real estate, and the stock market. With a fixed, deflationary currency that is heavily used for saving, however, the pricing volatility will naturally hit both consumer goods and the labor market: forcing businesses to mark down their goods, and then either fire or cut the salaries of their employees. After all, firing necessary employees because they won't accept a necessary cut in wages will damage the business; but being willing to accept a wage cut just because the employer claims it's necessary will result in never earning what you're worth. So (contrary to [what I wrote in the tweet thread](https://twitter.com/ajtowns/status/1555784636927655937)) this does seem like a legitimate way that a responsibly managed fiat currency can reduce or avoid recessions.\n\nBut this also seems to me like a real case where central banks economists and financial engineers have a meaningful future, even in an all Bitcoin future. The central bank could, for instance, issue an inflationary currency backed by deflationary one -- if you say $10,000 today is worth 0.5 BTC, and inflate the dollar while deflating BTC, you end up with, perhaps $10,250 in a year being worth 0.495 BTC. But of course that's only if it's reliable -- if BTC becomes inflationary (due to the savings rate dropping massively), perhaps your $10,250 requires 0.525 BTC to back it, and you're screwed. But if everyone is really interested in holding BTC anyway, the central bank doesn't actually need to issue a token -- all it really needs to do is release an exchange rate. 1 BTC = $20,000 today, 1 BTC = $20707 in a year, 1 BTC = $19,523 when the savings rate plummets. Wages and goods can then be priced in dollars, but paid in BTC, with no one actually holding dollars, and no one suffering a risk of a bank run due to holding dollars that are suddenly unbacked.\n\nThat system would have some strange behaviours (if it is even possible to implement in the real world). In particular, a rise in the \"savings rate\", once reflected in the changing exchange rate of the dollar, would, in dollar terms, immediately increase the value of everyone's savings, presumably to the point where, again in dollar terms, everyone is still willing to buy roughly as many goods and services as they were previously (avoding a drop in GDP and a recession). However in bitcoin terms, the new exchange rate and their wages/income being fixed in dollar terms, would mean that they receive less BTC every month, making it harder to continue to grow their savings in percentage terms. Perhaps that simply means that if the desire for savings increases again, then the central bank will adapt by again decreasing the exchange rate, and everyone will be satisfied, but it's not clear to me that there wouldn't be some more complicated result.\n\nIn any event, the key issue there is simply one of collective bargaining: businesses and workers and consumers agree to coordinate automatic mild price cuts (in BTC terms) via their national central bank for both wages and goods. In all cases they can opt out of this, either by changing their prices or by renegotiating their salary; but in the normal case, (if it's workable) it provides an easy way to address bumps in the economy in a way that, hopefully, affects everyone equally.",
  "actions_summary": [],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}