{
  "id": 47,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/3_2.png",
  "created_at": "2022-08-28T07:23:55.697Z",
  "cooked": "<aside class=\"quote no-group quote-modified\" data-username=\"RubenSomsen\" data-post=\"2\" data-topic=\"22\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"20\" height=\"20\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/r/35a633/40.png\" class=\"avatar\"> RubenSomsen:</div>\n<blockquote>\n<blockquote>\n<p>agree to coordinate automatic mild price cuts (in BTC terms) via their national central bank</p>\n</blockquote>\n<p>Do you think this type of agreement won’t arise from the free market and has to be managed by a central bank?</p>\n</blockquote>\n</aside>\n<p>I don’t think you want to have many different pricing systems; you wouldn’t want one shop to be operating in AlphaDollars and the shop next door to be operating in BetaDollars (would make it hard to do price comparisons, would make things difficult if people being paid wages by one store want to buy goods at the other store), and that’s probably true even for nearby cities. If you only had one fiat currency across a large area, then whoever’s in control of that fiat currency has a lot of influence on the economy, so having some accountability via elected representatives seems reasonable. Also, seems likely that it would be hard to setup that sort of system without a legal mandate along the lines of “all goods must have their price in dollars listed” or “salaried employees must be offered their salary in dollar terms and those terms cannot be decreased more often than once every three months” or something.</p>\n<aside class=\"quote no-group\" data-username=\"RubenSomsen\" data-post=\"2\" data-topic=\"22\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"20\" height=\"20\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/r/35a633/40.png\" class=\"avatar\"> RubenSomsen:</div>\n<blockquote>\n<p>Lastly, just to add a bit of nuance that I’m sure you’ll agree with, I’ll say that I don’t think everyone will want to hold their full savings in BTC – some will prefer to pay a percentage to hedge away the volatility.</p>\n</blockquote>\n</aside>\n<p>I think of it more as distinguishing “investment” (you’ve bought some assets), “savings” (money/bitcoins) and “transaction funds” (cash you’re planning on spending soon) – so hedging would be me converting from bitcoin in savings to dollars in your transaction account. So I’d be happy to argue “holding their full savings in BTC” is a good idea with that definition. <img src=\"https://delvingbitcoin.org/images/emoji/twitter/smile.png?v=12\" title=\":smile:\" class=\"emoji\" alt=\":smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>I’m not sure whether that savings/transaction hedging is better done with actual “dollars” that the central bank would mint and redeem, or privately with future/options contracts or similar financial instruments. If a clever financial instrument could work, that could be done privately, which might reduce systemic risk – if one bank makes a mistake, it might only affect their customers, while if the central bank makes a mistake it necessarily affects everyone.</p>\n<p>I think a systemic problem in this case would be if “dollars” end up undercollateralised – your balance says $20,000 but there’s ultimately only 0.9 BTC backing it, and the central bank says 0.9 BTC is worth $18,000 say. In that case there’s two choices: all the banks that messed up go through bankruptcy proceedings (and you’re given 0.9 BTC quickly and perhaps another 0.5B from sale of the bank’s tangible assets, and you’ve effectively lost $1000/5% of you transaction account balance), or the central bank devalues their fiat currency, so that now you need $20,000 or more to buy 0.9 BTC. If the central bank chooses to devalue it to avoid systemic risk, despite its CPI target not giving it a reason to, that would then cause corresponding (demand-driven?) price inflation.</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2022-08-28T07:23:55.697Z",
  "reply_count": 1,
  "reply_to_post_number": 2,
  "quote_count": 1,
  "incoming_link_count": 1,
  "reads": 12,
  "readers_count": 11,
  "score": 12.4,
  "yours": false,
  "topic_id": 22,
  "topic_slug": "deflationary-money-is-a-good-thing",
  "topic_title": "Deflationary money is a Good Thing",
  "topic_html_title": "Deflationary money is a Good Thing",
  "category_id": 5,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"RubenSomsen, post:2, topic:22\"]\n> agree to coordinate automatic mild price cuts (in BTC terms) via their national central bank\n\nDo you think this type of agreement won’t arise from the free market and has to be managed by a central bank?\n[/quote]\n\nI don't think you want to have many different pricing systems; you wouldn't want one shop to be operating in AlphaDollars and the shop next door to be operating in BetaDollars (would make it hard to do price comparisons, would make things difficult if people being paid wages by one store want to buy goods at the other store), and that's probably true even for nearby cities. If you only had one fiat currency across a large area, then whoever's in control of that fiat currency has a lot of influence on the economy, so having some accountability via elected representatives seems reasonable. Also, seems likely that it would be hard to setup that sort of system without a legal mandate along the lines of \"all goods must have their price in dollars listed\" or \"salaried employees must be offered their salary in dollar terms and those terms cannot be decreased more often than once every three months\" or something.\n\n[quote=\"RubenSomsen, post:2, topic:22\"]\nLastly, just to add a bit of nuance that I’m sure you’ll agree with, I’ll say that I don’t think everyone will want to hold their full savings in BTC – some will prefer to pay a percentage to hedge away the volatility.\n[/quote]\n\nI think of it more as distinguishing \"investment\" (you've bought some assets), \"savings\" (money/bitcoins) and \"transaction funds\" (cash you're planning on spending soon) -- so hedging would be me converting from bitcoin in savings to dollars in your transaction account. So I'd be happy to argue \"holding their full savings in BTC\" is a good idea with that definition. :smile:\n\nI'm not sure whether that savings/transaction hedging is better done with actual \"dollars\" that the central bank would mint and redeem, or privately with future/options contracts or similar financial instruments. If a clever financial instrument could work, that could be done privately, which might reduce systemic risk -- if one bank makes a mistake, it might only affect their customers, while if the central bank makes a mistake it necessarily affects everyone.\n\nI think a systemic problem in this case would be if \"dollars\" end up undercollateralised -- your balance says $20,000 but there's ultimately only 0.9 BTC backing it, and the central bank says 0.9 BTC is worth $18,000 say. In that case there's two choices: all the banks that messed up go through bankruptcy proceedings (and you're given 0.9 BTC quickly and perhaps another 0.5B from sale of the bank's tangible assets, and you've effectively lost $1000/5% of you transaction account balance), or the central bank devalues their fiat currency, so that now you need $20,000 or more to buy 0.9 BTC. If the central bank chooses to devalue it to avoid systemic risk, despite its CPI target not giving it a reason to, that would then cause corresponding (demand-driven?) price inflation.",
  "actions_summary": [],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}