{
  "id": 3564,
  "name": "Bastien Teinturier",
  "username": "t-bast",
  "avatar_template": "/user_avatar/delvingbitcoin.org/t-bast/{size}/98_2.png",
  "created_at": "2024-11-21T15:00:03.792Z",
  "cooked": "<p>Sorry for the very late reply! Thanks for the detailed summary <img src=\"https://delvingbitcoin.org/images/emoji/twitter/slight_smile.png?v=12\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>I’m a big fan of the unsigned TLV for SPV proof, very good idea!</p>\n<p>It all looks mostly good to me, I only have a couple of nitpicks:</p>\n<ul>\n<li>C): I would like the outpoint to be included in the signed fields, it’s nicer for <code>txindex</code> nodes and provides more information about the tx which is generally a good thing</li>\n<li>C): I’m not a fan of the “hash of the SPV proof” proposal: I don’t think it’s a good idea to force nodes to be able to generate the SPV proof when creating the announcement, as I believe most nodes won’t care about including an SPV proof for light clients</li>\n<li>D): I think we could collapse feature bits 1 and 2 into a single one, I don’t think it’s a huge amount of implementation work to support both and would speed up network adoption. But I’m also ok with keeping them separate if people feel strongly about it.</li>\n<li>E): nice to have this!</li>\n</ul>\n<p>On the eclair side, we’d be happy to work on implementing features 1 and 2 as soon as you feel that you have the spec ready and an lnd implementation ready for cross-compat. Let’s do this!</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2024-11-21T15:00:03.792Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 1,
  "readers_count": 0,
  "score": 0.2,
  "yours": false,
  "topic_id": 1202,
  "topic_slug": "updates-to-the-gossip-1-75-proposal-post-ln-summit-meeting",
  "topic_title": "Updates to the Gossip 1.75 proposal post LN summit meeting",
  "topic_html_title": "Updates to the Gossip 1.75 proposal post LN summit meeting",
  "category_id": 7,
  "display_username": "Bastien Teinturier",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Sorry for the very late reply! Thanks for the detailed summary :slight_smile: \n\nI'm a big fan of the unsigned TLV for SPV proof, very good idea!\n\nIt all looks mostly good to me, I only have a couple of nitpicks:\n\n- C): I would like the outpoint to be included in the signed fields, it's nicer for `txindex` nodes and provides more information about the tx which is generally a good thing\n- C): I'm not a fan of the \"hash of the SPV proof\" proposal: I don't think it's a good idea to force nodes to be able to generate the SPV proof when creating the announcement, as I believe most nodes won't care about including an SPV proof for light clients\n- D): I think we could collapse feature bits 1 and 2 into a single one, I don't think it's a huge amount of implementation work to support both and would speed up network adoption. But I'm also ok with keeping them separate if people feel strongly about it.\n- E): nice to have this!\n\nOn the eclair side, we'd be happy to work on implementing features 1 and 2 as soon as you feel that you have the spec ready and an lnd implementation ready for cross-compat. Let's do this!",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 101,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}