{
  "id": 3502,
  "name": null,
  "username": "JohnLaw",
  "avatar_template": "/letter_avatar_proxy/v4/letter/j/58956e/{size}.png",
  "created_at": "2024-11-10T00:06:59.715Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"harding\" data-post=\"3\" data-topic=\"1233\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/harding/48/6_2.png\" class=\"avatar\"> harding:</div>\n<blockquote>\n<p>It’s my belief (possibly ill-informed) that there’s been minimal work in this direction due to HTLC settlement cost griefing not being perceived as a major problem at present.</p>\n</blockquote>\n</aside>\n<p>Fair enough.</p>\n<p>Let’s assume the current protocol is safe for payments that are smaller than the on-chain fees required to claim them.\nI think the reason they are safe is:</p>\n<ol>\n<li>no one is willing to be shown to be a sucker from whom funds can be stolen, therefore:</li>\n<li>everyone is willing to claim the funds that are owed to them, even if this results in a net loss due to fees, therefore:</li>\n<li>Alice will never try to steal Bob’s funds by using the attack given at the beginning of this post.</li>\n</ol>\n<p>Regarding point 3, Alice won’t try to steal because doing so won’t succeed (due to point 2) and would make it look like she has low availability (even though she wouldn’t lose funds if she tried).</p>\n<p>If we believe the above reasoning, then I think it’s fair to say that the OPR protocol is safe (for any size payment) because:</p>\n<ol start=\"4\">\n<li>no one is willing to be shown to be a sucker from whom funds can be stolen, therefore:</li>\n<li>everyone is willing to prevent a bullying attack, even if they would obtain more funds if they could be bullied, therefore:</li>\n<li>no one will ever attack their peer by failing to agree to the correct resolution of an HTLC.</li>\n</ol>\n<p>Regarding point 6, no one will try such an attack, both because it won’t succeed (due to point 5) and it would make the attacker lose funds and reputation.</p>\n<p>If we agree to the reasoning above, that means the OPR protocol is safe in the sense that one’s peer will always try to resolve each HTLC correctly.</p>\n<p>Does that sound right?</p>\n<p>There are tradeoffs with the OPR protocol’s use of a burn output because one’s peer can fail permanently or the partners may fail to agree on an HTLC’s resolution (despite their best efforts).\nHowever, those costs provide the benefits of resolving payments in a completely off-chain and scalable manner.\nI could certainly image that those costs could be worth paying someday, especially if lightning becomes widely used and the blockchain becomes very congested.</p>\n<p>There’s also a potential cost to supporting short HTLC expiries, as they increase the risk of losing the payment because of a failure.\nHowever, this is tunable.</p>\n<p>For example, consider the case where each router sets their htlc_expiry_delta_msec parameter to match the off-chain (G) portion of their CLTV delta parameter.\nIn this case, there’s no obvious risk from having shorter expiries, and users are likely to appreciate the faster payment resolutions.\nIn practice, I’m guessing that the htlc_expiry_delta_msec parameters will be much shorter, but that’s just a guess for now.</p>\n<p>In any case, prior to the OPR protocol, I wasn’t aware of a way to resolve payments quickly and safely without ever having to go onchain.</p>\n<p>I hope that adding these capabilities to our toolkit will help lightning scale and become more widely adopted.</p>",
  "post_number": 6,
  "post_type": 1,
  "updated_at": "2024-11-10T00:06:59.715Z",
  "reply_count": 0,
  "reply_to_post_number": 3,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 7,
  "readers_count": 6,
  "score": 1.4,
  "yours": false,
  "topic_id": 1233,
  "topic_slug": "a-fast-scalable-protocol-for-resolving-lightning-payments",
  "topic_title": "A Fast, Scalable Protocol For Resolving Lightning Payments",
  "topic_html_title": "A Fast, Scalable Protocol For Resolving Lightning Payments",
  "category_id": 7,
  "display_username": null,
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"harding, post:3, topic:1233\"]\nIt’s my belief (possibly ill-informed) that there’s been minimal work in this direction due to HTLC settlement cost griefing not being perceived as a major problem at present.\n[/quote]\n\nFair enough.\n\nLet's assume the current protocol is safe for payments that are smaller than the on-chain fees required to claim them.\nI think the reason they are safe is:\n\n  1) no one is willing to be shown to be a sucker from whom funds can be stolen, therefore:\n  2) everyone is willing to claim the funds that are owed to them, even if this results in a net loss due to fees, therefore:\n  3) Alice will never try to steal Bob's funds by using the attack given at the beginning of this post.\n\nRegarding point 3, Alice won't try to steal because doing so won't succeed (due to point 2) and would make it look like she has low availability (even though she wouldn't lose funds if she tried).\n\nIf we believe the above reasoning, then I think it's fair to say that the OPR protocol is safe (for any size payment) because:\n\n  4) no one is willing to be shown to be a sucker from whom funds can be stolen, therefore:\n  5) everyone is willing to prevent a bullying attack, even if they would obtain more funds if they could be bullied, therefore:\n  6) no one will ever attack their peer by failing to agree to the correct resolution of an HTLC.\n\nRegarding point 6, no one will try such an attack, both because it won't succeed (due to point 5) and it would make the attacker lose funds and reputation.\n\nIf we agree to the reasoning above, that means the OPR protocol is safe in the sense that one's peer will always try to resolve each HTLC correctly.\n\nDoes that sound right?\n\nThere are tradeoffs with the OPR protocol's use of a burn output because one's peer can fail permanently or the partners may fail to agree on an HTLC's resolution (despite their best efforts).\nHowever, those costs provide the benefits of resolving payments in a completely off-chain and scalable manner.\nI could certainly image that those costs could be worth paying someday, especially if lightning becomes widely used and the blockchain becomes very congested.\n\nThere's also a potential cost to supporting short HTLC expiries, as they increase the risk of losing the payment because of a failure.\nHowever, this is tunable.\n\nFor example, consider the case where each router sets their htlc_expiry_delta_msec parameter to match the off-chain (G) portion of their CLTV delta parameter.\nIn this case, there's no obvious risk from having shorter expiries, and users are likely to appreciate the faster payment resolutions.\nIn practice, I'm guessing that the htlc_expiry_delta_msec parameters will be much shorter, but that's just a guess for now.\n\nIn any case, prior to the OPR protocol, I wasn't aware of a way to resolve payments quickly and safely without ever having to go onchain.\n\nI hope that adding these capabilities to our toolkit will help lightning scale and become more widely adopted.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 279,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}