{
  "id": 3580,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/417_2.png",
  "created_at": "2024-11-25T06:51:39.315Z",
  "cooked": "<p>I’d like to share a concept that I’m working on implementing in <a href=\"https://delvingbitcoin.org/t/debuggable-lisp-scripts/1224\">bllsh</a>, that I’m calling “Flexible Coin Earmarks”, along with how it relates to ideas like lightning commitments, vaults, and payment pools. This post does go into some implementation details, but not to the level of specifying any code, so should apply equally to a realisation in bll or simplicity or something else.</p>\n<h3><a name=\"p-3580-concept-1\" class=\"anchor\" href=\"#p-3580-concept-1\"></a>Concept</h3>\n<p>The idea is relatively simple:</p>\n<ul>\n<li>a flexible coin earmark allows you to split the value of a single coin (aka utxo) across separate purposes – each of these is an “earmark”.</li>\n<li>earmarks can be “exercised” independently by updating the coin; that is to say, by publishing a transaction that:\n<ul>\n<li>spends the coin</li>\n<li>satisfies whatever conditions were placed on the earmark</li>\n<li>creates a new output that is also a flexible coin earmark<sup class=\"footnote-ref\"><a href=\"#footnote-3580-1\" id=\"footnote-ref-3580-1\">[1]</a></sup>, which contains all the unexercised earmarks and their corresponding value</li>\n</ul>\n</li>\n<li>all earmarks can be replaced wholesale under some circumstances\n<ul>\n<li>the circumstances under which this makes sense depends heavily on the use case, so see below</li>\n<li>in implementation terms, eg, this might correspond to a key path spend signed by a musig2 key that combines the pubkeys of all the recipients of the earmarks</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"p-3580-comparisons-2\" class=\"anchor\" href=\"#p-3580-comparisons-2\"></a>Comparisons</h3>\n<h4><a name=\"p-3580-lightning-commitment-transactions-3\" class=\"anchor\" href=\"#p-3580-lightning-commitment-transactions-3\"></a>Lightning commitment transactions</h4>\n<p>This is a fairly nice match for lightning commitments: when you do a unilateral channel close, the channel funds are naturally earmarked for different purposes; there’s your balance, there’s your counterparty’s balance, and also each unresolved HTLC. Likewise the conditions for ignoring all the earmarks are pretty clear: you published an outdated state, and your counterparty has a newer state. Exactly what happens when you ignore the earmarks depends on whether you’re doing ln-penalty (all the funds go to your counterparty), or eltoo (you just update to the new state’s earmarks).</p>\n<p>One aspect that is different in the flexible coin earmark model is dealing with layered commitments. Layered commitments in the current ln-penalty model means that when you close a channel with a pending HTLC, you create a distinct output for that HTLC, that can be updated either by providing the HTLC preimage or when the HTLC timeout occurs, so that the HTLC’s recipient is locked in. This means that if there is an overlap between the HTLC timeout and the channel’s state finalisation timeout (ie, the point at which you can no longer present a newer state to dispute the channel close), there isn’t a race between which channel member gets to claim the funds.</p>\n<p>In the flexible coin earmark model, this can occur within a single coin, without creating additional outputs: you exercise the earmark by either providing the preimage or demonstrating the timeout has passed, and when generating the new output, you remove the HTLC’s earmark, and update the appropriate balance of whoever received the funds. This has two benefits. One, admittedly fairly minor, is that it means you don’t ever need a dedicated output for the individual HTLC, so the dust limit doesn’t constrain what the value of HTLCs you can satisfy on-chain. The more important is that the channel’s overall value remains in a single utxo even as layered commitments are updated, which makes it cheaper for the cheated party to recover the channel funds, as they haven’t been split across multiple small utxos, that would all need to be claimed separately.</p>\n<p>In the context of eltoo, layered commitments have either been ignored entirely, or result in <a href=\"https://lists.linuxfoundation.org/pipermail/lightning-dev/2020-January/002448.html\">very complex constructions</a>. With flexible coin earmarks, this becomes much simpler: layered commitments are just updating the earmarks, and state updates are just wholesale replacement of the earmarks. Neither of these change the coin’s balance, and nor do they split the coin.</p>\n<h4><a name=\"p-3580-vaults-4\" class=\"anchor\" href=\"#p-3580-vaults-4\"></a>Vaults</h4>\n<p>The concept of “vault” that I’m using here is that when your funds are in a vault you can spend them by:</p>\n<ol>\n<li>authorising with your “hot key”</li>\n<li>publishing a commitment to where you want the funds to end up</li>\n<li>wait some fixed delay during which the vault can be “locked” via a “recovery key”</li>\n<li>publishing a transaction to actually send funds to the place you committed to</li>\n</ol>\n<p>If the recovery key is used, then that should at least invalidate the commitment (preventing the attempted theft), but in most cases all the funds in the vault should be locked down (since the attempted theft was only possible in the first place if the hot key had been compromised).</p>\n<p>In the flexible coin earmark model, you would implement this concept by creating a new earmark any time you wanted to spend funds, with the earmark’s execution conditions being that a particular delay has been reached and that the correct output is created. The recovery path is then simply replacing all the pending earmarks, and moving the funds into a cold wallet. (If you want to allow multiple concurrent pending spends, then tracking the delay becomes somewhat more complicated, as each new commitment should not reset the delay)</p>\n<p>The <a href=\"https://github.com/bitcoin/bips/blob/f269890255400d3119a3341c124902d98519fa3a/bip-0345.mediawiki\">BIP345</a> approach differs from this in that the spend is separated into its own utxo immediately upon publishing the commitment, which makes the final spend somewhat easier, at the cost of making the recovery somewhat more complicated. (BIP345 also introduces the concept of deferred balance checks to consensus, which are not contemplated here)</p>\n<h4><a name=\"p-3580-payment-pools-5\" class=\"anchor\" href=\"#p-3580-payment-pools-5\"></a>Payment pools</h4>\n<p>The concept of a payment pool here is an on-chain mechanism for gathering funds, that can be spent jointly, but, until they have been spent remain recoverable by whoever originally contributed the funds. An example design was given in the <a href=\"https://gnusha.org/pi/bitcoindev/20210909064138.GA22496@erisian.com.au/\">TLUV proposal</a>.</p>\n<p>Mapping this to a flexible coin earmark model is straightforward: the value of the coin is split into an earmark for each contributor who can extract that value just by signing for it, and making the pooled payment can be done via a key path spend authorised by a musig2 key combining the keys of all the funders.</p>\n<p>However, generating the updated coin when an earmark is executed is more complex, as not only do the earmarks have to be updated (removing the earmark for the funds that were removed), but so does the internal public key, which needs to have a key removed from the musig2 collection. This was where the process fell apart in the TLUV design – removal requires either adding or subtracting the key, depending on where the internal public key had previously been negated, but because taproot uses a 32-byte internal public key, there is no natural way to track whether it was negated. This could have been worked around, but not in any particularly satisfying way. (BIP 345’s OP_VAULT opcode avoids this issue by not providing a way to modify the internal public key) With flexible coin earmarks, we can finesse this nicely however: we need a somewhat generic way of storing all the earmarks anyway, so can simply store whether the internal public key was negated in the same place.</p>\n<h3><a name=\"p-3580-flexibility-6\" class=\"anchor\" href=\"#p-3580-flexibility-6\"></a>Flexibility</h3>\n<p>Implicit in the descriptions above is a couple of different ideas of what “flexible” means in the phrase “flexible coin earmarks”.</p>\n<ol>\n<li>Earmark execution is flexible: there’s no fixed order in which the earmarks have to be executed, some earmarks may never be executed, and the earmarks themselves may have conditions in their execution (eg, HTLC earmarks behave differently depending on if they’re executed with a preimage reveal, vs a timeout)</li>\n<li>Earmark specification is flexible: there are substantial differences in the behaviour of earmarks between lightning, vaults, and payment pools: in lightning we want execution of one earmark (an HTLC) to update the value of another earmark (the recipient’s channel balance); in vaults we want to enforce a delay before an earmark can be executed; in payment pools we want to update the internal public key.</li>\n</ol>\n<p>The latter point raises a question: can that flexibility in specification be provided via specialist opcodes (such as TLUV), or can it only really be achieved via a more general purpose language (like bll or simplicity)? Of course, even if the latter were the case, it would be possible to introduce independent opcodes for each distinct class of earmark with a use case that gains traction, so this may be more a question of philosophy and development process.</p>\n<h3><a name=\"p-3580-implementation-7\" class=\"anchor\" href=\"#p-3580-implementation-7\"></a>Implementation</h3>\n<p>So, assuming a general purpose language for expressing coin spending conditions, and one built on taproot at that, I think the following implementation approach is feasible.</p>\n<p>First, deal with the “replace earmarks wholesale” step – in many cases this can be dealt with via setting the internal public key and simply using the key path, perhaps producing a multisig key with musig2 first. In some cases, such as lightning, some additional conditions may be required, in which case these are specified in taproot scripts. Because this path is for replacing the earmarks wholesale, any scripts here can remain independent of any logic investigating whatever the current earmarks were.</p>\n<p>This leaves the question of how to execute an earmark. There are many ways you could do this, but I think one of the simpler approaches is to leverage the taproot script tree for data storage (commitment) – that is, have one “branch” of the taproot tree be a merkle root committing to a tree of earmarks, and its neighbour in the taproot script tree be the script that’s authorising/validating earmark execution. This has two nice properties: it’s fairly easy to access the earmark merkle root as it is simply the first item in the merkle path section of the control block; and it also means that when updating the earmarks, the script itself is unchanged, somewhat simplifying calculation of the new scriptPubKey.</p>\n<p>This approach can be generalised if there are different methods of executing an earmark. For example, in the payment pool case, we’ve already considered the case of where a member of the pool wants to remove themselves from it; but it’s also possible that the rest of the pool may wish to evict a particular member: after all, in this design, the cooperative path can only be executed if everyone agrees. Evicting a single member would involve revealing that member’s earmark, creating an output paying the member’s balance to their pubkey, and signing the spend with the result of subtracting the member’s key from the internal public key. In this case you might want to provide separate scripts for both these behaviours, in which case the earmarks merkle root would become the second entry in the control block path, rather than the first. Updating the earmarks would still require constructing a new scriptPubKey with only the earmarks merkle root being replaced when recalculating the taproot script tree’s merkle root.</p>\n<p>Here’s a diagram of how that generalised example might look, where there are three scripts: one for bypassing/replacing the earmarks, one for a member withdrawing their own funds, and one for everyone else evicting a member from the pool.</p>\n<pre data-code-height=\"401\" data-code-wrap=\"mermaid\"><code class=\"lang-mermaid\">flowchart\n    spk{{scriptPubKey}} --&gt; ipk{{internal public key}}\n    spk --&gt; tr([taproot script tree root])\n    tr --&gt; coop[wholesale replacement\\nof earmarks]\n    tr --&gt; unco([earmarks subtree])\n    unco --&gt; em[[earmarks merkle root]]\n    unco --&gt; us([earmarks scripts])\n    us --&gt;  wd[withdraw via earmark]\n    us --&gt; ev[evict via earmark]\n    em --&gt; em1&gt;earmark 1]\n    em --&gt; em2&gt;earmark 2]\n</code></pre>\n<p>When spending using the “withdraw via earmark” script, the taproot merkle path will consist of “evict via earmark”, “earmarks merkle root”, and “wholesale replacement of earmarks”. (The entries in the earmarks merkle (sub)tree are marked up differently to imply they should be hashed in a way distinct from the TapLeaf/TapBranch tagged hashes defined in BIP341, to ensure they can’t be misinterpreted as taproot scripts, possibly enabling theft of funds).</p>\n<p>This leaves us with what an earmark execution script actually needs to do. The basic witness data the script will need to be provided with include:</p>\n<ul>\n<li>a reveal of the earmark, as well as the merkle path from the earmark to the earmarks merkle root</li>\n<li>any data necessary to satisfy the earmark conditions (eg, a preimage reveal or a signature)</li>\n<li>the index of the output that will contain the remaining/updated earmarks</li>\n</ul>\n<p>And the things the script will need to check/calculate include:</p>\n<ul>\n<li>check that the earmark reveal and merkle path resolve to the merkle root extracted from the control block</li>\n<li>check that the earmark’s execution conditions are correctly satisfied</li>\n<li>calculate the amount of funds that should remain in the coin (ie, the input value minus the value of any spent earmarks)</li>\n<li>check that the new output’s value is at least the amount of funds that should remain</li>\n<li>calculate the new internal public key, if necessary (eg, in the case of payment pools, the internal public key will change)</li>\n<li>calculate the updated earmarks merkle root (eg, the executed earmark should be removed, and perhaps other earmarks should be updated if this was an internal transfer)</li>\n<li>calculate the new scriptPubKey by combining the new internal public key, the updated earmarks merkle root, and the taproot script merkle path from the control block</li>\n<li>check that the new output’s scriptPubKey matches the new scriptPubKey</li>\n</ul>\n<p>I believe both bll and simplicity have a sufficient feature set to be able to express the above. My hope is that it’s possible to express it in a modular way, so you can spend most of your time defining what the earmark execution and wholesale replacement conditions are, rather than manually tweaking the checks/calculations above for your particular use case.</p>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"footnote-3580-1\" class=\"footnote-item\"><p>If you’re wondering why the word “covenant” doesn’t appear in this post other than in this footnote, I’ve <a href=\"https://gnusha.org/pi/bitcoindev/20220719044458.GA26986@erisian.com.au/\">written previously</a> about why I think it is not an accurate or useful term. <a href=\"#footnote-ref-3580-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-11-25T06:56:45.680Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 57,
  "reads": 20,
  "readers_count": 19,
  "score": 354.0,
  "yours": false,
  "topic_id": 1275,
  "topic_slug": "flexible-coin-earmarks",
  "topic_title": "Flexible Coin Earmarks",
  "topic_html_title": "Flexible Coin Earmarks",
  "category_id": 7,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I'd like to share a concept that I'm working on implementing in [bllsh](https://delvingbitcoin.org/t/debuggable-lisp-scripts/1224), that I'm calling \"Flexible Coin Earmarks\", along with how it relates to ideas like lightning commitments, vaults, and payment pools. This post does go into some implementation details, but not to the level of specifying any code, so should apply equally to a realisation in bll or simplicity or something else.\n\n### Concept\n\nThe idea is relatively simple:\n\n  * a flexible coin earmark allows you to split the value of a single coin (aka utxo) across separate purposes -- each of these is an \"earmark\".\n  * earmarks can be \"exercised\" independently by updating the coin; that is to say, by publishing a transaction that:\n    * spends the coin\n    * satisfies whatever conditions were placed on the earmark\n    * creates a new output that is also a flexible coin earmark[^1], which contains all the unexercised earmarks and their corresponding value\n  * all earmarks can be replaced wholesale under some circumstances\n    * the circumstances under which this makes sense depends heavily on the use case, so see below\n    * in implementation terms, eg, this might correspond to a key path spend signed by a musig2 key that combines the pubkeys of all the recipients of the earmarks\n\n### Comparisons\n\n#### Lightning commitment transactions\n\nThis is a fairly nice match for lightning commitments: when you do a unilateral channel close, the channel funds are naturally earmarked for different purposes; there's your balance, there's your counterparty's balance, and also each unresolved HTLC. Likewise the conditions for ignoring all the earmarks are pretty clear: you published an outdated state, and your counterparty has a newer state. Exactly what happens when you ignore the earmarks depends on whether you're doing ln-penalty (all the funds go to your counterparty), or eltoo (you just update to the new state's earmarks).\n\nOne aspect that is different in the flexible coin earmark model is dealing with layered commitments. Layered commitments in the current ln-penalty model means that when you close a channel with a pending HTLC, you create a distinct output for that HTLC, that can be updated either by providing the HTLC preimage or when the HTLC timeout occurs, so that the HTLC's recipient is locked in. This means that if there is an overlap between the HTLC timeout and the channel's state finalisation timeout (ie, the point at which you can no longer present a newer state to dispute the channel close), there isn't a race between which channel member gets to claim the funds.\n\nIn the flexible coin earmark model, this can occur within a single coin, without creating additional outputs: you exercise the earmark by either providing the preimage or demonstrating the timeout has passed, and when generating the new output, you remove the HTLC's earmark, and update the appropriate balance of whoever received the funds. This has two benefits. One, admittedly fairly minor, is that it means you don't ever need a dedicated output for the individual HTLC, so the dust limit doesn't constrain what the value of HTLCs you can satisfy on-chain. The more important is that the channel's overall value remains in a single utxo even as layered commitments are updated, which makes it cheaper for the cheated party to recover the channel funds, as they haven't been split across multiple small utxos, that would all need to be claimed separately.\n\nIn the context of eltoo, layered commitments have either been ignored entirely, or result in [very complex constructions](https://lists.linuxfoundation.org/pipermail/lightning-dev/2020-January/002448.html). With flexible coin earmarks, this becomes much simpler: layered commitments are just updating the earmarks, and state updates are just wholesale replacement of the earmarks. Neither of these change the coin's balance, and nor do they split the coin.\n\n#### Vaults\n\nThe concept of \"vault\" that I'm using here is that when your funds are in a vault you can spend them by:\n  1. authorising with your \"hot key\"\n  2. publishing a commitment to where you want the funds to end up\n  3. wait some fixed delay during which the vault can be \"locked\" via a \"recovery key\"\n  4. publishing a transaction to actually send funds to the place you committed to\n\nIf the recovery key is used, then that should at least invalidate the commitment (preventing the attempted theft), but in most cases all the funds in the vault should be locked down (since the attempted theft was only possible in the first place if the hot key had been compromised).\n\nIn the flexible coin earmark model, you would implement this concept by creating a new earmark any time you wanted to spend funds, with the earmark's execution conditions being that a particular delay has been reached and that the correct output is created. The recovery path is then simply replacing all the pending earmarks, and moving the funds into a cold wallet. (If you want to allow multiple concurrent pending spends, then tracking the delay becomes somewhat more complicated, as each new commitment should not reset the delay) \n\nThe [BIP345](https://github.com/bitcoin/bips/blob/f269890255400d3119a3341c124902d98519fa3a/bip-0345.mediawiki) approach differs from this in that the spend is separated into its own utxo immediately upon publishing the commitment, which makes the final spend somewhat easier, at the cost of making the recovery somewhat more complicated. (BIP345 also introduces the concept of deferred balance checks to consensus, which are not contemplated here)\n\n#### Payment pools\n\nThe concept of a payment pool here is an on-chain mechanism for gathering funds, that can be spent jointly, but, until they have been spent remain recoverable by whoever originally contributed the funds. An example design was given in the [TLUV proposal](https://gnusha.org/pi/bitcoindev/20210909064138.GA22496@erisian.com.au/).\n\nMapping this to a flexible coin earmark model is straightforward: the value of the coin is split into an earmark for each contributor who can extract that value just by signing for it, and making the pooled payment can be done via a key path spend authorised by a musig2 key combining the keys of all the funders.\n\nHowever, generating the updated coin when an earmark is executed is more complex, as not only do the earmarks have to be updated (removing the earmark for the funds that were removed), but so does the internal public key, which needs to have a key removed from the musig2 collection. This was where the process fell apart in the TLUV design -- removal requires either adding or subtracting the key, depending on where the internal public key had previously been negated, but because taproot uses a 32-byte internal public key, there is no natural way to track whether it was negated. This could have been worked around, but not in any particularly satisfying way. (BIP 345's OP_VAULT opcode avoids this issue by not providing a way to modify the internal public key) With flexible coin earmarks, we can finesse this nicely however: we need a somewhat generic way of storing all the earmarks anyway, so can simply store whether the internal public key was negated in the same place.\n\n### Flexibility\n\nImplicit in the descriptions above is a couple of different ideas of what \"flexible\" means in the phrase \"flexible coin earmarks\".\n\n 1. Earmark execution is flexible: there's no fixed order in which the earmarks have to be executed, some earmarks may never be executed, and the earmarks themselves may have conditions in their execution (eg, HTLC earmarks behave differently depending on if they're executed with a preimage reveal, vs a timeout)\n 2. Earmark specification is flexible: there are substantial differences in the behaviour of earmarks between lightning, vaults, and payment pools: in lightning we want execution of one earmark (an HTLC) to update the value of another earmark (the recipient's channel balance); in vaults we want to enforce a delay before an earmark can be executed; in payment pools we want to update the internal public key.\n\nThe latter point raises a question: can that flexibility in specification be provided via specialist opcodes (such as TLUV), or can it only really be achieved via a more general purpose language (like bll or simplicity)? Of course, even if the latter were the case, it would be possible to introduce independent opcodes for each distinct class of earmark with a use case that gains traction, so this may be more a question of philosophy and development process.\n\n### Implementation\n\nSo, assuming a general purpose language for expressing coin spending conditions, and one built on taproot at that, I think the following implementation approach is feasible.\n\nFirst, deal with the \"replace earmarks wholesale\" step -- in many cases this can be dealt with via setting the internal public key and simply using the key path, perhaps producing a multisig key with musig2 first. In some cases, such as lightning, some additional conditions may be required, in which case these are specified in taproot scripts. Because this path is for replacing the earmarks wholesale, any scripts here can remain independent of any logic investigating whatever the current earmarks were.\n\nThis leaves the question of how to execute an earmark. There are many ways you could do this, but I think one of the simpler approaches is to leverage the taproot script tree for data storage (commitment) -- that is, have one \"branch\" of the taproot tree be a merkle root committing to a tree of earmarks, and its neighbour in the taproot script tree be the script that's authorising/validating earmark execution. This has two nice properties: it's fairly easy to access the earmark merkle root as it is simply the first item in the merkle path section of the control block; and it also means that when updating the earmarks, the script itself is unchanged, somewhat simplifying calculation of the new scriptPubKey.\n\nThis approach can be generalised if there are different methods of executing an earmark. For example, in the payment pool case, we've already considered the case of where a member of the pool wants to remove themselves from it; but it's also possible that the rest of the pool may wish to evict a particular member: after all, in this design, the cooperative path can only be executed if everyone agrees. Evicting a single member would involve revealing that member's earmark, creating an output paying the member's balance to their pubkey, and signing the spend with the result of subtracting the member's key from the internal public key. In this case you might want to provide separate scripts for both these behaviours, in which case the earmarks merkle root would become the second entry in the control block path, rather than the first. Updating the earmarks would still require constructing a new scriptPubKey with only the earmarks merkle root being replaced when recalculating the taproot script tree's merkle root.\n\nHere's a diagram of how that generalised example might look, where there are three scripts: one for bypassing/replacing the earmarks, one for a member withdrawing their own funds, and one for everyone else evicting a member from the pool.\n\n```mermaid height=401,auto\nflowchart\n    spk{{scriptPubKey}} --> ipk{{internal public key}}\n    spk --> tr([taproot script tree root])\n    tr --> coop[wholesale replacement\\nof earmarks]\n    tr --> unco([earmarks subtree])\n    unco --> em[[earmarks merkle root]]\n    unco --> us([earmarks scripts])\n    us -->  wd[withdraw via earmark]\n    us --> ev[evict via earmark]\n    em --> em1>earmark 1]\n    em --> em2>earmark 2]\n```\n\nWhen spending using the \"withdraw via earmark\" script, the taproot merkle path will consist of \"evict via earmark\", \"earmarks merkle root\", and \"wholesale replacement of earmarks\". (The entries in the earmarks merkle (sub)tree are marked up differently to imply they should be hashed in a way distinct from the TapLeaf/TapBranch tagged hashes defined in BIP341, to ensure they can't be misinterpreted as taproot scripts, possibly enabling theft of funds).\n\nThis leaves us with what an earmark execution script actually needs to do. The basic witness data the script will need to be provided with include:\n\n * a reveal of the earmark, as well as the merkle path from the earmark to the earmarks merkle root\n * any data necessary to satisfy the earmark conditions (eg, a preimage reveal or a signature)\n * the index of the output that will contain the remaining/updated earmarks\n\nAnd the things the script will need to check/calculate include:\n\n * check that the earmark reveal and merkle path resolve to the merkle root extracted from the control block\n * check that the earmark's execution conditions are correctly satisfied\n * calculate the amount of funds that should remain in the coin (ie, the input value minus the value of any spent earmarks)\n * check that the new output's value is at least the amount of funds that should remain\n * calculate the new internal public key, if necessary (eg, in the case of payment pools, the internal public key will change)\n * calculate the updated earmarks merkle root (eg, the executed earmark should be removed, and perhaps other earmarks should be updated if this was an internal transfer)\n * calculate the new scriptPubKey by combining the new internal public key, the updated earmarks merkle root, and the taproot script merkle path from the control block\n * check that the new output's scriptPubKey matches the new scriptPubKey\n\nI believe both bll and simplicity have a sufficient feature set to be able to express the above. My hope is that it's possible to express it in a modular way, so you can spend most of your time defining what the earmark execution and wholesale replacement conditions are, rather than manually tweaking the checks/calculations above for your particular use case.\n\n[^1]: If you're wondering why the word \"covenant\" doesn't appear in this post other than in this footnote, I've [written previously](https://gnusha.org/pi/bitcoindev/20220719044458.GA26986@erisian.com.au/) about why I think it is not an accurate or useful term.",
  "actions_summary": [
    {
      "id": 2,
      "count": 4
    }
  ],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "eyes",
      "type": "emoji",
      "count": 2
    },
    {
      "id": "heart",
      "type": "emoji",
      "count": 1
    },
    {
      "id": "rocket",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 4,
  "current_user_used_main_reaction": false
}