{
  "id": 3488,
  "name": "David A. Harding",
  "username": "harding",
  "avatar_template": "/user_avatar/delvingbitcoin.org/harding/{size}/6_2.png",
  "created_at": "2024-11-05T10:14:19.731Z",
  "cooked": "<p>I think OPR needs some sort of unconditional fees to work.</p>\n<p>In the current LN protocol, the party that creates a payment only pays forwarding fees if the payment is successful.  Unsuccessful payments, and HTLCs designed to fail (called <em>probes</em>), cost their creator nothing.</p>\n<p>However, if that model was adopted by OPR, then Mallory could send a constant stream of probes through Bob to random endpoints.  Each of those endpoints would fail the probes (because they wouldn’t know the payment preimage) in the normal case, but it would occasionally be the case that there would be a problem downstream and a penalty payment would propagate back to Mallory.</p>\n<p>Even with unconditional fees, OPR would seem to create an incentive for an attacker to create disruptions within the network.  Defending against such attacks could become a centralizing factor (e.g. in the same way that many popular websites use CloudFlare today because it’s one of the few services big enough to survive cheap-to-perform DDoS attacks).</p>\n<aside class=\"quote no-group\" data-username=\"JohnLaw\" data-post=\"1\" data-topic=\"1233\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/j/58956e/48.png\" class=\"avatar\"> JohnLaw:</div>\n<blockquote>\n<p>If we assume the average incremental latency required to resolve an HTLC is 100 milliseconds and the average payment traverses 11 hops, each HTLC will be resolved an average of 600 milliseconds after it’s created. If each node fails (due to a crash, delay, or protocol error) randomly 10 times a day, thus causing it to lose the value of all unresolved HTLCs, that node will lose the value of one out of every 14,400 HTLCs. Therefore, increasing the routing fee by 1/14,400 = 0.007% of the HTLC value per node (and thus 0.077% per payment) will cover the cost of node failures that cause HTLC failures.</p>\n</blockquote>\n</aside>\n<p>If the risk-free interest rate is 2% per annum, then we would expect the forwarding fee in a mature system to approach 0.00000004% per hop for a 600 ms average settlement time (<code>2 / (86400 / 0.6) / 365.25</code>), or 0.0000004% per payment assuming 11 hops. The OPR fee is 5 orders of magnitude higher.  <a href=\"https://1ml.com/statistics\" class=\"inline-onebox\">Lightning Network Statistics | 1ML - Lightning Network Search and Analysis Engine - Bitcoin mainnet</a> says the current median percentage fee (not factoring in the base fee) is “0.000072 sat/sat”, or 0.0072% per hop, or 0.08% per payment assuming 11 hops, so OPR accidental routing failures is roughly expected to double the routing cost over the current system or 10,000x increase the cost over a (very theoretical) expected floor.</p>\n<p>That does not count the costs of non-accidental failures (i.e. attacks) or the costs of preventing attacks.</p>\n<aside class=\"quote no-group\" data-username=\"JohnLaw\" data-post=\"1\" data-topic=\"1233\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/j/58956e/48.png\" class=\"avatar\"> JohnLaw:</div>\n<blockquote>\n<p>The security of all known Lightning payment protocols breaks down when the incremental cost of resolving a payment on-chain exceeds the value of the payment.</p>\n</blockquote>\n</aside>\n<p>One theoretical solution, <a href=\"https://docs.google.com/presentation/d/1G4xchDGcO37DJ2lPC_XYyZIUkJc2khnLrCaZXgvDN0U/edit?pref=2&amp;pli=1#slide=id.g85f425098_0_195\">proposed years ago</a>, is for low-value payments to be encapsulated in higher-value outputs using probabilistic payments.  For example: when it would cost $10 in onchain fees to settle an HTLC, Alice offers Bob a $100 HTLC with an HTLC-Success transaction that gives him a 1% chance of being able to claim it onchain (the other 99% of the time, Alice reclaims the money).  Bob accepts that and forwards $1 to Carol (perhaps also using a probabilistic payment).  If the HTLC is settled offchain (either success or failure), then the $100 output is reallocated $1 to Bob and $99 to Alice.  If it goes onchain, then Bob gets his 1% chance at $100 (i.e., an expected value before fees of $1) which will cost him $10 in fees if he’s successful; in the other 99% of the time, Alice gets her $100 back (expected value $99) by paying $10 in fees.</p>\n<p>Probabilistic payments are possible today on Elements-based sidechains using <code>OP_DETERMINISTIC_RANDOM</code>.</p>\n<p>It’s my belief (possibly ill-informed) that there’s been minimal work in this direction due to HTLC settlement cost griefing not being perceived as a major problem at present.</p>\n<aside class=\"quote no-group\" data-username=\"JohnLaw\" data-post=\"1\" data-topic=\"1233\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/j/58956e/48.png\" class=\"avatar\"> JohnLaw:</div>\n<blockquote>\n<p>all payments are resolved within seconds (as compared to hours for the current protocol),</p>\n</blockquote>\n</aside>\n<p><a href=\"https://bitcoinops.org/en/topics/redundant-overpayments/\">Opportunistic overpayments</a> also has this property for <em>almost</em> all payments.  If, in your proposal, the burn output is expected to be a multiple of the maximal OPR HTLC amount, then the same amount of funds could be used instead for an refundable overpayment that would significantly increase the odds of rapid payment success.</p>\n<p>Most discussion about overpayments that I’m aware of has preferred a PTLC-based mechanism, which is something that’s still being developed for LN.</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2024-11-05T10:14:19.731Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 10,
  "readers_count": 9,
  "score": 2.0,
  "yours": false,
  "topic_id": 1233,
  "topic_slug": "a-fast-scalable-protocol-for-resolving-lightning-payments",
  "topic_title": "A Fast, Scalable Protocol For Resolving Lightning Payments",
  "topic_html_title": "A Fast, Scalable Protocol For Resolving Lightning Payments",
  "category_id": 7,
  "display_username": "David A. Harding",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I think OPR needs some sort of unconditional fees to work.\n\nIn the current LN protocol, the party that creates a payment only pays forwarding fees if the payment is successful.  Unsuccessful payments, and HTLCs designed to fail (called _probes_), cost their creator nothing.\n\nHowever, if that model was adopted by OPR, then Mallory could send a constant stream of probes through Bob to random endpoints.  Each of those endpoints would fail the probes (because they wouldn't know the payment preimage) in the normal case, but it would occasionally be the case that there would be a problem downstream and a penalty payment would propagate back to Mallory.\n\nEven with unconditional fees, OPR would seem to create an incentive for an attacker to create disruptions within the network.  Defending against such attacks could become a centralizing factor (e.g. in the same way that many popular websites use CloudFlare today because it's one of the few services big enough to survive cheap-to-perform DDoS attacks).\n\n[quote=\"JohnLaw, post:1, topic:1233\"]\nIf we assume the average incremental latency required to resolve an HTLC is 100 milliseconds and the average payment traverses 11 hops, each HTLC will be resolved an average of 600 milliseconds after it’s created. If each node fails (due to a crash, delay, or protocol error) randomly 10 times a day, thus causing it to lose the value of all unresolved HTLCs, that node will lose the value of one out of every 14,400 HTLCs. Therefore, increasing the routing fee by 1/14,400 = 0.007% of the HTLC value per node (and thus 0.077% per payment) will cover the cost of node failures that cause HTLC failures.\n[/quote]\n\nIf the risk-free interest rate is 2% per annum, then we would expect the forwarding fee in a mature system to approach 0.00000004% per hop for a 600 ms average settlement time (`2 / (86400 / 0.6) / 365.25`), or 0.0000004% per payment assuming 11 hops. The OPR fee is 5 orders of magnitude higher.  https://1ml.com/statistics says the current median percentage fee (not factoring in the base fee) is \"0.000072 sat/sat\", or 0.0072% per hop, or 0.08% per payment assuming 11 hops, so OPR accidental routing failures is roughly expected to double the routing cost over the current system or 10,000x increase the cost over a (very theoretical) expected floor.\n\nThat does not count the costs of non-accidental failures (i.e. attacks) or the costs of preventing attacks.\n\n[quote=\"JohnLaw, post:1, topic:1233\"]\nThe security of all known Lightning payment protocols breaks down when the incremental cost of resolving a payment on-chain exceeds the value of the payment.\n[/quote]\n\nOne theoretical solution, [proposed years ago](https://docs.google.com/presentation/d/1G4xchDGcO37DJ2lPC_XYyZIUkJc2khnLrCaZXgvDN0U/edit?pref=2&pli=1#slide=id.g85f425098_0_195), is for low-value payments to be encapsulated in higher-value outputs using probabilistic payments.  For example: when it would cost $10 in onchain fees to settle an HTLC, Alice offers Bob a $100 HTLC with an HTLC-Success transaction that gives him a 1% chance of being able to claim it onchain (the other 99% of the time, Alice reclaims the money).  Bob accepts that and forwards $1 to Carol (perhaps also using a probabilistic payment).  If the HTLC is settled offchain (either success or failure), then the $100 output is reallocated $1 to Bob and $99 to Alice.  If it goes onchain, then Bob gets his 1% chance at $100 (i.e., an expected value before fees of $1) which will cost him $10 in fees if he's successful; in the other 99% of the time, Alice gets her $100 back (expected value $99) by paying $10 in fees.\n\nProbabilistic payments are possible today on Elements-based sidechains using `OP_DETERMINISTIC_RANDOM`.\n\nIt's my belief (possibly ill-informed) that there's been minimal work in this direction due to HTLC settlement cost griefing not being perceived as a major problem at present.\n\n[quote=\"JohnLaw, post:1, topic:1233\"]\nall payments are resolved within seconds (as compared to hours for the current protocol),\n[/quote]\n\n[Opportunistic overpayments](https://bitcoinops.org/en/topics/redundant-overpayments/) also has this property for _almost_ all payments.  If, in your proposal, the burn output is expected to be a multiple of the maximal OPR HTLC amount, then the same amount of funds could be used instead for an refundable overpayment that would significantly increase the odds of rapid payment success.\n\nMost discussion about overpayments that I'm aware of has preferred a PTLC-based mechanism, which is something that's still being developed for LN.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 6,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}