{
  "id": 3554,
  "name": "Antoine Riard",
  "username": "ariard",
  "avatar_template": "/letter_avatar_proxy/v4/letter/a/c67d28/{size}.png",
  "created_at": "2024-11-17T18:50:53.510Z",
  "cooked": "<p>Firstly, I believe this message from Rusty Russell defaming my professional reputation is very deliberately or naively amnesic in providing more context from where this complaint might have arise, here few links for a more “objective” view of the situation (in chronological order: <a href=\"https://github.com/lightning/bolts/issues/1171#issuecomment-2391390677\">here</a>, <a href=\"https://github.com/lightning/bolts/issues/1201\">here</a>, <a href=\"https://github.com/lightning/bolts/pull/1207\">here</a>, <a href=\"https://github.com/lightning/bolts/pull/1208\">here</a> and <a href=\"https://github.com/lightning/bolts/pull/1207\">here</a>).</p>\n<p>Second, I’m very surprised to not see Matt Corallo mentioned in the signature of this message (<a href=\"mailto:wdihtdtfs@mattcorallo.com\">wdihtdtfs@mattcorallo.com</a> - email cc’d in Rusty private email 13 Nov 2024). What was Matt’s role in this affair ? Being the author of the code of conduct, acting as a moderator, playing the victim ? For an external observer, this can only lend confusion if Rusty Russell isn’t just currently acting as the puppet of Matt Corallo’s employer, or under threats of such employer.</p>\n<p>Thirdly, there has been a follow-up discussion by email among Rusty Russel and myself over the past days, where I did ask him if he had any conflict of interest protection within its current work contract with Blockstream Inc for him to express and act freely on open-source topics. After all, from public media and private conversations, this was well-understood by at least 2 bitcoin foss veterans who had such conflict of interests protections in their work contract employment at Blockstream Inc inception in 2014.</p>\n<p>Rusty Russell did confirm me by email he had no such conflict of interest protections in his current work agreement with Blockstream Inc, and he went to point out of his experience in the linux kernel space. While I did mark my respect to Rusty’s experience in the linux kernel (whatever one can think how it scores on low-level robustness as a kernel artifact let’s say compared to openbsd), I did observe to Rusty he was not Linus Torvalds. It appears that Torvalds himself sounds himself to have given him to put code of conduct in the kernel in 2018 (cf <a href=\"https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/commit/?id=8a104f8b5867c682d994ffa7a74093c54469c11f\">here</a> and <a href=\"https://lkml.org/lkml/2018/9/16/167\">here</a>), under some blackmail pressures from SJW political activists.</p>\n<p>Personally, I’ve nothing against political activism in itself, that’s a basic right for the ones who are lucky to live in democracy respecting the rule of law. Beyond, about social justice as a political ideology in itself, while being very busy professionally myself, I can always find time to discuss the philosophical tenets of it in front of a  bitcoin public media with one of its advocate. I’ve amply studied in the past the John Rawls vs. Robert Nocizck controversy in the past, while more or less formally studying philosophy, and I’ve always loved intense intellectual brawls for their own sake (beyond a left vs right divide, as the philosopher Ortega y Gasset said it once “<em>Being right or left, it is only picking up among two forms of moral hemiplegia</em>” – let’s keep bitcoin development as much apolitical as we can).</p>\n<p>For good reasons, the moderation rules in bitcoin core were specifically designed to be agnostic\nin their cultural expression, and let people focus on code shipping and review (cf. <a href=\"https://github.com/bitcoin-core/meta/blob/3527bf7818d53bffa6c496be7f8d30dc8e1fa198/MODERATION-GUIDELINES.md\">here</a>) as one maintainer and developer in the multi-process eloquently put it. It has also the additional advantage to well bound the margins of subjectivity in the moderators’s judgement. This preventing some dispositions of the moderation rules to be leveraged to covertly advance business interest of some stakeholder or weaken the review process. All of that at the detriment of the average end-user financial safety (i.e <em>you</em> the anonymous pleb).</p>\n<p>E.g, a lightning contributor belonging to company X could now go to argue that she/he{picks up the politically correct pronoun of your choice} “feels” verbally bullied by the harsh comments of a\ncontributor belonging to company Y or being an independent contributor to the lightning spec advancing a bolt or blip Z in favor of the commercial interest of the company Z.</p>\n<p>All that said, this is nothing personal or whatever related with Rusty Russell himself, and I’m looking forward to collaborate with him again in the future on bugs and vulnerabilities affecting the memory-unsafe coded in C Core-Lightning lightning code base as I did in the past. I understand open-source maintainers with decade of experiences, who have learnt to bend the knee to cultural norms to not take risks with their more or less guaranteed employments. I do not approve, but I understand.</p>\n<p>All the information reported is I believe “cold facts” and not defamatory towards anyone. If necessary, I’m ready to attest to the alleged fact under oath in front of a US court or other country with decent rule of law. Sadly, digital mediums are too many times deliberately used by some open-source folks themselves to forget the basic of ethics.</p>\n<p>This message is timestamped in the bitcoin blockchain for authenticity of the conversation.</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2024-11-17T18:56:01.497Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 74,
  "reads": 23,
  "readers_count": 22,
  "score": 374.4,
  "yours": false,
  "topic_id": 1254,
  "topic_slug": "code-of-conduct-violation-banning-antoine-riard-for-3-months",
  "topic_title": "Code of Conduct Violation: Banning Antoine Riard for 3 months",
  "topic_html_title": "Code of Conduct Violation: Banning Antoine Riard for 3 months",
  "category_id": 7,
  "display_username": "Antoine Riard",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Firstly, I believe this message from Rusty Russell defaming my professional reputation is very deliberately or naively amnesic in providing more context from where this complaint might have arise, here few links for a more \"objective\" view of the situation (in chronological order: [here](https://github.com/lightning/bolts/issues/1171#issuecomment-2391390677), [here](https://github.com/lightning/bolts/issues/1201), [here](https://github.com/lightning/bolts/pull/1207), [here](https://github.com/lightning/bolts/pull/1208) and [here](https://github.com/lightning/bolts/pull/1207)).\n\nSecond, I'm very surprised to not see Matt Corallo mentioned in the signature of this message (wdihtdtfs@mattcorallo.com - email cc’d in Rusty private email 13 Nov 2024). What was Matt's role in this affair ? Being the author of the code of conduct, acting as a moderator, playing the victim ? For an external observer, this can only lend confusion if Rusty Russell isn’t just currently acting as the puppet of Matt Corallo's employer, or under threats of such employer.\n\nThirdly, there has been a follow-up discussion by email among Rusty Russel and myself over the past days, where I did ask him if he had any conflict of interest protection within its current work contract with Blockstream Inc for him to express and act freely on open-source topics. After all, from public media and private conversations, this was well-understood by at least 2 bitcoin foss veterans who had such conflict of interests protections in their work contract employment at Blockstream Inc inception in 2014.\n\nRusty Russell did confirm me by email he had no such conflict of interest protections in his current work agreement with Blockstream Inc, and he went to point out of his experience in the linux kernel space. While I did mark my respect to Rusty's experience in the linux kernel (whatever one can think how it scores on low-level robustness as a kernel artifact let's say compared to openbsd), I did observe to Rusty he was not Linus Torvalds. It appears that Torvalds himself sounds himself to have given him to put code of conduct in the kernel in 2018 (cf [here](https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/commit/?id=8a104f8b5867c682d994ffa7a74093c54469c11f) and [here](https://lkml.org/lkml/2018/9/16/167)), under some blackmail pressures from SJW political activists.\n\nPersonally, I've nothing against political activism in itself, that's a basic right for the ones who are lucky to live in democracy respecting the rule of law. Beyond, about social justice as a political ideology in itself, while being very busy professionally myself, I can always find time to discuss the philosophical tenets of it in front of a  bitcoin public media with one of its advocate. I've amply studied in the past the John Rawls vs. Robert Nocizck controversy in the past, while more or less formally studying philosophy, and I've always loved intense intellectual brawls for their own sake (beyond a left vs right divide, as the philosopher Ortega y Gasset said it once \"*Being right or left, it is only picking up among two forms of moral hemiplegia*\" -- let's keep bitcoin development as much apolitical as we can).\n\nFor good reasons, the moderation rules in bitcoin core were specifically designed to be agnostic\nin their cultural expression, and let people focus on code shipping and review (cf. [here](https://github.com/bitcoin-core/meta/blob/3527bf7818d53bffa6c496be7f8d30dc8e1fa198/MODERATION-GUIDELINES.md)) as one maintainer and developer in the multi-process eloquently put it. It has also the additional advantage to well bound the margins of subjectivity in the moderators's judgement. This preventing some dispositions of the moderation rules to be leveraged to covertly advance business interest of some stakeholder or weaken the review process. All of that at the detriment of the average end-user financial safety (i.e *you* the anonymous pleb).\n\nE.g, a lightning contributor belonging to company X could now go to argue that she/he{picks up the politically correct pronoun of your choice} \"feels\" verbally bullied by the harsh comments of a\ncontributor belonging to company Y or being an independent contributor to the lightning spec advancing a bolt or blip Z in favor of the commercial interest of the company Z.\n\nAll that said, this is nothing personal or whatever related with Rusty Russell himself, and I'm looking forward to collaborate with him again in the future on bugs and vulnerabilities affecting the memory-unsafe coded in C Core-Lightning lightning code base as I did in the past. I understand open-source maintainers with decade of experiences, who have learnt to bend the knee to cultural norms to not take risks with their more or less guaranteed employments. I do not approve, but I understand.\n\nAll the information reported is I believe \"cold facts\" and not defamatory towards anyone. If necessary, I'm ready to attest to the alleged fact under oath in front of a US court or other country with decent rule of law. Sadly, digital mediums are too many times deliberately used by some open-source folks themselves to forget the basic of ethics.\n\nThis message is timestamped in the bitcoin blockchain for authenticity of the conversation.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 5,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}