{
  "id": 5395,
  "name": "Gijs van Dam",
  "username": "gijswijs",
  "avatar_template": "/user_avatar/delvingbitcoin.org/gijswijs/{size}/749_2.png",
  "created_at": "2025-07-02T13:50:39.749Z",
  "cooked": "<p>Firstly, onion messages today don’t have to keep to the same graph topology as the channel graph. The BOLT specifically states:</p>\n<blockquote>\n<p>Onion messages don’t explicitly require a channel, but for spam-reduction a node may choose to ratelimit such peers, especially messages it is asked to forward.</p>\n</blockquote>\n<p>This would allow for a multi-hop message over nodes without any channel between them. But this is a kind of hail Mary approach to sending messages, as the chances of a message being dropped are substantial. Current implementation most likely stick to their current path finding functionality that takes to the channel graph.</p>\n<p>More likely, this property of onion messaging is used to fall back to directly connecting to the recipient (with whom you don’t have a channel) so that the onion message gets delivered directly.</p>\n<p>Secondly, I’m not convinced the resulting onion messaging graph will turn out smaller. (depending on your definition of smaller) For a graph to become smaller (by means of graph diameter) the edge density would have to increase. Meaning that nodes would have to be quite permissive in accepting onion message connections. But if nodes either</p>\n<ul>\n<li>only accept <code>onion_link_req</code> from peers with which they have a channel, or</li>\n<li>filter out <code>onion_link_proof</code>s from nodes with less thean <code>N</code> channels or with less than <code>X</code> BTC total capacity,</li>\n</ul>\n<p>the resulting graph won’t be substantially smaller in diameter, because you are tying the cost of edge creation in the onion message graph (which should be low to be able to get a smaller diameter) to the cost of edge creation in the underlying channel graph (which is high).</p>\n<p>I do like the separation of concerns that lies at the foundation of this proposal and I think that warrants further exploration of this topic.</p>",
  "post_number": 9,
  "post_type": 1,
  "posts_count": 11,
  "updated_at": "2025-07-02T13:50:39.749Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 4,
  "reads": 35,
  "readers_count": 34,
  "score": 57.0,
  "yours": false,
  "topic_id": 1799,
  "topic_slug": "reimagining-onion-messages-as-an-overlay-layer",
  "topic_title": "Reimagining Onion Messages as an Overlay Layer",
  "topic_html_title": "Reimagining Onion Messages as an Overlay Layer",
  "category_id": 7,
  "display_username": "Gijs van Dam",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Firstly, onion messages today don't have to keep to the same graph topology as the channel graph. The BOLT specifically states:\n\n> Onion messages don't explicitly require a channel, but for spam-reduction a node may choose to ratelimit such peers, especially messages it is asked to forward.\n\nThis would allow for a multi-hop message over nodes without any channel between them. But this is a kind of hail Mary approach to sending messages, as the chances of a message being dropped are substantial. Current implementation most likely stick to their current path finding functionality that takes to the channel graph.\n\nMore likely, this property of onion messaging is used to fall back to directly connecting to the recipient (with whom you don't have a channel) so that the onion message gets delivered directly.\n\nSecondly, I'm not convinced the resulting onion messaging graph will turn out smaller. (depending on your definition of smaller) For a graph to become smaller (by means of graph diameter) the edge density would have to increase. Meaning that nodes would have to be quite permissive in accepting onion message connections. But if nodes either\n\n- only accept `onion_link_req` from peers with which they have a channel, or\n- filter out `onion_link_proof`s from nodes with less thean `N` channels or with less than `X` BTC total capacity,\n\nthe resulting graph won't be substantially smaller in diameter, because you are tying the cost of edge creation in the onion message graph (which should be low to be able to get a smaller diameter) to the cost of edge creation in the underlying channel graph (which is high).\n\nI do like the separation of concerns that lies at the foundation of this proposal and I think that warrants further exploration of this topic.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 501,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Firstly, onion messages today don’t have to keep to the same graph topology as the channel graph. The BOLT specifically states: \n\nOnion messages don’t explicitly require a channel, but for spam-reduction a node may choose to ratelimit such peers, especially messages it is asked to forward. \n\nThis wo&hellip;",
  "truncated": true,
  "post_url": "/t/reimagining-onion-messages-as-an-overlay-layer/1799/9",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}