{
  "id": 5556,
  "name": "Zawy",
  "username": "zawy",
  "avatar_template": "/user_avatar/delvingbitcoin.org/zawy/{size}/750_2.png",
  "created_at": "2025-07-25T15:01:57.015Z",
  "cooked": "<p>There’s a <a href=\"https://x.com/hashdag/status/1933544298810622335\" rel=\"noopener nofollow ugc\">new paper</a> that shows how the world’s A.I. compute based on matrix multiplication can be used as if that compute power is a “parent coin” to “merge mine” a blockchain coin. They found a way for matrix multiplications to not be restricted in their size and yet easily prove how many “FLOPs” were spent. I view it as a potential threat to Bitcoin dominance if Bitcoin isn’t prepared to adopt it as a new PoW.</p>\n<p>An immediate objection is that there’s no inherent waste.</p>\n<p>Wastefulness (in CAPEX or OPEX) isn’t as foundational to secure &amp; decentralized PoW consensus as non-repurposeability. Non-repurposeability means attacking the coin would reduce the coin’s value so much that the future income from the majority’s CAPEX investment is harmed more than an attack would be a reward. The chain must be the miners’ primary source of future potential income. If something else paid more, they wouldn’t mine as much and it wouldn’t be as secure because those external sha256d operations could periodically visit Bitcoin to double-spend.</p>\n<p>Since sha256d for non-bitcoin uses pays less than Bitcoin, the vast majority of sha256d is “wasted” on bitcoin to satisfy non-repurposeability.</p>\n<p>The innovation in this PoUW that bypasses the need for “imprisoned” (dedicated) work is that it’s like merge mining. It enables miners to get their primary profit from other sources. It’s secure if the exchange value of double-spending is less than the cost of the work provided by the portion of the world’s matrix multiplication that’s “merge mining” the coin.</p>\n<p>There has to be enough “merge mining” to raise the cost of solving the difficulty above the value of an attack.</p>\n<p>Max Kaiser has claimed increased hashrate increases price but I think it’s obviously the other way. In bitcoin expected future profit due to price limits hashrate but in PoUW, difficulty (“hashrate”) limits the value transferred per time to prevent double-spending.</p>\n<p>Less pricisely, in PoUW hashrate limits price in contrast to Bitcoin’s price limiting hashrate. Work preceding value feels like creating value which is appealing. There may be something useful and very different from bitcoin such as making the amount of coin proportional to the proven matrix multiplication FLOPs devoted to the merge mining.</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 1,
  "updated_at": "2025-07-25T18:54:04.307Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 75,
  "reads": 45,
  "readers_count": 44,
  "score": 379.0,
  "yours": false,
  "topic_id": 1867,
  "topic_slug": "new-paper-on-proof-of-usable-work",
  "topic_title": "New paper on Proof of Usable Work",
  "topic_html_title": "New paper on Proof of Usable Work",
  "category_id": 7,
  "display_username": "Zawy",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 3,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "There's a [new paper](https://x.com/hashdag/status/1933544298810622335) that shows how the world's A.I. compute based on matrix multiplication can be used as if that compute power is a \"parent coin\" to \"merge mine\" a blockchain coin. They found a way for matrix multiplications to not be restricted in their size and yet easily prove how many \"FLOPs\" were spent. I view it as a potential threat to Bitcoin dominance if Bitcoin isn't prepared to adopt it as a new PoW.\n\nAn immediate objection is that there's no inherent waste. \n\nWastefulness (in CAPEX or OPEX) isn't as foundational to secure & decentralized PoW consensus as non-repurposeability. Non-repurposeability means attacking the coin would reduce the coin's value so much that the future income from the majority's CAPEX investment is harmed more than an attack would be a reward. The chain must be the miners' primary source of future potential income. If something else paid more, they wouldn't mine as much and it wouldn't be as secure because those external sha256d operations could periodically visit Bitcoin to double-spend. \n\nSince sha256d for non-bitcoin uses pays less than Bitcoin, the vast majority of sha256d is \"wasted\" on bitcoin to satisfy non-repurposeability. \n\nThe innovation in this PoUW that bypasses the need for \"imprisoned\" (dedicated) work is that it's like merge mining. It enables miners to get their primary profit from other sources. It's secure if the exchange value of double-spending is less than the cost of the work provided by the portion of the world's matrix multiplication that's \"merge mining\" the coin.   \n\nThere has to be enough \"merge mining\" to raise the cost of solving the difficulty above the value of an attack.  \n\nMax Kaiser has claimed increased hashrate increases price but I think it's obviously the other way. In bitcoin expected future profit due to price limits hashrate but in PoUW, difficulty (\"hashrate\") limits the value transferred per time to prevent double-spending. \n\nLess pricisely, in PoUW hashrate limits price in contrast to Bitcoin's price limiting hashrate. Work preceding value feels like creating value which is appealing. There may be something useful and very different from bitcoin such as making the amount of coin proportional to the proven matrix multiplication FLOPs devoted to the merge mining.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 502,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "There’s a <a href=\"https://x.com/hashdag/status/1933544298810622335\" rel=\"noopener nofollow ugc\">new paper</a> that shows how the world’s A.I. compute based on matrix multiplication can be used as if that compute power is a “parent coin” to “merge mine” a blockchain coin. They found a way for matrix multiplications to not be restricted in their size and yet easily prove how many “FLOPs” w&hellip;",
  "truncated": true,
  "post_url": "/t/new-paper-on-proof-of-usable-work/1867/1",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}