{
  "id": 5567,
  "name": "David Taubmann (david.qro.mx)",
  "username": "davidtaubmann",
  "avatar_template": "/user_avatar/delvingbitcoin.org/davidtaubmann/{size}/1439_2.png",
  "created_at": "2025-07-26T23:45:02.647Z",
  "cooked": "<p><strong>Description</strong></p>\n<p>The proposal is a new paralel Bitcoin, where only one wallet could be created for each physical conscious entity (“Bitcoin Px” maybe), probably using a proof like the national identity number “<a href=\"https://en.wikipedia.org/wiki/National_identification_number\" rel=\"noopener nofollow ugc\">NIN</a>” (e.g.: US+SSN, MX+CURP, etc.), and getting sure it’s a living conscious being (not yet registered as dead).</p>\n<p>To be able to carry out transactions with institutions, this could be done, through decentralized exchanges (DEXs).</p>\n<p>To perform the fork migration, after the snapshot of the blockchain, the replication of the original bitcoins should be requested from the original Bitcoin wallet addressing the personal wallet in the new fork (Bitcoin Px).\nInstitutional Bitcoins could be replicated into a personal wallet, but this replication should have a maximum socially congruent limit (maybe 10 or 20 times the average wealth of a global citizen).</p>\n<p>Bitcoins that aren’t reclaimed under the replication period (maybe 3 months), should be nonexistent in the new blockchain, so they are available to be mined as fresh new Bitcoins.</p>\n<p><strong>Problems that this solves</strong></p>\n<p>The problem this issue would deal with, is the current centralization of the available money under the control of a few institutions, giving them unmeasurable power over society. Leaving once again the power of the whole/conjunct (democracy of any level, even liquid) at the mercy of the power of a few (oligarchy). This is completely against the global democratization Internet should be promoting and empowering.</p>\n<p>Now that the efficiency of Bitcoin has been accepted even by institutions, maybe it’s time to stop pandering those institutional whales, by creating an institution-proof Bitcoin replica, exclusively for physical conscious individuals. This could be a way to decentralize money in a second phase, and expand the democratization that the internet and it’s native tools are allowing.</p>\n<p><strong>Other issues this might solve</strong></p>\n<p>As long as only humans (or any living beings from the future that might be proven to be conscious enough) are able to step inside this money platform, and institutions can be kept away (even through false human agents), this could work also as a worldwide equity platform.</p>\n<p><strong>Alternatives considered for the use of oficial NIN’s</strong></p>\n<p>If the proof method chosen is NIN’s, for the citizens of countries without any trustful NIN system, Biometrics (Facial recognition, fingerprints, etc) could be used, or a different solution could be created in collaboration with other Bitcoin cycle agents (miners, nodes, etc), so that the system can be certain the entities are in fact conscious living beings.</p>\n<p>Genome or blood could be alternatives or complimentary to NIN’s, but might add an extra layer of complexity. I would suggest those to be posterior implementations.</p>\n<p>I would personally disagree with any solution that involves invasive technology.</p>\n<p><strong>Additional context</strong></p>\n<p>I understand this would drastically remove the “anonymity” from Bitcoin, but it could be also a good thing for addressing inequality and corruption (at least inside this blockchain), and allow everyone to use this universe-wide (thinking on the quantum age) community-driven tools in general for the common good.</p>\n<p>(originally posted <a href=\"https://github.com/bitcoin/bitcoin/issues/32897?reload=1?reload=1\" rel=\"noopener nofollow ugc\">in here</a>, but rejected as wrong place)</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 13,
  "updated_at": "2025-08-01T21:34:02.806Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 25,
  "reads": 63,
  "readers_count": 62,
  "score": 182.4,
  "yours": false,
  "topic_id": 1877,
  "topic_slug": "paralel-bitcoin-only-for-conscious-living-individuals",
  "topic_title": "Paralel Bitcoin only for conscious living individuals",
  "topic_html_title": "Paralel Bitcoin only for conscious living individuals",
  "category_id": 6,
  "display_username": "David Taubmann (david.qro.mx)",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 8,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": "",
  "bookmarked": false,
  "raw": "**Description**\n\nThe proposal is a new paralel Bitcoin, where only one wallet could be created for each physical conscious entity (\"Bitcoin Px\" maybe), probably using a proof like the national identity number \"[NIN](https://en.wikipedia.org/wiki/National_identification_number)\" (e.g.: US+SSN, MX+CURP, etc.), and getting sure it's a living conscious being (not yet registered as dead).\n\nTo be able to carry out transactions with institutions, this could be done, through decentralized exchanges (DEXs).\n\nTo perform the fork migration, after the snapshot of the blockchain, the replication of the original bitcoins should be requested from the original Bitcoin wallet addressing the personal wallet in the new fork (Bitcoin Px).\nInstitutional Bitcoins could be replicated into a personal wallet, but this replication should have a maximum socially congruent limit (maybe 10 or 20 times the average wealth of a global citizen).\n\nBitcoins that aren't reclaimed under the replication period (maybe 3 months), should be nonexistent in the new blockchain, so they are available to be mined as fresh new Bitcoins.\n\n**Problems that this solves**\n\nThe problem this issue would deal with, is the current centralization of the available money under the control of a few institutions, giving them unmeasurable power over society. Leaving once again the power of the whole/conjunct (democracy of any level, even liquid) at the mercy of the power of a few (oligarchy). This is completely against the global democratization Internet should be promoting and empowering.\n\nNow that the efficiency of Bitcoin has been accepted even by institutions, maybe it's time to stop pandering those institutional whales, by creating an institution-proof Bitcoin replica, exclusively for physical conscious individuals. This could be a way to decentralize money in a second phase, and expand the democratization that the internet and it's native tools are allowing.\n\n**Other issues this might solve**\n\nAs long as only humans (or any living beings from the future that might be proven to be conscious enough) are able to step inside this money platform, and institutions can be kept away (even through false human agents), this could work also as a worldwide equity platform.\n\n**Alternatives considered for the use of oficial NIN's**\n\nIf the proof method chosen is NIN's, for the citizens of countries without any trustful NIN system, Biometrics (Facial recognition, fingerprints, etc) could be used, or a different solution could be created in collaboration with other Bitcoin cycle agents (miners, nodes, etc), so that the system can be certain the entities are in fact conscious living beings.\n\nGenome or blood could be alternatives or complimentary to NIN's, but might add an extra layer of complexity. I would suggest those to be posterior implementations.\n\nI would personally disagree with any solution that involves invasive technology.\n\n**Additional context**\n\nI understand this would drastically remove the \"anonymity\" from Bitcoin, but it could be also a good thing for addressing inequality and corruption (at least inside this blockchain), and allow everyone to use this universe-wide (thinking on the quantum age) community-driven tools in general for the common good.\n\n(originally posted [in here](https://github.com/bitcoin/bitcoin/issues/32897?reload=1?reload=1), but rejected as wrong place)",
  "actions_summary": [
    {
      "id": 2,
      "count": 3
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 874,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Description \nThe proposal is a new paralel Bitcoin, where only one wallet could be created for each physical conscious entity (“Bitcoin Px” maybe), probably using a proof like the national identity number “<a href=\"https://en.wikipedia.org/wiki/National_identification_number\" rel=\"noopener nofollow ugc\">NIN</a>” (e.g.: US+SSN, MX+CURP, etc.), and getting sure it’s a living conscious being (not yet re&hellip;",
  "truncated": true,
  "post_url": "/t/paralel-bitcoin-only-for-conscious-living-individuals/1877/1",
  "reactions": [
    {
      "id": "laughing",
      "type": "emoji",
      "count": 3
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 3,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}