{
  "id": 1772,
  "name": "ZmnSCPxj jxPCSnmZ",
  "username": "ZmnSCPxj",
  "avatar_template": "/letter_avatar_proxy/v4/letter/z/ee7513/{size}.png",
  "created_at": "2024-03-03T11:34:29.847Z",
  "cooked": "<h1><a name=\"introduction-1\" class=\"anchor\" href=\"#introduction-1\"></a>Introduction</h1>\n<p><code>OP_CTV</code> and other covenant opcodes have somehow managed to trigger a countervailing “ossify-now” movement, which seeks to keep the Bitcoin consensus unchanged indefinitely, citing that changes introduce risk of exploitation.</p>\n<p>Ultimately, what matters is how much actual users care to activate, or block, a particular consensus change. As the writeup <a href=\"https://www.lesswrong.com/posts/ZpDnRCeef2CLEFeKM/money-the-unit-of-caring\" rel=\"noopener nofollow ugc\">Money: The Unit of Caring (LessWrong)</a> suggests, however, how much you care about something can be signalled by “how much are you willing to put on the line to ensure it happens / ensure it does not happen?”  Such signalling is, literally, expensive, and thus difficult to fake.</p>\n<p>Indeed, the concept of an “economic majority” that controls miners via the invisible hand of the market is not new. The “user-activated soft fork” insisted that users could coerce miners to follow their desired chain, by rejecting blocks of miners that do not follow the desired consensus rules.</p>\n<h2><a name=\"economics-of-consensus-change-2\" class=\"anchor\" href=\"#economics-of-consensus-change-2\"></a>Economics of Consensus Change</h2>\n<p>In order to cause consensus change, miners must be convinced to run the modified rules.  Can ordinary users coerce miners?</p>\n<p>An existing HODLer is in possession of some number of UTXOs whose keys are under their control. Suppose a HODLer strongly desires to have some rule set to be used (whether the existing rules, or a new set of rules).  Now suppose further that there is a chainsplit, where one chain uses rules wanted by the HODLer, and another uses rules not wanted by the HODLer.  In that case:</p>\n<ul>\n<li>On both sides of the chainsplit, the HODLer has possession of coins.</li>\n<li>A miner can only point its purchased hashrate at one chainsplit or the other, and can only earn coins on one side of the chainsplit.</li>\n</ul>\n<p>The HODLer can then sell coins on the chainsplit of the undesired ruleset. If so, the value of coins in that chainsplit lowers, unless other users arise which prefer that ruleset (who then buy out the value of the sold coins).  If there are more sellers of one side of the chainsplit than the other, then the price of the coins on that chainsplit drops.</p>\n<p>Miners are incentivized to maximize their earnings in terms of real-world purchasing power.  This is because hashrate is costly: real-world energy must be utilized in order to actually generate hashes and therefore blocks, which must be purchased, and furthermore, actual real-world utilization of energy increases universal entropy, including the entropy of actual hashing hardware (i.e. hardware breaks down, especially as it is more utilized, and must eventually be replaced).  This forces miners to be both earnings-maximizing and short-sighted relative to HODLers of coins, who can generally have a time preference proportional to human lifespans rather than proportional to hashing hardware lifespans.</p>\n<p>Thus, miners will be coerced into mining the chainsplit of the desired ruleset, by simple economic theory.</p>\n<h1><a name=\"betting-on-op_ctv-activation-blockage-3\" class=\"anchor\" href=\"#betting-on-op_ctv-activation-blockage-3\"></a>Betting On <code>OP_CTV</code> Activation / Blockage</h1>\n<p>Any signal for “caring to activate / block” can be formed as a bet.  For instance, I can say “I will sell coins on a chainsplit that does not activate <code>OP_FOO</code>” by betting that it will activate.  If it activates, then I get back my funds and HODL it. If it does not activate, I have effectively sold the equivalent amount and have divested myself of the coin.</p>\n<p>Now, for softforks that replace <code>OP_NOP</code> opcodes, such as the BIP-119 rendition of <code>OP_CHECKTEMPLATEVERIFY</code>, we can actually use a simple technique of violating the rules of the opcode to determine if the chainsplit does not activate the opcode, and serves as “the opcode was not activated”.  Then we can have a second time-delayed branch, which can be used if the first branch is not entered, which serves as the branch for “the opcode was activated”.</p>\n<p>As a concrete example for <code>OP_CTV</code>, suppose we have the actors below:</p>\n<ul>\n<li>Alice: I bet that <code>OP_CTV</code> DOES NOT activate (“ossify-now”).</li>\n<li>Bob: I bet that <code>OP_CTV</code> DOES activate (“<code>OP_CTV</code> now”).</li>\n</ul>\n<p>Suppose that we have a defined activation blockheight for <code>OP_CTV</code>, called <code>N</code>.  Then we can use the following P2WSH script:</p>\n<pre><code>&lt;hash(pay to Bob)&gt; OP_CTV OP_DROP\n&lt;Alice&gt; OP_CHECKSIGVERIFY\n&lt;Bob&gt; OP_CHECKSIG\n</code></pre>\n<p>The <code>hash(pay to Bob)</code> is the <code>OP_CTV</code> hash where the output goes to an address Bob controls, at time <code>N+1month</code>.</p>\n<p>Then Alice and Bob exchange signatures:</p>\n<ul>\n<li>Alice gives a signature to Bob:\n<ul>\n<li>Matches <code>hash(pay to Bob)</code>, spending the above script and giving the output to Bob.</li>\n<li><code>nLockTime</code> is <code>N+1month</code>.</li>\n</ul>\n</li>\n<li>Bob gives a signature to Alice:\n<ul>\n<li>Spends the above script and gives the output to Alice</li>\n<li><code>nLockTime</code> is <code>N</code>.</li>\n</ul>\n</li>\n</ul>\n<p>Then, depending on the chainsplit:</p>\n<ul>\n<li>Chainsplit where <code>OP_CTV</code> activated:\n<ul>\n<li>At time <code>N</code> Alice cannot use the Bob-side signature, because <code>OP_CTV</code> is violated — the signature is for a transaction that pays to Alice, but the <code>OP_CTV</code> requires the output to pay to Bob.</li>\n<li>At time <code>N+1month</code>, Bob can use the Alice-side signature to claim the funds, because it wins its bet in this chainsplit where <code>OP_CTV</code> activated.</li>\n</ul>\n</li>\n<li>Chainsplit where <code>OP_CTV</code> was NOT activated:\n<ul>\n<li>At time <code>N</code> Alice can use the Bob-side signature, because <code>OP_CTV</code> is just <code>OP_NOP4</code> here and the <code>&lt;hash(pay to Bob)&gt;</code> has no meaning, and it won the bet in this chainsplit where <code>OP_CTV</code> was not activated.</li>\n<li>At time <code>N+1month</code>, hopefully Alice has already claimed the funds before then, and Bob is unable to claim the funds now.</li>\n</ul>\n</li>\n</ul>\n<p>After exchanging signatures, Alice and Bob can now cooperatively sign the funding transaction whose output is the above script, and whose inputs are the ante of Alice and Bob.</p>\n<p>A market maker can then provide a venue for Alices and Bobs to meet and make such bets.  If there is more economic power in Alice than in Bob, then Alices will become willing to take smaller antes from Bobs (and vice versa).  The market maker can then monitor which side has more money willing to bet on activation/blocking of <code>OP_CTV</code> and report it.</p>\n<p>Miners can then use the market venue to check which chainsplit is more economically-rational to mine in the future.  We thus hope that this economic control is sufficient to force one chainsplit or the other to never be mined in the first place.</p>\n<h1><a name=\"generalization-4\" class=\"anchor\" href=\"#generalization-4\"></a>Generalization</h1>\n<p>I believe that this technique generalizes to any opcode that replaces an <code>OP_NOP</code> in P2WSH.</p>\n<p>Unfortunately, the same technique cannot be used for any opcode that replaces an <code>OP_SUCCESS</code> in Tapscript.  This is because the Alice-wins remains anyone-can-spend in the chainsplit where the opcode does not activate.  Thus, it cannot be used for <code>OP_INTERNALKEY</code> or <code>OP_CHECKSIGNATUREFROMSTACK</code>.  However, in practice if both are packaged with the same softfork that activates the BIP-119 <code>OP_CHECKTEMPLATEVERIFY</code> that replaces <code>OP_NOP4</code>, then the entire package can be bet on via this mechanism.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-03-03T11:36:44.222Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 35,
  "reads": 14,
  "readers_count": 13,
  "score": 182.6,
  "yours": false,
  "topic_id": 635,
  "topic_slug": "economic-majority-signaling-for-op-ctv-activation",
  "topic_title": "Economic-Majority Signaling for OP_CTV Activation",
  "topic_html_title": "Economic-Majority Signaling for OP_CTV Activation",
  "category_id": 7,
  "display_username": "ZmnSCPxj jxPCSnmZ",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Introduction\n=====\n\n`OP_CTV` and other covenant opcodes have somehow managed to trigger a countervailing \"ossify-now\" movement, which seeks to keep the Bitcoin consensus unchanged indefinitely, citing that changes introduce risk of exploitation.\n\nUltimately, what matters is how much actual users care to activate, or block, a particular consensus change. As the writeup [Money: The Unit of Caring (LessWrong)](https://www.lesswrong.com/posts/ZpDnRCeef2CLEFeKM/money-the-unit-of-caring) suggests, however, how much you care about something can be signalled by \"how much are you willing to put on the line to ensure it happens / ensure it does not happen?\"  Such signalling is, literally, expensive, and thus difficult to fake.\n\nIndeed, the concept of an \"economic majority\" that controls miners via the invisible hand of the market is not new. The \"user-activated soft fork\" insisted that users could coerce miners to follow their desired chain, by rejecting blocks of miners that do not follow the desired consensus rules.\n\nEconomics of Consensus Change\n-------------------------\n\nIn order to cause consensus change, miners must be convinced to run the modified rules.  Can ordinary users coerce miners?\n\nAn existing HODLer is in possession of some number of UTXOs whose keys are under their control. Suppose a HODLer strongly desires to have some rule set to be used (whether the existing rules, or a new set of rules).  Now suppose further that there is a chainsplit, where one chain uses rules wanted by the HODLer, and another uses rules not wanted by the HODLer.  In that case:\n\n* On both sides of the chainsplit, the HODLer has possession of coins.\n* A miner can only point its purchased hashrate at one chainsplit or the other, and can only earn coins on one side of the chainsplit.\n\nThe HODLer can then sell coins on the chainsplit of the undesired ruleset. If so, the value of coins in that chainsplit lowers, unless other users arise which prefer that ruleset (who then buy out the value of the sold coins).  If there are more sellers of one side of the chainsplit than the other, then the price of the coins on that chainsplit drops.\n\nMiners are incentivized to maximize their earnings in terms of real-world purchasing power.  This is because hashrate is costly: real-world energy must be utilized in order to actually generate hashes and therefore blocks, which must be purchased, and furthermore, actual real-world utilization of energy increases universal entropy, including the entropy of actual hashing hardware (i.e. hardware breaks down, especially as it is more utilized, and must eventually be replaced).  This forces miners to be both earnings-maximizing and short-sighted relative to HODLers of coins, who can generally have a time preference proportional to human lifespans rather than proportional to hashing hardware lifespans.\n\nThus, miners will be coerced into mining the chainsplit of the desired ruleset, by simple economic theory.\n\nBetting On `OP_CTV` Activation / Blockage\n=======================\n\nAny signal for \"caring to activate / block\" can be formed as a bet.  For instance, I can say \"I will sell coins on a chainsplit that does not activate `OP_FOO`\" by betting that it will activate.  If it activates, then I get back my funds and HODL it. If it does not activate, I have effectively sold the equivalent amount and have divested myself of the coin.\n\nNow, for softforks that replace `OP_NOP` opcodes, such as the BIP-119 rendition of `OP_CHECKTEMPLATEVERIFY`, we can actually use a simple technique of violating the rules of the opcode to determine if the chainsplit does not activate the opcode, and serves as \"the opcode was not activated\".  Then we can have a second time-delayed branch, which can be used if the first branch is not entered, which serves as the branch for \"the opcode was activated\".\n\nAs a concrete example for `OP_CTV`, suppose we have the actors below:\n\n* Alice: I bet that `OP_CTV` DOES NOT activate (\"ossify-now\").\n* Bob: I bet that `OP_CTV` DOES activate (\"`OP_CTV` now\").\n\nSuppose that we have a defined activation blockheight for `OP_CTV`, called `N`.  Then we can use the following P2WSH script:\n\n    <hash(pay to Bob)> OP_CTV OP_DROP\n    <Alice> OP_CHECKSIGVERIFY\n    <Bob> OP_CHECKSIG\n\nThe `hash(pay to Bob)` is the `OP_CTV` hash where the output goes to an address Bob controls, at time `N+1month`.\n\nThen Alice and Bob exchange signatures:\n\n* Alice gives a signature to Bob:\n  * Matches `hash(pay to Bob)`, spending the above script and giving the output to Bob.\n  * `nLockTime` is `N+1month`.\n* Bob gives a signature to Alice:\n  * Spends the above script and gives the output to Alice\n  * `nLockTime` is `N`.\n\nThen, depending on the chainsplit:\n\n* Chainsplit where `OP_CTV` activated:\n  * At time `N` Alice cannot use the Bob-side signature, because `OP_CTV` is violated --- the signature is for a transaction that pays to Alice, but the `OP_CTV` requires the output to pay to Bob.\n  * At time `N+1month`, Bob can use the Alice-side signature to claim the funds, because it wins its bet in this chainsplit where `OP_CTV` activated.\n* Chainsplit where `OP_CTV` was NOT activated:\n  * At time `N` Alice can use the Bob-side signature, because `OP_CTV` is just `OP_NOP4` here and the `<hash(pay to Bob)>` has no meaning, and it won the bet in this chainsplit where `OP_CTV` was not activated.\n  * At time `N+1month`, hopefully Alice has already claimed the funds before then, and Bob is unable to claim the funds now.\n\nAfter exchanging signatures, Alice and Bob can now cooperatively sign the funding transaction whose output is the above script, and whose inputs are the ante of Alice and Bob.\n\nA market maker can then provide a venue for Alices and Bobs to meet and make such bets.  If there is more economic power in Alice than in Bob, then Alices will become willing to take smaller antes from Bobs (and vice versa).  The market maker can then monitor which side has more money willing to bet on activation/blocking of `OP_CTV` and report it.\n\nMiners can then use the market venue to check which chainsplit is more economically-rational to mine in the future.  We thus hope that this economic control is sufficient to force one chainsplit or the other to never be mined in the first place.\n\nGeneralization\n===============\n\nI believe that this technique generalizes to any opcode that replaces an `OP_NOP` in P2WSH.\n\nUnfortunately, the same technique cannot be used for any opcode that replaces an `OP_SUCCESS` in Tapscript.  This is because the Alice-wins remains anyone-can-spend in the chainsplit where the opcode does not activate.  Thus, it cannot be used for `OP_INTERNALKEY` or `OP_CHECKSIGNATUREFROMSTACK`.  However, in practice if both are packaged with the same softfork that activates the BIP-119 `OP_CHECKTEMPLATEVERIFY` that replaces `OP_NOP4`, then the entire package can be bet on via this mechanism.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 104,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    },
    {
      "id": "heart",
      "type": "emoji",
      "count": 1
    },
    {
      "id": "rocket",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 3,
  "current_user_used_main_reaction": false
}