{
  "id": 1777,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/3_2.png",
  "created_at": "2024-03-04T02:41:35.186Z",
  "cooked": "<p>I want to talk <a href=\"https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2022-March/020036.html\">some</a> <a href=\"https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-October/022099.html\">more</a> about doing a Lisp variant for script on Bitcoin, but before I do that in detail, I figure it’s probably helpful to do a summary of what <a href=\"https://chialisp.com/\">Lisp looks like on the Chia blockchain</a>, since that already has good answers for many of the questions that come up. If that sounds interesting, read on; if not, maybe remember this post exists so you can refer back to it later when I treat it as assumed knowledge in posts that do sound interesting!</p>\n<p>This writeup assumes you’re familiar with Bitcoin and <a href=\"https://en.bitcoin.it/wiki/Script\">Bitcoin Script</a>, but not with <a href=\"https://en.wikipedia.org/wiki/Chia_(cryptocurrency)\">Chia</a> or <a href=\"https://www.buildyourownlisp.com/\">Lisp</a>. It takes a very bottom up approach, and doesn’t go into any real detail about what any of this makes possible.</p>\n<p>For those who are familiar with Chialisp, note that I’m mostly talking about the behaviour of <a href=\"https://chialisp.com/clvm/\">clvm</a> (ie what’s implemented in consensus and seen on-chain in chia), rather than Chialisp per se (ie, the syntax you use to write complicated programs that then gets compiled down to clvm).</p>\n<div data-theme-toc=\"true\"> </div>\n<h2><a name=\"why-1\" class=\"anchor\" href=\"#why-1\"></a>Why?</h2>\n<p>Why is this worth thinking about at all? After all, Bitcoin script is a great little language, essentially a tiny stack based RPN calculator, that’s robust enough to be ready to replace central bank clearing houses, with enough programmability to do a bunch of neat things. But from a programmer’s perspective, there are two things that as a language it can’t do well: looping and structured data.</p>\n<p>Not being able to do a loop natively means that scripts that do the same thing repeatedly quickly become cumbersome, for example the <a href=\"https://delvingbitcoin.org/t/lamport-signatures-and-other-cat-tricks/236\">Lamport Sigs and CAT tricks</a> design has 20 steps each involving an 8 level merkle tree that need to be spelt out separately, rather than just having two loops – so 160 steps that should just be one in a loop. There’s been thoughts about adding constructs that could enable looping to bitcoin script in the past, eg <a href=\"https://github.com/bitcoin/bips/blob/b3701faef2bdb98a0d7ace4eedbeefa2da4c89ed/bip-0012.mediawiki\">BIP 12 OP_EVAL</a> and <a href=\"https://github.com/bitcoin/bips/blob/b3701faef2bdb98a0d7ace4eedbeefa2da4c89ed/bip-0117.mediawiki\">BIP 117 Tail Call Semandtics</a>, both of which are explicitly limited to disable looping, or <a href=\"https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2022-February/020021.html\">OP_FOLD</a>.</p>\n<p>Not being able to natively deal with structured data isn’t as big a problem: you can work around it by using the various stack rotation opcodes and moving things on and off the alt stack, however that becomes annoying to actually do in practice. For example, a few of the recent script proposals suggest modest changes to imply a little more structure: eg,</p>\n<ul>\n<li><a href=\"https://github.com/bitcoin/bips/pull/1421\">OP_VAULT</a> allows you to specify a number of items that will be encoded as minimal pushes and prefixed to the provided <code>leaf-update-script-body</code>,</li>\n<li><a href=\"https://rusty.ozlabs.org/2024/01/04/OP_SEGMENT.html\">OP_SEGMENT</a> proposes introducing a code-separator like opcode that does nothing itself, but is used to separate out the impact of <code>OP_SUCCESSx</code> behaviour, so that script fragments can be manipulated within script itself</li>\n<li>there is a <a href=\"https://twitter.com/reardencode/status/1760324791343665396\">proposal being tossed around</a> for CHECKSIGFROMSTACK to also allow specifying up to 16 additional bits of message data, that will be hashed and combined for the actual signature verification operation occurs</li>\n</ul>\n<p>The approach Chia Lisp takes addresses both these limitations in perhaps the simplest way possible:</p>\n<ul>\n<li>it adds an “apply” opcode (<code>a</code>) that allows for recursion and hence can be used for looping; and</li>\n<li>it replaces the concept of a stack with that of a binary tree – any element can either be a leaf node (aka an “atom”) that is just a byte string (the same as stack elements now), or it can be a branch and contain a pair of elements (aka a “cons”), which are themselves either branches or leaves.</li>\n</ul>\n<p>As is usual for Lisp, programs are then encoded in that same data structure, allowing the program itself to be introspected using the same operations that allow manipulating any other data structure.</p>\n<h2><a name=\"making-lists-2\" class=\"anchor\" href=\"#making-lists-2\"></a>Making Lists</h2>\n<p>Lisp is known for its lists, though, not for binary trees, so the above may seem slightly surprising. It’s fairly simply resolved however: lists are constructed recursively, where the first element in the list is put on the left side of a cons, and the rest of the list is put on the right side, and the empty list is defined as the empty byte vector, also known as “nil”. We have special notations for this:</p>\n<ul>\n<li><code>()</code> is the empty list aka the empty byte vector</li>\n<li><code>(a . b)</code> indicates a cons or branch element with <code>a</code> on the left and <code>b</code> on the right.</li>\n<li><code>(a b c d)</code> indicates a list of four elements, equivalent to <code>(a . (b . (c . (d . ()))))</code></li>\n<li><code>(a b c d . e)</code> indicates a “dotted” list, which ends with <code>e</code> instead of an implicit <code>nil</code>, ie is the same as <code>(a . (b . (c . (d . e))))</code>.</li>\n</ul>\n<p>This means that <code>(a b . (c d))</code> is just an alternative way of writing <code>(a b c d)</code>.</p>\n<p>If you keep taking the righthand side of each cons until you come to an atom (ie a byte vector, aka a leaf node), then either the byte vector is empty, and you have a normal list, called a “proper list”, or it’s a non-empty byte vector, and you have what’s called an “improper” list.</p>\n<p>For anyone like me who has heard about <a href=\"https://en.wikipedia.org/wiki/CAR_and_CDR\"><code>car</code> and <code>cdr</code></a> but didn’t know what they meant, <code>car</code> just means take the left side of the pair, and <code>cdr</code> just means take the right, and they come from implementation details from the original Lisp. Better, in my opinion, to call them “head” and “tail” (as is usual in other <a href=\"https://hackage.haskell.org/package/base-4.19.1.0/docs/Data-List.html\">functional</a> <a href=\"https://www.scala-lang.org/api/current/scala/collection/immutable/List.html\">languages</a>), or as Common Lisp and Chia Lisp do, “first” and “rest”.</p>\n<h2><a name=\"having-opcodes-operate-on-lists-3\" class=\"anchor\" href=\"#having-opcodes-operate-on-lists-3\"></a>Having opcodes operate on lists</h2>\n<p>It then becomes fairly straightforward to extend opcodes to operate on a list of arguments: eg, rather than <code>OP_ADD</code> taking exactly two things off the stack and adding them together, we can have the <code>+</code> opcode expect a list of values that it will add together. Then we just put the opcode and its arguments together as a pair, ie <code>(+ . (1 2 3))</code>, but of course, as we just established, that’s the same as writing <code>(+ 1 2 3)</code>, and that becomes our general notation for expressions in our programs.</p>\n<h2><a name=\"the-environment-4\" class=\"anchor\" href=\"#the-environment-4\"></a>The environment</h2>\n<p>We want to be able to write programs that are applied to some “user input”, so the way we do that is we have something called the “environment”, which the program can access. The environment is just another list (or binary tree), but we have a clever way of accessing any part of it just via an integer. In particular, we say that <code>1</code> gets us the whole thing verbatim; <code>2</code> gets the left side, <code>3</code> gets the right side, <code>4</code> gets the left side of the left side, <code>6</code> gets the right side of the left side, etc.</p>\n<pre data-code-height=\"234\" data-code-wrap=\"mermaid\"><code class=\"lang-mermaid\">flowchart TD\n    1 --&gt; 2\n    1 --&gt; 3\n    2 --&gt; 4\n    2 --&gt; 6\n    3 --&gt; 5\n    3 --&gt; 7\n</code></pre>\n<p>The general procedure is:</p>\n<pre data-code-wrap=\"python\"><code class=\"lang-python\">def get_env(n, e):\n  if n == 0: return nil\n  while n &gt; 1:\n    if n % 2 == 0:\n      e = e.left\n    else:\n      e = e.right\n    n //= 2\n  return e\n</code></pre>\n<p>So if the environment is the list <code>(1 2 3)</code> then <code>get_env(2, env)</code> gives 1, <code>get_env(5, env)</code> gives 2, <code>get_env(11, env)</code> gives 3, and <code>get_env(15, env)</code> gives the final nil.</p>\n<p>Thus if you want the program “(a*b)+c” you can write that as <code>(+ (* 2 5) 11)</code>, and the numbers will be treated as environment lookups, so if the environment is <code>(1 2 3)</code> the result will be <code>(1*2)+3=5</code>.</p>\n<h2><a name=\"quoting-5\" class=\"anchor\" href=\"#quoting-5\"></a>Quoting</h2>\n<p>What if you want to triple a number (multiply by 3), rather than multiply by whatever the user inputs? In that case you can “quote” values, to avoid resolving them either from an environment lookup or evaluating them as an expression. This involves a special opcode, <code>q</code>, which has special evaluation rules compared to every other opcode. Its behaviour is quite simple: its result is just its argument passed through without any evaluation. It’s also special in that it doesn’t necessarily expect a proper (nil-terminated) list for its argument.</p>\n<p>So if you instead of <code>(a*b)+c</code>, you want to calculate <code>(a*b)+(3*c)</code>, you can write that as <code>(+ (* 2 5) (* (q . 3) 11)</code>.</p>\n<h2><a name=\"evaluation-6\" class=\"anchor\" href=\"#evaluation-6\"></a>Evaluation</h2>\n<p>At a high level, then, the logic for evaluating a program is therefore:</p>\n<ul>\n<li>If the program is an atom, treat it as representing a number, and lookup the environment based on that number. The answer is the result of the program.</li>\n<li>If the program is a cons, take the front (left) and call it the opcode, and take the rest (right) and call it the arguments\n<ul>\n<li>If the opcode is not an atom, or the cons of an atom and nil, fail. If the atom does not match a known opcode, fail (or, in non-strict mode, treat as no-op and evaluate as nil).</li>\n<li>If the opcode is <code>q</code> (ie the one-byte atom 0x01), return the arguments verbatim</li>\n<li>Otherwise, evaluate the arguments:\n<ul>\n<li>If it’s nil, stop</li>\n<li>Otherwise if it’s a cons, recursively evaluate the first (left) element as a program, and fee that into the opcode, then continue with the rest (right element).</li>\n<li>If it’s not nil or a cons, error.</li>\n</ul>\n</li>\n<li>Return the result of feeding the processed arguments into the opcode.</li>\n</ul>\n</li>\n</ul>\n<p>Note that this is an “eager-evaluation” approach: eg the “if-then-else” opcode (<code>i</code>) accepts three arguments, a “condition”, a “then” value and an “else” value, however it does not short-circuit, so whether or not the condition is true, both the “then” and “else” values will be calculated, even though one or the other will be immediately discarded. That becomes important if you’re doing recursive/looping constructs, and when evaluating the execution cost of the program.</p>\n<p>Also note that numbers in Chialisp are represented as signed, 2’s-complement big-endian (more or less the opposite of Bitcoin’s little-endian with a sign-bit approach). Numbers can be arbitrarily large, they’re not limited to 4bytes or 64, 128 or 256bits, but rather they’re limited by the overall cost of evaluating the program as a whole.</p>\n<h2><a name=\"opcodes-7\" class=\"anchor\" href=\"#opcodes-7\"></a>Opcodes</h2>\n<p>As well as <code>q</code>, there are a bunch of other opcodes:</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>opcode (name)</th>\n<th>arguments</th>\n<th>atom value</th>\n<th>description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>q</code> (quote)</td>\n<td>…</td>\n<td>0x01</td>\n<td>special, return arguments unevaluated</td>\n</tr>\n<tr>\n<td><code>a</code> (apply)</td>\n<td>A B</td>\n<td>0x02</td>\n<td>evaluate A as a program with environment B</td>\n</tr>\n<tr>\n<td><code>i</code> (if)</td>\n<td>C T E</td>\n<td>0x03</td>\n<td>if C is not nil, then T, otherwise E</td>\n</tr>\n<tr>\n<td><code>c</code> (cons)</td>\n<td>L R</td>\n<td>0x04</td>\n<td>produce a cons element with L and R as left and right</td>\n</tr>\n<tr>\n<td><code>f</code> (first)</td>\n<td>C</td>\n<td>0x05</td>\n<td>return the left element of C, fail if C is an atom</td>\n</tr>\n<tr>\n<td><code>r</code> (rest)</td>\n<td>C</td>\n<td>0x06</td>\n<td>return the right element of C, fail if C is an atom</td>\n</tr>\n<tr>\n<td><code>l</code> (listp)</td>\n<td>X</td>\n<td>0x07</td>\n<td>return 1 if X is a cons, nil otherwise</td>\n</tr>\n<tr>\n<td><code>x</code> (raise)</td>\n<td>…</td>\n<td>0x08</td>\n<td>fail the program immediately</td>\n</tr>\n<tr>\n<td><code>=</code> (eq)</td>\n<td>*A *B</td>\n<td>0x09</td>\n<td>return 1 if A B are both atoms are equal, nil otherwise</td>\n</tr>\n<tr>\n<td><code>&gt;s</code> (gr_bytes)</td>\n<td>*A *B</td>\n<td>0x0a</td>\n<td>return 1 if A is greater than B when both are interepreted as byte strings, nil otherwise</td>\n</tr>\n<tr>\n<td><code>sha256</code></td>\n<td>*A *B *C …</td>\n<td>0x0b</td>\n<td>calculate the sha256 of the concatenation of the arguments</td>\n</tr>\n<tr>\n<td><code>substr</code></td>\n<td>*A *B *C</td>\n<td>0x0c</td>\n<td>return the substring of A between B and C</td>\n</tr>\n<tr>\n<td><code>strlen</code></td>\n<td>*A</td>\n<td>0x0d</td>\n<td>return the length of A</td>\n</tr>\n<tr>\n<td><code>concat</code></td>\n<td>*A *B *C …</td>\n<td>0x0e</td>\n<td>return an atom concatenating all the arguments</td>\n</tr>\n<tr>\n<td><code>+</code> (add)</td>\n<td>*A *B *C …</td>\n<td>0x10</td>\n<td>return A+B+C</td>\n</tr>\n<tr>\n<td><code>-</code> (subtract)</td>\n<td>*A *B *C …</td>\n<td>0x11</td>\n<td>return A-B-C</td>\n</tr>\n<tr>\n<td><code>*</code> (multiply)</td>\n<td>*A *B *C …</td>\n<td>0x12</td>\n<td>return A * B * C</td>\n</tr>\n<tr>\n<td><code>/</code> (div)</td>\n<td>*A *B</td>\n<td>0x13</td>\n<td>return A / B</td>\n</tr>\n<tr>\n<td><code>divmod</code></td>\n<td>*A *B</td>\n<td>0x14</td>\n<td>return the pair A/B and A%B</td>\n</tr>\n<tr>\n<td><code>&gt;</code> (gr)</td>\n<td>*A *B</td>\n<td>0x15</td>\n<td>return 1 if A is greater than B when both are interpreted as numbers, nil otherwise</td>\n</tr>\n<tr>\n<td><code>ash</code></td>\n<td>*A *B</td>\n<td>0x16</td>\n<td>return the value of A arithmetically shifted by B bits (ie with sign extension)</td>\n</tr>\n<tr>\n<td><code>lsh</code></td>\n<td>*A *B</td>\n<td>0x17</td>\n<td>return the value of A logically shifted by B bits (ie treated as unsigned)</td>\n</tr>\n<tr>\n<td><code>logand</code></td>\n<td>*A *B *C …</td>\n<td>0x18</td>\n<td>bitwise and of A, B, C (follows python behaviour for &amp; of negative values)</td>\n</tr>\n<tr>\n<td><code>logior</code></td>\n<td>*A *B *C …</td>\n<td>0x19</td>\n<td>bitwise inclusive-or of A, B, C</td>\n</tr>\n<tr>\n<td><code>logxor</code></td>\n<td>*A *B *C …</td>\n<td>0x1a</td>\n<td>bitwise exclusive-or of A, B, C</td>\n</tr>\n<tr>\n<td><code>lognot</code></td>\n<td>*A</td>\n<td>0x1b</td>\n<td>bitwise inversion of A</td>\n</tr>\n<tr>\n<td><code>point_add</code> <code>g1_add</code></td>\n<td>*P1 *P2 …</td>\n<td>0x1d</td>\n<td>BLS12-381 addition of G1 points (renamed in CHIP-11)</td>\n</tr>\n<tr>\n<td><code>pubkey_for_exp</code></td>\n<td>*A</td>\n<td>0x1e</td>\n<td>BLS12-381 create a G1 point (multiply the generator by A)</td>\n</tr>\n<tr>\n<td><code>not</code></td>\n<td>A</td>\n<td>0x20</td>\n<td>return 1 if A is nil, return nil otherwise</td>\n</tr>\n<tr>\n<td><code>any</code></td>\n<td>A B C …</td>\n<td>0x21</td>\n<td>return 1 if any of A B C… is not nil; return nil otherwise</td>\n</tr>\n<tr>\n<td><code>all</code></td>\n<td>…</td>\n<td>0x22</td>\n<td>return 1 if none of A B C… are nil; return nil otherwise</td>\n</tr>\n<tr>\n<td><code>softfork</code></td>\n<td>*C *E P A</td>\n<td>0x24</td>\n<td>evaluate P with environment A (like <code>a</code> opcode) but with new behaviour defined by E, and a cost of C</td>\n</tr>\n</tbody>\n</table>\n</div><p>Arguments marked with an asterisk are required to be atoms: if a cons is provided instead the program fails immediately. (Note that this restriction is only applied after the argument is evaluated, though)</p>\n<p>In addition, these opcodes are added by <a href=\"https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0011.md\">CHIP-11</a>; initially via the <code>softfork</code> operator with extension 0, but after the <a href=\"https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0011.md\">CHIP-12 hardfork</a>, also directly, as if they’d always been there.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>opcode (name)</th>\n<th>arguments</th>\n<th>atom value</th>\n<th>description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>coinid</code></td>\n<td>*PARENT *PUZHASH *AMOUNT</td>\n<td>0x30</td>\n<td>Return the coinid given the parent coin, puzzle hash and amount; fail if any of those arguments are invalid/non-canonical</td>\n</tr>\n<tr>\n<td><code>g1_subtract</code></td>\n<td>*A *B *C …</td>\n<td>0x31</td>\n<td>BLS12-381 subtraction of G1 points (A-B-C)</td>\n</tr>\n<tr>\n<td><code>g1_multiply</code></td>\n<td>*P *S</td>\n<td>0x32</td>\n<td>BLS12-381 multiplication of G1 point P by scalar S</td>\n</tr>\n<tr>\n<td><code>g1_negate</code></td>\n<td>*P</td>\n<td>0x33</td>\n<td>BLS12-381 negation of a G1 point P</td>\n</tr>\n<tr>\n<td><code>g2_add</code></td>\n<td>*A *B *C …</td>\n<td>0x34</td>\n<td>BLS12-381 addition of G2 points</td>\n</tr>\n<tr>\n<td><code>g2_subtract</code></td>\n<td>*A *B *C …</td>\n<td>0x35</td>\n<td>BLS12-381 subtraction of G2 points (A-B-C)</td>\n</tr>\n<tr>\n<td><code>g2_multiply</code></td>\n<td>*P *S</td>\n<td>0x36</td>\n<td>BLS12-381 multiplication of G2 point P by scalar S</td>\n</tr>\n<tr>\n<td><code>g2_negate</code></td>\n<td>*P</td>\n<td>0x37</td>\n<td>BLS12-381 negation of a G2 point P</td>\n</tr>\n<tr>\n<td><code>g1_map</code></td>\n<td>*DATA *DST</td>\n<td>0x38</td>\n<td>Map arbitrary data (by hashing it) to a BLS12-381 G1 point with optional domain separation tag</td>\n</tr>\n<tr>\n<td><code>g2_map</code></td>\n<td>*DATA *DST</td>\n<td>0x39</td>\n<td>Map arbitrary data (by hashing it) to a BLS12-381 G2 point with optional domain separation tag</td>\n</tr>\n<tr>\n<td><code>bls_pairing_identity</code></td>\n<td>*G1_1 *G2_1 *G1_2 *G2_2 …</td>\n<td>0x3a</td>\n<td>Return nil if the pairing of all given pairs is the identity, otherwise fail</td>\n</tr>\n<tr>\n<td><code>bls_verify</code></td>\n<td>*G2 *G1_1 *M1 *G1_2 *M2 …</td>\n<td>0x3b</td>\n<td>Return nil if the signature (G2) is valid for the combination of the messages (Mn) and public keys (G1_n)</td>\n</tr>\n<tr>\n<td><code>modpow</code></td>\n<td>*B *E *M</td>\n<td>0x3c</td>\n<td>Returns B raised to the power E, modulo M</td>\n</tr>\n<tr>\n<td><code>SOFTFORK</code></td>\n<td>*C [unspecified]</td>\n<td>0x5a</td>\n<td>For allowing future upgrades to the classes of conditions a Chialisp program can return</td>\n</tr>\n<tr>\n<td><code>secp256k1_verify</code></td>\n<td>*P *M *S</td>\n<td>0x13d61f00</td>\n<td>ECDSA signature check (pubkey P, message digest M, signature S) via secp256k1</td>\n</tr>\n<tr>\n<td><code>secp256r1_verify</code></td>\n<td>*P *M *S</td>\n<td>0x1c3a8f00</td>\n<td>ECDSA signature check (pubkey P, message digest M, signature S) via secp256r1</td>\n</tr>\n</tbody>\n</table>\n</div><p>One thing worth noting there is that unlike in bitcoin, very few opcodes are dedicated to control flow and data manipulation: just <code>q</code>, <code>a</code>, <code>i</code>, <code>c</code>, <code>f</code>, <code>r</code>, <code>x</code> (7); as compared to <code>if</code>, <code>notif</code>, <code>else</code>, <code>endif</code>, <code>verify</code>, <code>return</code>, <code>toaltstack</code>, <code>fromaltstack</code>, <code>ifdup</code>, <code>depth</code>, <code>drop</code>, <code>dup</code>, <code>nip</code>, <code>over</code>, <code>pick</code>, <code>roll</code>, <code>rot</code>, <code>swap</code>, <code>tuck</code>, <code>2drop</code>, <code>2dup</code>, <code>3dup</code>, <code>2over</code>, <code>2rot</code>, <code>2swap</code> (25). In effect, the ability to easily access any part of the environment just by using an integer to specify its location gives an arbitrarily large number of “stack access” opcodes.</p>\n<h2><a name=\"the-softfork-operator-8\" class=\"anchor\" href=\"#the-softfork-operator-8\"></a>The softfork operator</h2>\n<p>Instead of either a range of upgradable NOP opcodes or taproot’s <code>OP_SUCCESSx</code>, Chia lisp has a single <code>(softfork ...)</code> wrapper function. This accepts four arguments:</p>\n<ul>\n<li>a program and environment that will be interpreted in a similar way as the arguments for the <code>(a ...)</code> opcode would be, except with new behaviour defined in a soft fork</li>\n<li>a code identifying the soft fork(s) that should be applied to the program</li>\n<li>the expected total cost of evaluating the program (so that the consensus critical cost of the program can be correctly calculated even by older software that does not implement the specified soft fork behaviour)</li>\n</ul>\n<p>This is essentially an extended <code>OP_NOP</code> – the result of the softfork opcode is always nil, so the only additional behaviour that can be implemented within a softfork program is to fail the script entirely, which is exactly the same as when introducing new functionality to Bitcoin script via <code>OP_NOP</code> opcodes. Where it differs is that it is easy to provide complicated arguments to <code>(softfork)</code> in lisp, that can include a whole program with many new opcodes; doing the same in Bitcoin script is not as simple, simply because you’d need to define a new way of specifying those complicated arguments.</p>\n<h2><a name=\"conditions-9\" class=\"anchor\" href=\"#conditions-9\"></a>Conditions</h2>\n<p>One thing you may note is that Chia’s original list of opcodes doesn’t include a “checksig” equivalent. That is because rather than Bitcoin Script’s approach of returning a boolean as to whether the script succeeded or the transaction is invalid, Chialisp takes the approach of returning a set of <a href=\"https://chialisp.com/conditions/\">“conditions”</a> that need further validation, generally in the context of the block of transactions. This includes (aggregated) signature validation, but can also includes requirements like “this coin must also be spent simultaneously”.</p>\n<p>I’m not going to go into any detail about this behaviour, because most of it doesn’t map easily onto Bitcoin, and it’s essentially a separate layer to the lisp scripting in any event.</p>\n<h2><a name=\"recursion-and-looping-10\" class=\"anchor\" href=\"#recursion-and-looping-10\"></a>Recursion and looping</h2>\n<p>What does looping look like given these primitives? Consider the normal example, calculating a factorial:</p>\n<ul>\n<li><code>f(1) = 1</code></li>\n<li><code>f(n+1) = (n+1) * f(n)</code></li>\n</ul>\n<p>The <a href=\"https://github.com/Chia-Network/clvm_tools/blob/b78d414703fe9a0c1cb3f81a8ad9b42a33768dd8/README.md?plain=1#L50\">clvm implementation of that</a> looks like:</p>\n<ul>\n<li><code>(a (q a 2 (c 2 (c 5 ()))) (c (q a (i (= 5 (q . 1)) (q 1 . 1) (q 18 5 (a 2 (c 2 (c (- 5 (q . 1)) ()))))) 1) 1))</code></li>\n</ul>\n<p>That breaks down somewhat like:</p>\n<ul>\n<li><code>(a (q . PROGRAM) (ENV))</code> - run PROGRAM with environment ENV</li>\n<li><code>PROGRAM = (a 2 (c 2 (c 5 ())))</code> - run the program in slot 2 of the environment, in the context of a new environment (that’s pretty much the same as the existing one)</li>\n<li><code>ENV = (c (q . APPLYIF) 1)</code> – create a new environment with APPLYIF in slot 2, and the current environment in slot 3</li>\n<li><code>APPLYIF = (a (i (= 5 (q . 1)) (q q . 1) (q * 5 (a 2 RECURENV)) 1)</code> – check if the value in slot 5 is 1, if it is evaluate as <code>(a (q . 1))</code>, if it’s not evaluate as a recursive call, <code>(a (* 5 (a 2 RECURENV)) 1)</code>. The <code>(a (i X (q . Y) (q . Z)) 1)</code> pattern allows you to have a short-circuiting if, despite the <code>i</code> opcode not having that behaviour natively.</li>\n<li><code>RECURENV = (c 2 (c (- 5 (q . 1)) ())))</code> – recursive step changes to arguments: 2 stays the same, 5 has 1 subtracted from it, 7 is nil</li>\n</ul>\n<h2><a name=\"compiling-11\" class=\"anchor\" href=\"#compiling-11\"></a>Compiling</h2>\n<p>Putting the values into the right place in the environment, and ensuring they’re quoted correctly involves a lot of fiddling, as you can see by all the <code>c</code> and <code>q</code> invocations, and getting those things right manually is pretty hard. That brings us to the difference between “Chialisp” and “clvm”. Compared to the clvm code for factorial shown above, the <a href=\"https://chialisp.com/modern-chialisp/\">Chialisp</a> code for factorial looks like a much more normal functional program:</p>\n<pre data-code-wrap=\"lisp\"><code class=\"lang-lisp\">(mod (INDEX)\n    (defun factorial (VALUE)\n        (if (= VALUE 1) 1 (* VALUE (factorial (- VALUE 1))))\n    )\n    (factorial INDEX)\n)\n</code></pre>\n<p>Some points from the above:</p>\n<ul>\n<li><code>defun</code> allows you to define (possibly recursive) functions, that can be treated like opcodes, rather than having to manually invoke them with the <code>a</code> opcode</li>\n<li>Unlike with clvm, you don’t have to quote numbers; you use names when you want to access the environment, and the compiler figures out where in the environment to put them. Obviously, the compiler quotes those numbers when translating into clvm code. (You can use <code>@</code> to access the environment directly if you don’t want to use names for some reason)</li>\n<li><code>if</code> is a macro that supports short-circuiting, unlike the <code>i</code> opcode</li>\n</ul>\n<p>One caveat that may be worth noting is that chialisp often does not check that additional arguments aren’t provided. For example with the code for “factorial” above, the generated clvm code will correctly calculate <code>120</code> as the result when presented with the input <code>(5)</code>, and given an <code>= on list</code> type error if presented with <code>((10))</code> or a <code>path into atom</code> error if presented with <code>5</code>, but it will also produce the result <code>120</code> if given the extended list <code>(5 13)</code> – it only grabs the value 5 from the left hand side of the cons, it doesn’t also check that the right hand side of the cons in nil, it just ignores it entirely. This creates a third party malleability vector; however while that may be a problem in the Bitcoin context (it would decrease the tx’s effective feerate, making it less attractive to mine, and would introduce a conflicting wtxid which may be confusing), it perhaps isn’t much of a problem in Chia’s context (as bundling gives the opportunity to optimise unreferenced atoms out anyway).</p>\n<p>There are a variety of other features available at that higher level, including the ability to <code>include</code> code from other files, and it’s possible to add or change the supported features arbitrarily without requiring consensus changes. In some sense you might consider chialisp as similar to the miniscript policy language, while clvm code is similar to miniscript/script code.</p>\n<h2><a name=\"encoding-12\" class=\"anchor\" href=\"#encoding-12\"></a>Encoding</h2>\n<p>As you may expect, clvm programs/data are represented over the wire in a binary format, rather than an ascii one. It’s a fairly straightforward encoding:</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>first byte</th>\n<th>extra bytes</th>\n<th>meaning</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>b0xxx_xxxx</code></td>\n<td></td>\n<td>the one byte atom with the same value</td>\n</tr>\n<tr>\n<td><code>b1000_0000</code></td>\n<td></td>\n<td>the zero byte atom (nil)</td>\n</tr>\n<tr>\n<td><code>b10xx_xxxx</code></td>\n<td></td>\n<td>1-63 byte atom follows</td>\n</tr>\n<tr>\n<td><code>b110x_xxxx</code></td>\n<td>1</td>\n<td>0-8,191  byte atom follows</td>\n</tr>\n<tr>\n<td><code>b1110_xxxx</code></td>\n<td>2</td>\n<td>0-1,048,575  byte atom follows</td>\n</tr>\n<tr>\n<td><code>b1111_0xxx</code></td>\n<td>3</td>\n<td>0-134,217,727  byte atom follows</td>\n</tr>\n<tr>\n<td><code>b1111_10xx</code></td>\n<td>4</td>\n<td>0-17,179,869,183  byte atom follows</td>\n</tr>\n<tr>\n<td><code>b1111_110x</code></td>\n<td></td>\n<td>invalid</td>\n</tr>\n<tr>\n<td><code>b1111_1110</code></td>\n<td></td>\n<td>invalid</td>\n</tr>\n<tr>\n<td><code>b1111_1111</code></td>\n<td></td>\n<td>cons elements follow</td>\n</tr>\n</tbody>\n</table>\n</div><p>This format does mean there are multiple encodings of the same data: eg the single byte atom <code>0x42</code> can be encoded as a single byte <code>0x42</code>, or as two bytes <code>0x8142</code>, or as three bytes <code>0xc00142</code>, etc.</p>\n<p>It also may not be well optimised for its use case: each list requires a <code>0xff</code> cons marker for each entry in the list, and a <code>0x80</code> nil terminator; it may have been better to have linear overhead for megabyte or gigabyte length atoms, rather than linear overhead for even small lists.</p>\n<p>Compared to Bitcoin script, clvm here has a lower overhead for one-byte constants greater between 17 and 127 (inclusive), but higher overhead for 64-75 byte pushes. The latter impacts signatures for Bitcoin, though does not impact signatures for Chia: BLS12-381 signatures are ~96 bytes in length anyway, and because it supports pairing, signatures are designed to be aggregated together into a single signature per block anyway, and an additional byte of overhead per block rather than per spent coin is pretty immaterial. That has a moderate impact: the cost limit for chia blocks implies a limit of up to 920kB of data per block (and much less when you add in actual signature verification etc), and is measured against this serialization, so wasted bytes do matter somewhat.</p>\n<h2><a name=\"costs-13\" class=\"anchor\" href=\"#costs-13\"></a>Costs</h2>\n<p>Speaking of costs: <a href=\"https://chialisp.com/costs/\">carefully accounting for costs</a> is how chialisp allows flexible computation primitives without introducing the same denial-of-service attack vectors that caused a range of Bitcoin script’s original opcodes to be disabled.</p>\n<p>The overall block cost limit is 11e9; each opcode then has a cost made up of three components: a fixed cost per operation, a per-argument cost, and a per-byte cost. So <code>(* 0x10 0x2000 0x400000)</code> has three arguments, and six bytes, eg. Futher there is an additional cost dependant on the size of the returned valued. Finally the conditions resulting from a script also have significant costs (as these are what result in coins being spent/created and signatures being verified). Finally, there is a per-byte cost simply for encoding the script in the first place.</p>\n<p>One non-obvious difference is that in Bitcoin, we have a stack size limit of 1000 and an element size limit of 520 bytes, so that the program’s data is limited to taking about 500kB of memory at any point in time (though various overheads can make this a little larger). By contrast, Chia largely does not have a point-in-time runtime limit, but rather a total compute limit. This means it largely doesn’t make your program any cheaper if you design it so memory can be freed earlier.</p>\n<p>I think an example of a program that uses lots of memory but still fits within Chia’s cost budget is:</p>\n<pre data-code-wrap=\"lisp\"><code class=\"lang-lisp\">(mod (C) \n    (defun double (N X) (if (&gt; N 0) (double (- N 1) (concat X X)) X))\n    (double C \"foo\")\n)\n</code></pre>\n<p>which just doubles the string “foo” however many times you ask it to. If you say “double it 26 times”, that would result in a 200MB string, with a calculated cost of 5,234,558,878 which is slightly below the half the 11e9 limit for a block (mempool transactions are limited to half the block cost).</p>\n<h2><a name=\"bundles-14\" class=\"anchor\" href=\"#bundles-14\"></a>Bundles</h2>\n<p>Another non-obvious difference between Chia and Bitcoin costs is due to <a href=\"https://docs.chia.net/spend-bundles/\">spend bundles</a>. This is in many ways a natural consequence of supporting automatic signature aggregation: rather than transactions remaining separate, they’re combined into bundles, and their signatures are aggregated. However, at the same time the signature is aggregated, their lisp scripts are also bundled together, which can then allow some further optimisation: eg if many coins have the same script just with different public keys, you could have the script be a template, and reuse it via a loop for each coin that it corresponds with.</p>\n<p>The downside of this seems to me to be twofold:</p>\n<ul>\n<li>it makes it harder to reuse the cache of validated transactions from your mempool to speed up block validation</li>\n<li>it makes block assembly more complicated, and in a highly competitive environment, may increase centralisation pressure and become a vector for censorship</li>\n</ul>\n<p>So while this is neat, I don’t really think it’s interesting enough to try retrofitting into Bitcoin, and am pretty much ignoring it as a feature.</p>\n<h2><a name=\"tooling-15\" class=\"anchor\" href=\"#tooling-15\"></a>Tooling</h2>\n<p>In order to mess around with clvm/chialisp, <a href=\"https://github.com/Chia-Network/chia-dev-tools/\">chia-dev-tools</a> seems to be the main starting point; following the pip install there gives you <code>run</code> (a chialisp compiler that generates clvm code), <code>brun</code> (a clvm interpreter that executes clvm code), and <code>cdv</code> (which does fancy stuff much of which I don’t understand and haven’t looked at). I haven’t found any online tools that you can use to compile/test/debug code online without installing software locally. There’s also a <a href=\"https://github.com/Chia-Network/clvm_rs\">rust implementation</a>, which is definitely preferable.</p>\n<h2><a name=\"defects-16\" class=\"anchor\" href=\"#defects-16\"></a>Defects</h2>\n<p>Perhaps an interesting thing to look at is what defects have been found in the clvm since it’s launch, and how they were addressed. Examples I’m aware of:</p>\n<ul>\n<li><a href=\"https://www.chia.net/2022/03/04/divided-we-fork/\">Inconsistent division results</a> was a bug where the <code>div</code> operator didn’t behave as expected for negative values, fixed by making negative division invalid, recommending usage if the <code>divmod</code> operator instead in the rare cases where it might be desired.</li>\n<li><a href=\"https://github.com/Chia-Network/post-mortem/blob/7889789f8ea6ae74a0783dbbb64845c2ea012930/2022-08/2022-08-19-CATbleed.md\">CATbleed</a> was a smart contract programming error (insufficient checking of inputs to a hash function allowing different input sets to result in the same hash), fixed by updating the smart contract to a new version, and mitigated for the future by introducing a new <a href=\"https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0011.md#coinid\">coinid opcode</a> that does all the checks directly. (CAT here refers to “Chia Asset Tokens”, and isn’t related to <code>OP_CAT</code>)</li>\n<li><a href=\"https://github.com/Chia-Network/post-mortem/blob/7889789f8ea6ae74a0783dbbb64845c2ea012930/2023-01/2023-01-31-CLVM-infinite-recursion.md\">Excessive recursion</a> via a bug where internal stack usage didn’t contribute to the cost calculation so wasn’t effectively limited; fixed by adding a stack depth limit</li>\n<li>Missing functionality: as noted above <a href=\"https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0011.md\">CHIP-11</a> adds a bunch of opcodes, covering directly doing ECC operations on the BLS12-381 curve, as well as ECDSA signature checking on secp256k1 and secp256r1, modular exponentiation, and a mod operator that doesn’t require an extra step to drop the division result.</li>\n<li>Missing functionality: <a href=\"https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0011.md\">CHIP-11</a> and <a href=\"https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0014.md\">CHIP-14</a> add some conditions, namely (for CHIP-11) various new signatures committing to only part of the coinid, and (for CHIP-14) reverse timelock conditions (must be spent prior to …), concurrent spend conditions (must be spent in the same block as …, and creation assertions (coin being spent was created at …).</li>\n</ul>\n<h2><a name=\"conclusion-17\" class=\"anchor\" href=\"#conclusion-17\"></a>Conclusion</h2>\n<p>Anyway, I think that covers all the key features of clvm/chialisp in reasonable detail, as long as you’re not actually trying to develop actual chia scripts/contracts (in which case you need to know how conditions work in at least some detail).</p>\n<p>Note that I’m not an expert in lisp/clvm/chialisp, and have more focused on the design/potential than the details per se, so there may be errors in my understanding and/or description. No warranty, etc.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-03-04T02:46:38.231Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 10,
  "reads": 28,
  "readers_count": 27,
  "score": 95.6,
  "yours": false,
  "topic_id": 636,
  "topic_slug": "chia-lisp-for-bitcoiners",
  "topic_title": "Chia Lisp For Bitcoiners",
  "topic_html_title": "Chia Lisp For Bitcoiners",
  "category_id": 7,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I want to talk [some](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2022-March/020036.html) [more](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-October/022099.html) about doing a Lisp variant for script on Bitcoin, but before I do that in detail, I figure it's probably helpful to do a summary of what [Lisp looks like on the Chia blockchain](https://chialisp.com/), since that already has good answers for many of the questions that come up. If that sounds interesting, read on; if not, maybe remember this post exists so you can refer back to it later when I treat it as assumed knowledge in posts that do sound interesting!\n\nThis writeup assumes you're familiar with Bitcoin and [Bitcoin Script](https://en.bitcoin.it/wiki/Script), but not with [Chia](https://en.wikipedia.org/wiki/Chia_(cryptocurrency)) or [Lisp](https://www.buildyourownlisp.com/). It takes a very bottom up approach, and doesn't go into any real detail about what any of this makes possible.\n\nFor those who are familiar with Chialisp, note that I'm mostly talking about the behaviour of [clvm](https://chialisp.com/clvm/) (ie what's implemented in consensus and seen on-chain in chia), rather than Chialisp per se (ie, the syntax you use to write complicated programs that then gets compiled down to clvm).\n\n<div data-theme-toc=\"true\"> </div>\n\n## Why?\n\nWhy is this worth thinking about at all? After all, Bitcoin script is a great little language, essentially a tiny stack based RPN calculator, that's robust enough to be ready to replace central bank clearing houses, with enough programmability to do a bunch of neat things. But from a programmer's perspective, there are two things that as a language it can't do well: looping and structured data.\n\nNot being able to do a loop natively means that scripts that do the same thing repeatedly quickly become cumbersome, for example the [Lamport Sigs and CAT tricks](https://delvingbitcoin.org/t/lamport-signatures-and-other-cat-tricks/236) design has 20 steps each involving an 8 level merkle tree that need to be spelt out separately, rather than just having two loops -- so 160 steps that should just be one in a loop. There's been thoughts about adding constructs that could enable looping to bitcoin script in the past, eg [BIP 12 OP_EVAL](https://github.com/bitcoin/bips/blob/b3701faef2bdb98a0d7ace4eedbeefa2da4c89ed/bip-0012.mediawiki) and [BIP 117 Tail Call Semandtics](https://github.com/bitcoin/bips/blob/b3701faef2bdb98a0d7ace4eedbeefa2da4c89ed/bip-0117.mediawiki), both of which are explicitly limited to disable looping, or [OP_FOLD](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2022-February/020021.html).\n\nNot being able to natively deal with structured data isn't as big a problem: you can work around it by using the various stack rotation opcodes and moving things on and off the alt stack, however that becomes annoying to actually do in practice. For example, a few of the recent script proposals suggest modest changes to imply a little more structure: eg,\n * [OP_VAULT](https://github.com/bitcoin/bips/pull/1421) allows you to specify a number of items that will be encoded as minimal pushes and prefixed to the provided `leaf-update-script-body`,\n * [OP_SEGMENT](https://rusty.ozlabs.org/2024/01/04/OP_SEGMENT.html) proposes introducing a code-separator like opcode that does nothing itself, but is used to separate out the impact of `OP_SUCCESSx` behaviour, so that script fragments can be manipulated within script itself\n * there is a [proposal being tossed around](https://twitter.com/reardencode/status/1760324791343665396) for CHECKSIGFROMSTACK to also allow specifying up to 16 additional bits of message data, that will be hashed and combined for the actual signature verification operation occurs\n\nThe approach Chia Lisp takes addresses both these limitations in perhaps the simplest way possible:\n\n * it adds an \"apply\" opcode (`a`) that allows for recursion and hence can be used for looping; and\n * it replaces the concept of a stack with that of a binary tree -- any element can either be a leaf node (aka an \"atom\") that is just a byte string (the same as stack elements now), or it can be a branch and contain a pair of elements (aka a \"cons\"), which are themselves either branches or leaves.\n\nAs is usual for Lisp, programs are then encoded in that same data structure, allowing the program itself to be introspected using the same operations that allow manipulating any other data structure.\n\n## Making Lists\n\nLisp is known for its lists, though, not for binary trees, so the above may seem slightly surprising. It's fairly simply resolved however: lists are constructed recursively, where the first element in the list is put on the left side of a cons, and the rest of the list is put on the right side, and the empty list is defined as the empty byte vector, also known as \"nil\". We have special notations for this:\n\n * `()` is the empty list aka the empty byte vector\n * `(a . b)` indicates a cons or branch element with `a` on the left and `b` on the right.\n * `(a b c d)` indicates a list of four elements, equivalent to `(a . (b . (c . (d . ()))))`\n * `(a b c d . e)` indicates a \"dotted\" list, which ends with `e` instead of an implicit `nil`, ie is the same as `(a . (b . (c . (d . e))))`.\n\nThis means that `(a b . (c d))` is just an alternative way of writing `(a b c d)`.\n\nIf you keep taking the righthand side of each cons until you come to an atom (ie a byte vector, aka a leaf node), then either the byte vector is empty, and you have a normal list, called a \"proper list\", or it's a non-empty byte vector, and you have what's called an \"improper\" list.\n\nFor anyone like me who has heard about [`car` and `cdr`](https://en.wikipedia.org/wiki/CAR_and_CDR) but didn't know what they meant, `car` just means take the left side of the pair, and `cdr` just means take the right, and they come from implementation details from the original Lisp. Better, in my opinion, to call them \"head\" and \"tail\" (as is usual in other [functional](https://hackage.haskell.org/package/base-4.19.1.0/docs/Data-List.html) [languages](https://www.scala-lang.org/api/current/scala/collection/immutable/List.html)), or as Common Lisp and Chia Lisp do, \"first\" and \"rest\".\n\n## Having opcodes operate on lists\n\nIt then becomes fairly straightforward to extend opcodes to operate on a list of arguments: eg, rather than `OP_ADD` taking exactly two things off the stack and adding them together, we can have the `+` opcode expect a list of values that it will add together. Then we just put the opcode and its arguments together as a pair, ie `(+ . (1 2 3))`, but of course, as we just established, that's the same as writing `(+ 1 2 3)`, and that becomes our general notation for expressions in our programs.\n\n## The environment\n\nWe want to be able to write programs that are applied to some \"user input\", so the way we do that is we have something called the \"environment\", which the program can access. The environment is just another list (or binary tree), but we have a clever way of accessing any part of it just via an integer. In particular, we say that `1` gets us the whole thing verbatim; `2` gets the left side, `3` gets the right side, `4` gets the left side of the left side, `6` gets the right side of the left side, etc.\n\n```mermaid height=234,auto\nflowchart TD\n    1 --> 2\n    1 --> 3\n    2 --> 4\n    2 --> 6\n    3 --> 5\n    3 --> 7\n```\n\nThe general procedure is:\n\n```python\ndef get_env(n, e):\n  if n == 0: return nil\n  while n > 1:\n    if n % 2 == 0:\n      e = e.left\n    else:\n      e = e.right\n    n //= 2\n  return e\n```\n\nSo if the environment is the list `(1 2 3)` then `get_env(2, env)` gives 1, `get_env(5, env)` gives 2, `get_env(11, env)` gives 3, and `get_env(15, env)` gives the final nil.\n\nThus if you want the program \"(a*b)+c\" you can write that as `(+ (* 2 5) 11)`, and the numbers will be treated as environment lookups, so if the environment is `(1 2 3)` the result will be `(1*2)+3=5`.\n\n## Quoting\n\nWhat if you want to triple a number (multiply by 3), rather than multiply by whatever the user inputs? In that case you can \"quote\" values, to avoid resolving them either from an environment lookup or evaluating them as an expression. This involves a special opcode, `q`, which has special evaluation rules compared to every other opcode. Its behaviour is quite simple: its result is just its argument passed through without any evaluation. It's also special in that it doesn't necessarily expect a proper (nil-terminated) list for its argument.\n\nSo if you instead of `(a*b)+c`, you want to calculate `(a*b)+(3*c)`, you can write that as `(+ (* 2 5) (* (q . 3) 11)`.\n\n## Evaluation\n\nAt a high level, then, the logic for evaluating a program is therefore:\n\n * If the program is an atom, treat it as representing a number, and lookup the environment based on that number. The answer is the result of the program.\n * If the program is a cons, take the front (left) and call it the opcode, and take the rest (right) and call it the arguments\n   * If the opcode is not an atom, or the cons of an atom and nil, fail. If the atom does not match a known opcode, fail (or, in non-strict mode, treat as no-op and evaluate as nil).\n   * If the opcode is `q` (ie the one-byte atom 0x01), return the arguments verbatim\n   * Otherwise, evaluate the arguments:\n      * If it's nil, stop\n      * Otherwise if it's a cons, recursively evaluate the first (left) element as a program, and fee that into the opcode, then continue with the rest (right element).\n      * If it's not nil or a cons, error.\n    * Return the result of feeding the processed arguments into the opcode.\n\nNote that this is an \"eager-evaluation\" approach: eg the \"if-then-else\" opcode (`i`) accepts three arguments, a \"condition\", a \"then\" value and an \"else\" value, however it does not short-circuit, so whether or not the condition is true, both the \"then\" and \"else\" values will be calculated, even though one or the other will be immediately discarded. That becomes important if you're doing recursive/looping constructs, and when evaluating the execution cost of the program.\n\nAlso note that numbers in Chialisp are represented as signed, 2's-complement big-endian (more or less the opposite of Bitcoin's little-endian with a sign-bit approach). Numbers can be arbitrarily large, they're not limited to 4bytes or 64, 128 or 256bits, but rather they're limited by the overall cost of evaluating the program as a whole.\n\n## Opcodes\n\nAs well as `q`, there are a bunch of other opcodes:\n\n| opcode (name) | arguments | atom value | description |\n| --- | --- | --- | --- |\n| `q` (quote) | ... | 0x01 | special, return arguments unevaluated\n| `a` (apply) | A B | 0x02 | evaluate A as a program with environment B\n| `i` (if) | C T E | 0x03 | if C is not nil, then T, otherwise E\n| `c` (cons) | L R | 0x04 | produce a cons element with L and R as left and right\n| `f` (first) | C | 0x05 | return the left element of C, fail if C is an atom\n| `r` (rest) | C | 0x06 | return the right element of C, fail if C is an atom\n| `l` (listp) | X | 0x07 | return 1 if X is a cons, nil otherwise\n| `x` (raise) | ... | 0x08 | fail the program immediately\n| `=` (eq) | *A *B | 0x09 | return 1 if A B are both atoms are equal, nil otherwise\n| `>s` (gr_bytes) | *A *B | 0x0a | return 1 if A is greater than B when both are interepreted as byte strings, nil otherwise\n| `sha256` | *A *B *C ... | 0x0b | calculate the sha256 of the concatenation of the arguments\n| `substr` | *A *B *C | 0x0c | return the substring of A between B and C\n| `strlen` | *A | 0x0d | return the length of A\n| `concat` | *A *B *C ... | 0x0e | return an atom concatenating all the arguments\n| `+` (add) | *A *B *C ... | 0x10 | return A+B+C\n| `-` (subtract) | *A *B *C ... | 0x11 | return A-B-C\n| `*` (multiply) | *A *B *C ... | 0x12 | return A * B * C\n| `/` (div) | *A *B | 0x13 | return A / B\n| `divmod` | *A *B | 0x14 | return the pair A/B and A%B\n| `>` (gr) | *A *B | 0x15 | return 1 if A is greater than B when both are interpreted as numbers, nil otherwise\n| `ash` | *A *B | 0x16 | return the value of A arithmetically shifted by B bits (ie with sign extension)\n| `lsh` | *A *B | 0x17 | return the value of A logically shifted by B bits (ie treated as unsigned)\n| `logand` | *A *B *C ... | 0x18 | bitwise and of A, B, C (follows python behaviour for & of negative values)\n| `logior` | *A *B *C ... | 0x19 | bitwise inclusive-or of A, B, C\n| `logxor` | *A *B *C ... | 0x1a | bitwise exclusive-or of A, B, C\n| `lognot` | *A | 0x1b | bitwise inversion of A\n| `point_add` `g1_add` | *P1 *P2 ... | 0x1d | BLS12-381 addition of G1 points (renamed in CHIP-11)\n| `pubkey_for_exp` | *A | 0x1e | BLS12-381 create a G1 point (multiply the generator by A)\n| `not` | A | 0x20 | return 1 if A is nil, return nil otherwise\n| `any` | A B C ... | 0x21 | return 1 if any of A B C.. is not nil; return nil otherwise\n| `all` | ... | 0x22 | return 1 if none of A B C... are nil; return nil otherwise\n| `softfork` | *C *E P A | 0x24 | evaluate P with environment A (like `a` opcode) but with new behaviour defined by E, and a cost of C\n\nArguments marked with an asterisk are required to be atoms: if a cons is provided instead the program fails immediately. (Note that this restriction is only applied after the argument is evaluated, though)\n\nIn addition, these opcodes are added by [CHIP-11](https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0011.md); initially via the `softfork` operator with extension 0, but after the [CHIP-12 hardfork](https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0011.md), also directly, as if they'd always been there.\n\n| opcode (name) | arguments | atom value | description |\n| --- | --- | --- | --- |\n| `coinid` | *PARENT *PUZHASH *AMOUNT | 0x30 | Return the coinid given the parent coin, puzzle hash and amount; fail if any of those arguments are invalid/non-canonical\n| `g1_subtract` | *A *B *C ... | 0x31 | BLS12-381 subtraction of G1 points (A-B-C)\n| `g1_multiply` | *P *S | 0x32 | BLS12-381 multiplication of G1 point P by scalar S\n| `g1_negate` | *P | 0x33 | BLS12-381 negation of a G1 point P\n| `g2_add` | *A *B *C ... | 0x34 | BLS12-381 addition of G2 points\n| `g2_subtract` | *A *B *C ... | 0x35 | BLS12-381 subtraction of G2 points (A-B-C)\n| `g2_multiply` | *P *S | 0x36 | BLS12-381 multiplication of G2 point P by scalar S\n| `g2_negate` | *P | 0x37 | BLS12-381 negation of a G2 point P\n| `g1_map` | *DATA *DST | 0x38 | Map arbitrary data (by hashing it) to a BLS12-381 G1 point with optional domain separation tag\n| `g2_map` | *DATA *DST | 0x39 | Map arbitrary data (by hashing it) to a BLS12-381 G2 point with optional domain separation tag\n| `bls_pairing_identity` | *G1_1 *G2_1 *G1_2 *G2_2 ... | 0x3a | Return nil if the pairing of all given pairs is the identity, otherwise fail\n| `bls_verify` | *G2 *G1_1 *M1 *G1_2 *M2 ... | 0x3b | Return nil if the signature (G2) is valid for the combination of the messages (Mn) and public keys (G1_n)\n| `modpow` | *B *E *M | 0x3c | Returns B raised to the power E, modulo M\n| `SOFTFORK` | *C [unspecified] | 0x5a | For allowing future upgrades to the classes of conditions a Chialisp program can return\n| `secp256k1_verify` | *P *M *S | 0x13d61f00 | ECDSA signature check (pubkey P, message digest M, signature S) via secp256k1\n| `secp256r1_verify` | *P *M *S | 0x1c3a8f00 | ECDSA signature check (pubkey P, message digest M, signature S) via secp256r1\n\nOne thing worth noting there is that unlike in bitcoin, very few opcodes are dedicated to control flow and data manipulation: just `q`, `a`, `i`, `c`, `f`, `r`, `x` (7); as compared to `if`, `notif`, `else`, `endif`, `verify`, `return`, `toaltstack`, `fromaltstack`, `ifdup`, `depth`, `drop`, `dup`, `nip`, `over`, `pick`, `roll`, `rot`, `swap`, `tuck`, `2drop`, `2dup`, `3dup`, `2over`, `2rot`, `2swap` (25). In effect, the ability to easily access any part of the environment just by using an integer to specify its location gives an arbitrarily large number of \"stack access\" opcodes.\n\n## The softfork operator\n\nInstead of either a range of upgradable NOP opcodes or taproot's `OP_SUCCESSx`, Chia lisp has a single `(softfork ...)` wrapper function. This accepts four arguments:\n * a program and environment that will be interpreted in a similar way as the arguments for the `(a ...)` opcode would be, except with new behaviour defined in a soft fork\n * a code identifying the soft fork(s) that should be applied to the program\n * the expected total cost of evaluating the program (so that the consensus critical cost of the program can be correctly calculated even by older software that does not implement the specified soft fork behaviour)\n\nThis is essentially an extended `OP_NOP` -- the result of the softfork opcode is always nil, so the only additional behaviour that can be implemented within a softfork program is to fail the script entirely, which is exactly the same as when introducing new functionality to Bitcoin script via `OP_NOP` opcodes. Where it differs is that it is easy to provide complicated arguments to `(softfork)` in lisp, that can include a whole program with many new opcodes; doing the same in Bitcoin script is not as simple, simply because you'd need to define a new way of specifying those complicated arguments.\n\n## Conditions\n\nOne thing you may note is that Chia's original list of opcodes doesn't include a \"checksig\" equivalent. That is because rather than Bitcoin Script's approach of returning a boolean as to whether the script succeeded or the transaction is invalid, Chialisp takes the approach of returning a set of [\"conditions\"](https://chialisp.com/conditions/) that need further validation, generally in the context of the block of transactions. This includes (aggregated) signature validation, but can also includes requirements like \"this coin must also be spent simultaneously\".\n\nI'm not going to go into any detail about this behaviour, because most of it doesn't map easily onto Bitcoin, and it's essentially a separate layer to the lisp scripting in any event.\n\n## Recursion and looping\n\nWhat does looping look like given these primitives? Consider the normal example, calculating a factorial:\n\n * `f(1) = 1`\n * `f(n+1) = (n+1) * f(n)`\n\nThe [clvm implementation of that](https://github.com/Chia-Network/clvm_tools/blob/b78d414703fe9a0c1cb3f81a8ad9b42a33768dd8/README.md?plain=1#L50) looks like:\n\n * `(a (q a 2 (c 2 (c 5 ()))) (c (q a (i (= 5 (q . 1)) (q 1 . 1) (q 18 5 (a 2 (c 2 (c (- 5 (q . 1)) ()))))) 1) 1))`\n\nThat breaks down somewhat like:\n\n * `(a (q . PROGRAM) (ENV))` - run PROGRAM with environment ENV \n * `PROGRAM = (a 2 (c 2 (c 5 ())))` - run the program in slot 2 of the environment, in the context of a new environment (that's pretty much the same as the existing one)\n * `ENV = (c (q . APPLYIF) 1)` -- create a new environment with APPLYIF in slot 2, and the current environment in slot 3\n * `APPLYIF = (a (i (= 5 (q . 1)) (q q . 1) (q * 5 (a 2 RECURENV)) 1)` -- check if the value in slot 5 is 1, if it is evaluate as `(a (q . 1))`, if it's not evaluate as a recursive call, `(a (* 5 (a 2 RECURENV)) 1)`. The `(a (i X (q . Y) (q . Z)) 1)` pattern allows you to have a short-circuiting if, despite the `i` opcode not having that behaviour natively.\n * `RECURENV = (c 2 (c (- 5 (q . 1)) ())))` -- recursive step changes to arguments: 2 stays the same, 5 has 1 subtracted from it, 7 is nil\n\n## Compiling\n\nPutting the values into the right place in the environment, and ensuring they're quoted correctly involves a lot of fiddling, as you can see by all the `c` and `q` invocations, and getting those things right manually is pretty hard. That brings us to the difference between \"Chialisp\" and \"clvm\". Compared to the clvm code for factorial shown above, the [Chialisp](https://chialisp.com/modern-chialisp/) code for factorial looks like a much more normal functional program:\n\n```lisp\n(mod (INDEX)\n    (defun factorial (VALUE)\n        (if (= VALUE 1) 1 (* VALUE (factorial (- VALUE 1))))\n    )\n    (factorial INDEX)\n)\n```\n\nSome points from the above:\n\n * `defun` allows you to define (possibly recursive) functions, that can be treated like opcodes, rather than having to manually invoke them with the `a` opcode\n * Unlike with clvm, you don't have to quote numbers; you use names when you want to access the environment, and the compiler figures out where in the environment to put them. Obviously, the compiler quotes those numbers when translating into clvm code. (You can use `@` to access the environment directly if you don't want to use names for some reason)\n * `if` is a macro that supports short-circuiting, unlike the `i` opcode\n\nOne caveat that may be worth noting is that chialisp often does not check that additional arguments aren't provided. For example with the code for \"factorial\" above, the generated clvm code will correctly calculate `120` as the result when presented with the input `(5)`, and given an `= on list` type error if presented with `((10))` or a `path into atom` error if presented with `5`, but it will also produce the result `120` if given the extended list `(5 13)` -- it only grabs the value 5 from the left hand side of the cons, it doesn't also check that the right hand side of the cons in nil, it just ignores it entirely. This creates a third party malleability vector; however while that may be a problem in the Bitcoin context (it would decrease the tx's effective feerate, making it less attractive to mine, and would introduce a conflicting wtxid which may be confusing), it perhaps isn't much of a problem in Chia's context (as bundling gives the opportunity to optimise unreferenced atoms out anyway).\n\nThere are a variety of other features available at that higher level, including the ability to `include` code from other files, and it's possible to add or change the supported features arbitrarily without requiring consensus changes. In some sense you might consider chialisp as similar to the miniscript policy language, while clvm code is similar to miniscript/script code.\n\n## Encoding\n\nAs you may expect, clvm programs/data are represented over the wire in a binary format, rather than an ascii one. It's a fairly straightforward encoding:\n\n| first byte | extra bytes | meaning |\n| --- | --- | --- | \n| `b0xxx_xxxx` | | the one byte atom with the same value\n| `b1000_0000`  | | the zero byte atom (nil)\n| `b10xx_xxxx`  | | 1-63 byte atom follows\n| `b110x_xxxx` | 1 | 0-8,191  byte atom follows\n| `b1110_xxxx` | 2 | 0-1,048,575  byte atom follows\n| `b1111_0xxx` | 3 | 0-134,217,727  byte atom follows\n| `b1111_10xx` | 4 | 0-17,179,869,183  byte atom follows\n| `b1111_110x` | | invalid\n| `b1111_1110` | | invalid\n| `b1111_1111` | | cons elements follow\n\nThis format does mean there are multiple encodings of the same data: eg the single byte atom `0x42` can be encoded as a single byte `0x42`, or as two bytes `0x8142`, or as three bytes `0xc00142`, etc.\n\nIt also may not be well optimised for its use case: each list requires a `0xff` cons marker for each entry in the list, and a `0x80` nil terminator; it may have been better to have linear overhead for megabyte or gigabyte length atoms, rather than linear overhead for even small lists.\n\nCompared to Bitcoin script, clvm here has a lower overhead for one-byte constants greater between 17 and 127 (inclusive), but higher overhead for 64-75 byte pushes. The latter impacts signatures for Bitcoin, though does not impact signatures for Chia: BLS12-381 signatures are ~96 bytes in length anyway, and because it supports pairing, signatures are designed to be aggregated together into a single signature per block anyway, and an additional byte of overhead per block rather than per spent coin is pretty immaterial. That has a moderate impact: the cost limit for chia blocks implies a limit of up to 920kB of data per block (and much less when you add in actual signature verification etc), and is measured against this serialization, so wasted bytes do matter somewhat.\n\n## Costs\n\nSpeaking of costs: [carefully accounting for costs](https://chialisp.com/costs/) is how chialisp allows flexible computation primitives without introducing the same denial-of-service attack vectors that caused a range of Bitcoin script's original opcodes to be disabled.\n\nThe overall block cost limit is 11e9; each opcode then has a cost made up of three components: a fixed cost per operation, a per-argument cost, and a per-byte cost. So `(* 0x10 0x2000 0x400000)` has three arguments, and six bytes, eg. Futher there is an additional cost dependant on the size of the returned valued. Finally the conditions resulting from a script also have significant costs (as these are what result in coins being spent/created and signatures being verified). Finally, there is a per-byte cost simply for encoding the script in the first place.\n\nOne non-obvious difference is that in Bitcoin, we have a stack size limit of 1000 and an element size limit of 520 bytes, so that the program's data is limited to taking about 500kB of memory at any point in time (though various overheads can make this a little larger). By contrast, Chia largely does not have a point-in-time runtime limit, but rather a total compute limit. This means it largely doesn't make your program any cheaper if you design it so memory can be freed earlier.\n\nI think an example of a program that uses lots of memory but still fits within Chia's cost budget is:\n\n```lisp\n(mod (C) \n    (defun double (N X) (if (> N 0) (double (- N 1) (concat X X)) X))\n    (double C \"foo\")\n)\n```\n\nwhich just doubles the string \"foo\" however many times you ask it to. If you say \"double it 26 times\", that would result in a 200MB string, with a calculated cost of 5,234,558,878 which is slightly below the half the 11e9 limit for a block (mempool transactions are limited to half the block cost).\n\n## Bundles\n\nAnother non-obvious difference between Chia and Bitcoin costs is due to [spend bundles](https://docs.chia.net/spend-bundles/). This is in many ways a natural consequence of supporting automatic signature aggregation: rather than transactions remaining separate, they're combined into bundles, and their signatures are aggregated. However, at the same time the signature is aggregated, their lisp scripts are also bundled together, which can then allow some further optimisation: eg if many coins have the same script just with different public keys, you could have the script be a template, and reuse it via a loop for each coin that it corresponds with.\n\nThe downside of this seems to me to be twofold:\n * it makes it harder to reuse the cache of validated transactions from your mempool to speed up block validation\n * it makes block assembly more complicated, and in a highly competitive environment, may increase centralisation pressure and become a vector for censorship\n\nSo while this is neat, I don't really think it's interesting enough to try retrofitting into Bitcoin, and am pretty much ignoring it as a feature.\n\n## Tooling\n\nIn order to mess around with clvm/chialisp, [chia-dev-tools](https://github.com/Chia-Network/chia-dev-tools/) seems to be the main starting point; following the pip install there gives you `run` (a chialisp compiler that generates clvm code), `brun` (a clvm interpreter that executes clvm code), and `cdv` (which does fancy stuff much of which I don't understand and haven't looked at). I haven't found any online tools that you can use to compile/test/debug code online without installing software locally. There's also a [rust implementation](https://github.com/Chia-Network/clvm_rs), which is definitely preferable.\n\n## Defects\n\nPerhaps an interesting thing to look at is what defects have been found in the clvm since it's launch, and how they were addressed. Examples I'm aware of:\n\n * [Inconsistent division results](https://www.chia.net/2022/03/04/divided-we-fork/) was a bug where the `div` operator didn't behave as expected for negative values, fixed by making negative division invalid, recommending usage if the `divmod` operator instead in the rare cases where it might be desired. \n * [CATbleed](https://github.com/Chia-Network/post-mortem/blob/7889789f8ea6ae74a0783dbbb64845c2ea012930/2022-08/2022-08-19-CATbleed.md) was a smart contract programming error (insufficient checking of inputs to a hash function allowing different input sets to result in the same hash), fixed by updating the smart contract to a new version, and mitigated for the future by introducing a new [coinid opcode](https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0011.md#coinid) that does all the checks directly. (CAT here refers to \"Chia Asset Tokens\", and isn't related to `OP_CAT`)\n * [Excessive recursion](https://github.com/Chia-Network/post-mortem/blob/7889789f8ea6ae74a0783dbbb64845c2ea012930/2023-01/2023-01-31-CLVM-infinite-recursion.md) via a bug where internal stack usage didn't contribute to the cost calculation so wasn't effectively limited; fixed by adding a stack depth limit\n * Missing functionality: as noted above [CHIP-11](https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0011.md) adds a bunch of opcodes, covering directly doing ECC operations on the BLS12-381 curve, as well as ECDSA signature checking on secp256k1 and secp256r1, modular exponentiation, and a mod operator that doesn't require an extra step to drop the division result.\n * Missing functionality: [CHIP-11](https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0011.md) and [CHIP-14](https://github.com/Chia-Network/chips/blob/b096b5735989b243f7c2dec8533aa0080d084dc8/CHIPs/chip-0014.md) add some conditions, namely (for CHIP-11) various new signatures committing to only part of the coinid, and (for CHIP-14) reverse timelock conditions (must be spent prior to ...), concurrent spend conditions (must be spent in the same block as ..., and creation assertions (coin being spent was created at ...).\n\n## Conclusion\n\nAnyway, I think that covers all the key features of clvm/chialisp in reasonable detail, as long as you're not actually trying to develop actual chia scripts/contracts (in which case you need to know how conditions work in at least some detail).\n\nNote that I'm not an expert in lisp/clvm/chialisp, and have more focused on the design/potential than the details per se, so there may be errors in my understanding and/or description. No warranty, etc.",
  "actions_summary": [
    {
      "id": 2,
      "count": 3
    }
  ],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 3
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 3,
  "current_user_used_main_reaction": false
}