{
  "id": 1851,
  "name": "Steven Roose",
  "username": "stevenroose",
  "avatar_template": "/letter_avatar_proxy/v4/letter/s/8edcca/{size}.png",
  "created_at": "2024-03-11T22:38:30.955Z",
  "cooked": "<p>Using MAST for this scheme is pretty broken though. It requires all possible exit orders to be pre-calculated which is factorial. It doesn’t work with more than maybe 10 or with specialized hardware 15 participants, if I remember my math from some months ago correctly.</p>\n<p>When trying to do large sizes, like for Ark, we need an actual accumulator so that the calculation of the remainder is inside the opcode, not pre-calculated. I’ve had discussions with Salvatore about such accumulators.</p>\n<p>Some kind of append-only merke forest would work in a fraud-proof (interactive) setting. In such a scheme, every exit would take the leaf index as input and the resulting new accumulator would be the same tree with an “exit leaf” appended. If it is malicious, it can be disputed by proving either (1) the exit is not located at the given leaf index, (2) the exit was already performed and there is an exit leaf for it or (3) the resulting new accumulator is not equal the old one plus the exit leaf.</p>\n<p>Something like this would work and can be implemented using MATT or CATT.</p>",
  "post_number": 7,
  "post_type": 1,
  "updated_at": "2024-03-11T22:42:46.905Z",
  "reply_count": 0,
  "reply_to_post_number": 4,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 18,
  "readers_count": 17,
  "score": 3.6,
  "yours": false,
  "topic_id": 664,
  "topic_slug": "unilateral-exit",
  "topic_title": "Unilateral Exit",
  "topic_html_title": "Unilateral Exit",
  "category_id": 7,
  "display_username": "Steven Roose",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "ursuscamp",
    "name": "Ryan Breen",
    "avatar_template": "/user_avatar/delvingbitcoin.org/ursuscamp/{size}/39_2.png"
  },
  "bookmarked": false,
  "raw": "Using MAST for this scheme is pretty broken though. It requires all possible exit orders to be pre-calculated which is factorial. It doesn't work with more than maybe 10 or with specialized hardware 15 participants, if I remember my math from some months ago correctly.\n\nWhen trying to do large sizes, like for Ark, we need an actual accumulator so that the calculation of the remainder is inside the opcode, not pre-calculated. I've had discussions with Salvatore about such accumulators.\n\nSome kind of append-only merke forest would work in a fraud-proof (interactive) setting. In such a scheme, every exit would take the leaf index as input and the resulting new accumulator would be the same tree with an \"exit leaf\" appended. If it is malicious, it can be disputed by proving either (1) the exit is not located at the given leaf index, (2) the exit was already performed and there is an exit leaf for it or (3) the resulting new accumulator is not equal the old one plus the exit leaf.\n\nSomething like this would work and can be implemented using MATT or CATT.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 76,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}