{
  "id": 1714,
  "name": "Pieter Wuille",
  "username": "sipa",
  "avatar_template": "/user_avatar/delvingbitcoin.org/sipa/{size}/102_2.png",
  "created_at": "2024-02-27T09:19:52.677Z",
  "cooked": "<p>You’re right, I’m skipping over a few steps here.</p>\n<p>What is happening is that we’re starting from <span class=\"math\">L_{opt}</span>, and moving the prefix of <span class=\"math\">L</span> that feerate-diagram-coincides with it to its front, so that we can skip over that, and just compare the part where the diagram actually differs. If it were any more obvious than it is, the proof could just have said “without loss of generality, assume <span class=\"math\">L</span> and <span class=\"math\">L_{opt}</span> have a distinct first chunk feerate”. This part of the argument is just to show that it indeed is without loss of generality, because if there is a coinciding prefix, then applying the theorem to just the transactions not in that prefix still leads to a contradiction.</p>\n<p>This prefix <span class=\"math\">p</span> may consists of multiple chunks of <span class=\"math\">L</span>. If it consisted of 0 chunks, there is nothing to do, as <span class=\"math\">L'_{opt} = L_{opt}</span> in that case. If <span class=\"math\">p</span> consists of a single <span class=\"math\">L</span>-chunk, then just applying the gathering theorem gives our desired result (because in that case <span class=\"math\">p</span> has a feerate at least as much (and in fact, exactly equal to) the first chunk of <span class=\"math\">L_{opt}</span>).</p>\n<p>The difficulty is only when <span class=\"math\">p</span> consists of multiple chunks. But in this case, repeatedly applying the gathering theorem (to move one <span class=\"math\">L</span>-chunk worth of <span class=\"math\">p</span> subset to the front of <span class=\"math\">L_{opt}</span>) and the stripping theorem (to skip over the just moved part) gets the result. I’m happy to write it out more formally, but this informal description is perhaps more enlightening?</p>",
  "post_number": 11,
  "post_type": 1,
  "updated_at": "2024-02-27T09:32:38.228Z",
  "reply_count": 0,
  "reply_to_post_number": 10,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 2,
  "readers_count": 1,
  "score": 0.4,
  "yours": false,
  "topic_id": 202,
  "topic_slug": "cluster-mempool-definitions-theory",
  "topic_title": "Cluster mempool definitions & theory",
  "topic_html_title": "Cluster mempool definitions &amp; theory",
  "category_id": 8,
  "display_username": "Pieter Wuille",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "Crypt-iQ",
    "name": "Eugene",
    "avatar_template": "/user_avatar/delvingbitcoin.org/crypt-iq/{size}/306_2.png"
  },
  "bookmarked": false,
  "raw": "You're right, I'm skipping over a few steps here.\n\nWhat is happening is that we're starting from $L_{opt}$, and moving the prefix of $L$ that feerate-diagram-coincides with it to its front, so that we can skip over that, and just compare the part where the diagram actually differs. If it were any more obvious than it is, the proof could just have said \"without loss of generality, assume $L$ and $L_{opt}$ have a distinct first chunk feerate\". This part of the argument is just to show that it indeed is without loss of generality, because if there is a coinciding prefix, then applying the theorem to just the transactions not in that prefix still leads to a contradiction.\n\nThis prefix $p$ may consists of multiple chunks of $L$. If it consisted of 0 chunks, there is nothing to do, as $L'_{opt} = L_{opt}$ in that case. If $p$ consists of a single $L$-chunk, then just applying the gathering theorem gives our desired result (because in that case $p$ has a feerate at least as much (and in fact, exactly equal to) the first chunk of $L_{opt}$).\n\nThe difficulty is only when $p$ consists of multiple chunks. But in this case, repeatedly applying the gathering theorem (to move one $L$-chunk worth of $p$ subset to the front of $L_{opt}$) and the stripping theorem (to skip over the just moved part) gets the result. I'm happy to write it out more formally, but this informal description is perhaps more enlightening?",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 96,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}