{
  "id": 1491,
  "name": "Suhas Daftuar",
  "username": "sdaftuar",
  "avatar_template": "/letter_avatar_proxy/v4/letter/s/0ea827/{size}.png",
  "created_at": "2024-02-08T15:24:07.286Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"ismaelsadeeq\" data-post=\"1\" data-topic=\"312\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ismaelsadeeq/48/151_2.png\" class=\"avatar\"> ismaelsadeeq:</div>\n<blockquote>\n<ul>\n<li>Ignoring some data points (all transactions that have unconfirmed parents).</li>\n<li>Having some incorrect data points (assuming transactions are always confirmed because of their fee rate when sometimes they are not).</li>\n</ul>\n</blockquote>\n</aside>\n<p>I think it’s worth noting that only the second bullet here is clearly important to fix – if we have enough data points to the fee estimator from transactions that have no parents and no children in the mempool, then those transactions should be plenty for the fee estimator to give reasonable estimates.  It’s not important that we catch every transaction and understand what feerate caused it to be mined.</p>\n<p>My understanding is that it is still the case that the vast majority of confirmed transactions are in a cluster of size 1 while in the mempool, so I’d assume that if we just figured out how to avoid tracking transactions that have in-mempool descendants, that’s probably good enough for now? (Worth double-checking whether my claim is correct)</p>\n<p>However, if we think that the number of transactions appearing in a package is going to grow significantly (which is possible given all the work we’re doing on making package relay/validation work!) then I’d agree we ought to have a theoretical understanding of how fee estimation should work in that world.</p>",
  "post_number": 10,
  "post_type": 1,
  "updated_at": "2024-02-08T15:24:07.286Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 3,
  "readers_count": 2,
  "score": 0,
  "yours": false,
  "topic_id": 312,
  "topic_slug": "package-aware-fee-estimator-post-cluster-mempool",
  "topic_title": "Package aware Fee estimator post cluster mempool",
  "topic_html_title": "Package aware Fee estimator post cluster mempool",
  "category_id": 8,
  "display_username": "Suhas Daftuar",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"ismaelsadeeq, post:1, topic:312\"]\n* Ignoring some data points (all transactions that have unconfirmed parents).\n* Having some incorrect data points (assuming transactions are always confirmed because of their fee rate when sometimes they are not).\n[/quote]\n\nI think it's worth noting that only the second bullet here is clearly important to fix -- if we have enough data points to the fee estimator from transactions that have no parents and no children in the mempool, then those transactions should be plenty for the fee estimator to give reasonable estimates.  It's not important that we catch every transaction and understand what feerate caused it to be mined.\n\nMy understanding is that it is still the case that the vast majority of confirmed transactions are in a cluster of size 1 while in the mempool, so I'd assume that if we just figured out how to avoid tracking transactions that have in-mempool descendants, that's probably good enough for now? (Worth double-checking whether my claim is correct)\n\nHowever, if we think that the number of transactions appearing in a package is going to grow significantly (which is possible given all the work we're doing on making package relay/validation work!) then I'd agree we ought to have a theoretical understanding of how fee estimation should work in that world.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 95,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}