{
  "id": 1601,
  "name": "David A. Harding",
  "username": "harding",
  "avatar_template": "/user_avatar/delvingbitcoin.org/harding/{size}/6_2.png",
  "created_at": "2024-02-18T18:08:44.754Z",
  "cooked": "<p>Most onchain contracts are motivated by eliminating the counterparty risk that comes from relying on a trusted third party.  In this case, we get that benefit like usual, but I find it notable that we also (theoretically) get the benefit of not having to worry about principle actor corruption.  It’s like being able to bet for your favorite sports team without creating a temptation for the athletes on that team to bet against themselves.</p>\n<p>For example, a trusted third party arbitrating futures contracts for a centralized exchange or an oracle providing data for DLC users can only fully reproducibly use fee data from confirmed transactions—but miners can manipulate the fees in their blocks to a certain degree.  The trusted third party could use transactions from their local mempool to derive an estimated feerate range for a particular block, but miners could make that third party look unreliable by including a different set of transactions in their blocks (and this could happen accidentally if the miner received significant fees out-of-band).  With this onchain contract, miners are (in theory) incentivized to make decisions based on the candidate blocks they’re actually producing, aligning their incentive to maximize fee revenue with their incentive to maximize future contracts revenue.</p>\n<p>That said, I think a <a href=\"https://delvingbitcoin.org/t/mempool-incentive-compatibility/553#a-simple-analysis-of-a-toy-problem-14\">contemporary post</a> on this forum points to a weakness in this theoretical model: a miner with a large percentage of total network hashrate can forgo mining a transaction in a particular block and still have a realistic chance of being able to mine that transaction in one of their later blocks.  In the case of this contract, the large miner may be willing to settle this contract in their favor even if it means being unable to mine some higher feerate transactions in the current block because the large miner knows that they’ll have a chance of mining some of the excluded transactions in the next block.  A miner with a small percentage of total network hashrate doesn’t have that option: they’ll have to let the contract settle against them because their probability of getting a second chance at mining any transactions is tiny.</p>\n<p>Given the above, I suspect that widespread use of this contract might make large miners even more profitable than smaller miners, increasing centralization of mining.  I haven’t analyzed how significant of an effect that would be and I don’t have a good enough intuition to hazard a guess.</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2024-02-18T18:08:44.754Z",
  "reply_count": 2,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 10,
  "readers_count": 9,
  "score": 7.0,
  "yours": false,
  "topic_id": 547,
  "topic_slug": "an-onchain-implementation-of-mining-feerate-futures",
  "topic_title": "An Onchain Implementation Of Mining Feerate Futures",
  "topic_html_title": "An Onchain Implementation Of Mining Feerate Futures",
  "category_id": 7,
  "display_username": "David A. Harding",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Most onchain contracts are motivated by eliminating the counterparty risk that comes from relying on a trusted third party.  In this case, we get that benefit like usual, but I find it notable that we also (theoretically) get the benefit of not having to worry about principle actor corruption.  It's like being able to bet for your favorite sports team without creating a temptation for the athletes on that team to bet against themselves.\n\nFor example, a trusted third party arbitrating futures contracts for a centralized exchange or an oracle providing data for DLC users can only fully reproducibly use fee data from confirmed transactions---but miners can manipulate the fees in their blocks to a certain degree.  The trusted third party could use transactions from their local mempool to derive an estimated feerate range for a particular block, but miners could make that third party look unreliable by including a different set of transactions in their blocks (and this could happen accidentally if the miner received significant fees out-of-band).  With this onchain contract, miners are (in theory) incentivized to make decisions based on the candidate blocks they're actually producing, aligning their incentive to maximize fee revenue with their incentive to maximize future contracts revenue.\n\nThat said, I think a [contemporary post](https://delvingbitcoin.org/t/mempool-incentive-compatibility/553#a-simple-analysis-of-a-toy-problem-14) on this forum points to a weakness in this theoretical model: a miner with a large percentage of total network hashrate can forgo mining a transaction in a particular block and still have a realistic chance of being able to mine that transaction in one of their later blocks.  In the case of this contract, the large miner may be willing to settle this contract in their favor even if it means being unable to mine some higher feerate transactions in the current block because the large miner knows that they'll have a chance of mining some of the excluded transactions in the next block.  A miner with a small percentage of total network hashrate doesn't have that option: they'll have to let the contract settle against them because their probability of getting a second chance at mining any transactions is tiny.\n\nGiven the above, I suspect that widespread use of this contract might make large miners even more profitable than smaller miners, increasing centralization of mining.  I haven't analyzed how significant of an effect that would be and I don't have a good enough intuition to hazard a guess.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 6,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}