{
  "id": 1591,
  "name": "arshbot",
  "username": "arshbot",
  "avatar_template": "/user_avatar/delvingbitcoin.org/arshbot/{size}/363_2.png",
  "created_at": "2024-02-16T21:12:50.736Z",
  "cooked": "<p>Thinking through this, I think I can propose a few ways forward. Before that, let me shed a bit of context.</p>\n<blockquote>\n<p>Devs propose → Miners Activate → Users override</p>\n</blockquote>\n<p>Sounds nice in theory, but to <a class=\"mention\" href=\"/u/roasbeef\">@roasbeef</a>’s point, it doesn’t work anymore. Let’s explore why.</p>\n<p>Let’s break down the relationship Devs propose → Miners Activate for a moment. As it stands, this relationship doesn’t highlight the decision maker. It implies Miners are decision makers, but I don’t know if that’s true. From my conversations and research into how the taproot softfork was activated, it seems like miners had opinions (overwhelmingly positive for some reason), but still waited for a push. That push came in the form of Alejandro De La Torre which led to public signaling, which led to devs conversing and debating instead of “if we should taproot”, then “how we should taproot”. An important distinction.</p>\n<p>Okay, so it’s not so much Devs propose → Miners Activate, it’s more like (assuming only happy paths):</p>\n<pre data-code-wrap=\"mermaid\"><code class=\"lang-mermaid\">sequenceDiagram\n    Devs -&gt;&gt;+ Devs: Concensus on Final Proposal\n    Devs-&gt;&gt;+Miners: Final Proposal for Consideration\n    Miners-&gt;&gt;+Devs: Signal Agreement\n    Devs-&gt;&gt;+Miners: Proposal for Activation\n    Miners-&gt;&gt;+Devs: Activation\n</code></pre>\n<p>We have not reached the step where we communicate a proposal to miners. We haven’t done it in the traditional sense (merging the thing into bitcoind), we haven’t done it in the non traditional sense (everyone screaming on every bitcoin media, including this one).</p>\n<p>That is because we, developers lack the ability the come to a consensus. Frankly, Miners aren’t to blame on this one. As much as I’d like to blame the user community for their fiery commentary and politicking and divisiveness, it isn’t them either. In fact, they’re a symptom of the cause just like our indecisiveness is.</p>\n<h2><a name=\"potential-solutions-1\" class=\"anchor\" href=\"#potential-solutions-1\"></a>Potential Solutions</h2>\n<p>The cause is right in the post that started this, and we need to talk about it plainly. We lack trusted figures to champion causes or judge iterations until they are sound, and because of this, us developers are frozen on any issues of significance. We could explore a replacement for them at the user layer, but I’ll hold off on that for now.</p>\n<p>I don’t love the concept myself, but let’s explore the alternatives for governance.</p>\n<p>Fundamentally there are two buckets of solutions here. Direct democracy or representative democracy. Bitcoiners do not necessarily believe in democracy for Bitcoin. It is a tool with ideals and those ideals must be maintained at all costs, regardless of public opinion.</p>\n<p>That last caveat more or less kills any form of direct democracy. In any form of unimpeded voting it is possible for a majority (honest or not) to lobby for the changing of core ideals easily, and that is unacceptable.</p>\n<p>There are many forms of representative democracies, many of which have been adopted by alternative coins. They represent based on investment in the project, number of nodes run, etc. These options are representative democracies where the barrier to entry is technical or financial and the enforcement is code. There are also foundations that can be constructed to provide extracode enforcement in a formal manner so the second things break down (like now), they are promptly fixed.</p>\n<h2><a name=\"trusted-figures-what-are-they-2\" class=\"anchor\" href=\"#trusted-figures-what-are-they-2\"></a>Trusted Figures… what are they?</h2>\n<p>All of the above actions have pros and cons worth discussing, but I will leave that to others in this thread. An informal representative democracies by trusted figures, which we’ve had so far is particularly interesting. In the past, our trusted figures were more or less early cypherpunks who worked on bitcoin. They garnered the trust because for most others, they were <em>available</em> and <em>knowledgable</em> about this mysterious new tech, and stayed involved. We have people like that now, but why haven’t those chairs been filled?</p>\n<p>This system in particular is well suited for the only caveat I’ve added here: we must maintain our ideals at all costs. Trusted figures have always held and enforced those rules with ruthless consistency. This system is also incredibly fragile. Because of informality, it’s immediately unclear when a trusted chair’s post has been vacated let alone how to fill it again. We’re at a point where we’re not even sure if there any more left.</p>\n<h2><a name=\"how-do-we-fill-the-chairs-3\" class=\"anchor\" href=\"#how-do-we-fill-the-chairs-3\"></a>How Do We Fill the Chairs?</h2>\n<p>The informality of chairs filled by trusted figures has lost it’s shine. If we must maintain that informality, it must be with intent at least. If we are to choose new chairs, they should have at least the following attributes among the obvious.</p>\n<ul>\n<li>Moral opinions in line with our chosen ethos</li>\n<li>Track record of care for Bitcoin</li>\n<li>Incredible proficiency in game theory. Among the trusted chair’s chief roles is to identify abuse vectors</li>\n</ul>\n<p>Please extend/modify this list.</p>\n<p>If we are to choose new chairs, it must be an election of some kind, informal or otherwise. Hoping for the chairs to be filled naturally hasn’t worked. There are too many of us with differing values for any group to see the field well. The election should likely appoint the winner to a post of consequence like the following:</p>\n<ul>\n<li>Head maintainer of a repo of value; bitcoind, bips, etc</li>\n<li>Chair of some nonprofit org aiming to represent bitcoin developers</li>\n</ul>\n<p>Please extend/modify this list.</p>\n<h2><a name=\"conclusion-4\" class=\"anchor\" href=\"#conclusion-4\"></a>Conclusion</h2>\n<p>It is clear we’re paralyzed on anything of substance. We need trusted people who say “No, here’s what’s wrong” so iterations can be made so they can finally say “Yes, this can be merged”. We have plenty of people ACKing, but those who should be saying “No” are silent.</p>\n<p>Above I list a few alternative paths we could take and make a stab at defining trusted figured better and how we might go about removing the vagueness around the role and how we might fill the position ourselves.</p>",
  "post_number": 25,
  "post_type": 1,
  "updated_at": "2024-02-16T21:12:50.736Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 10,
  "readers_count": 9,
  "score": 1.8,
  "yours": false,
  "topic_id": 334,
  "topic_slug": "on-consensus-changes-in-bitcoin-2024",
  "topic_title": "On consensus changes in bitcoin 2024",
  "topic_html_title": "On consensus changes in bitcoin 2024",
  "category_id": 5,
  "display_username": "arshbot",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Thinking through this, I think I can propose a few ways forward. Before that, let me shed a bit of context.\n\n> Devs propose → Miners Activate → Users override\n \nSounds nice in theory, but to @roasbeef's point, it doesn’t work anymore. Let's explore why.\n\nLet’s break down the relationship Devs propose → Miners Activate for a moment. As it stands, this relationship doesn't highlight the decision maker. It implies Miners are decision makers, but I don't know if that's true. From my conversations and research into how the taproot softfork was activated, it seems like miners had opinions (overwhelmingly positive for some reason), but still waited for a push. That push came in the form of Alejandro De La Torre which led to public signaling, which led to devs conversing and debating instead of \"if we should taproot\", then \"how we should taproot\". An important distinction.\n\nOkay, so it's not so much Devs propose → Miners Activate, it's more like (assuming only happy paths):\n\n```mermaid height\nsequenceDiagram\n    Devs ->>+ Devs: Concensus on Final Proposal\n    Devs->>+Miners: Final Proposal for Consideration\n    Miners->>+Devs: Signal Agreement\n    Devs->>+Miners: Proposal for Activation\n    Miners->>+Devs: Activation\n  ```\n\nWe have not reached the step where we communicate a proposal to miners. We haven't done it in the traditional sense (merging the thing into bitcoind), we haven't done it in the non traditional sense (everyone screaming on every bitcoin media, including this one).\n\nThat is because we, developers lack the ability the come to a consensus. Frankly, Miners aren't to blame on this one. As much as I'd like to blame the user community for their fiery commentary and politicking and divisiveness, it isn't them either. In fact, they're a symptom of the cause just like our indecisiveness is.\n\n## Potential Solutions\n\nThe cause is right in the post that started this, and we need to talk about it plainly. We lack trusted figures to champion causes or judge iterations until they are sound, and because of this, us developers are frozen on any issues of significance. We could explore a replacement for them at the user layer, but I'll hold off on that for now.\n\nI don't love the concept myself, but let's explore the alternatives for governance.\n\nFundamentally there are two buckets of solutions here. Direct democracy or representative democracy. Bitcoiners do not necessarily believe in democracy for Bitcoin. It is a tool with ideals and those ideals must be maintained at all costs, regardless of public opinion.\n\nThat last caveat more or less kills any form of direct democracy. In any form of unimpeded voting it is possible for a majority (honest or not) to lobby for the changing of core ideals easily, and that is unacceptable.\n\nThere are many forms of representative democracies, many of which have been adopted by alternative coins. They represent based on investment in the project, number of nodes run, etc. These options are representative democracies where the barrier to entry is technical or financial and the enforcement is code. There are also foundations that can be constructed to provide extracode enforcement in a formal manner so the second things break down (like now), they are promptly fixed.\n\n## Trusted Figures... what are they?\n\nAll of the above actions have pros and cons worth discussing, but I will leave that to others in this thread. An informal representative democracies by trusted figures, which we've had so far is particularly interesting. In the past, our trusted figures were more or less early cypherpunks who worked on bitcoin. They garnered the trust because for most others, they were _available_ and _knowledgable_ about this mysterious new tech, and stayed involved. We have people like that now, but why haven't those chairs been filled?\n\nThis system in particular is well suited for the only caveat I've added here: we must maintain our ideals at all costs. Trusted figures have always held and enforced those rules with ruthless consistency. This system is also incredibly fragile. Because of informality, it's immediately unclear when a trusted chair's post has been vacated let alone how to fill it again. We're at a point where we're not even sure if there any more left.\n\n## How Do We Fill the Chairs?\n\nThe informality of chairs filled by trusted figures has lost it's shine. If we must maintain that informality, it must be with intent at least. If we are to choose new chairs, they should have at least the following attributes among the obvious.\n\n- Moral opinions in line with our chosen ethos\n- Track record of care for Bitcoin\n- Incredible proficiency in game theory. Among the trusted chair's chief roles is to identify abuse vectors\n\nPlease extend/modify this list.\n\nIf we are to choose new chairs, it must be an election of some kind, informal or otherwise. Hoping for the chairs to be filled naturally hasn't worked. There are too many of us with differing values for any group to see the field well. The election should likely appoint the winner to a post of consequence like the following:\n\n- Head maintainer of a repo of value; bitcoind, bips, etc\n- Chair of some nonprofit org aiming to represent bitcoin developers\n\nPlease extend/modify this list.\n\n## Conclusion\n\nIt is clear we're paralyzed on anything of substance. We need trusted people who say \"No, here's what's wrong\" so iterations can be made so they can finally say \"Yes, this can be merged\". We have plenty of people ACKing, but those who should be saying \"No\" are silent.\n\nAbove I list a few alternative paths we could take and make a stab at defining trusted figured better and how we might go about removing the vagueness around the role and how we might fill the position ourselves.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 235,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}