{
  "id": 1659,
  "name": "Rusty Russell",
  "username": "rustyrussell",
  "avatar_template": "/user_avatar/delvingbitcoin.org/rustyrussell/{size}/154_2.png",
  "created_at": "2024-02-22T02:45:53.042Z",
  "cooked": "<p>Thanks for this excellent summary:  I learned a lot!</p>\n<h1><a name=\"on-greedy-vs-wait-for-miners-1\" class=\"anchor\" href=\"#on-greedy-vs-wait-for-miners-1\"></a>On greedy vs wait for Miners</h1>\n<p>If we step back for a moment, we realize that all timeout-based protocols assume (and require!) miners take a greedy approach, as it is a subset of the “no censorship” assumption.</p>\n<p>If a miner considers waiting for a future larger reward, timeouts get broken.  Moreover, it’s a trivial step for miners to consider <em>potential</em> future rewards even if they don’t see them yet: knowing a deadline approaches and deferring a tx will usually cause it to bid upwards, and then after the deadline a bidding war will begin between the parties.</p>\n<p>Fortunately, the actual divergence from miner incentives here is fairly narrow in practice, as these extreme examples do not regularly occur.  Bitcoin software also doesn’t mine backwards even in the case of a large fee double-spend, and I haven’t seen anyone complaining about that.  Similarly, I suggest leaving this door firmly closed.</p>\n<h1><a name=\"on-mempool-as-a-linearization-fantasy-2\" class=\"anchor\" href=\"#on-mempool-as-a-linearization-fantasy-2\"></a>On Mempool As a Linearization Fantasy</h1>\n<p>A subset of these problems (though definitely not all of them!) seems to come from the requirement that the mempool be consistent.  If it were a simple collection of potentially incompatible but all possibly-valid transactions, and selection were made at block creation time, we would be able to trade some problems for others.  We would need, however, some other mechanism for DoS protection.</p>\n<h1><a name=\"the-hysteresis-approach-to-rbf-bypass-3\" class=\"anchor\" href=\"#the-hysteresis-approach-to-rbf-bypass-3\"></a>The Hysteresis Approach to RBF Bypass</h1>\n<p>I wanted to mention what is still my current favorite solution in the replacement wars: that RBF rules be bypassed in favor of a simpler “higher feerate” iff all the replaced txs would not have been in the successive block, and all new ones are.  This addresses both the sharp end of RBF complaints in a multi-party scenario (blocking progress) and the sharp end of miner incentive (getting those juicy fees).  [Aside: ISTR someone had a critique of this approach, but I can’t find the link? Help?!]</p>\n<p>There are some potential replay games to be played on the low end of the current block, but this is difficult to do in practice (other txs must push you out), and the game is terminated when a new block is made.  If necessary, hysteresis can be added (e.g. replaced txs must be more than 1.5 blocks back, new txs must be in first 1.0 blocks of mempool), but I’m not sure that’s required.</p>\n<h1><a name=\"unrelated-transaction-propagation-dos-principles-4\" class=\"anchor\" href=\"#unrelated-transaction-propagation-dos-principles-4\"></a>Unrelated Transaction Propagation DoS Principles</h1>\n<p>It’s possible to consider a different approach to tx propagation, with a more direct correlation with miner incentives: In theory, high-fee txs should propagate faster than low-fee txs.</p>\n<p>This, of course, reintroduces many of the issues you discussed here, and is still not sufficient:</p>\n<ol>\n<li>You still don’t want 1,000 (clashing) txs even if they are all offering top-dollar: you need <em>some</em> rbf-style limits.</li>\n<li>You actually want to defer <em>evaluating</em> txs if they’re low-enough fee, but you can’t actually figure out feerates without UTXO lookup which is much of the expense.  This seems to require that the feerate be sent with the tx, included in the WTXID.</li>\n</ol>\n<p>Some of these points are probably too-radical a departure from existing practice to be worth serious consideration, but maybe someone smarter than me will feel inspired to explore them further <img src=\"https://delvingbitcoin.org/images/emoji/twitter/orange_heart.png?v=12\" title=\":orange_heart:\" class=\"emoji\" alt=\":orange_heart:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>",
  "post_number": 4,
  "post_type": 1,
  "updated_at": "2024-02-22T02:45:53.042Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 15,
  "readers_count": 14,
  "score": 22.8,
  "yours": false,
  "topic_id": 553,
  "topic_slug": "mempool-incentive-compatibility",
  "topic_title": "Mempool Incentive Compatibility",
  "topic_html_title": "Mempool Incentive Compatibility",
  "category_id": 7,
  "display_username": "Rusty Russell",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Thanks for this excellent summary:  I learned a lot!\n\n# On greedy vs wait for Miners\n\nIf we step back for a moment, we realize that all timeout-based protocols assume (and require!) miners take a greedy approach, as it is a subset of the \"no censorship\" assumption.\n\nIf a miner considers waiting for a future larger reward, timeouts get broken.  Moreover, it's a trivial step for miners to consider *potential* future rewards even if they don't see them yet: knowing a deadline approaches and deferring a tx will usually cause it to bid upwards, and then after the deadline a bidding war will begin between the parties.\n\nFortunately, the actual divergence from miner incentives here is fairly narrow in practice, as these extreme examples do not regularly occur.  Bitcoin software also doesn't mine backwards even in the case of a large fee double-spend, and I haven't seen anyone complaining about that.  Similarly, I suggest leaving this door firmly closed.\n\n# On Mempool As a Linearization Fantasy\n\nA subset of these problems (though definitely not all of them!) seems to come from the requirement that the mempool be consistent.  If it were a simple collection of potentially incompatible but all possibly-valid transactions, and selection were made at block creation time, we would be able to trade some problems for others.  We would need, however, some other mechanism for DoS protection.\n\n# The Hysteresis Approach to RBF Bypass\n\nI wanted to mention what is still my current favorite solution in the replacement wars: that RBF rules be bypassed in favor of a simpler \"higher feerate\" iff all the replaced txs would not have been in the successive block, and all new ones are.  This addresses both the sharp end of RBF complaints in a multi-party scenario (blocking progress) and the sharp end of miner incentive (getting those juicy fees).  [Aside: ISTR someone had a critique of this approach, but I can't find the link? Help?!]\n\nThere are some potential replay games to be played on the low end of the current block, but this is difficult to do in practice (other txs must push you out), and the game is terminated when a new block is made.  If necessary, hysteresis can be added (e.g. replaced txs must be more than 1.5 blocks back, new txs must be in first 1.0 blocks of mempool), but I'm not sure that's required.\n\n# Unrelated Transaction Propagation DoS Principles\n\nIt's possible to consider a different approach to tx propagation, with a more direct correlation with miner incentives: In theory, high-fee txs should propagate faster than low-fee txs.\n\nThis, of course, reintroduces many of the issues you discussed here, and is still not sufficient:\n1. You still don't want 1,000 (clashing) txs even if they are all offering top-dollar: you need *some* rbf-style limits.\n2. You actually want to defer *evaluating* txs if they're low-enough fee, but you can't actually figure out feerates without UTXO lookup which is much of the expense.  This seems to require that the feerate be sent with the tx, included in the WTXID.\n\nSome of these points are probably too-radical a departure from existing practice to be worth serious consideration, but maybe someone smarter than me will feel inspired to explore them further :orange_heart:",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 137,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false
}