{
  "id": 1622,
  "name": "Evan Winget",
  "username": "EvanWinget",
  "avatar_template": "/user_avatar/delvingbitcoin.org/evanwinget/{size}/365_2.png",
  "created_at": "2024-02-20T01:44:28.475Z",
  "cooked": "<p>Thanks for the suggestion! rearden_code pointed me there from Twitter as well, I had missed this mailing list post last fall and it’s a good read.  Peter’s proposal for how this could be implemented is preferable to the proposal that I had in mind. Very different motivation behind his proposal, and ultimately I think this strengthens the case for adding an op code that enables transaction expiration.</p>\n<p>One note on the OP_EXPIRE conversation is that Peter shared: “Time-based anything is sketchy, as it could give miners incentives to lie about\nthe current time in the nTime field. If anything, the fact that nLockTime can\nin fact be time-based was a design mistake.”</p>\n<p>I agree with him that block height is strongly preferable to block time for the reason that miners can’t misrepresent the block height.</p>\n<p>Interestingly though, if we <em>are</em> going to keep around timestamp based time locks (and I’ve not seen any indication anyone is going to really push to remove them), then I think that having timestamp based transaction expiration helps to balance economic incentives for miners.</p>\n<p>In the current world we only have timestamp-based time locks and a miner wants to include the highest fee rate tx in their block. They may be incentivized to put a lower-than-accurate nTime in the block header such that they can include transactions that should only become valid at a future time. If we had an op code that could declare a max block time in which the transaction is valid and the mempool had a mixture of high fee rate transactions with expiration times and lock times, the miner would want to pull nTime forward for the time locks but push nTime backwards to include soon-to-expire transactions.</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2024-02-20T02:12:32.910Z",
  "reply_count": 0,
  "reply_to_post_number": 2,
  "quote_count": 0,
  "incoming_link_count": 1,
  "reads": 16,
  "readers_count": 15,
  "score": 8.0,
  "yours": false,
  "topic_id": 581,
  "topic_slug": "op-checkmaxtimeverify",
  "topic_title": "Op_checkmaxtimeverify",
  "topic_html_title": "Op_checkmaxtimeverify",
  "category_id": 7,
  "display_username": "Evan Winget",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "ProofOfKeags",
    "name": "ProofOfKeags",
    "avatar_template": "/user_avatar/delvingbitcoin.org/proofofkeags/{size}/156_2.png"
  },
  "bookmarked": false,
  "raw": "Thanks for the suggestion! rearden_code pointed me there from Twitter as well, I had missed this mailing list post last fall and it's a good read.  Peter's proposal for how this could be implemented is preferable to the proposal that I had in mind. Very different motivation behind his proposal, and ultimately I think this strengthens the case for adding an op code that enables transaction expiration.\n\nOne note on the OP_EXPIRE conversation is that Peter shared: \"Time-based anything is sketchy, as it could give miners incentives to lie about\nthe current time in the nTime field. If anything, the fact that nLockTime can\nin fact be time-based was a design mistake.\"\n\nI agree with him that block height is strongly preferable to block time for the reason that miners can't misrepresent the block height.\n\nInterestingly though, if we *are* going to keep around timestamp based time locks (and I've not seen any indication anyone is going to really push to remove them), then I think that having timestamp based transaction expiration helps to balance economic incentives for miners.\n\nIn the current world we only have timestamp-based time locks and a miner wants to include the highest fee rate tx in their block. They may be incentivized to put a lower-than-accurate nTime in the block header such that they can include transactions that should only become valid at a future time. If we had an op code that could declare a max block time in which the transaction is valid and the mempool had a mixture of high fee rate transactions with expiration times and lock times, the miner would want to pull nTime forward for the time locks but push nTime backwards to include soon-to-expire transactions.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 304,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}