{
  "id": 1689,
  "name": "Rusty Russell",
  "username": "rustyrussell",
  "avatar_template": "/user_avatar/delvingbitcoin.org/rustyrussell/{size}/154_2.png",
  "created_at": "2024-02-25T03:56:28.656Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"sdaftuar\" data-post=\"14\" data-topic=\"553\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/s/0ea827/48.png\" class=\"avatar\"> sdaftuar:</div>\n<blockquote>\n<p><a class=\"mention\" href=\"/u/rustyrussell\">@rustyrussell</a> Sorry for the transaction size typo; I corrected my earlier post and added a footnote mentioning the error. With that correction made, do you still find the example objectionable?</p>\n</blockquote>\n</aside>\n<p>Sorry, I should have filtered that myself!  All good, thanks!</p>\n<aside class=\"quote no-group\" data-username=\"sdaftuar\" data-post=\"14\" data-topic=\"553\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/s/0ea827/48.png\" class=\"avatar\"> sdaftuar:</div>\n<blockquote>\n<p>Is there any entry in this table that you’d disagree with?</p>\n</blockquote>\n</aside>\n<p>I’m still kind of nerd crushing on the clarity of your post, TBH.  It’s really nice! <img src=\"https://delvingbitcoin.org/images/emoji/twitter/orange_heart.png?v=12\" title=\":orange_heart:\" class=\"emoji\" alt=\":orange_heart:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>FDP  “probably rejects some incentive compatible” is trivially Yes, I think?  In a flat mempool a miner should accept a 64 byte tx which pays a greater feerate than a larger tx it replaces.  It’s not immediately clear to how we would <em>quantify</em> it, but I suspect that the total fee rule makes FDP less incentive compatible in realistic scenarios than NBP.</p>\n<p>Secondly, DoS resistance is not a binary.  I’m not sure we’d be happy with the traffic increase if every tx RBF-stomped its way through the mempool in currently-allowed minimal increments?  (To be fair, I haven’t calculated this in detail!).  On the other hand, if we allowed a possible violation of the “must pay your way” rule which was difficult to execute in practice (such as filling the second block and hoping it doesn’t get mined before you replace it with the first block) we might be able to convince ourselves it’s not too bad statistically.  Especially since we can adjust this, somewhat, by using greater hysteresis (e.g. you get an exception if you’re going from &gt; 2 blocks in to &lt; 0.5 block in the mempool, etc).</p>\n<p>My main issue with this table, though, is the missing column is the one I care about!  That’s the adversarial case.</p>\n<p>And while v3 is a useful hack for CPFP, we <em>don’t want</em> CPFP as fees rise: we want inline fees and we want to stack multiple txs as much as possible to share the fee in/out (presumably using future covenant tech), but this means v3 doesn’t help us <img src=\"https://delvingbitcoin.org/images/emoji/twitter/frowning.png?v=12\" title=\":frowning:\" class=\"emoji\" alt=\":frowning:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<aside class=\"quote no-group\" data-username=\"sdaftuar\" data-post=\"14\" data-topic=\"553\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/letter_avatar_proxy/v4/letter/s/0ea827/48.png\" class=\"avatar\"> sdaftuar:</div>\n<blockquote>\n<p>I don’t know if the Next Block Policy proposal would also layer on the Feerate Diagram Policy when considering replacements that wouldn’t touch the top block; if so then the answer here should be “maybe”.</p>\n</blockquote>\n</aside>\n<p>Yes, I was initially assuming a carveout for the sharpest case where we currently clash with miner incentives, which is things going in the top block (also enables clients to have a Grug-like RBF model of “not in block yet, Grug pay more!” which suits my abilities).  I think this would also apply to FDP, which has the same issue.</p>\n<p>But I think to evaluate it we need to know:</p>\n<ol>\n<li>how much of a DoS we are opening,</li>\n<li>how incentive compatible it really is (given an non-infinite discount on future blocks, sigh), and</li>\n<li>how much does it really help against the adversarial case.</li>\n</ol>\n<p>(1) and (3) seem to require some mempool model and maybe a propagation model and a major thesis or three…</p>",
  "post_number": 15,
  "post_type": 1,
  "updated_at": "2024-02-25T03:56:28.656Z",
  "reply_count": 0,
  "reply_to_post_number": 14,
  "quote_count": 1,
  "incoming_link_count": 2,
  "reads": 8,
  "readers_count": 7,
  "score": 11.4,
  "yours": false,
  "topic_id": 553,
  "topic_slug": "mempool-incentive-compatibility",
  "topic_title": "Mempool Incentive Compatibility",
  "topic_html_title": "Mempool Incentive Compatibility",
  "category_id": 7,
  "display_username": "Rusty Russell",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"sdaftuar, post:14, topic:553\"]\n@rustyrussell Sorry for the transaction size typo; I corrected my earlier post and added a footnote mentioning the error. With that correction made, do you still find the example objectionable?\n[/quote]\n\nSorry, I should have filtered that myself!  All good, thanks!\n\n[quote=\"sdaftuar, post:14, topic:553\"]\nIs there any entry in this table that you’d disagree with?\n[/quote]\n\nI'm still kind of nerd crushing on the clarity of your post, TBH.  It's really nice! :orange_heart: \n\nFDP  \"probably rejects some incentive compatible\" is trivially Yes, I think?  In a flat mempool a miner should accept a 64 byte tx which pays a greater feerate than a larger tx it replaces.  It's not immediately clear to how we would *quantify* it, but I suspect that the total fee rule makes FDP less incentive compatible in realistic scenarios than NBP.\n\nSecondly, DoS resistance is not a binary.  I'm not sure we'd be happy with the traffic increase if every tx RBF-stomped its way through the mempool in currently-allowed minimal increments?  (To be fair, I haven't calculated this in detail!).  On the other hand, if we allowed a possible violation of the \"must pay your way\" rule which was difficult to execute in practice (such as filling the second block and hoping it doesn't get mined before you replace it with the first block) we might be able to convince ourselves it's not too bad statistically.  Especially since we can adjust this, somewhat, by using greater hysteresis (e.g. you get an exception if you're going from > 2 blocks in to < 0.5 block in the mempool, etc).\n\nMy main issue with this table, though, is the missing column is the one I care about!  That's the adversarial case.\n\nAnd while v3 is a useful hack for CPFP, we *don't want* CPFP as fees rise: we want inline fees and we want to stack multiple txs as much as possible to share the fee in/out (presumably using future covenant tech), but this means v3 doesn't help us :(\n\n[quote=\"sdaftuar, post:14, topic:553\"]\nI don’t know if the Next Block Policy proposal would also layer on the Feerate Diagram Policy when considering replacements that wouldn’t touch the top block; if so then the answer here should be “maybe”.\n[/quote]\n\nYes, I was initially assuming a carveout for the sharpest case where we currently clash with miner incentives, which is things going in the top block (also enables clients to have a Grug-like RBF model of \"not in block yet, Grug pay more!\" which suits my abilities).  I think this would also apply to FDP, which has the same issue.  \n\nBut I think to evaluate it we need to know:\n1) how much of a DoS we are opening,\n2) how incentive compatible it really is (given an non-infinite discount on future blocks, sigh), and \n3) how much does it really help against the adversarial case.  \n\n(1) and (3) seem to require some mempool model and maybe a propagation model and a major thesis or three...",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 137,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}