{
  "id": 1522,
  "name": "moonsettler",
  "username": "moonsettler",
  "avatar_template": "/user_avatar/delvingbitcoin.org/moonsettler/{size}/38_2.png",
  "created_at": "2024-02-12T16:42:23.441Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"thunderbiscuit\" data-post=\"1\" data-topic=\"506\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/thunderbiscuit/48/32_2.png\" class=\"avatar\"> thunderbiscuit:</div>\n<blockquote>\n<p>Because this token is valid and has good privacy propeties, it might be accepted as payment by others. Alice can pay Bob with the token <code>(C, message)</code> and Bob can redeem the token with Mike, who has no idea an exchange was made between the two.</p>\n</blockquote>\n</aside>\n<p>in the basic scheme there is no way to verify the signature is correct by anyone but the mint. there is also no one else that can tell if it’s a double spend.</p>\n<p>since the mint is the only one that can tell if a signature is his or that it’s not a double spend, this also means he has the ability to commit fraud and claim that a token has already been spent and was known to him.</p>\n<p>fraud proofs are possible to be carried out in front of an arbitration body or the public, in a challenge response manner, that requires a different multi-step sequence of issuance and redemption.</p>\n<p>the DLEQ proof given by the cashu mint (to avoid any potential secret tagging, ie the mint using different keys for each token) can be used to prove the mint’s private key was used to create the token, which is a valid token, BUT to prove that you have to reveal your blinding factor undoing the unlikability of issuance and redemption.</p>\n<p>it is theoretically possible to transfer ecash tokens offline between parties or similarly to how the hawala network works, that requires the secret to be a hash of additional spend conditions enforced by the mint. therefore implementing pubkey spend, time locked redeem ‘scripts’. this ofc hurts fungibility pretty bad.</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2024-02-12T16:47:19.070Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 4,
  "readers_count": 3,
  "score": 0.8,
  "yours": false,
  "topic_id": 506,
  "topic_slug": "building-intuition-for-the-cashu-blind-signature-scheme",
  "topic_title": "Building Intuition for the Cashu Blind Signature Scheme",
  "topic_html_title": "Building Intuition for the Cashu Blind Signature Scheme",
  "category_id": 7,
  "display_username": "moonsettler",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"thunderbiscuit, post:1, topic:506\"]\nBecause this token is valid and has good privacy propeties, it might be accepted as payment by others. Alice can pay Bob with the token `(C, message)` and Bob can redeem the token with Mike, who has no idea an exchange was made between the two.\n[/quote]\n\nin the basic scheme there is no way to verify the signature is correct by anyone but the mint. there is also no one else that can tell if it's a double spend.\n\nsince the mint is the only one that can tell if a signature is his or that it's not a double spend, this also means he has the ability to commit fraud and claim that a token has already been spent and was known to him.\n\nfraud proofs are possible to be carried out in front of an arbitration body or the public, in a challenge response manner, that requires a different multi-step sequence of issuance and redemption.\n\nthe DLEQ proof given by the cashu mint (to avoid any potential secret tagging, ie the mint using different keys for each token) can be used to prove the mint's private key was used to create the token, which is a valid token, BUT to prove that you have to reveal your blinding factor undoing the unlikability of issuance and redemption.\n\nit is theoretically possible to transfer ecash tokens offline between parties or similarly to how the hawala network works, that requires the secret to be a hash of additional spend conditions enforced by the mint. therefore implementing pubkey spend, time locked redeem 'scripts'. this ofc hurts fungibility pretty bad.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 48,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}