{
  "id": 1668,
  "name": "Suhas Daftuar",
  "username": "sdaftuar",
  "avatar_template": "/letter_avatar_proxy/v4/letter/s/0ea827/{size}.png",
  "created_at": "2024-02-22T10:31:53.558Z",
  "cooked": "<p>Yes, I agree that we need to be mindful of the validation costs of RBF and impose RBF limits to prevent those costs from being too high.</p>\n<p>There are two differences between validation of RBF transactions and non-RBF transactions:</p>\n<ol>\n<li>\n<p>RBF transactions require re-clustering and relinearizing all the clusters which have seen evictions.  (Re-clustering is an <span class=\"math\">O(n)</span> operation in the number of transactions, and roughly speaking we can bound re-linearization cost to <span class=\"math\">O(n^2)</span> in the number of transactions in a single cluster.)</p>\n</li>\n<li>\n<p>Doing a feerate diagram comparison of the old vs the new clusters.  This is linear in the number of chunks of the two diagrams (which is bounded by the number of transactions in the clusters that the diagrams come from).</p>\n</li>\n</ol>\n<p>Today’s RBF rules (BIP 125) impose a limit on the number of total transactions that would be evicted by a single replacement at 100. For cluster mempool, if we limited the number of direct conflicts a single transaction could have at 100, and if clusters end up being limited to at most 100 transactions, then this might be good enough – effectively bounding the number of extra linearizations at 100 and the size of a feerate diagram comparison to 10,000 entries.  But we’ll get a better sense of this as we do more benchmarking – if this is too many, we could do some kind of more precise calculation of how many clusters are being relinearized and how many entries the feerate diagram has, and bound things based on the exact numbers we care about limiting so that validating a single transaction is not too expensive.</p>",
  "post_number": 22,
  "post_type": 1,
  "updated_at": "2024-02-22T10:31:53.558Z",
  "reply_count": 0,
  "reply_to_post_number": 21,
  "quote_count": 0,
  "incoming_link_count": 1,
  "reads": 9,
  "readers_count": 8,
  "score": 21.8,
  "yours": false,
  "topic_id": 393,
  "topic_slug": "an-overview-of-the-cluster-mempool-proposal",
  "topic_title": "An overview of the cluster mempool proposal",
  "topic_html_title": "An overview of the cluster mempool proposal",
  "category_id": 8,
  "display_username": "Suhas Daftuar",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "hebasto",
    "name": "Hennadii Stepanov",
    "avatar_template": "/user_avatar/delvingbitcoin.org/hebasto/{size}/366_2.png"
  },
  "bookmarked": false,
  "raw": "Yes, I agree that we need to be mindful of the validation costs of RBF and impose RBF limits to prevent those costs from being too high.\n\nThere are two differences between validation of RBF transactions and non-RBF transactions:\n\n1) RBF transactions require re-clustering and relinearizing all the clusters which have seen evictions.  (Re-clustering is an $O(n)$ operation in the number of transactions, and roughly speaking we can bound re-linearization cost to $O(n^2)$ in the number of transactions in a single cluster.)\n\n2) Doing a feerate diagram comparison of the old vs the new clusters.  This is linear in the number of chunks of the two diagrams (which is bounded by the number of transactions in the clusters that the diagrams come from).\n\nToday's RBF rules (BIP 125) impose a limit on the number of total transactions that would be evicted by a single replacement at 100. For cluster mempool, if we limited the number of direct conflicts a single transaction could have at 100, and if clusters end up being limited to at most 100 transactions, then this might be good enough -- effectively bounding the number of extra linearizations at 100 and the size of a feerate diagram comparison to 10,000 entries.  But we'll get a better sense of this as we do more benchmarking -- if this is too many, we could do some kind of more precise calculation of how many clusters are being relinearized and how many entries the feerate diagram has, and bound things based on the exact numbers we care about limiting so that validating a single transaction is not too expensive.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 95,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false
}