{
  "id": 5221,
  "name": "Bastien Teinturier",
  "username": "t-bast",
  "avatar_template": "/user_avatar/delvingbitcoin.org/t-bast/{size}/98_2.png",
  "created_at": "2025-06-05T07:42:57.381Z",
  "cooked": "<p>Thanks for the write-up <a class=\"mention\" href=\"/u/roasbeef\">@roasbeef</a> <img src=\"https://delvingbitcoin.org/images/emoji/twitter/folded_hands.png?v=14\" title=\":folded_hands:\" class=\"emoji\" alt=\":folded_hands:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<aside class=\"quote no-group\" data-username=\"roasbeef\" data-post=\"24\" data-topic=\"1723\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/roasbeef/48/160_2.png\" class=\"avatar\"> roasbeef:</div>\n<blockquote>\n<p>Personally, I favor: the self identifying encoding, with either just the actual value, or buckets (100ms?).</p>\n</blockquote>\n</aside>\n<p>What do you mean by “self identifying encoding”? The encoding you’re describing in your “Flexibility Middle Ground” section?</p>\n<p>My personal opinion is that privacy is very important and needs to be protected. We chose from the beginning of the project to use onion routing because this was important to us (“us” meaning developers of the network). I strongly favor privacy over speed (within reasonable latency bounds of course): the goal of the lightning network in my opinion is to provide properties that you won’t find in traditional payment rails, and privacy and censorship resistance are properties we absolutely don’t have in traditional payment rails. Sacrificing those to get performance gains for which we don’t have any concrete use-case today doesn’t make any sense to me.</p>\n<p>As we’ve highlighted several times during spec meetings, privacy loves company: you can only achieve good enough privacy if that is the default behavior of the network. Most users don’t care about privacy (for them, or for other users of the network): but more importantly, most users <em>don’t know that they care about privacy until something happens to them</em>, because of decades of telling people that if they haven’t done anything wrong, they shouldn’t have anything to hide. But I don’t think this is fine, and I’m afraid of what a society without any privacy looks like - and don’t want to live in one. So I’d rather have privacy built-in by default, and address the need for high performance separately, for example using direct channels (but again, since we don’t have any use-case today that <em>requires</em> very low latency, we can’t really design the right knobs for it).</p>\n<p>If lightning succeeds at providing an open access to electronic payments for individuals worldwide, that offers good privacy, censorship resistance, low fees and reasonable speed (even 1-2 seconds is IMO reasonable speed compared to credit card payments), I would count it as an amazing success. I personally think that’s where it provides the most real-world utility and I don’t think we need to do “more” than that, I’d rather be 100% focused on making this use-case work well. I’m not at all interested in just building a faster VISA network.</p>\n<p>Obviously, this is a “philosophical” question of what the developers of the network want: it always has been in every choice we make (feature we work on, implementation details, configuration knobs, etc). We’re not impartial and I don’t think we should try to be? We must be open to discussion and listen to our users, but in the end we all make a personal choice of what we want to spend time working on. And it’s great that different contributors value different properties!</p>\n<p>I’m sorry if it looks like we’re slowing down progress on the attributable failures PR because of those discussions, but I think they’re important (more important than just shipping a feature without which the network has been doing fine for years). I understand the frustration (I have pending spec PRs that have been waiting for much longer than attributable failures), but I think this is part of the trade-offs of working on an open, decentralized network?</p>",
  "post_number": 25,
  "post_type": 1,
  "posts_count": 40,
  "updated_at": "2025-06-05T07:42:57.381Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 20,
  "readers_count": 19,
  "score": 49.0,
  "yours": false,
  "topic_id": 1723,
  "topic_slug": "latency-and-privacy-in-lightning",
  "topic_title": "Latency and Privacy in Lightning",
  "topic_html_title": "Latency and Privacy in Lightning",
  "category_id": 7,
  "display_username": "Bastien Teinturier",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Thanks for the write-up @roasbeef :folded_hands: \n\n[quote=\"roasbeef, post:24, topic:1723\"]\nPersonally, I favor: the self identifying encoding, with either just the actual value, or buckets (100ms?).\n[/quote]\n\nWhat do you mean by \"self identifying encoding\"? The encoding you're describing in your \"Flexibility Middle Ground\" section?\n\nMy personal opinion is that privacy is very important and needs to be protected. We chose from the beginning of the project to use onion routing because this was important to us (\"us\" meaning developers of the network). I strongly favor privacy over speed (within reasonable latency bounds of course): the goal of the lightning network in my opinion is to provide properties that you won't find in traditional payment rails, and privacy and censorship resistance are properties we absolutely don't have in traditional payment rails. Sacrificing those to get performance gains for which we don't have any concrete use-case today doesn't make any sense to me.\n\nAs we've highlighted several times during spec meetings, privacy loves company: you can only achieve good enough privacy if that is the default behavior of the network. Most users don't care about privacy (for them, or for other users of the network): but more importantly, most users *don't know that they care about privacy until something happens to them*, because of decades of telling people that if they haven't done anything wrong, they shouldn't have anything to hide. But I don't think this is fine, and I'm afraid of what a society without any privacy looks like - and don't want to live in one. So I'd rather have privacy built-in by default, and address the need for high performance separately, for example using direct channels (but again, since we don't have any use-case today that *requires* very low latency, we can't really design the right knobs for it).\n\nIf lightning succeeds at providing an open access to electronic payments for individuals worldwide, that offers good privacy, censorship resistance, low fees and reasonable speed (even 1-2 seconds is IMO reasonable speed compared to credit card payments), I would count it as an amazing success. I personally think that's where it provides the most real-world utility and I don't think we need to do \"more\" than that, I'd rather be 100% focused on making this use-case work well. I'm not at all interested in just building a faster VISA network.\n\nObviously, this is a \"philosophical\" question of what the developers of the network want: it always has been in every choice we make (feature we work on, implementation details, configuration knobs, etc). We're not impartial and I don't think we should try to be? We must be open to discussion and listen to our users, but in the end we all make a personal choice of what we want to spend time working on. And it's great that different contributors value different properties!\n\nI'm sorry if it looks like we're slowing down progress on the attributable failures PR because of those discussions, but I think they're important (more important than just shipping a feature without which the network has been doing fine for years). I understand the frustration (I have pending spec PRs that have been waiting for much longer than attributable failures), but I think this is part of the trade-offs of working on an open, decentralized network?",
  "actions_summary": [
    {
      "id": 2,
      "count": 3
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 101,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Thanks for the write-up <a class=\"mention\" href=\"/u/roasbeef\">@roasbeef</a> :folded_hands: \n\nWhat do you mean by “self identifying encoding”? The encoding you’re describing in your “Flexibility Middle Ground” section? \nMy personal opinion is that privacy is very important and needs to be protected. We chose from the beginning of the project&hellip;",
  "truncated": true,
  "post_url": "/t/latency-and-privacy-in-lightning/1723/25",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 3
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 3,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}