{
  "id": 5223,
  "name": "Bastien Teinturier",
  "username": "t-bast",
  "avatar_template": "/user_avatar/delvingbitcoin.org/t-bast/{size}/98_2.png",
  "created_at": "2025-06-05T12:24:39.598Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"GeorgeTsagk\" data-post=\"26\" data-topic=\"1723\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/georgetsagk/48/162_2.png\" class=\"avatar\"> GeorgeTsagk:</div>\n<blockquote>\n<p>a) We’re not really <strong>sacrificing</strong> privacy, it’s more like being honest about the current situation. Similarly, we are not gaining any privacy by obfuscating the latency that is reported to the sender. Adversaries face no extra difficulties in analyzing traffic.</p>\n</blockquote>\n</aside>\n<p>We are giving away more information than before, so this is definitely adding privacy risks. I don’t buy the argument that adversaries have no extra difficulty obtaining that information elsewhere. It will keep getting harder and harder for adversaries to collect such information when we have random delays, message padding and jamming protection (which will include upfront fees, making probing costly).</p>\n<p>The issue is also mostly that incentivizing nodes to favor latency over privacy is not the direction I’d like to see the network take, as this is something we cannot come back from.</p>\n<aside class=\"quote no-group\" data-username=\"GeorgeTsagk\" data-post=\"26\" data-topic=\"1723\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/georgetsagk/48/162_2.png\" class=\"avatar\"> GeorgeTsagk:</div>\n<blockquote>\n<p>b) Focusing on the performance of LN is a fundamental use-case. Every day someone pays for their food or ticket with LN and the payment resolves fast is a small win for the whole network. I’m not saying we need 100ms instead of 1s, but we definitely need to treat performance as a fundamental requirement of the network.</p>\n</blockquote>\n</aside>\n<p>I never said that we shouldn’t treat performance as important, I said that it doesn’t make sense to me to chase performance gains outside of the bounds of what really matters for payment UX if it hurts privacy. Having 1ms precision on payment forwarding latency is absolutely not crucial to get a decent payment UX.</p>\n<aside class=\"quote no-group\" data-username=\"GeorgeTsagk\" data-post=\"26\" data-topic=\"1723\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/georgetsagk/48/162_2.png\" class=\"avatar\"> GeorgeTsagk:</div>\n<blockquote>\n<p>I still don’t understand whether we’re assuming that most people are willing to strip away parts of the software for the sake of speed.</p>\n</blockquote>\n</aside>\n<p>Of course some people will modify their software. But I’m ready to bet that it is going to be a very small minority of nodes, so it’s fine. I’m convinced that the vast majority of the network will run standard lightning implementations, with most of the default configuration values.</p>\n<aside class=\"quote no-group\" data-username=\"GeorgeTsagk\" data-post=\"26\" data-topic=\"1723\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/georgetsagk/48/162_2.png\" class=\"avatar\"> GeorgeTsagk:</div>\n<blockquote>\n<p>That’s already happening today by having websites score nodes for you and then guiding you into choosing the best ones, which is already a worse version of the problem being played out right now</p>\n</blockquote>\n</aside>\n<p>Nobody is using those to make their payments outside of a small niche of developers / tinkerers who are mostly playing around with running a node because they want to do something with their bitcoin: they’re not the users who make the majority of the payment volume.</p>\n<p>I think there’s a big gap between real users (mostly non technical, who just need a payment app that works) and technical people who are spending a lot of their free time tinkering with lightning mostly for experimentation or to be part of a community because they own some bitcoin. It may be harsh, but I don’t think the latter is what we should be focusing on when we design features.</p>\n<p>On top of that, as Matt pointed out, the data exposed by those websites is mostly garbage. I don’t believe that it has any significant impact on the network, or ever will.</p>",
  "post_number": 27,
  "post_type": 1,
  "posts_count": 40,
  "updated_at": "2025-06-05T12:24:39.598Z",
  "reply_count": 2,
  "reply_to_post_number": 26,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 21,
  "readers_count": 20,
  "score": 14.2,
  "yours": false,
  "topic_id": 1723,
  "topic_slug": "latency-and-privacy-in-lightning",
  "topic_title": "Latency and Privacy in Lightning",
  "topic_html_title": "Latency and Privacy in Lightning",
  "category_id": 7,
  "display_username": "Bastien Teinturier",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"GeorgeTsagk, post:26, topic:1723\"]\na) We’re not really **sacrificing** privacy, it’s more like being honest about the current situation. Similarly, we are not gaining any privacy by obfuscating the latency that is reported to the sender. Adversaries face no extra difficulties in analyzing traffic.\n[/quote]\n\nWe are giving away more information than before, so this is definitely adding privacy risks. I don't buy the argument that adversaries have no extra difficulty obtaining that information elsewhere. It will keep getting harder and harder for adversaries to collect such information when we have random delays, message padding and jamming protection (which will include upfront fees, making probing costly).\n\n The issue is also mostly that incentivizing nodes to favor latency over privacy is not the direction I'd like to see the network take, as this is something we cannot come back from.\n\n[quote=\"GeorgeTsagk, post:26, topic:1723\"]\nb) Focusing on the performance of LN is a fundamental use-case. Every day someone pays for their food or ticket with LN and the payment resolves fast is a small win for the whole network. I’m not saying we need 100ms instead of 1s, but we definitely need to treat performance as a fundamental requirement of the network.\n[/quote]\n\nI never said that we shouldn't treat performance as important, I said that it doesn't make sense to me to chase performance gains outside of the bounds of what really matters for payment UX if it hurts privacy. Having 1ms precision on payment forwarding latency is absolutely not crucial to get a decent payment UX.\n\n[quote=\"GeorgeTsagk, post:26, topic:1723\"]\nI still don’t understand whether we’re assuming that most people are willing to strip away parts of the software for the sake of speed.\n[/quote]\n\nOf course some people will modify their software. But I'm ready to bet that it is going to be a very small minority of nodes, so it's fine. I'm convinced that the vast majority of the network will run standard lightning implementations, with most of the default configuration values.\n\n[quote=\"GeorgeTsagk, post:26, topic:1723\"]\nThat’s already happening today by having websites score nodes for you and then guiding you into choosing the best ones, which is already a worse version of the problem being played out right now\n[/quote]\n\nNobody is using those to make their payments outside of a small niche of developers / tinkerers who are mostly playing around with running a node because they want to do something with their bitcoin: they're not the users who make the majority of the payment volume.\n\nI think there's a big gap between real users (mostly non technical, who just need a payment app that works) and technical people who are spending a lot of their free time tinkering with lightning mostly for experimentation or to be part of a community because they own some bitcoin. It may be harsh, but I don't think the latter is what we should be focusing on when we design features.\n\nOn top of that, as Matt pointed out, the data exposed by those websites is mostly garbage. I don't believe that it has any significant impact on the network, or ever will.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 101,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "We are giving away more information than before, so this is definitely adding privacy risks. I don’t buy the argument that adversaries have no extra difficulty obtaining that information elsewhere. It will keep getting harder and harder for adversaries to collect such information when we have rando&hellip;",
  "truncated": true,
  "post_url": "/t/latency-and-privacy-in-lightning/1723/27",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}