{
  "id": 5371,
  "name": null,
  "username": "JohnLaw",
  "avatar_template": "/letter_avatar_proxy/v4/letter/j/58956e/{size}.png",
  "created_at": "2025-06-30T00:57:12.392Z",
  "cooked": "<p>Hi Clara,</p>\n<p>Thanks for your questions.</p>\n<p>“When exactly is the hold fee charged, and what ensures that the necessary funds are available to cover it?”</p>\n<p>The charging of the hold fee consists of 3 phases:</p>\n<ul>\n<li>the channel state is updated by staking funds for the meximum possible hold fee charge:\n<ul>\n<li>the downstream node moves funds from their output to the burn output that cover the maximum possible hold fee charge, and</li>\n<li>the upstream node moves matching funds (which are a fixed fraction of the funds staked by the downstream node) by moving them from their output to the burn output</li>\n</ul>\n</li>\n<li>both nodes calculate the correct hold fee charge when the HTLC is resolved with an update_fulfill_htlc or update_fail_htlc message (or the HTLC’s expiry is reached), and</li>\n<li>both nodes update the channel state by transferring the correct hold fee charge (plus the upfront node’s matching funds) from the burn output to the upstream node and refunding the remainder of the downstream node’s stake to the downstream node.</li>\n</ul>\n<p>The fact that the maximum possible hold fee charge is staked (placed in the burn output) ensures that the funds are available. The maximum possible hold fee charge is the product of the rate at which the hold fee is charged to the downstream node and how long the payment was delayed at this hop. The payment delay is the time from when the hop’s hold grace period ends until an update_fulfill_htlc or update_fail_htlc message is sent, but it cannot extend past the HTLC’s expiry (thus providing a maximum possible charge).</p>\n<p>“If the funds are pre-locked, what’s the maximum amount that can be charged?”</p>\n<p>They are pre-locked (by staking them in the burn output).</p>\n<p>The maximum amount that can be charged is the product of the rate at which the downstream node is charged a hold fee and the maximum possible delay of the payment at this hop. The maximum possible delay of the payment at this hop is the time from the end of the payment’s grace period to the HTLC’s expiry.</p>\n<p>Note that the downstream node is charged a hold fee at a rate that covers the cost of capital held by <em>all</em> of the nodes upstream of it (not just its upstream partner).</p>\n<p>“Is the hold fee calculated by amount, by slot, or both?”</p>\n<p>The hold fee charge covers the entire cost of capital for the time that capital was delayed. Thus, it depends on the amount of capital in all of the upstream nodes (rather than just the payment amount).</p>\n<p>Of course, one could easily modify the protocol to use a different function for calculating hold fee charges. For example, a fixed lump sum charge could be added for any delay past the grace period. As another example, the charge could be based on a nonlinear function of the delay.</p>\n<p>I chose the simple linear charge in order to capture the costs of capital. However, more complex charges (such as nonlinear ones) could cover the “free call option” cost when using the LN to make a Taproot Assets payment. This may be of interest given the recent news about using Taproot Assets for stable coins payments.</p>\n<p>The costs associated with allocation of a slot are covered by Upfront fees and are paid by the sender.</p>\n<p>If you want more detail, the calculation of hold fees is covered in Section 5 of the paper and the collection of hold fees is covered in Section 3.2 of the paper.</p>\n<p>Please let me know if any of this isn’t clear or if you have other questions.</p>",
  "post_number": 12,
  "post_type": 1,
  "posts_count": 19,
  "updated_at": "2025-06-30T00:57:12.392Z",
  "reply_count": 1,
  "reply_to_post_number": 11,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 28,
  "readers_count": 27,
  "score": 10.6,
  "yours": false,
  "topic_id": 1524,
  "topic_slug": "fee-based-spam-prevention-for-lightning",
  "topic_title": "Fee-Based Spam Prevention For Lightning",
  "topic_html_title": "Fee-Based Spam Prevention For Lightning",
  "category_id": 7,
  "display_username": null,
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 310,
    "username": "ClaraShk",
    "name": "",
    "avatar_template": "/user_avatar/delvingbitcoin.org/clarashk/{size}/370_2.png"
  },
  "bookmarked": false,
  "raw": "Hi Clara,\n\nThanks for your questions.\n\n\"When exactly is the hold fee charged, and what ensures that the necessary funds are available to cover it?\"\n\nThe charging of the hold fee consists of 3 phases:  \n* the channel state is updated by staking funds for the meximum possible hold fee charge:  \n  - the downstream node moves funds from their output to the burn output that cover the maximum possible hold fee charge, and  \n  - the upstream node moves matching funds (which are a fixed fraction of the funds staked by the downstream node) by moving them from their output to the burn output  \n* both nodes calculate the correct hold fee charge when the HTLC is resolved with an update_fulfill_htlc or update_fail_htlc message (or the HTLC's expiry is reached), and  \n* both nodes update the channel state by transferring the correct hold fee charge (plus the upfront node's matching funds) from the burn output to the upstream node and refunding the remainder of the downstream node's stake to the downstream node.  \n\nThe fact that the maximum possible hold fee charge is staked (placed in the burn output) ensures that the funds are available. The maximum possible hold fee charge is the product of the rate at which the hold fee is charged to the downstream node and how long the payment was delayed at this hop. The payment delay is the time from when the hop's hold grace period ends until an update_fulfill_htlc or update_fail_htlc message is sent, but it cannot extend past the HTLC's expiry (thus providing a maximum possible charge).\n\n\"If the funds are pre-locked, what’s the maximum amount that can be charged?\"\n\nThey are pre-locked (by staking them in the burn output).\n\nThe maximum amount that can be charged is the product of the rate at which the downstream node is charged a hold fee and the maximum possible delay of the payment at this hop. The maximum possible delay of the payment at this hop is the time from the end of the payment's grace period to the HTLC's expiry.\n\nNote that the downstream node is charged a hold fee at a rate that covers the cost of capital held by *all* of the nodes upstream of it (not just its upstream partner).\n\n\"Is the hold fee calculated by amount, by slot, or both?\"\n\nThe hold fee charge covers the entire cost of capital for the time that capital was delayed. Thus, it depends on the amount of capital in all of the upstream nodes (rather than just the payment amount).\n\nOf course, one could easily modify the protocol to use a different function for calculating hold fee charges. For example, a fixed lump sum charge could be added for any delay past the grace period. As another example, the charge could be based on a nonlinear function of the delay.\n\nI chose the simple linear charge in order to capture the costs of capital. However, more complex charges (such as nonlinear ones) could cover the \"free call option\" cost when using the LN to make a Taproot Assets payment. This may be of interest given the recent news about using Taproot Assets for stable coins payments.\n\nThe costs associated with allocation of a slot are covered by Upfront fees and are paid by the sender.\n\nIf you want more detail, the calculation of hold fees is covered in Section 5 of the paper and the collection of hold fees is covered in Section 3.2 of the paper.\n\nPlease let me know if any of this isn't clear or if you have other questions.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 279,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Hi Clara, \nThanks for your questions. \n“When exactly is the hold fee charged, and what ensures that the necessary funds are available to cover it?” \nThe charging of the hold fee consists of 3 phases: \n\nthe channel state is updated by staking funds for the meximum possible hold fee charge:\n\nthe downs&hellip;",
  "truncated": true,
  "post_url": "/t/fee-based-spam-prevention-for-lightning/1524/12",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}