{
  "id": 5256,
  "name": "Steven Roose",
  "username": "stevenroose",
  "avatar_template": "/user_avatar/delvingbitcoin.org/stevenroose/{size}/1087_2.png",
  "created_at": "2025-06-09T10:22:17.405Z",
  "cooked": "<p>Specifying fees upfront in second layer solutions is annoying. Both predicting future feerates and deciding how to allocate the money for the fee are non-trivial problems that can be avoided if fees can be paid when they are needed (just-in-time): when (usually pre-signed) off-chain contracts go on-chain.</p>\n<p>I have two aims with this post:</p>\n<ol>\n<li>compare different options for simple fee sponsorring both for a single and for multiple transactions</li>\n<li>show that TXSIGHASH can be used for effective stacking of transactions by third parties</li>\n</ol>\n<p>I make a comparisong for paying fees JIT with CPFP, Tx Sponsors and TXSIGHASH, both for a single transaction and for stacks of transactions. You can skip to the <a href=\"#p-5256-summary-table-16\">summary table</a> or the bit on <a href=\"#p-5256-txsighash-15\">TXHASH-based stacking</a> if you wish.</p>\n<h2><a name=\"p-5256-cpfp-1\" class=\"anchor\" href=\"#p-5256-cpfp-1\"></a>CPFP</h2>\n<p>The currently available solution for paying fees JIT is <a href=\"https://bitcoinops.org/en/topics/cpfp/\" rel=\"noopener nofollow ugc\">CPFP, or child-pays-for-parent</a>:\na new transaction is created that spends the original transaction and can add fees to cover the entire <a href=\"https://bitcoinops.org/en/topics/package-relay/\" rel=\"noopener nofollow ugc\"><em>package</em></a>.</p>\n<p>The advantage of CPFP is that it uses existing transaction dependency rules (doesn’t need any special-case consensus rules) and that all transactions involved have a stable txid. The disadvantage is that it is quite costly, as a fee anchor output needs to be made and an entire new child transaction with at least 2 inputs.</p>\n<h2><a name=\"p-5256-tx-sponsors-2\" class=\"anchor\" href=\"#p-5256-tx-sponsors-2\"></a>Tx Sponsors</h2>\n<p>There is currently a proposal to add a construction to bitcoin’s consensus that is aimed specifically at solving this problem more elegantly and more efficiently: <a href=\"https://bitcoinops.org/en/topics/fee-sponsorship/\" rel=\"noopener nofollow ugc\">Tx Sponsors</a>.</p>\n<p>The idea of sponsors at a high level is that a transaction can specify any other transaction by its txid and consensus would require that transactioon to be included in the same block. Like this, the new transaction effectively “sponsors” the other transaction to encourage its inclusion in a block.</p>\n<p>I’ll be basing on the <a href=\"https://delvingbitcoin.org/t/improving-transaction-sponsor-blockspace-efficiency/696\">more recent ideas</a> of David Harding on how to implement sponsorship:</p>\n<ul>\n<li>a new kinda input/output marker is to be used to indicate a transaction is a sponsor, this could be free (below denoted as <code>p2tr-spon</code>)</li>\n<li>the sponsored txids are committed into the sighash of the sponsor transaction’s input</li>\n<li>the sponsor transaction has an additional witness element with 2 bytes per sponsored which hold the offsets of the txids in the block</li>\n</ul>\n<h2><a name=\"p-5256-txhash-3\" class=\"anchor\" href=\"#p-5256-txhash-3\"></a>TXHASH</h2>\n<p><a href=\"https://covenants.info/proposals/txhash/\" rel=\"noopener nofollow ugc\">TXHASH</a> is a proposal for a consensus change that adds constructions to introspect the current transaction from the bitcoin Script system. The BIP currently specifies two opcodes, <code>OP_TXHASH</code> and <code>OP_CHECKTXHASHVERIFY</code> that can be used inside the Script system to inspect or assert certain transaction properties.</p>\n<p>It specifies the concept of a <code>TxFieldSelector</code> that is used to exactly specify what parts of the transaction the user wants to have included in their <em>tx hash</em>. The <code>TxFieldSelector</code> is quite powerful and supports:</p>\n<ul>\n<li>selecting top-level transaction fields like version and lockTime</li>\n<li>selecting all individual fields of the inputs and outputs</li>\n<li>selecting inputs and outputs one wants to include, by either\n<ul>\n<li>selecting all in/outputs</li>\n<li>selecting the leading N in/outputs</li>\n<li>selecting individual in/outputs by their absolute index</li>\n<li>selecting individual in/outputs by their relative index to the current inputs</li>\n</ul>\n</li>\n<li>selecting various fields related to the current execution like input index, control block, annex, OP_CODESEPARATOR etc</li>\n</ul>\n<h3><a name=\"p-5256-txsighash-4\" class=\"anchor\" href=\"#p-5256-txsighash-4\"></a>TXSIGHASH</h3>\n<p>In this write-up, I will use a different construction based on TXHASH: a TXHASH-based sighash. I do this because using the <code>OP_TXHASH</code> opcode comes with a significant size penalty because of how tapscript works and if TXHASH would become popular, adopting a sighash system based on TXHASH will be a reasonable decision.</p>\n<p>The construction defines a new key type for p2tr outputs. For example 33-byte p2tr outputs with the first byte being 0x01<sup class=\"footnote-ref\"><a href=\"#footnote-5256-1\" id=\"footnote-ref-5256-1\">[1]</a></sup>. For such outputs, the signature field is interpreted differently: all bytes appended to the 64-byte signature are interepreted as a <code>TxFieldSelector</code> and the sighash for the signature is calculated as if it was the <em>tx hash</em> calculated as per TXHASH fasion for the given <code>TxFieldSelector</code>.</p>\n<p>To pay fees using TXSIGHASH, the original transaction will use a sighash that only commits to its own inputs and outputs and the sponsor will add an additional input and output that will commit to all inputs and outputs, including the additional ones. This locks in the original transaction’s inputs and outputs.</p>\n<p>One important note here is that this will obviously change the txid of the transaction. Currently, many constructions like Lightning and Ark are built in a way that they require txids to be stable and reliable. However, both <a href=\"https://bitcoinops.org/en/topics/eltoo/\" rel=\"noopener nofollow ugc\">Lightning</a> and <a href=\"https://delvingbitcoin.org/t/re-evolving-the-ark-protocol-using-ctv-and-csfs/1667\">Ark</a> can be build differently using rebindable signatures to no longer rely on this property.</p>\n<h1><a name=\"p-5256-scenarios-5\" class=\"anchor\" href=\"#p-5256-scenarios-5\"></a>Scenarios</h1>\n<p>I will outline a few different scenarios, explain how spending works using TXSIGHASH and compare the costs with CPFP and tx sponsors.</p>\n<p>For our base cases, I will work with transactions that have simple p2tr key-spend inputs and outputs<sup class=\"footnote-ref\"><a href=\"#footnote-5256-2\" id=\"footnote-ref-5256-2\">[2]</a></sup>.</p>\n<h2><a name=\"p-5256-single-transaction-sponsorring-6\" class=\"anchor\" href=\"#p-5256-single-transaction-sponsorring-6\"></a>Single-transaction Sponsorring</h2>\n<h3><a name=\"p-5256-h-1-in-1-out-7\" class=\"anchor\" href=\"#p-5256-h-1-in-1-out-7\"></a>1-in-1-out</h3>\n<p>Let’s start with the simplest case: a simple transaction with a single input and a single output.</p>\n<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| p2tr-ks    |      p2tr |\n+------------+-----------+\n</code></pre>\n<p>This simple transaction has a virtual size of 111 vB.</p>\n<h4><a name=\"p-5256-cpfp-8\" class=\"anchor\" href=\"#p-5256-cpfp-8\"></a>CPFP</h4>\n<p>For CPFP, the transaction would have to be extended with a fee anchor (<a href=\"https://bitcoinops.org/en/topics/ephemeral-anchors/\" rel=\"noopener nofollow ugc\">p2a</a>) as follows:</p>\n<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| p2tr-ks    |      p2tr |\n+------------+-----------+\n|            |    anchor |\n+------------+-----------+\n</code></pre>\n<p>The transaction than becomes 124 vB.</p>\n<p>The “child” transaction that will pay the fee, will have to spend the fee anchor and add additional funds (using p2tr). That transaction looks as follows:</p>\n<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| anchor     |      p2tr |\n+------------+-----------+\n| p2tr-ks    |           |\n+------------+-----------+\n</code></pre>\n<p>This transaction has 153 vB. The complete construction here, parent + child, totals 277 vB.</p>\n<h3><a name=\"p-5256-tx-sponsors-9\" class=\"anchor\" href=\"#p-5256-tx-sponsors-9\"></a>Tx Sponsors</h3>\n<p>In order to sponsor a transaction, no changes have to made to the original sponsoree. It can remain a 1-in-1-out transaction.</p>\n<p>The sponsor would then create an additional new transaction, the <em>sponsor transaction</em>, that looks as follows:</p>\n<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| p2tr-spon* |      p2tr |\n+------------+-----------+\n</code></pre>\n<p>In the simple case, the <code>p2tr-spon</code> input would have an additinal input witness element of 2 bytes that indicates the relative index of the sponsoree transaction in the block.</p>\n<p>This transaction has 112 vB.</p>\n<h4><a name=\"p-5256-txsighash-10\" class=\"anchor\" href=\"#p-5256-txsighash-10\"></a>TXSIGHASH</h4>\n<p>In order for this transaction to be used with TXSIGHASH, all <code>scriptPubkeys</code> will need to flag TXSIGHASH support with an additional byte. In theory, only the input strictly needs to support it, but for all fairness, we will also add the extra byte on the outputs, because if the construction needs to be used further along, the byte will have to be present. I will denote this as follows:</p>\n<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| p2txsh-ks  |    p2txsh |\n+------------+-----------+\n</code></pre>\n<p>This transactions has 113 vB.</p>\n<p>Note that the sighash of this transaction will only cover the first input and first output. This can be cheaply expressed using a 4-byte <code>TxFieldSelector</code>. The same 4-byte cost remains for other transactions as long as the number of in/outputs doesn’t exceed 7936; you can have a different number of inputs and outputs.</p>\n<p>In order to pay fees for this transaction using external funds that support TXSIGHASH, we can construct a transaction by simply adding our funding input and creating an additional output, as follows:</p>\n<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| p2txsh-ks  |    p2txsh |  &lt;- original\n+------------+-----------+\n| p2txsh-ks  |    p2txsh |  &lt;- sponsor\n+------------+-----------+\n</code></pre>\n<p>As we described above, the sighash of the first input will cover only the first input and output (4-byte <code>TxFieldSelector</code>) and the sighash of the last input will cover the entire transaction (1-byte <code>TxFieldSelector</code> <sup class=\"footnote-ref\"><a href=\"#footnote-5256-3\" id=\"footnote-ref-5256-3\">[3]</a></sup>).</p>\n<p>This entire transaction has 215 vB.</p>\n<h3><a name=\"p-5256-other-transaction-configurations-11\" class=\"anchor\" href=\"#p-5256-other-transaction-configurations-11\"></a>Other transaction configurations</h3>\n<p>Other common transaction configurations are the common 2-in-2-out for regular payments that require change or Lightning channels. We will also cover the 1-in-4-out case which is very common in constructions using transaction trees like Ark.</p>\n<p>All numbers are in virtual bytes (vB) and the difference compared with the CPFP case.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th>base</th>\n<th>CPFP</th>\n<th>Tx Sponsors</th>\n<th>TXSIGHASH</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1-in-1-out</td>\n<td>111</td>\n<td>277</td>\n<td>223 (-54,-19%)</td>\n<td>215 (-62,-22%)</td>\n</tr>\n<tr>\n<td>2-in-2-out</td>\n<td>212</td>\n<td>378</td>\n<td>324 (-54,-14%)</td>\n<td>318 (-60,-16%)</td>\n</tr>\n<tr>\n<td>1-in-4-out</td>\n<td>240</td>\n<td>406</td>\n<td>352 (-54,-13%)</td>\n<td>347 (-59,-15%)</td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"p-5256-multi-transaction-sponsorring-or-stacking-12\" class=\"anchor\" href=\"#p-5256-multi-transaction-sponsorring-or-stacking-12\"></a>Multi-transaction Sponsorring or Stacking</h2>\n<p>Next, we want to look at scenarios where a single sponsor sponsors multiple transactions at once.</p>\n<p>We will explore the case of stacking 10 and 100 transactions, but will use 3 in our example diagrams below.</p>\n<h3><a name=\"p-5256-cpfp-13\" class=\"anchor\" href=\"#p-5256-cpfp-13\"></a>CPFP</h3>\n<p>Sponsorring multiple transactions using CPFP can be done by having a single child spend all the anchors from all the transactions that one wants to sponsor. Under the current mempool rules, it is not yet possible to relay such transactions, but work is almost done to <a href=\"https://bitcoinops.org/en/topics/package-relay/\" rel=\"noopener nofollow ugc\">support this</a>.</p>\n<p>Constructions are very simple, the regular transactions can remain exactly the same and the child will simply have to spend all the anchors.</p>\n<p>For the case of sponsorring 3 transactions, the child (sponsor) transaction looks as follows:</p>\n<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| anchor     |      p2tr |\n+------------+-----------+\n| anchor     |           |\n+------------+-----------+\n| anchor     |           |\n+------------+-----------+\n| p2tr-ks    |           |\n+------------+-----------+\n</code></pre>\n<h3><a name=\"p-5256-tx-sponsors-14\" class=\"anchor\" href=\"#p-5256-tx-sponsors-14\"></a>Tx Sponsors</h3>\n<p>Sponsorring multiple transactions using Tx Sponsors is very easy. The original transaction don’t have to be changed and can just be relayed and included as they are. Possibly it would be required for the author of the transaction to mark the transaction as eligible for sponsorship, but this can be done without costing any additional bytes.</p>\n<p>The sponsor transaction still looks the same, having a single input and a single output, but having an additional 2 witness bytes per transaction it is sponsorring.</p>\n<h3><a name=\"p-5256-txsighash-15\" class=\"anchor\" href=\"#p-5256-txsighash-15\"></a>TXSIGHASH</h3>\n<p>For the case of TXSIGHASH, we will look into <em>stacking</em>. Stacking is when multiple semantic transactions are squashed into a single transaction that encompases all original semantic transactions (meaning their inputs and outputs). It is somewhat similar to doing a coinjoin round, but stacking is generally considered non-interactive.</p>\n<p>Transactions of arbitrary fan-in-fan-out can be stacked using TXSIGHASH. However, special care have to be taken by the <em>stackees</em>. This is because the signatures used in the stacked inputs will be different depending on the resulting stacking configuration. If one wants to allow an external <em>stacker</em> to stack their transactions, multiple different signatures have to be generated in order to facilitate various different stacking configurations and these different signatures will have to be communicated to the <em>stacker</em>. This can either be done by an out-of-band protocol provided by the <em>stacker</em> for his <em>stackees</em> (similar to current coinjoin protocols etc), or a special-purpose relay network can be created to relay ready-to-go stack packages. (The latter is relevant because not all packages might need external fees, but being included in a stack can still allow you to save fees for the fixed transaction boilerplate bytes.)</p>\n<p>In the case of off-chain protocols where these transactions are pre-signed, the same variation of signatures will have to be made beforehand and stored by all parties involved in the protocol.</p>\n<p>Before we lay out an example stack, I’ll explain the strategy. We will use the term <em>stackee tx</em> for a semantic transaction, consisting of some inputs and some outputs. Intuitively, they are like bitcoin transactions, but in the stacking process, they might be pulled apart, while still ensuring that they always must all be included in a transaction together (atomicity).</p>\n<p>We will use the <code>TxFieldSelector</code> relative indices so that sighashes of the <em>stackee tx</em> inputs can cover the desired outputs. We make the following reasonings:</p>\n<ul>\n<li>The user doesn’t care in what order their inputs and outputs are included, so they can re-order them to suite the stacking process.</li>\n<li>We make the assumption here that “inputs don’t require to be included”, meaning that if some external party decides to fund the outputs instead, a user will be happy to get free money. If for some external reason, a user requires his inputs to be included, a variation of this stacking protocol can be designed but it will be slightly more costly.</li>\n<li>We use the first input of the <em>stackee tx</em> to fix all outputs.</li>\n<li>All other inputs will commit to the existence of the first input to indirectly also commit to the outputs.</li>\n<li>Inputs will always be aligned, meaning that all inputs of a <em>stackee tx</em> will follow each other in the resulting <em>stack tx</em>.</li>\n<li>The case where the number of outputs is equal or less than the number of inputs is easy:\n<ul>\n<li>The first input commits to the outputs at relative indices <span class=\"math\">0, 1, .., N-1</span> for N outputs.</li>\n<li>Each other input commits to input at relative index <span class=\"math\">-1, -2, .. -(N-1)</span><sup class=\"footnote-ref\"><a href=\"#footnote-5256-4\" id=\"footnote-ref-5256-4\">[4]</a></sup></li>\n<li>For this case, only exactly <span class=\"math\">N</span> signatures have to be produced.</li>\n</ul>\n</li>\n<li>If there are more outputs than inputs, the user will generate a number of different signature variants, where the relative index for the outputs with indices after the last input’s index will be moved each time one further. This allows the <em>stacker</em> to pick the right signatures matching the eventual configuration of the <em>stack tx</em>.</li>\n<li>Since all indices are relative, there are no strict limits on how large a <em>stack</em> can get, especially if on average the number of inputs and outputs kind matches and the puzzle algorithm finds ways to construct stacks where outputs don’t have to put places too far away from the inputs.</li>\n</ul>\n<p>This is a somewhat naive version of a stacking algorithm. Many optimizations can be made to increase the likelihood that a set of transactions can be stacked. This is however out of the scope of this write-up as it doesn’t affect the on-chain costs of the stacks.</p>\n<p>Let’s look at an example then. We will try to stack the following three <em>stackee txs</em>:</p>\n<ul>\n<li>transaction A with 2 inputs and 1 outputs<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| A1         |        A1 |\n+------------+-----------+\n| A2         |           |\n+------------+-----------+\n</code></pre>\n</li>\n<li>transaction B with 1 inputs and 3 outputs<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| B1         |        B1 |\n+------------+-----------+\n|            |        B2 |\n+------------+-----------+\n|            |        B3 |\n+------------+-----------+\n</code></pre>\n</li>\n<li>transaction C with 2 inputs and 3 outputs<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| C1         |        C1 |\n+------------+-----------+\n| C2         |        C2 |\n+------------+-----------+\n|            |        C3 |\n+------------+-----------+\n</code></pre>\n</li>\n</ul>\n<p>The <em>stacker</em> will ask the <em>stackees</em> to provide signatures up to <span class=\"math\">N</span> relative distance for the additional outputs. In reality, <span class=\"math\">N</span> will be in the order of magnitude of 100, but for this example, we will show the case where <span class=\"math\">N</span> equals <span class=\"math\">5</span>. The <em>stacker</em> will then receive the following signatures:</p>\n<ul>\n<li>input A1 committing to output A1 at same index</li>\n<li>input A2 committing to input A1 at index -1</li>\n<li>5 signatures for input B1 committing to outputs B1, B2 and B3 at indices\n<ul>\n<li>+0, +1, +2</li>\n<li>+0, +2, +3</li>\n<li>+0, +3, +4</li>\n<li>+0, +4, +5</li>\n<li>+0, +5, +6</li>\n</ul>\n</li>\n<li>5 signatures for inputs C1 committing to outputs C1, C2 and C3 at indices\n<ul>\n<li>+0, +1, +2</li>\n<li>+0, +1, +3</li>\n<li>+0, +1, +4</li>\n<li>+0, +1, +5</li>\n<li>+0, +1, +6</li>\n</ul>\n</li>\n<li>input C2 committing to input C1 at index -1</li>\n</ul>\n<p>The <em>stacker</em> can add an input and output S (using SIGHASH_ALL) to pay for the fees, and construct the following <em>stack tx</em>:</p>\n<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| C1         |        C1 |\n+------------+-----------+\n| C2         |        C2 |\n+------------+-----------+\n| A1         |        A1 |\n+------------+-----------+\n| A2         |        C3 |\n+------------+-----------+\n| B1         |        B1 |\n+------------+-----------+\n| S          |        B2 |\n+------------+-----------+\n|            |        B3 |\n+------------+-----------+\n|            |         S |\n+------------+-----------+\n</code></pre>\n<p>Alternatively, he could have constructed this transaction as well:</p>\n<pre><code class=\"lang-plaintext\">| inputs     |   outputs | \n+============+===========+\n| B1         |        B1 |\n+------------+-----------+\n| A1         |        A1 |\n+------------+-----------+\n| A2         |        B2 |\n+------------+-----------+\n| S          |        B3 |\n+------------+-----------+\n| C1         |        C1 |\n+------------+-----------+\n| C2         |        C2 |\n+------------+-----------+\n|            |        C3 |\n+------------+-----------+\n|            |         S |\n+------------+-----------+\n</code></pre>\n<h3><a name=\"p-5256-summary-table-16\" class=\"anchor\" href=\"#p-5256-summary-table-16\"></a>Summary table</h3>\n<p>Below is a table with the costs for sponsorring/stacking 10 and 100 <em>identical</em> transactions. I chose identical transactions because it is otherwise really hard to make random configurations.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th>N</th>\n<th>CPFP</th>\n<th>Tx Sponsors</th>\n<th>TXSIGHASH</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>2-in-2-out</td>\n<td>10</td>\n<td>2769</td>\n<td>2232 (-537)</td>\n<td>2165 (-604)</td>\n</tr>\n<tr>\n<td>2-in-2-out</td>\n<td>100</td>\n<td>26686</td>\n<td>21312 (-5374)</td>\n<td>20638 (-6048)</td>\n</tr>\n<tr>\n<td>1-in-4-out</td>\n<td>10</td>\n<td>3054</td>\n<td>2517 (-537)</td>\n<td>2465 (-589)</td>\n</tr>\n<tr>\n<td>1-in-4-out</td>\n<td>100</td>\n<td>29536</td>\n<td>24162 (-5374)</td>\n<td>23640 (-5896)</td>\n</tr>\n</tbody>\n</table>\n</div><p>Or in vB per <em>stackee tx</em>:</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th>N</th>\n<th>base</th>\n<th>CPFP</th>\n<th>Tx Sponsors</th>\n<th>TXSIGHASH</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>2-in-2-out</td>\n<td>1</td>\n<td>212</td>\n<td>378</td>\n<td>324 (-54,-14%)</td>\n<td>318 (-60,-16%)</td>\n</tr>\n<tr>\n<td>2-in-2-out</td>\n<td>10</td>\n<td>212</td>\n<td>277</td>\n<td>223 (-54,-19%)</td>\n<td>217 (-60,-22%)</td>\n</tr>\n<tr>\n<td>2-in-2-out</td>\n<td>100</td>\n<td>212</td>\n<td>267</td>\n<td>213 (-54,-20%)</td>\n<td>207 (-60,-23%)</td>\n</tr>\n<tr>\n<td>1-in-4-out</td>\n<td>1</td>\n<td>240</td>\n<td>406</td>\n<td>352 (-54,-13%)</td>\n<td>347 (-59,-15%)</td>\n</tr>\n<tr>\n<td>1-in-4-out</td>\n<td>10</td>\n<td>240</td>\n<td>306</td>\n<td>252 (-54,-18%)</td>\n<td>247 (-59,-19%)</td>\n</tr>\n<tr>\n<td>1-in-4-out</td>\n<td>100</td>\n<td>240</td>\n<td>296</td>\n<td>242 (-54,-18%)</td>\n<td>237 (-59,-20%)</td>\n</tr>\n</tbody>\n</table>\n</div><h1><a name=\"p-5256-conclusion-17\" class=\"anchor\" href=\"#p-5256-conclusion-17\"></a>Conclusion</h1>\n<p>TXSIGHASH based constructions provide an extremely cost-effective way for both sponsorring single transactions and for stacking multiple transactions together, <strong>possibly by a third party. With stacking, the cost in virtual bytes of each stacked transaction can even be lower than their original cost without a sponsor included</strong>.</p>\n<p>It is also worth noting that stacking with TXSIGHASH results in having a single big transaction instead of a series of multiple transactions, like both CPFP and Tx Sponsors. Additionally, all inputs are “simple”<sup class=\"footnote-ref\"><a href=\"#footnote-5256-5\" id=\"footnote-ref-5256-5\">[5]</a></sup> key-spends, meaning that they could be aggregated if <a href=\"https://bitcoinops.org/en/topics/cross-input-signature-aggregation/\" rel=\"noopener nofollow ugc\">CISA</a> were to be deployed.</p>\n<p>The drawback of sponsorring and stacking using TXSIGHASH is the overhead of creating, storing and relaying multiple variants of the signatures used in the transaction. This has to be done by the creators of any transaction that wants to be eligible for stacking, at the time of its creation. This added complexity can be considered quite significant, especially when compared with Tx Sponsors which doesn’t require any special preparation by the original transactions.</p>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"footnote-5256-1\" class=\"footnote-item\"><p>This one byte could be saved by defining a new segwit version (v2). <a href=\"#footnote-ref-5256-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-5256-2\" class=\"footnote-item\"><p>In theory other policies could be used, especially if they include a signature check that can use TXSIGHASH semantics. Other covenant-based policies should be reviewed on an individual basis. <a href=\"#footnote-ref-5256-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-5256-3\" class=\"footnote-item\"><p>In theory this could maybe be even a 0-byte <code>TxFieldSelector</code> as it would make sense to make the “default” sighash type to be ALL. <a href=\"#footnote-ref-5256-3\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-5256-4\" class=\"footnote-item\"><p>The careful reader will have noted that this construction is vulnerable to an attack where if the user for some reason produces two different signatures for the first input, the other inputs could be linked to the other spends as well. This can be dangerous. Full atomicity can be guaranteed by putting commitments into the annex, but this requires quite some changes. A possible simple and free improvement is that the other inputs also commit to the outputs below their own index. By carefully ordering the outputs by value and putting the largest one at the index equivalent with the last input, the signatures can be made significantly more safe. <a href=\"#footnote-ref-5256-4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-5256-5\" class=\"footnote-item\"><p>“simple” because they do use different SIGHASHES, but still only have a single pubkey and signature per input <a href=\"#footnote-ref-5256-5\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 2,
  "updated_at": "2025-06-09T10:29:38.803Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 154,
  "reads": 42,
  "readers_count": 41,
  "score": 803.4,
  "yours": false,
  "topic_id": 1760,
  "topic_slug": "jit-fees-with-txhash-comparing-options-for-sponsorring-and-stacking",
  "topic_title": "JIT fees with TXHASH: comparing options for sponsorring and stacking",
  "topic_html_title": "JIT fees with TXHASH: comparing options for sponsorring and stacking",
  "category_id": 7,
  "display_username": "Steven Roose",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Specifying fees upfront in second layer solutions is annoying. Both predicting future feerates and deciding how to allocate the money for the fee are non-trivial problems that can be avoided if fees can be paid when they are needed (just-in-time): when (usually pre-signed) off-chain contracts go on-chain.\n\nI have two aims with this post:\n1. compare different options for simple fee sponsorring both for a single and for multiple transactions\n2. show that TXSIGHASH can be used for effective stacking of transactions by third parties\n\nI make a comparisong for paying fees JIT with CPFP, Tx Sponsors and TXSIGHASH, both for a single transaction and for stacks of transactions. You can skip to the [summary table](#p-5256-summary-table-16) or the bit on [TXHASH-based stacking](#p-5256-txsighash-15) if you wish.\n\n\n## CPFP\n\nThe currently available solution for paying fees JIT is [CPFP, or child-pays-for-parent](https://bitcoinops.org/en/topics/cpfp/):\na new transaction is created that spends the original transaction and can add fees to cover the entire [_package_](https://bitcoinops.org/en/topics/package-relay/).\n\nThe advantage of CPFP is that it uses existing transaction dependency rules (doesn't need any special-case consensus rules) and that all transactions involved have a stable txid. The disadvantage is that it is quite costly, as a fee anchor output needs to be made and an entire new child transaction with at least 2 inputs.\n\n## Tx Sponsors\n\nThere is currently a proposal to add a construction to bitcoin's consensus that is aimed specifically at solving this problem more elegantly and more efficiently: [Tx Sponsors](https://bitcoinops.org/en/topics/fee-sponsorship/).\n\nThe idea of sponsors at a high level is that a transaction can specify any other transaction by its txid and consensus would require that transactioon to be included in the same block. Like this, the new transaction effectively \"sponsors\" the other transaction to encourage its inclusion in a block.\n\nI'll be basing on the [more recent ideas](https://delvingbitcoin.org/t/improving-transaction-sponsor-blockspace-efficiency/696) of David Harding on how to implement sponsorship:\n\n- a new kinda input/output marker is to be used to indicate a transaction is a sponsor, this could be free (below denoted as `p2tr-spon`)\n- the sponsored txids are committed into the sighash of the sponsor transaction's input\n- the sponsor transaction has an additional witness element with 2 bytes per sponsored which hold the offsets of the txids in the block\n\n\n## TXHASH\n\n[TXHASH](https://covenants.info/proposals/txhash/) is a proposal for a consensus change that adds constructions to introspect the current transaction from the bitcoin Script system. The BIP currently specifies two opcodes, `OP_TXHASH` and `OP_CHECKTXHASHVERIFY` that can be used inside the Script system to inspect or assert certain transaction properties.\n\nIt specifies the concept of a `TxFieldSelector` that is used to exactly specify what parts of the transaction the user wants to have included in their _tx hash_. The `TxFieldSelector` is quite powerful and supports:\n\n- selecting top-level transaction fields like version and lockTime\n- selecting all individual fields of the inputs and outputs\n- selecting inputs and outputs one wants to include, by either\n  - selecting all in/outputs\n  - selecting the leading N in/outputs\n  - selecting individual in/outputs by their absolute index\n  - selecting individual in/outputs by their relative index to the current inputs\n- selecting various fields related to the current execution like input index, control block, annex, OP_CODESEPARATOR etc\n\n### TXSIGHASH\n\nIn this write-up, I will use a different construction based on TXHASH: a TXHASH-based sighash. I do this because using the `OP_TXHASH` opcode comes with a significant size penalty because of how tapscript works and if TXHASH would become popular, adopting a sighash system based on TXHASH will be a reasonable decision.\n\nThe construction defines a new key type for p2tr outputs. For example 33-byte p2tr outputs with the first byte being 0x01[^4]. For such outputs, the signature field is interpreted differently: all bytes appended to the 64-byte signature are interepreted as a `TxFieldSelector` and the sighash for the signature is calculated as if it was the _tx hash_ calculated as per TXHASH fasion for the given `TxFieldSelector`.\n\nTo pay fees using TXSIGHASH, the original transaction will use a sighash that only commits to its own inputs and outputs and the sponsor will add an additional input and output that will commit to all inputs and outputs, including the additional ones. This locks in the original transaction's inputs and outputs.\n\nOne important note here is that this will obviously change the txid of the transaction. Currently, many constructions like Lightning and Ark are built in a way that they require txids to be stable and reliable. However, both [Lightning](https://bitcoinops.org/en/topics/eltoo/) and [Ark](https://delvingbitcoin.org/t/re-evolving-the-ark-protocol-using-ctv-and-csfs/1667) can be build differently using rebindable signatures to no longer rely on this property.\n\n\n# Scenarios\n\nI will outline a few different scenarios, explain how spending works using TXSIGHASH and compare the costs with CPFP and tx sponsors.\n\nFor our base cases, I will work with transactions that have simple p2tr key-spend inputs and outputs[^1]. \n\n## Single-transaction Sponsorring\n\n### 1-in-1-out\n\nLet's start with the simplest case: a simple transaction with a single input and a single output.\n\n```text\n| inputs     |   outputs | \n+============+===========+\n| p2tr-ks    |      p2tr |\n+------------+-----------+\n```\n\nThis simple transaction has a virtual size of 111 vB.\n\n\n#### CPFP\n\nFor CPFP, the transaction would have to be extended with a fee anchor ([p2a](https://bitcoinops.org/en/topics/ephemeral-anchors/)) as follows:\n\n```text\n| inputs     |   outputs | \n+============+===========+\n| p2tr-ks    |      p2tr |\n+------------+-----------+\n|            |    anchor |\n+------------+-----------+\n```\n\nThe transaction than becomes 124 vB.\n\nThe \"child\" transaction that will pay the fee, will have to spend the fee anchor and add additional funds (using p2tr). That transaction looks as follows:\n\n```text\n| inputs     |   outputs | \n+============+===========+\n| anchor     |      p2tr |\n+------------+-----------+\n| p2tr-ks    |           |\n+------------+-----------+\n```\n\nThis transaction has 153 vB. The complete construction here, parent + child, totals 277 vB.\n\n### Tx Sponsors\n\nIn order to sponsor a transaction, no changes have to made to the original sponsoree. It can remain a 1-in-1-out transaction.\n\nThe sponsor would then create an additional new transaction, the _sponsor transaction_, that looks as follows:\n\n```text\n| inputs     |   outputs | \n+============+===========+\n| p2tr-spon* |      p2tr |\n+------------+-----------+\n```\n\nIn the simple case, the `p2tr-spon` input would have an additinal input witness element of 2 bytes that indicates the relative index of the sponsoree transaction in the block.\n\nThis transaction has 112 vB.\n\n\n#### TXSIGHASH\n\nIn order for this transaction to be used with TXSIGHASH, all `scriptPubkeys` will need to flag TXSIGHASH support with an additional byte. In theory, only the input strictly needs to support it, but for all fairness, we will also add the extra byte on the outputs, because if the construction needs to be used further along, the byte will have to be present. I will denote this as follows:\n\n```text\n| inputs     |   outputs | \n+============+===========+\n| p2txsh-ks  |    p2txsh |\n+------------+-----------+\n```\nThis transactions has 113 vB.\n\nNote that the sighash of this transaction will only cover the first input and first output. This can be cheaply expressed using a 4-byte `TxFieldSelector`. The same 4-byte cost remains for other transactions as long as the number of in/outputs doesn't exceed 7936; you can have a different number of inputs and outputs.\n\n\nIn order to pay fees for this transaction using external funds that support TXSIGHASH, we can construct a transaction by simply adding our funding input and creating an additional output, as follows:\n\n```text\n| inputs     |   outputs | \n+============+===========+\n| p2txsh-ks  |    p2txsh |  <- original\n+------------+-----------+\n| p2txsh-ks  |    p2txsh |  <- sponsor\n+------------+-----------+\n```\n\nAs we described above, the sighash of the first input will cover only the first input and output (4-byte `TxFieldSelector`) and the sighash of the last input will cover the entire transaction (1-byte `TxFieldSelector` [^2]).\n\nThis entire transaction has 215 vB.\n\n\n### Other transaction configurations\n\nOther common transaction configurations are the common 2-in-2-out for regular payments that require change or Lightning channels. We will also cover the 1-in-4-out case which is very common in constructions using transaction trees like Ark.\n\nAll numbers are in virtual bytes (vB) and the difference compared with the CPFP case.\n\n|            | base | CPFP | Tx Sponsors    | TXSIGHASH      |\n|-|-|-|-|-|\n| 1-in-1-out | 111  | 277  | 223 (-54,-19%) | 215 (-62,-22%) |\n| 2-in-2-out | 212  | 378  | 324 (-54,-14%) | 318 (-60,-16%) |\n| 1-in-4-out | 240  | 406  | 352 (-54,-13%) | 347 (-59,-15%) |\n\n\n\n## Multi-transaction Sponsorring or Stacking\n\nNext, we want to look at scenarios where a single sponsor sponsors multiple transactions at once.\n\nWe will explore the case of stacking 10 and 100 transactions, but will use 3 in our example diagrams below.\n\n### CPFP\n\nSponsorring multiple transactions using CPFP can be done by having a single child spend all the anchors from all the transactions that one wants to sponsor. Under the current mempool rules, it is not yet possible to relay such transactions, but work is almost done to [support this](https://bitcoinops.org/en/topics/package-relay/).\n\nConstructions are very simple, the regular transactions can remain exactly the same and the child will simply have to spend all the anchors.\n\nFor the case of sponsorring 3 transactions, the child (sponsor) transaction looks as follows:\n\n```text\n| inputs     |   outputs | \n+============+===========+\n| anchor     |      p2tr |\n+------------+-----------+\n| anchor     |           |\n+------------+-----------+\n| anchor     |           |\n+------------+-----------+\n| p2tr-ks    |           |\n+------------+-----------+\n```\n\n\n### Tx Sponsors\n\nSponsorring multiple transactions using Tx Sponsors is very easy. The original transaction don't have to be changed and can just be relayed and included as they are. Possibly it would be required for the author of the transaction to mark the transaction as eligible for sponsorship, but this can be done without costing any additional bytes.\n\nThe sponsor transaction still looks the same, having a single input and a single output, but having an additional 2 witness bytes per transaction it is sponsorring.\n\n\n### TXSIGHASH\n\nFor the case of TXSIGHASH, we will look into _stacking_. Stacking is when multiple semantic transactions are squashed into a single transaction that encompases all original semantic transactions (meaning their inputs and outputs). It is somewhat similar to doing a coinjoin round, but stacking is generally considered non-interactive.\n\nTransactions of arbitrary fan-in-fan-out can be stacked using TXSIGHASH. However, special care have to be taken by the _stackees_. This is because the signatures used in the stacked inputs will be different depending on the resulting stacking configuration. If one wants to allow an external _stacker_ to stack their transactions, multiple different signatures have to be generated in order to facilitate various different stacking configurations and these different signatures will have to be communicated to the _stacker_. This can either be done by an out-of-band protocol provided by the _stacker_ for his _stackees_ (similar to current coinjoin protocols etc), or a special-purpose relay network can be created to relay ready-to-go stack packages. (The latter is relevant because not all packages might need external fees, but being included in a stack can still allow you to save fees for the fixed transaction boilerplate bytes.)\n\nIn the case of off-chain protocols where these transactions are pre-signed, the same variation of signatures will have to be made beforehand and stored by all parties involved in the protocol.\n\nBefore we lay out an example stack, I'll explain the strategy. We will use the term _stackee tx_ for a semantic transaction, consisting of some inputs and some outputs. Intuitively, they are like bitcoin transactions, but in the stacking process, they might be pulled apart, while still ensuring that they always must all be included in a transaction together (atomicity).\n\nWe will use the `TxFieldSelector` relative indices so that sighashes of the _stackee tx_ inputs can cover the desired outputs. We make the following reasonings:\n\n- The user doesn't care in what order their inputs and outputs are included, so they can re-order them to suite the stacking process.\n- We make the assumption here that \"inputs don't require to be included\", meaning that if some external party decides to fund the outputs instead, a user will be happy to get free money. If for some external reason, a user requires his inputs to be included, a variation of this stacking protocol can be designed but it will be slightly more costly.\n- We use the first input of the _stackee tx_ to fix all outputs.\n- All other inputs will commit to the existence of the first input to indirectly also commit to the outputs.\n- Inputs will always be aligned, meaning that all inputs of a _stackee tx_ will follow each other in the resulting _stack tx_.\n- The case where the number of outputs is equal or less than the number of inputs is easy:\n  - The first input commits to the outputs at relative indices $0, 1, .., N-1$ for N outputs.\n  - Each other input commits to input at relative index $-1, -2, .. -(N-1)$[^3]\n  - For this case, only exactly $N$ signatures have to be produced.\n- If there are more outputs than inputs, the user will generate a number of different signature variants, where the relative index for the outputs with indices after the last input's index will be moved each time one further. This allows the _stacker_ to pick the right signatures matching the eventual configuration of the _stack tx_.\n- Since all indices are relative, there are no strict limits on how large a _stack_ can get, especially if on average the number of inputs and outputs kind matches and the puzzle algorithm finds ways to construct stacks where outputs don't have to put places too far away from the inputs.\n\nThis is a somewhat naive version of a stacking algorithm. Many optimizations can be made to increase the likelihood that a set of transactions can be stacked. This is however out of the scope of this write-up as it doesn't affect the on-chain costs of the stacks.\n\nLet's look at an example then. We will try to stack the following three _stackee txs_:\n\n- transaction A with 2 inputs and 1 outputs\n  ```text\n  | inputs     |   outputs | \n  +============+===========+\n  | A1         |        A1 |\n  +------------+-----------+\n  | A2         |           |\n  +------------+-----------+\n  ```\n- transaction B with 1 inputs and 3 outputs\n  ```text\n  | inputs     |   outputs | \n  +============+===========+\n  | B1         |        B1 |\n  +------------+-----------+\n  |            |        B2 |\n  +------------+-----------+\n  |            |        B3 |\n  +------------+-----------+\n  ```\n- transaction C with 2 inputs and 3 outputs\n  ```text\n  | inputs     |   outputs | \n  +============+===========+\n  | C1         |        C1 |\n  +------------+-----------+\n  | C2         |        C2 |\n  +------------+-----------+\n  |            |        C3 |\n  +------------+-----------+\n  ```\n\nThe _stacker_ will ask the _stackees_ to provide signatures up to $N$ relative distance for the additional outputs. In reality, $N$ will be in the order of magnitude of 100, but for this example, we will show the case where $N$ equals $5$. The _stacker_ will then receive the following signatures:\n\n- input A1 committing to output A1 at same index\n- input A2 committing to input A1 at index -1\n- 5 signatures for input B1 committing to outputs B1, B2 and B3 at indices\n  - +0, +1, +2\n  - +0, +2, +3\n  - +0, +3, +4\n  - +0, +4, +5\n  - +0, +5, +6\n- 5 signatures for inputs C1 committing to outputs C1, C2 and C3 at indices\n  - +0, +1, +2\n  - +0, +1, +3\n  - +0, +1, +4\n  - +0, +1, +5\n  - +0, +1, +6\n- input C2 committing to input C1 at index -1\n\nThe _stacker_ can add an input and output S (using SIGHASH_ALL) to pay for the fees, and construct the following _stack tx_:\n\n```text\n| inputs     |   outputs | \n+============+===========+\n| C1         |        C1 |\n+------------+-----------+\n| C2         |        C2 |\n+------------+-----------+\n| A1         |        A1 |\n+------------+-----------+\n| A2         |        C3 |\n+------------+-----------+\n| B1         |        B1 |\n+------------+-----------+\n| S          |        B2 |\n+------------+-----------+\n|            |        B3 |\n+------------+-----------+\n|            |         S |\n+------------+-----------+\n```\nAlternatively, he could have constructed this transaction as well:\n```text\n| inputs     |   outputs | \n+============+===========+\n| B1         |        B1 |\n+------------+-----------+\n| A1         |        A1 |\n+------------+-----------+\n| A2         |        B2 |\n+------------+-----------+\n| S          |        B3 |\n+------------+-----------+\n| C1         |        C1 |\n+------------+-----------+\n| C2         |        C2 |\n+------------+-----------+\n|            |        C3 |\n+------------+-----------+\n|            |         S |\n+------------+-----------+\n```\n\n\n### Summary table\n\nBelow is a table with the costs for sponsorring/stacking 10 and 100 _identical_ transactions. I chose identical transactions because it is otherwise really hard to make random configurations.\n\n\n|            | N   | CPFP  | Tx Sponsors   | TXSIGHASH     |\n|-|-|-|-|-|\n| 2-in-2-out | 10  | 2769  | 2232 (-537)   | 2165 (-604)   |\n| 2-in-2-out | 100 | 26686 | 21312 (-5374) | 20638 (-6048) |\n| 1-in-4-out | 10  | 3054  | 2517 (-537)   | 2465 (-589)   |\n| 1-in-4-out | 100 | 29536 | 24162 (-5374) | 23640 (-5896) |\n\nOr in vB per _stackee tx_:\n\n|            | N   | base | CPFP | Tx Sponsors    | TXSIGHASH      |\n|-|-|-|-|-|-|\n| 2-in-2-out | 1   | 212  | 378  | 324 (-54,-14%) | 318 (-60,-16%) |\n| 2-in-2-out | 10  | 212  | 277  | 223 (-54,-19%) | 217 (-60,-22%) |\n| 2-in-2-out | 100 | 212  | 267  | 213 (-54,-20%) | 207 (-60,-23%) |\n| 1-in-4-out | 1   | 240  | 406  | 352 (-54,-13%) | 347 (-59,-15%) |\n| 1-in-4-out | 10  | 240  | 306  | 252 (-54,-18%) | 247 (-59,-19%) |\n| 1-in-4-out | 100 | 240  | 296  | 242 (-54,-18%) | 237 (-59,-20%) |\n\n\n# Conclusion\n\nTXSIGHASH based constructions provide an extremely cost-effective way for both sponsorring single transactions and for stacking multiple transactions together, **possibly by a third party. With stacking, the cost in virtual bytes of each stacked transaction can even be lower than their original cost without a sponsor included**.\n\nIt is also worth noting that stacking with TXSIGHASH results in having a single big transaction instead of a series of multiple transactions, like both CPFP and Tx Sponsors. Additionally, all inputs are \"simple\"[^5] key-spends, meaning that they could be aggregated if [CISA](https://bitcoinops.org/en/topics/cross-input-signature-aggregation/) were to be deployed.\n\nThe drawback of sponsorring and stacking using TXSIGHASH is the overhead of creating, storing and relaying multiple variants of the signatures used in the transaction. This has to be done by the creators of any transaction that wants to be eligible for stacking, at the time of its creation. This added complexity can be considered quite significant, especially when compared with Tx Sponsors which doesn't require any special preparation by the original transactions.\n\n\n\n\n\n[^1]: In theory other policies could be used, especially if they include a signature check that can use TXSIGHASH semantics. Other covenant-based policies should be reviewed on an individual basis.\n[^2]: In theory this could maybe be even a 0-byte `TxFieldSelector` as it would make sense to make the \"default\" sighash type to be ALL.\n[^3]: The careful reader will have noted that this construction is vulnerable to an attack where if the user for some reason produces two different signatures for the first input, the other inputs could be linked to the other spends as well. This can be dangerous. Full atomicity can be guaranteed by putting commitments into the annex, but this requires quite some changes. A possible simple and free improvement is that the other inputs also commit to the outputs below their own index. By carefully ordering the outputs by value and putting the largest one at the index equivalent with the last input, the signatures can be made significantly more safe.\n[^4]: This one byte could be saved by defining a new segwit version (v2).\n[^5]:  \"simple\" because they do use different SIGHASHES, but still only have a single pubkey and signature per input",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 76,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Specifying fees upfront in second layer solutions is annoying. Both predicting future feerates and deciding how to allocate the money for the fee are non-trivial problems that can be avoided if fees can be paid when they are needed (just-in-time): when (usually pre-signed) off-chain contracts go on-&hellip;",
  "truncated": true,
  "post_url": "/t/jit-fees-with-txhash-comparing-options-for-sponsorring-and-stacking/1760/1",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}