{
  "id": 5367,
  "name": "Justin (shocknet)",
  "username": "shocknet_justin",
  "avatar_template": "/user_avatar/delvingbitcoin.org/shocknet_justin/{size}/600_2.png",
  "created_at": "2025-06-28T18:12:18.711Z",
  "cooked": "<p>I’m disheartened to see mental cycles as valuable as yours Mr. Beef being used on something like this, onion messages are a terrible thing and beyond saving.</p>\n<p><a href=\"https://stacker.news/items/730371/r/justin_shocknet?commentId=731289\" rel=\"noopener nofollow ugc\">As I have long warned and been vindicated</a>, each hop inherently increases latency and failure probability. This makes OM’s unfit for communication in areas where high reliability and performance are paramount, like payments. Bolt12 has no future because of this.</p>\n<p>Anyone who has used Tor can attest to the fact there is no production value to OM’s. To the extent OM’s work on Lightning even conceptually is due only to the nature of the network being a defacto bonding apparatus, any further decoupling from that can only make reliability worse.</p>\n<p>Now, Lightning would absolutely benefit from a better overlay network for communication, but that is almost unanimously Nostr. Concerns are properly separated, web comportability allows deprecation of things like LNURL, and identity can be either leveraged trivially or entirely de-coupled based on the use-case.</p>\n<p>Better protocols like we’re developing with <a href=\"https://clinkme.dev\" rel=\"noopener nofollow ugc\">CLINK</a> solve the node-to-app coordination problem without the unreliable p2p topology. The preceding link demonstrates Nostr static payment offers that retrieve bolt11 invoices from a simple static web page without wasm, and there are also specs for the reverse flow (debits) and a draft for remote management of static offers (app manages offers on a remote node).</p>",
  "post_number": 2,
  "post_type": 1,
  "posts_count": 11,
  "updated_at": "2025-06-28T18:12:18.711Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 238,
  "reads": 51,
  "readers_count": 50,
  "score": 1195.2,
  "yours": false,
  "topic_id": 1799,
  "topic_slug": "reimagining-onion-messages-as-an-overlay-layer",
  "topic_title": "Reimagining Onion Messages as an Overlay Layer",
  "topic_html_title": "Reimagining Onion Messages as an Overlay Layer",
  "category_id": 7,
  "display_username": "Justin (shocknet)",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I'm disheartened to see mental cycles as valuable as yours Mr. Beef being used on something like this, onion messages are a terrible thing and beyond saving. \n\n[As I have long warned and been vindicated](https://stacker.news/items/730371/r/justin_shocknet?commentId=731289), each hop inherently increases latency and failure probability. This makes OM's unfit for communication in areas where high reliability and performance are paramount, like payments. Bolt12 has no future because of this. \n\nAnyone who has used Tor can attest to the fact there is no production value to OM's. To the extent OM's work on Lightning even conceptually is due only to the nature of the network being a defacto bonding apparatus, any further decoupling from that can only make reliability worse. \n\nNow, Lightning would absolutely benefit from a better overlay network for communication, but that is almost unanimously Nostr. Concerns are properly separated, web comportability allows deprecation of things like LNURL, and identity can be either leveraged trivially or entirely de-coupled based on the use-case. \n\nBetter protocols like we're developing with [CLINK](https://clinkme.dev) solve the node-to-app coordination problem without the unreliable p2p topology. The preceding link demonstrates Nostr static payment offers that retrieve bolt11 invoices from a simple static web page without wasm, and there are also specs for the reverse flow (debits) and a draft for remote management of static offers (app manages offers on a remote node).",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 460,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "I’m disheartened to see mental cycles as valuable as yours Mr. Beef being used on something like this, onion messages are a terrible thing and beyond saving. \n<a href=\"https://stacker.news/items/730371/r/justin_shocknet?commentId=731289\" rel=\"noopener nofollow ugc\">As I have long warned and been vindicated</a>, each hop inherently increases latency and failure probability. This makes OM’s unfit for communica&hellip;",
  "truncated": true,
  "post_url": "/t/reimagining-onion-messages-as-an-overlay-layer/1799/2",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}