{
  "id": 5260,
  "name": "Evan",
  "username": "vnprc",
  "avatar_template": "/user_avatar/delvingbitcoin.org/vnprc/{size}/983_2.png",
  "created_at": "2025-06-09T16:27:14.772Z",
  "cooked": "<blockquote>\n<p>Thanks for the detailed writeup.</p>\n</blockquote>\n<p>You are welcome! It’s my pleasure to explore and write about how CTV materially improves bitcoin. Thank you for reading and commenting.</p>\n<blockquote>\n<p>I do not see how what you describe scales non-custodial mining payouts (the title of this post), or maximizes fee revenues</p>\n</blockquote>\n<p>We can define non-custodial mining payouts as such: newly created UTXOs in the coinbase of a bitcoin block that are unable to be spent by any party other than the intended recipient of that payout. Every large pool today, with the exception of Ocean, sends the coinbase outputs to a custodial wallet and renders payouts from that wallet. This means the pool operator could rug their miners by simply not transferring the bitcoin from their wallet to the miner’s wallet. In this sense, Ocean is a non-custodial pool for all miners who receive a coinbase output in a given Ocean block.</p>\n<p>Ocean is limited in the number of these outputs they can produce each block by two factors. The first is a hard limit: Some ASIC appliance firmware places a limit on the size of the coinbase. The second is a soft limit: since the coinbase counts against the maximum block size limit, pools are incentivized to use the smallest possible coinbase in order to maximize fee revenue in each block.</p>\n<p>CTV sidesteps both limitations. It enables an effectively unlimited number of non-custodial payouts in each block mined while improving pool profitability compared to the status quo. In other words, CTV scales non-custodial mining payouts.</p>\n<blockquote>\n<p>At best this is a congestion control claim</p>\n</blockquote>\n<p>This is not a congestion control claim. The heart of my argument is that CTV unfetters trustless mining payouts. Trusted systems are a security vulnerability, as asserted by Satoshi in the first two sentences of the white paper. CTV can fundamentally improve the trust model of bitcoin mining. Proof of work mining is the foundation of bitcoin’s trust model. Therefore, CTV can be used to fundamentally improve the trust model of bitcoin.</p>\n<blockquote>\n<p>increasing your block space usage would work against maximizing your fee revenues</p>\n</blockquote>\n<p>I’m not sure how you reach this conclusion. You appear to be considering total block space usage for the bitcoin network in the context of a single mining pool. This doesn’t translate. CTV can very slightly increase total blockspace usage but this is not a concern for a mining pool operator unless they are producing all of the blocks on the network. In practice, every custodial pool externalizes their payout costs to future blocks using fanout transactions. My design is only different in the trust model used.</p>\n<blockquote>\n<p>Using Ark for payouts instead introduces some additional assumptions but at least does make sense from a scalability perspective</p>\n</blockquote>\n<p>I am very bullish on Ark for payments. I’m also very excited about how it can be used to improve mining operations and scalability. Again, you are talking about scalability of the entire bitcoin system. In this post I am focused on scaling trustless mining payouts beyond the limitations it faces under current consensus rules.</p>\n<blockquote>\n<p>If the intention of this post was to motivate a CTV soft fork</p>\n</blockquote>\n<p>My intention is to improve bitcoin’s chance of long-term success as a self-sovereign monetary commodity by improving the mining stack. I believe that mining pool centralization is currently the biggest threat to bitcoin and therefore this is the highest impact work I can do. I did not wade into the CTV debate earlier because I didn’t have a concrete proposal in an area of domain expertise. (This was the case the last time we talked.)</p>\n<p>I have chosen a domain. I am working hard to gain practical expertise. And I have found (I believe) a very compelling use for CTV within my domain. I plan to continue building use cases for CTV+CSFS, as indicated at the end of the github readme. If you still question my motives you can also reach out to me personally. I’m always happy to talk to a respected core developer such as yourself.</p>\n<blockquote>\n<p>unrealistic wild claims that twist reality to fit a certain narrative</p>\n</blockquote>\n<p>Greg Maxwell backward engineered a Bitmain ASIC appliance to demonstrate how it was capable of covert ASIC boost. This is what settled the block size debate for me personally by revealing the motivations of the primary economic actor opposing the segwit soft fork.</p>\n<p>Covert ASICboost was obsoleted by the segwit soft fork, demonstrating to me that it is easier to change bitcoin than to change Bitmain firmware or hardware. This is a subjective claim and, as such, it cannot be proven or disproven. You can choose to agree or disagree. I only made this statement in response to a subjective criticism of my proposal.</p>\n<p>I don’t believe we can fix the deep and long-running problems in the bitcoin mining stack by being ignorant of history or naive about the motivations of the largest actors in this space. My claims are not unrealistic or wild and they do not distort reality or promote a narrative other than that which is supported by the historical facts.</p>\n<p>Here is some reading material if you don’t believe me.</p>\n<p>Greg’s initial claim about reverse engineering the ASIC:\n</p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://gnusha.org/pi/bitcoindev/CAAS2fgR84898xD0nyq7ykJnB7qkdoCJYnFg6z5WZEUu0+-=mMA@mail.gmail.com/\">\n  <header class=\"source\">\n\n      <a href=\"https://gnusha.org/pi/bitcoindev/CAAS2fgR84898xD0nyq7ykJnB7qkdoCJYnFg6z5WZEUu0+-=mMA@mail.gmail.com/\" target=\"_blank\" rel=\"noopener nofollow ugc\">gnusha.org</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    \n\n<h3><a href=\"https://gnusha.org/pi/bitcoindev/CAAS2fgR84898xD0nyq7ykJnB7qkdoCJYnFg6z5WZEUu0+-=mMA@mail.gmail.com/\" target=\"_blank\" rel=\"noopener nofollow ugc\">[bitcoin-dev] BIP proposal: Inhibiting a covert attack on the Bitcoin POW...</a></h3>\n\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>This reddit thread shows achow confirming with greg over IRC how he did it:\n<a href=\"https://www.reddit.com/r/Bitcoin/comments/63soe3/comment/dfx9ncr/\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://www.reddit.com/r/Bitcoin/comments/63soe3/comment/dfx9ncr/</a></p>\n<p>The smoking gun, IMO, was when Braiins shipped the option to activate covert ASICboost on their S9 firmware.\n<a href=\"https://www.ccn.com/under-pressure-bitmain-releases-patch-to-let-bitcoin-miners-activate-overt-asicboost/\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://www.ccn.com/under-pressure-bitmain-releases-patch-to-let-bitcoin-miners-activate-overt-asicboost/</a></p>",
  "post_number": 8,
  "post_type": 1,
  "posts_count": 17,
  "updated_at": "2025-06-09T17:17:42.242Z",
  "reply_count": 2,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 29,
  "readers_count": 28,
  "score": 30.8,
  "yours": false,
  "topic_id": 1753,
  "topic_slug": "scaling-noncustodial-mining-payouts-with-ctv",
  "topic_title": "Scaling Noncustodial Mining Payouts with CTV",
  "topic_html_title": "Scaling Noncustodial Mining Payouts with CTV",
  "category_id": 7,
  "display_username": "Evan",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": "",
  "bookmarked": false,
  "raw": "> Thanks for the detailed writeup.\n\nYou are welcome! It's my pleasure to explore and write about how CTV materially improves bitcoin. Thank you for reading and commenting.\n\n> I do not see how what you describe scales non-custodial mining payouts (the title of this post), or maximizes fee revenues\n\nWe can define non-custodial mining payouts as such: newly created UTXOs in the coinbase of a bitcoin block that are unable to be spent by any party other than the intended recipient of that payout. Every large pool today, with the exception of Ocean, sends the coinbase outputs to a custodial wallet and renders payouts from that wallet. This means the pool operator could rug their miners by simply not transferring the bitcoin from their wallet to the miner's wallet. In this sense, Ocean is a non-custodial pool for all miners who receive a coinbase output in a given Ocean block.\n\nOcean is limited in the number of these outputs they can produce each block by two factors. The first is a hard limit: Some ASIC appliance firmware places a limit on the size of the coinbase. The second is a soft limit: since the coinbase counts against the maximum block size limit, pools are incentivized to use the smallest possible coinbase in order to maximize fee revenue in each block.\n\nCTV sidesteps both limitations. It enables an effectively unlimited number of non-custodial payouts in each block mined while improving pool profitability compared to the status quo. In other words, CTV scales non-custodial mining payouts.\n\n> At best this is a congestion control claim\n\nThis is not a congestion control claim. The heart of my argument is that CTV unfetters trustless mining payouts. Trusted systems are a security vulnerability, as asserted by Satoshi in the first two sentences of the white paper. CTV can fundamentally improve the trust model of bitcoin mining. Proof of work mining is the foundation of bitcoin's trust model. Therefore, CTV can be used to fundamentally improve the trust model of bitcoin.\n\n> increasing your block space usage would work against maximizing your fee revenues\n\nI'm not sure how you reach this conclusion. You appear to be considering total block space usage for the bitcoin network in the context of a single mining pool. This doesn't translate. CTV can very slightly increase total blockspace usage but this is not a concern for a mining pool operator unless they are producing all of the blocks on the network. In practice, every custodial pool externalizes their payout costs to future blocks using fanout transactions. My design is only different in the trust model used.\n\n> Using Ark for payouts instead introduces some additional assumptions but at least does make sense from a scalability perspective\n\nI am very bullish on Ark for payments. I'm also very excited about how it can be used to improve mining operations and scalability. Again, you are talking about scalability of the entire bitcoin system. In this post I am focused on scaling trustless mining payouts beyond the limitations it faces under current consensus rules.\n\n> If the intention of this post was to motivate a CTV soft fork\n\nMy intention is to improve bitcoin's chance of long-term success as a self-sovereign monetary commodity by improving the mining stack. I believe that mining pool centralization is currently the biggest threat to bitcoin and therefore this is the highest impact work I can do. I did not wade into the CTV debate earlier because I didn't have a concrete proposal in an area of domain expertise. (This was the case the last time we talked.)\n\nI have chosen a domain. I am working hard to gain practical expertise. And I have found (I believe) a very compelling use for CTV within my domain. I plan to continue building use cases for CTV+CSFS, as indicated at the end of the github readme. If you still question my motives you can also reach out to me personally. I'm always happy to talk to a respected core developer such as yourself.\n\n> unrealistic wild claims that twist reality to fit a certain narrative\n\nGreg Maxwell backward engineered a Bitmain ASIC appliance to demonstrate how it was capable of covert ASIC boost. This is what settled the block size debate for me personally by revealing the motivations of the primary economic actor opposing the segwit soft fork.\n\nCovert ASICboost was obsoleted by the segwit soft fork, demonstrating to me that it is easier to change bitcoin than to change Bitmain firmware or hardware. This is a subjective claim and, as such, it cannot be proven or disproven. You can choose to agree or disagree. I only made this statement in response to a subjective criticism of my proposal.\n\nI don't believe we can fix the deep and long-running problems in the bitcoin mining stack by being ignorant of history or naive about the motivations of the largest actors in this space. My claims are not unrealistic or wild and they do not distort reality or promote a narrative other than that which is supported by the historical facts.\n\nHere is some reading material if you don't believe me.\n\nGreg's initial claim about reverse engineering the ASIC:\nhttps://gnusha.org/pi/bitcoindev/CAAS2fgR84898xD0nyq7ykJnB7qkdoCJYnFg6z5WZEUu0+-=mMA@mail.gmail.com/\n\nThis reddit thread shows achow confirming with greg over IRC how he did it:\nhttps://www.reddit.com/r/Bitcoin/comments/63soe3/comment/dfx9ncr/\n\nThe smoking gun, IMO, was when Braiins shipped the option to activate covert ASICboost on their S9 firmware.\nhttps://www.ccn.com/under-pressure-bitmain-releases-patch-to-let-bitcoin-miners-activate-overt-asicboost/",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 503,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Thanks for the detailed writeup. \n\nYou are welcome! It’s my pleasure to explore and write about how CTV materially improves bitcoin. Thank you for reading and commenting. \n\nI do not see how what you describe scales non-custodial mining payouts (the title of this post), or maximizes fee revenues \n\nW&hellip;",
  "truncated": true,
  "post_url": "/t/scaling-noncustodial-mining-payouts-with-ctv/1753/8",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}