{
  "id": 6704,
  "name": "Pieter Wuille",
  "username": "sipa",
  "avatar_template": "/user_avatar/delvingbitcoin.org/sipa/{size}/1100_2.png",
  "created_at": "2026-01-28T20:12:17.340Z",
  "cooked": "<p>I’m going to be blunt here. I realize it’s petty to criticize just the name of a proposal, but I’m pretty annoyed here because I feel you’re not understanding my comments.</p>\n<p>BIP-360 as <a href=\"https://github.com/cryptoquick/bips/blob/c7b11d7b3753bc6984c2e12b1ddf212610aa8947/bip-0360.mediawiki\">written</a> in the open PR is essentially “all of BIP-341, but remove taproot”. Why do you want the keep the name “tap”/“taproot” in there? It’s exactly <strong>not</strong> taproot.</p>\n<p>BIP-342 defines “tapscript”: the specific variant of Bitcoin Script that is used in BIP-341 script tree leaves with leaf version 0xc0. My understanding is that BIP-360 intends(*) to inherit <strong>all</strong> semantics from the BIP-341 script tree - whether that’s the BIP-342 semantics for 0xc0 leaves, or any future script semantics added separately. For that reason, I think invoking the name “tapscript” here is just <strong>wrong</strong>: it’s not paying to “tapscript”, it’s paying to a tree of scripts which include any and all script types (even though tapscript is currently the only one defined). If your intent is to <em>only</em> allow paying to BIP-342 tapscript, that is not clear at all.</p>\n<hr>\n<blockquote>\n<p>The reason I chose Pay to Tapscript Hash was because it rhymes with Pay to Script Hash and Pay to Witness Script Hash.</p>\n</blockquote>\n<p>Because it <strong>rhymes</strong>? You’re seriously suggesting that’s a justification for giving a misleading name?</p>\n<blockquote>\n<p>I also ran it by Stephen Roose in a past thread here on Delving and he gave me the thumbs up on it.</p>\n</blockquote>\n<p>…</p>\n<blockquote>\n<p>Also, MAST is confusing because Merkelized Alternative Script Trees are different than prior MAST proposals, and the retronym makes it more difficult to disambiguate.</p>\n</blockquote>\n<p>Fair enough.</p>\n<blockquote>\n<p>As for the suggestions, P2STMR, P2TTR, and P2MAST are not superior acronyms in my opinion, at least, from an aesthetic sense…</p>\n</blockquote>\n<p>…</p>\n<blockquote>\n<p>I think it should end in the word Hash because it helps communicate quantum resistance.</p>\n</blockquote>\n<p>Sigh, ok.</p>\n<blockquote>\n<p>And while naming is subjective and difficult and imperfect, I think P2TSH works well in the context of what’s currently in Bitcoin now.</p>\n</blockquote>\n<p>I think it’s highly misleading, and you’re doing the ecosystem a disservice by letting aesthetics guide things.</p>\n<p>If you insist on having “hash” at the end, at least “pay to script tree hash” wouldn’t be misleading.</p>\n<hr>\n<p>(*) I note that BIP-360 just copies the line</p>\n<blockquote>\n<p>Execute the script, according to the applicable script rules, using the witness stack elements excluding the script <em>s</em>, the control block <em>c</em>, and the annex <em>a</em> if present, as initial stack.</p>\n</blockquote>\n<p>… from BIP-341, but then never defines what the applicable script rules are. Since BIP-342 specifically says it only applies when spending BIP-341 outputs, and BIP-360 outputs are not that, technically there just aren’t any applicable spending rules according to the current writing, and any leaf is an anyone-can-spend. I assume that’s not what you meant, but it’s worth addressing too.</p>",
  "post_number": 8,
  "post_type": 1,
  "posts_count": 9,
  "updated_at": "2026-01-28T22:26:36.000Z",
  "reply_count": 1,
  "reply_to_post_number": 7,
  "quote_count": 0,
  "incoming_link_count": 1,
  "reads": 9,
  "readers_count": 8,
  "score": 21.8,
  "yours": false,
  "topic_id": 2170,
  "topic_slug": "major-bip-360-update",
  "topic_title": "Major BIP 360 Update",
  "topic_html_title": "Major BIP 360 Update",
  "category_id": 7,
  "display_username": "Pieter Wuille",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 3,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 65,
    "username": "cryptoquick",
    "name": "Hunter Beast",
    "avatar_template": "/user_avatar/delvingbitcoin.org/cryptoquick/{size}/977_2.png"
  },
  "bookmarked": false,
  "raw": "I'm going to be blunt here. I realize it's petty to criticize just the name of a proposal, but I'm pretty annoyed here because I feel you're not understanding my comments.\n\nBIP-360 as [written](https://github.com/cryptoquick/bips/blob/c7b11d7b3753bc6984c2e12b1ddf212610aa8947/bip-0360.mediawiki) in the open PR is essentially \"all of BIP-341, but remove taproot\". Why do you want the keep the name \"tap\"/\"taproot\" in there? It's exactly **not** taproot.\n\nBIP-342 defines \"tapscript\": the specific variant of Bitcoin Script that is used in BIP-341 script tree leaves with leaf version 0xc0. My understanding is that BIP-360 intends(*) to inherit **all** semantics from the BIP-341 script tree - whether that's the BIP-342 semantics for 0xc0 leaves, or any future script semantics added separately. For that reason, I think invoking the name \"tapscript\" here is just **wrong**: it's not paying to \"tapscript\", it's paying to a tree of scripts which include any and all script types (even though tapscript is currently the only one defined). If your intent is to *only* allow paying to BIP-342 tapscript, that is not clear at all.\n\n---\n\n> The reason I chose Pay to Tapscript Hash was because it rhymes with Pay to Script Hash and Pay to Witness Script Hash.\n\nBecause it **rhymes**? You're seriously suggesting that's a justification for giving a misleading name?\n\n> I also ran it by Stephen Roose in a past thread here on Delving and he gave me the thumbs up on it.\n\n...\n\n> Also, MAST is confusing because Merkelized Alternative Script Trees are different than prior MAST proposals, and the retronym makes it more difficult to disambiguate.\n\nFair enough.\n\n> As for the suggestions, P2STMR, P2TTR, and P2MAST are not superior acronyms in my opinion, at least, from an aesthetic sense…\n\n...\n\n> I think it should end in the word Hash because it helps communicate quantum resistance.\n\nSigh, ok.\n\n> And while naming is subjective and difficult and imperfect, I think P2TSH works well in the context of what’s currently in Bitcoin now.\n\nI think it's highly misleading, and you're doing the ecosystem a disservice by letting aesthetics guide things.\n\nIf you insist on having \"hash\" at the end, at least \"pay to script tree hash\" wouldn't be misleading.\n\n---\n\n(*) I note that BIP-360 just copies the line\n\n> Execute the script, according to the applicable script rules, using the witness stack elements excluding the script *s*, the control block *c*, and the annex *a* if present, as initial stack.\n\n... from BIP-341, but then never defines what the applicable script rules are. Since BIP-342 specifically says it only applies when spending BIP-341 outputs, and BIP-360 outputs are not that, technically there just aren't any applicable spending rules according to the current writing, and any leaf is an anyone-can-spend. I assume that's not what you meant, but it's worth addressing too.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 96,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "I’m going to be blunt here. I realize it’s petty to criticize just the name of a proposal, but I’m pretty annoyed here because I feel you’re not understanding my comments. \nBIP-360 as <a href=\"https://github.com/cryptoquick/bips/blob/c7b11d7b3753bc6984c2e12b1ddf212610aa8947/bip-0360.mediawiki\">written</a> in the open PR is essentially “all of BIP-341, but remove taproot”. Why do you want the keep the name “tap”/&hellip;",
  "truncated": true,
  "post_url": "/t/major-bip-360-update/2170/8",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}