{
  "id": 4029,
  "name": "Antoine Riard",
  "username": "ariard",
  "avatar_template": "/letter_avatar_proxy/v4/letter/a/c67d28/{size}.png",
  "created_at": "2025-01-10T00:46:34.422Z",
  "cooked": "<p>Giving an update on this thread.</p>\n<p>I’ll pursue Matthew Corallo in front of courts of justice, be it a North Carolina one or another competent US court.</p>\n<p>I started to contribute on the rust-lightning project in 2018, when it was actually 2 active contributors working on it, i.e only Mr Corallo and myself, far before Square Crypto was a thing, so we know each other quite well.</p>\n<p>This will avoid unrelated third-party people like Rusty Russell again being lied to and being instrumentalized to serve the very private interest of Mr. Corallo, or also as I might suspect a commercial interest of Mr. Corallo’s current employer.</p>\n<p>I’ve been asked by some journalists to clarify what’s going with those issues, and again very recently by people I’m usually not connected with, so I’ll re-said in public what I’ve been saying in private.</p>\n<p>Those issues are not related to the US national security. Neither anything w.r.t US intelligence agencies.</p>\n<p>This is more simply an old-fashion quarrel among 2 foss guys. One guy thinks he’s the benevolent dictator for life of each open-source project he’s touching, and in consequence\nthat other contributors should just shut up and obey, and even believe it’s okay to do private phone calls to threat the professional reputations of the ones who don’t comply.</p>\n<p>The other guy disagrees.</p>\n<p>Courts of justice it’s usually the civilized way of solving conflicts among grown up people. It will take the time that it will takes, years if we have to. The timeframe of courts of justice is usually not the one of publishing an online social media post, and there people most of time, think before to speak.</p>\n<p>It will be interesting to have a US court of justice have a say on what “decentralization” really means in an open-source project. Up to the Supreme Court of the US, if it’s necessary.</p>\n<p>Warmly,</p>\n<p>Antoine Riard.</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2025-01-10T00:46:34.422Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 1,
  "readers_count": 0,
  "score": 0.2,
  "yours": false,
  "topic_id": 1254,
  "topic_slug": "code-of-conduct-violation-banning-antoine-riard-for-3-months",
  "topic_title": "Code of Conduct Violation: Banning Antoine Riard for 3 months",
  "topic_html_title": "Code of Conduct Violation: Banning Antoine Riard for 3 months",
  "category_id": 7,
  "display_username": "Antoine Riard",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Giving an update on this thread.\n\nI'll pursue Matthew Corallo in front of courts of justice, be it a North Carolina one or another competent US court.\n\nI started to contribute on the rust-lightning project in 2018, when it was actually 2 active contributors working on it, i.e only Mr Corallo and myself, far before Square Crypto was a thing, so we know each other quite well.\n\nThis will avoid unrelated third-party people like Rusty Russell again being lied to and being instrumentalized to serve the very private interest of Mr. Corallo, or also as I might suspect a commercial interest of Mr. Corallo's current employer.\n\nI've been asked by some journalists to clarify what's going with those issues, and again very recently by people I'm usually not connected with, so I'll re-said in public what I've been saying in private.\n\nThose issues are not related to the US national security. Neither anything w.r.t US intelligence agencies.\n\nThis is more simply an old-fashion quarrel among 2 foss guys. One guy thinks he’s the benevolent dictator for life of each open-source project he's touching, and in consequence\nthat other contributors should just shut up and obey, and even believe it's okay to do private phone calls to threat the professional reputations of the ones who don't comply.\n\nThe other guy disagrees.\n\nCourts of justice it's usually the civilized way of solving conflicts among grown up people. It will take the time that it will takes, years if we have to. The timeframe of courts of justice is usually not the one of publishing an online social media post, and there people most of time, think before to speak.\n\nIt will be interesting to have a US court of justice have a say on what “decentralization” really means in an open-source project. Up to the Supreme Court of the US, if it’s necessary.\n\nWarmly,\n\nAntoine Riard.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 5,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}