{
  "id": 3993,
  "name": "Bob McElrath",
  "username": "mcelrath",
  "avatar_template": "/user_avatar/delvingbitcoin.org/mcelrath/{size}/521_2.png",
  "created_at": "2025-01-06T20:15:06.043Z",
  "cooked": "<p>I present a challenge for all the covenant aficionados out there, and your favorite opcode. I’m looking for specific covenant proposals which accomplish the following:</p>\n<h2><a name=\"p-3993-background-1\" class=\"anchor\" href=\"#p-3993-background-1\"></a>Background</h2>\n<p><a href=\"https://github.com/braidpool/braidpool\" rel=\"noopener nofollow ugc\">Braidpool</a> (A decentralized mining pool) will need to custody coinbase rewards across multiple blocks. For this I have proposed using a FROST federation which signs two chained transactions RCA and UHPO for this:</p>\n<p>Coinbase → RCA → UHPO</p>\n<p><a href=\"https://github.com/braidpool/braidpool/blob/6bc7785c7ee61ea1379ae971ecf8ebca1f976332/docs/braidpool_spec.md#payout-update\" rel=\"noopener nofollow ugc\">Rolling Coinbase Aggregation (RCA)</a>: This is an Eltoo transaction on-chain that aggregates the most recent coinbase with the previous (aggregated) coinbase(es).</p>\n<p><a href=\"https://github.com/braidpool/braidpool/blob/6bc7785c7ee61ea1379ae971ecf8ebca1f976332/docs/braidpool_spec.md#unspent-hasher-payment-output\" rel=\"noopener nofollow ugc\">Unspent Hasher Payout Object (UHPO)</a>: One or more transactions that spends the RCA and pays all hashers in proportion to the work contributed. This transaction is timelocked and cannot be broadcast until the end of a difficulty adjustment window (the “settlement period”), at which time the most recently created UHPO is broadcast (with all previous UHPOs invalidated by the Eltoo mechanism of its parent RCA) and pays all miners for the preceding settlement period.</p>\n<p>I have proposed using a <a href=\"https://github.com/pool2win/frost-federation\" rel=\"noopener nofollow ugc\">FROST federation</a> in development by <a class=\"mention\" href=\"/u/jungly\">@jungly</a> for this. Our construction has the following properties:</p>\n<ol>\n<li>The UHPO transaction is constructed and signed or committed to first. All federation signing nodes can independently construct and verify the payouts in the UHPO transaction because they each have a copy of the Braidpool DAG with share information.</li>\n<li>The RCA transaction is signed or committed to after the UHPO transaction is signed by a quorum of federation nodes.</li>\n<li>The Byzantine fault tolerant signing quorum is 3f+1 or 67% of the signing nodes.</li>\n</ol>\n<p>The FROST Federation has a number of drawbacks, not the least of which is a 51% attack (or 67% attack) on the pool, if federation membership is decided by PoW, which could steal all funds. If federation membership is decided by some other manner this results in a highly political process at odds with the decentralized nature of Bitcoin, and theft is still a possibility. I wish to consider a covenant-based alternative which eschews the need for custody entirely, or achieves a “can’t-be-evil” philosophy where only the correct payouts can happen.</p>\n<h2><a name=\"p-3993-requirements-2\" class=\"anchor\" href=\"#p-3993-requirements-2\"></a>Requirements</h2>\n<ol>\n<li>The RCA transaction must either: be aggregated with another coinbase to create a new RCA transaction (Eltoo) OR (after a timelock) be spent in a UHPO transaction. It must not be spendable in any other way.</li>\n<li>A block with an incorrect payout not satisfying the requirements of the RCA or UHPO must be spendable (after a possible timelock) as solo-mined block, and will not be considered a “share” by the pool.</li>\n<li>Coinbase outputs must have a timelock that falls back to solo mining, so that in the event of a pool failure (RCA not constructed/mined), all miners with blocks not aggregated in the RCA can claim their blocks as solo mined blocks.</li>\n<li>Each new block found by the pool modifies the set of payouts in the next UHPO, so the UHPO from the previous block can’t know the correct payouts in the next block and can’t commit to it.</li>\n<li>In the event of an incorrect RCA or UHPO transaction or 51%/67% attack on the FROST federation signing, and a theft attempt is broadcast or otherwise detected against the RCA or UHPO, the “last-known-good” UHPO transaction must become immediately broadcastable, evading its usual timelock, and ensuring that the RCA Eltoo mechanism is invalidated for future blocks. The pool becomes entirely solo-mining or shuts down in this case.</li>\n<li>Assume that information necessary to construct the UHPO is known at the time a block template is constructed, and can be committed to in a block. (It’s the INPUT to this UHPO tx that requires custody across multiple blocks)</li>\n<li>You must take into account the 100 block coinbase maturity rule.</li>\n</ol>\n<p>A couple suggestions:</p>\n<ol>\n<li>You MAY choose that the UHPO has all the same outputs as the previous UHPO, with amounts that are greater than or equal to the previous UHPO, with additional outputs added.</li>\n<li>You MAY spend the entire RCA to fees if it is included in a pool’s block, in order to get rid of the RCA and have the UHPO directly committed to by the coinbase output. (As long as this can’t be stolen by another miner)</li>\n<li>You MAY eschew the RCA mechanism in favor of taking all coinbase outputs from the previous settlement period as inputs.</li>\n</ol>\n<p>Something deviating from the above outlined structure is welcome as well, if it achieves the goal of ensuring that everyone gets paid correctly and uses covenants.</p>\n<p>A proof of impossibility would be welcome as well.</p>\n<p>P.S. I have avoided describing other approaches that we might take here to keep it concise. (e.g. the P2Pool/Eligus/OCEAN mechanism of paying PPLNS in coinbases – we can always fall back on that but it’s been done has well known drawbacks) If that info would be helpful I can write it up in a separate post or doc on the Braidpool github. (msg me privately if that is of interest)</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2025-01-06T20:20:08.337Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 115,
  "reads": 26,
  "readers_count": 25,
  "score": 575.0,
  "yours": false,
  "topic_id": 1370,
  "topic_slug": "challenge-covenants-for-braidpool",
  "topic_title": "Challenge: Covenants for Braidpool",
  "topic_html_title": "Challenge: Covenants for Braidpool",
  "category_id": 7,
  "display_username": "Bob McElrath",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I present a challenge for all the covenant aficionados out there, and your favorite opcode. I'm looking for specific covenant proposals which accomplish the following:\n\n## Background\n\n[Braidpool](https://github.com/braidpool/braidpool) (A decentralized mining pool) will need to custody coinbase rewards across multiple blocks. For this I have proposed using a FROST federation which signs two chained transactions RCA and UHPO for this:\n\nCoinbase -> RCA -> UHPO\n\n[Rolling Coinbase Aggregation (RCA)](https://github.com/braidpool/braidpool/blob/6bc7785c7ee61ea1379ae971ecf8ebca1f976332/docs/braidpool_spec.md#payout-update): This is an Eltoo transaction on-chain that aggregates the most recent coinbase with the previous (aggregated) coinbase(es).\n\n[Unspent Hasher Payout Object (UHPO)](https://github.com/braidpool/braidpool/blob/6bc7785c7ee61ea1379ae971ecf8ebca1f976332/docs/braidpool_spec.md#unspent-hasher-payment-output): One or more transactions that spends the RCA and pays all hashers in proportion to the work contributed. This transaction is timelocked and cannot be broadcast until the end of a difficulty adjustment window (the \"settlement period\"), at which time the most recently created UHPO is broadcast (with all previous UHPOs invalidated by the Eltoo mechanism of its parent RCA) and pays all miners for the preceding settlement period.\n\nI have proposed using a [FROST federation](https://github.com/pool2win/frost-federation) in development by @jungly for this. Our construction has the following properties:\n\n1. The UHPO transaction is constructed and signed or committed to first. All federation signing nodes can independently construct and verify the payouts in the UHPO transaction because they each have a copy of the Braidpool DAG with share information.\n2. The RCA transaction is signed or committed to after the UHPO transaction is signed by a quorum of federation nodes.\n3. The Byzantine fault tolerant signing quorum is 3f+1 or 67% of the signing nodes.\n\nThe FROST Federation has a number of drawbacks, not the least of which is a 51% attack (or 67% attack) on the pool, if federation membership is decided by PoW, which could steal all funds. If federation membership is decided by some other manner this results in a highly political process at odds with the decentralized nature of Bitcoin, and theft is still a possibility. I wish to consider a covenant-based alternative which eschews the need for custody entirely, or achieves a \"can't-be-evil\" philosophy where only the correct payouts can happen.\n\n## Requirements\n\n1. The RCA transaction must either: be aggregated with another coinbase to create a new RCA transaction (Eltoo) OR (after a timelock) be spent in a UHPO transaction. It must not be spendable in any other way.\n2. A block with an incorrect payout not satisfying the requirements of the RCA or UHPO must be spendable (after a possible timelock) as solo-mined block, and will not be considered a \"share\" by the pool.\n3. Coinbase outputs must have a timelock that falls back to solo mining, so that in the event of a pool failure (RCA not constructed/mined), all miners with blocks not aggregated in the RCA can claim their blocks as solo mined blocks.\n4. Each new block found by the pool modifies the set of payouts in the next UHPO, so the UHPO from the previous block can't know the correct payouts in the next block and can't commit to it.\n5. In the event of an incorrect RCA or UHPO transaction or 51%/67% attack on the FROST federation signing, and a theft attempt is broadcast or otherwise detected against the RCA or UHPO, the \"last-known-good\" UHPO transaction must become immediately broadcastable, evading its usual timelock, and ensuring that the RCA Eltoo mechanism is invalidated for future blocks. The pool becomes entirely solo-mining or shuts down in this case.\n6. Assume that information necessary to construct the UHPO is known at the time a block template is constructed, and can be committed to in a block. (It's the INPUT to this UHPO tx that requires custody across multiple blocks)\n7. You must take into account the 100 block coinbase maturity rule.\n\nA couple suggestions:\n1. You MAY choose that the UHPO has all the same outputs as the previous UHPO, with amounts that are greater than or equal to the previous UHPO, with additional outputs added.\n2. You MAY spend the entire RCA to fees if it is included in a pool's block, in order to get rid of the RCA and have the UHPO directly committed to by the coinbase output. (As long as this can't be stolen by another miner)\n3. You MAY eschew the RCA mechanism in favor of taking all coinbase outputs from the previous settlement period as inputs.\n\nSomething deviating from the above outlined structure is welcome as well, if it achieves the goal of ensuring that everyone gets paid correctly and uses covenants.\n\nA proof of impossibility would be welcome as well.\n\nP.S. I have avoided describing other approaches that we might take here to keep it concise. (e.g. the P2Pool/Eligus/OCEAN mechanism of paying PPLNS in coinbases -- we can always fall back on that but it's been done has well known drawbacks) If that info would be helpful I can write it up in a separate post or doc on the Braidpool github. (msg me privately if that is of interest)",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 406,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}