{
  "id": 3920,
  "name": "Zawy",
  "username": "zawy",
  "avatar_template": "/user_avatar/delvingbitcoin.org/zawy/{size}/750_2.png",
  "created_at": "2025-01-02T15:50:56.859Z",
  "cooked": "<p>Here’s a chart showing the problem. All DAG’s must not accept new parents who have parents that are “too old”. Consensus is formed because (and when) when you stop letting in those ‘old’ blocks. As a result of having a cut-off, there can be forks where PoW will decide the winner.</p>\n<p>The chart below uses a cut-off, but not exactly like the above because it assumes all miners are honest. The DAA does a “look-back” of only 7 blocks to have a fast consensus. In this example, 15% of the hashrate has an ever-increasing latency indicated by the steps (this has the same effect as if 85% of hashrate had a decreasing latency). Since the network hashrate is constant, when the difficulty starts dropping (instead of increasing with average latency due to the 15%), it’s the result of those high-latency miners producing blocks the DAA can’t see (they’ll be orphaned). It thinks the hashrate is lower.\n<div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/1X/fdbf74080e29571834eb57bb9829f65192bcbe5f.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/fdbf74080e29571834eb57bb9829f65192bcbe5f\" title=\"image\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/1X/fdbf74080e29571834eb57bb9829f65192bcbe5f_2_690x346.png\" alt=\"image\" data-base62-sha1=\"AcKZaVVR7YWxlqaOkR7xH6TwPvx\" width=\"690\" height=\"346\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/1X/fdbf74080e29571834eb57bb9829f65192bcbe5f_2_690x346.png, https://delvingbitcoin.org/uploads/default/optimized/1X/fdbf74080e29571834eb57bb9829f65192bcbe5f_2_1035x519.png 1.5x, https://delvingbitcoin.org/uploads/default/optimized/1X/fdbf74080e29571834eb57bb9829f65192bcbe5f_2_1380x692.png 2x\" data-dominant-color=\"FAF8F6\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">image</span><span class=\"informations\">1923×965 128 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p>I may have a solution, or partial solution. Instead of (only) looking at parents.  I can base the DAA difficulty on a count of grandparents and maybe great-grandparents.  If a parent block cites as his parent(s) what other parents (his “siblings”) are calling grandparent, that block has a higher probability of having a higher latency than his siblings. It doesn’t occur often if everyone has the same latency, so I can increase difficulty a lot when it happens and it has little average effect, but if it happens more than expected due to miners with a much higher latency than the average, it can have a large effect. In other words, if the statistics that assume everyone has the same latency are being violated, it gives an increased difficulty which benefits the slow miners by slowing down block time (while not changing the look-back block count) so that they don’t fall outside the “look-back” window.  It gives less incentive to get your latency below the average while still incentivising everyone to get lower latency, if they want more blocks per real time.</p>",
  "post_number": 7,
  "post_type": 1,
  "updated_at": "2025-01-02T16:04:00.283Z",
  "reply_count": 1,
  "reply_to_post_number": 6,
  "quote_count": 0,
  "incoming_link_count": 11,
  "reads": 16,
  "readers_count": 15,
  "score": 63.2,
  "yours": false,
  "topic_id": 1331,
  "topic_slug": "fastest-possible-pow-via-simple-dag",
  "topic_title": "Fastest-possible PoW via Simple DAG",
  "topic_html_title": "Fastest-possible PoW via Simple DAG",
  "category_id": 5,
  "display_username": "Zawy",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "sipa",
    "name": "Pieter Wuille",
    "avatar_template": "/user_avatar/delvingbitcoin.org/sipa/{size}/102_2.png"
  },
  "bookmarked": false,
  "raw": "Here's a chart showing the problem. All DAG's must not accept new parents who have parents that are \"too old\". Consensus is formed because (and when) when you stop letting in those 'old' blocks. As a result of having a cut-off, there can be forks where PoW will decide the winner.  \n\nThe chart below uses a cut-off, but not exactly like the above because it assumes all miners are honest. The DAA does a \"look-back\" of only 7 blocks to have a fast consensus. In this example, 15% of the hashrate has an ever-increasing latency indicated by the steps (this has the same effect as if 85% of hashrate had a decreasing latency). Since the network hashrate is constant, when the difficulty starts dropping (instead of increasing with average latency due to the 15%), it's the result of those high-latency miners producing blocks the DAA can't see (they'll be orphaned). It thinks the hashrate is lower. \n![image|690x346](upload://AcKZaVVR7YWxlqaOkR7xH6TwPvx.png)\n\nI may have a solution, or partial solution. Instead of (only) looking at parents.  I can base the DAA difficulty on a count of grandparents and maybe great-grandparents.  If a parent block cites as his parent(s) what other parents (his \"siblings\") are calling grandparent, that block has a higher probability of having a higher latency than his siblings. It doesn't occur often if everyone has the same latency, so I can increase difficulty a lot when it happens and it has little average effect, but if it happens more than expected due to miners with a much higher latency than the average, it can have a large effect. In other words, if the statistics that assume everyone has the same latency are being violated, it gives an increased difficulty which benefits the slow miners by slowing down block time (while not changing the look-back block count) so that they don't fall outside the \"look-back\" window.  It gives less incentive to get your latency below the average while still incentivising everyone to get lower latency, if they want more blocks per real time.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 502,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}