{
  "id": 5656,
  "name": "Garlo Nicon",
  "username": "garlonicon",
  "avatar_template": "/letter_avatar_proxy/v4/letter/g/278dde/{size}.png",
  "created_at": "2025-08-06T06:01:50.120Z",
  "cooked": "<blockquote>\n<p>Are there any proposed solutions to avoid or remove institutional and oligarchic centralization in Bitcoin?</p>\n</blockquote>\n<p>No, because if someone would want to buy 99% of coins, then nothing would stop that people.</p>\n<blockquote>\n<p>Institutional Bitcoins could be replicated into a personal wallet, but this replication should have a maximum socially congruent limit (maybe 10 or 20 times the average wealth of a global citizen).</p>\n</blockquote>\n<p>So, you want to say to any whale something like “you can no longer buy any coins, and it is enforced by consensus rules”? If so, then it could be easily bypassed. A lot of people know nothing about technical details, so they can be easily tricked to share their IDs. As an example, you can see, what happened when IDs were assigned to SIM cards in phones: now, you can find a lot of individuals, who will register you any SIM card on their behalf, and for a few bucks, you can easily use someone else’s identity, to own more phone numbers, than you should. Not to mention what happened in 2021 or 2022, when people couldn’t travel without being identified as “healthy”, and how they bypassed any “stay at home” rules.</p>\n<blockquote>\n<p>Bitcoins that aren’t reclaimed under the replication period (maybe 3 months), should be nonexistent in the new blockchain, so they are available to be mined as fresh new Bitcoins.</p>\n</blockquote>\n<p>In other words: you want to make a hard-fork, which would allow stealing coins, and moving them to some new owners, while skipping initial Script rules. Many users won’t join your altcoin, because if you do it once, then how people can be sure, that you won’t do that again? It’s very similar as in quantum proposals: if coins will be burned, and then magically unlocked through hard-fork, instead of being simply frozen, and moved normally later, by meeting old Script conditions, then it would undermine the whole trust in Script rules. And then, you can put all coins on bc1pfeessrawgf, because why any coins should be locked on any key, when they can be always reassigned, when you look at UTXO set, and decide, that it is needed to do it again?</p>\n<p>Your proposal can be simplified into “there should never be any whales” rule. Which is very difficult to enforce, and can be easily bypassed, so that UTXO set would look like you want, but under the hood, there would be second layers, putting things back to normal, and allowing people to re-assign ownership as they like.</p>",
  "post_number": 2,
  "post_type": 1,
  "posts_count": 5,
  "updated_at": "2025-08-06T06:01:50.120Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 55,
  "readers_count": 54,
  "score": 25.4,
  "yours": false,
  "topic_id": 1907,
  "topic_slug": "solutions-for-this-new-centralization-inside-bitcoin",
  "topic_title": "Solutions for this new centralization INSIDE Bitcoin?",
  "topic_html_title": "Solutions for this new centralization INSIDE Bitcoin?",
  "category_id": 5,
  "display_username": "Garlo Nicon",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "> Are there any proposed solutions to avoid or remove institutional and oligarchic centralization in Bitcoin?\n\nNo, because if someone would want to buy 99% of coins, then nothing would stop that people.\n\n> Institutional Bitcoins could be replicated into a personal wallet, but this replication should have a maximum socially congruent limit (maybe 10 or 20 times the average wealth of a global citizen).\n\nSo, you want to say to any whale something like \"you can no longer buy any coins, and it is enforced by consensus rules\"? If so, then it could be easily bypassed. A lot of people know nothing about technical details, so they can be easily tricked to share their IDs. As an example, you can see, what happened when IDs were assigned to SIM cards in phones: now, you can find a lot of individuals, who will register you any SIM card on their behalf, and for a few bucks, you can easily use someone else's identity, to own more phone numbers, than you should. Not to mention what happened in 2021 or 2022, when people couldn't travel without being identified as \"healthy\", and how they bypassed any \"stay at home\" rules.\n\n> Bitcoins that aren’t reclaimed under the replication period (maybe 3 months), should be nonexistent in the new blockchain, so they are available to be mined as fresh new Bitcoins.\n\nIn other words: you want to make a hard-fork, which would allow stealing coins, and moving them to some new owners, while skipping initial Script rules. Many users won't join your altcoin, because if you do it once, then how people can be sure, that you won't do that again? It's very similar as in quantum proposals: if coins will be burned, and then magically unlocked through hard-fork, instead of being simply frozen, and moved normally later, by meeting old Script conditions, then it would undermine the whole trust in Script rules. And then, you can put all coins on bc1pfeessrawgf, because why any coins should be locked on any key, when they can be always reassigned, when you look at UTXO set, and decide, that it is needed to do it again?\n\nYour proposal can be simplified into \"there should never be any whales\" rule. Which is very difficult to enforce, and can be easily bypassed, so that UTXO set would look like you want, but under the hood, there would be second layers, putting things back to normal, and allowing people to re-assign ownership as they like.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 372,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Are there any proposed solutions to avoid or remove institutional and oligarchic centralization in Bitcoin? \n\nNo, because if someone would want to buy 99% of coins, then nothing would stop that people. \n\nInstitutional Bitcoins could be replicated into a personal wallet, but this replication should &hellip;",
  "truncated": true,
  "post_url": "/t/solutions-for-this-new-centralization-inside-bitcoin/1907/2",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}