{
  "id": 5699,
  "name": "Zawy",
  "username": "zawy",
  "avatar_template": "/user_avatar/delvingbitcoin.org/zawy/{size}/750_2.png",
  "created_at": "2025-08-13T11:33:04.734Z",
  "cooked": "<p>The Qubic attack on Monero appears to be a costly advertising gimmick to remind us “non-repurposeability” is a requirement for PoW security. Most if not all ASIC-resistant PoWs are vulnerable. ASIC PoWs that are repurposeable (i.e. they can find significant profit elsewhere) aren’t secure. Only the biggest CAPEX “waste” has the most security. <sup class=\"footnote-ref\"><a href=\"#footnote-5699-1\" id=\"footnote-ref-5699-1\">[1]</a></sup> Optical-PoW and Chia’s proof of hard drive waste aren’t ASICs but could potentially be secure, but it’s not as clear as it is in Bitcoin. Merge-mined coins using Bitcoin’s PoW aren’t secure because Bitcoin miner’s could attack. X11 PoW that uses a mixture of PoWs (if it includes Bitcoin’s PoW) might be a unique case that has at least as much security.  But all cases of sufficient security can be viewed as having sufficient non-repurposeability.</p>\n<p>Sufficiently non-repurposeable can be defined as &gt;50% of the hashrate (including equipment that has gone dark due to inefficiency) gaining more from long-term rewards + fees (from his remaining non-repurposeable CAPEX value) than from double-spending + short-term rewards + fees.</p>\n<p>Non-repurposeability isn’t completely secure. The main threat to Bitcoin is from states gaining more than the chain can provide by attacking Bitcoin to protect their fiat’s relevance, their control of fiat transactions, and their knowledge of who’s transacting. To be secure against this, the current OPEX invested (~ the sum of future rewards + fees) must exceed the amount of tax revenue and fiat printing that colluding states can muster for an attack, and expect to win if they do attack. This latter condition is satisfied to the extent Bitcoin is a threat to their power. About 40 governments could spend less than 10% of their revenue to maintain an attack ($10 B annually).  U.S. only needs to use 0.15% of its spending.</p>\n<p>Selfish mining was part of the Monero attack, but it isn’t a threat to Bitcoin as soon as the majority of hashrate agrees to softly-enforce timestamp accuracy to less than say 20 seconds of error as I’ve described before.</p>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"footnote-5699-1\" class=\"footnote-item\"><p>A “cash coin” can be created by OPEX waste (~electricity) if it’s timestamped to adjust for Moore’s law.  That is, CAPEX is ideal for PoW consensus security while a timestamped-OPEX PoW is ideal for creating coin that can expand in quantity as demand for it expands, adjusted for Moore’s law. This can be achieved if difficulty increases in proportion to Moore’s law. But there’s no known way to decentrally measure Moore’s law. But if it were possible, it would be a “cash coin” can be in units of Joules * velocity = Watts of societal production that is under the control of the cash coin. If demand falls, its value falls, but this is appropriate. The past has no inherent right to control or dictate what the future values. Coins that can’t have out-sized value in the future are thereby helping to secure their future value. <a href=\"#footnote-ref-5699-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 2,
  "updated_at": "2025-08-13T11:39:34.003Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 187,
  "reads": 54,
  "readers_count": 53,
  "score": 955.8,
  "yours": false,
  "topic_id": 1920,
  "topic_slug": "qubic-attack-on-monero",
  "topic_title": "Qubic attack on Monero",
  "topic_html_title": "Qubic attack on Monero",
  "category_id": 5,
  "display_username": "Zawy",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "The Qubic attack on Monero appears to be a costly advertising gimmick to remind us \"non-repurposeability\" is a requirement for PoW security. Most if not all ASIC-resistant PoWs are vulnerable. ASIC PoWs that are repurposeable (i.e. they can find significant profit elsewhere) aren't secure. Only the biggest CAPEX \"waste\" has the most security. ^[A \"cash coin\" can be created by OPEX waste (~electricity) if it's timestamped to adjust for Moore's law.  That is, CAPEX is ideal for PoW consensus security while a timestamped-OPEX PoW is ideal for creating coin that can expand in quantity as demand for it expands, adjusted for Moore's law. This can be achieved if difficulty increases in proportion to Moore's law. But there's no known way to decentrally measure Moore's law. But if it were possible, it would be a \"cash coin\" can be in units of Joules * velocity = Watts of societal production that is under the control of the cash coin. If demand falls, its value falls, but this is appropriate. The past has no inherent right to control or dictate what the future values. Coins that can't have out-sized value in the future are thereby helping to secure their future value.] Optical-PoW and Chia's proof of hard drive waste aren't ASICs but could potentially be secure, but it's not as clear as it is in Bitcoin. Merge-mined coins using Bitcoin's PoW aren't secure because Bitcoin miner's could attack. X11 PoW that uses a mixture of PoWs (if it includes Bitcoin's PoW) might be a unique case that has at least as much security.  But all cases of sufficient security can be viewed as having sufficient non-repurposeability. \n\nSufficiently non-repurposeable can be defined as >50% of the hashrate (including equipment that has gone dark due to inefficiency) gaining more from long-term rewards + fees (from his remaining non-repurposeable CAPEX value) than from double-spending + short-term rewards + fees. \n\nNon-repurposeability isn't completely secure. The main threat to Bitcoin is from states gaining more than the chain can provide by attacking Bitcoin to protect their fiat's relevance, their control of fiat transactions, and their knowledge of who's transacting. To be secure against this, the current OPEX invested (~ the sum of future rewards + fees) must exceed the amount of tax revenue and fiat printing that colluding states can muster for an attack, and expect to win if they do attack. This latter condition is satisfied to the extent Bitcoin is a threat to their power. About 40 governments could spend less than 10% of their revenue to maintain an attack ($10 B annually).  U.S. only needs to use 0.15% of its spending.\n\nSelfish mining was part of the Monero attack, but it isn't a threat to Bitcoin as soon as the majority of hashrate agrees to softly-enforce timestamp accuracy to less than say 20 seconds of error as I've described before.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 502,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "The Qubic attack on Monero appears to be a costly advertising gimmick to remind us “non-repurposeability” is a requirement for PoW security. Most if not all ASIC-resistant PoWs are vulnerable. ASIC PoWs that are repurposeable (i.e. they can find significant profit elsewhere) aren’t secure. Only the &hellip;",
  "truncated": true,
  "post_url": "/t/qubic-attack-on-monero/1920/1",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}