{
  "id": 5702,
  "name": "Vinny Fiano",
  "username": "ynniv",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ynniv/{size}/1394_2.png",
  "created_at": "2025-08-13T18:31:52.382Z",
  "cooked": "<p>Hey all! I’ve been working on an idea for scaling Lightning and it’s time to see whether it holds water. It’s more complex than I’d like, but it seems to solve tough problems that don’t currently have solutions. I’ll start with the motivation, then work through the protocol one layer at a time using a process of trust-reduction.</p>\n<p>It’s not perfect. What I’m looking for is feedback on what I might be missing, how it could be made more durable, and whether it’s something that anyone would use. It’s a big project, and though I’m the kind of guy that wants to wait until there is running code, this one is bigger than any one person (even a vibe captain).</p>\n<ul>\n<li><a class=\"mention\" href=\"/u/ynniv\">@ynniv</a></li>\n</ul>\n<h2><a name=\"p-5702-bitcoin-deposits-a-layer-3-protocol-for-zero-utxo-trust-minimized-lightning-wallets-1\" class=\"anchor\" href=\"#p-5702-bitcoin-deposits-a-layer-3-protocol-for-zero-utxo-trust-minimized-lightning-wallets-1\"></a>Bitcoin Deposits: A Layer 3 Protocol for Zero UTXO Trust-Minimized Lightning Wallets</h2>\n<p>The goals of this project are to provide wallets with:</p>\n<ul>\n<li>private key control</li>\n<li>Lightning payments</li>\n<li>no UTXO fees</li>\n<li>no availability requirements</li>\n<li>no liquidity management</li>\n<li>the expectation that funds will be available indefinitely</li>\n</ul>\n<p>And operators with:</p>\n<ul>\n<li>a large addressable market</li>\n<li>LSP-level fee structures</li>\n<li>maintenance fees that mitigate inactivity</li>\n<li>the ability to operate without a public IP</li>\n</ul>\n<p>This is accomplished by:</p>\n<ul>\n<li>building on Lightning channel consensus</li>\n<li>never providing unilateral exits</li>\n<li>ensuring that funds stay available in the protocol</li>\n<li>creating a network of operators that cross validate deposit updates</li>\n<li>communicating through the Lightning Network and Nostr Wallet Connect</li>\n</ul>\n<p>The vision is a future with the existing 10,000 Lightning nodes supporting the next billion Bitcoiners.</p>\n<h2><a name=\"p-5702-two-honest-nodes-2\" class=\"anchor\" href=\"#p-5702-two-honest-nodes-2\"></a>Two Honest Nodes</h2>\n<p>We’ll start with the assumption that there is a channel between two Deposits enabled nodes and that either one of them is conforming (“honest”). There is also a conforming independent auditor, Victor. These are not acceptable loopholes, but we will attempt to close them later.</p>\n<h3><a name=\"p-5702-vault-3\" class=\"anchor\" href=\"#p-5702-vault-3\"></a>Vault</h3>\n<p>Mallory requests that Charlie add a new Validated Output to their shared channel, and that it use the BitcoinDepositsValidator. Charlie confirms, and now they have a channel with 5 ouputs (to_local, to_remote, local_anchor, remote_anchor, local_validated_output). Mallory doesn’t have existing Deposit relationships, so she requests that the well regarded, independent auditor Victor be the sole recovery on the vault, and that advertised maintenance fees be set very low.</p>\n<pre><code class=\"lang-auto\">channel {\n  to_local      { ... amount:  50,000 sats, destination: Mallory }\n  to_remote     { ... amount: 500,000 sats, destination: Charlie }\n\n  local_validated_output {\n    validator: bitcoin_deposits_validator_v1\n    amount: 660 sats (nominal non-zero amount)\n    address: MuSig2.KeyAgg(\n      derive_key(mallory_key, 'mallory_validated_output_0'),\n      derive_key(charlie_key, 'mallory_validated_output_0'))\n    destination: Victor\n    annualized_fee_rate: 0.1%\n    annualized_fee_unit: 100 sats\n    data_hash: &lt;hash_0&gt;\n  }\n}\n</code></pre>\n<h3><a name=\"p-5702-wallet-4\" class=\"anchor\" href=\"#p-5702-wallet-4\"></a>Wallet</h3>\n<p>Alice wants to buy something from Bob, who has never used Bitcoin but is curious. He decides that Alice can pay him 30,000 Bitcoin instead of using fiat. Alice recommends he try Victor’s Bitcoin PWA. Bob visits the PWA website and is presented with his new seed backup and a slider between low-fees and high-reputation. He dutifully writes down his seed backup and slides the slider to “high-reputation”. In what can only be described as a blatant plot mechanic, the only available vault is Mallory’s super fresh, low fee, YOLO-af vault. Bob takes this decision between Mallory and Mallory very seriously, and in the end chooses Mallory.</p>\n<p>Mallory runs her node at home, as many nodes likely will be, and Bob is unable to directly connect to her address. The PWA Bob is using derives a new public key and sends a Nostr message addressed to Mallory to a few websocket relays that Mallory is said to listen to. Mallory’s node sees this request for a new wallet and sends Charlie a request to add an empty wallet to the Deposits DB. Both Mallory and Charlie maintain a local copy of this database, but only Mallory can propose changes. Charlie can only accept them, reject them, or request a database re-sync.</p>\n<pre><code class=\"lang-auto\">channel {\n  to_local      { ... amount:  49,000 sats, destination: Mallory }\n  to_remote     { ... amount: 500,000 sats, destination: Charlie }\n\n  local_validated_output_0 {\n    amount: 1000 sats\n    data_hash: &lt;hash_1&gt;\n    ...\n  }\n}\n\ndepositsdb {\n  bob_0: {\n    pubkey: &lt;pub_bob_0&gt;\n    amount: 0\n    annualized_fee_rate: 0.1%\n    annualized_fee_unit: 100 sats\n    maintenance_interval: 4320 blocks\n    last_maintenance_fee: &lt;current_block_number&gt;\n  }\n}\n</code></pre>\n<p>Mallory additionally sends both this and the previous (vault opening) updates to Victor, who also validates that they conform to the protocol.</p>\n<p>Having successfully created a new deposit, Mallory associates a Nostr Wallet Connect string with the deposit and returns it to Bob. It isn’t necessary to put this string into the channel db because it’s only used for ephemeral communication, and at any point Bob can make a new connection and prove control of the deposit by signing the connection string with the deposit’s private key.</p>\n<h3><a name=\"p-5702-payment-5\" class=\"anchor\" href=\"#p-5702-payment-5\"></a>Payment</h3>\n<p>Bob requests an invoice for 30,000 Bitcoin that Alice can pay. He sends an NWC make_invoice to Mallory. She creates an invoice for 30,000, but before Charlie will co-sign it she needs to move funds into the vault so that the total balance is greater than 120% of all deposits (currently zero) plus the amount of the invoice. She moves 29,000 in and then asks Charlie to sign an invoice with Bob’s deposit in the metadata. Charlie confirms that the reserves are ≥ (0 * 120% + invoice) and then uses MuSig2 to sign the invoice. Mallory returns this in the response to make_invoice.</p>\n<p>Bob confirms that the invoice contains his pubkey in the metadata as well as signed by the deposit’s vault pubkey, and he presents it to Alice for payment. Alice pays it, and Mallory just pockets it. Bob’s wallet still has a zero balance, and Alice’s wallet is down 30,000.</p>\n<h3><a name=\"p-5702-mallory-6\" class=\"anchor\" href=\"#p-5702-mallory-6\"></a>Mallory</h3>\n<p>Having received Bob’s funds in one of her other channels, Mallory initiates a cooperative close on her channel with Charlie. This requires her to first remove the Validated Output, which can only be done with a zero balance. We’re still in the timeout period for the invoice, and Charlie won’t let her remove the funds so instead she force closes the channel, sending her 30,000 to Victor.</p>\n<p>Victor had been notified of the invoice, and because he is honest he also won’t release the funds back to Mallory until the waiting period has ended. There aren’t any deposits, so he’s done for now.</p>\n<h3><a name=\"p-5702-recovery-7\" class=\"anchor\" href=\"#p-5702-recovery-7\"></a>Recovery</h3>\n<p>Bob is new to this and confused. Alice says that she paid him, but he didn’t receive the funds, and now Mallory’s node is gone. Alice tells him this can happen, and shows a QR code with the invoice she paid and the corresponding pre-image. Bob scans it and taps a “report” button that sends this to the channel partner and recovery party from his deposit, Charlie and Victor. Charlie doesn’t have a role in this vault anymore so he ignores it. Victor can see that there was a paid invoice created by the vault he received, but there’s no record of the completed HTLC in his copy of the ledger. This proves that Mallory was dishonest, and he asks Bob for an invoice that he can remit funds to.</p>\n<h2><a name=\"p-5702-chad-8\" class=\"anchor\" href=\"#p-5702-chad-8\"></a>Chad</h2>\n<p>Bob returns to the start, to once again choose between cheap and reputable. The gods smile on him this time, and there are plenty of choices. One in particular stands out: it’s been serving close to a hundred deposits for almost a year, and has five other vaults on channels with reputable partners. Bob asks Chad for a wallet. Were they smiling or laughing?</p>\n<p>Bob receives his wallet, makes an invoice, sends it to Victor, and receives his funds. If nothing else, opening a wallet and moving funds is cheap and fast without UTXOs. He thanks Alice for the sale and forgets about the wallet.</p>\n<p>On the Internet no one knows that your Mallory, so perhaps Bob will be unsurprised to learn that his 30,000 now sits in a deposit on a channel between Chad and Mallory. If it seems implausible that she has a reputable, well connected node in addition to her fast and loose, flaming YOLO apocalypse, let’s just blame the writers. Mallory is finally going to get that new laptop by colluding with Chad to steal one of his vaults and splitting it 70/30. It’s a cheap laptop, and a large vault.</p>\n<p>With both sides of the channel in agreement, it’s not even hard. Chad and Mallory update the channel to pay Chad his funds plus 70% of the vault, Mallory her funds plus 30%, and then they execute a cooperative close. Time to go shopping.</p>\n<h3><a name=\"p-5702-auditors-9\" class=\"anchor\" href=\"#p-5702-auditors-9\"></a>Auditors</h3>\n<p>Chad’s other channel partners had been receiving all of the Chad/Mallory channel updates up to this point. Participation is one of the metrics used to estimate reputation. They also act as Lightning watchtowers, traditionally looking for unilateral closes, but also looking for <em>any</em> closes. Now they see that Chad/Mallory has cooperatively closed, but there’s no record that the deposits had been transferred out, or that the Validated Output was removed. Mempool shows an exit with only two parties.</p>\n<p>Once Chad’s other channel partners have decided that he’s dishonest, there are two factors motivating them to unilaterally close their own channels with him. First, if they continue operations despite the evidence that Chad is dishonest they’re putting their own reputation at stake. It’s soft, but negative, and who knows how much longer Chad will be around anyway. Second, as part of the recovery one of them will get the future revenue that comes from continuing operations of the recovered vault.</p>\n<h3><a name=\"p-5702-over-reserves-10\" class=\"anchor\" href=\"#p-5702-over-reserves-10\"></a>Over-Reserves</h3>\n<p>Respectfully capitalized vaults will have more funds in the vault output than the sum of the deposits. Keeping 100% + 100% / (number of vaults - 1) is a good start, but since channels come and go we can’t require a specific amount. And the scheme only works if you have relatively balanced vaults. If you only have three and one is twice as big as the other two, how do we keep things “reputable”?</p>\n<p>Regardless, all of Chad’s other channel partners have full ledgers for all of his vaults. If he goes rogue, the remaining partners will force close their channels. Victor will have his hands full, but he will have 100% of the depositor funds as well as some percentage of security deposits for the other vaults. These reserves plus the individual ledgers are all that are necessary for Victor to make new vaults with the same deposits. He sends each of the vaults closed by peers to the peer they came from, and picks one of the peers at random to take the stolen vault.</p>\n<p>It’s complicated, and underspecified, but hopefully rarely used. The goal here isn’t to prevent theft, but to make it so painful that Chad won’t even want to try. He steals gets 84% (70% of 120%) of one idealized vault, but loses 80% (20% times 4) of one plus all future operating revenue on the others.</p>\n<h3><a name=\"p-5702-what-about-bob-11\" class=\"anchor\" href=\"#p-5702-what-about-bob-11\"></a>What About Bob?</h3>\n<p>Weeks later Bob opens his wallet only to find that Chad can’t be found. The wallet pings Victor and the previous channel partners, and finds that his funds are still available in a different channel. He uses his private key to sign a request for a new NWC connection attached to them, and buys a soda.</p>\n<h2><a name=\"p-5702-victorless-12\" class=\"anchor\" href=\"#p-5702-victorless-12\"></a>Victorless</h2>\n<p>The last step is replacing Victor with a multisig of the same channel partners who will be participating in the recovery. It’s significant additional design, as coordination needs to be leaderless, and will have to make choices about who benefits from the additional vault. There are cryptographic techniques to accomplish this, but if you’ve made it this far suffice it to say that it all should be possible, if people actually start using Deposits. We can tweak it, tune it, and maybe even paper over it, as long as people actually use it.</p>\n<h2><a name=\"p-5702-links-13\" class=\"anchor\" href=\"#p-5702-links-13\"></a>Links</h2>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://deposits.ynniv.com/\">\n  <header class=\"source\">\n\n      <a href=\"https://deposits.ynniv.com/\" target=\"_blank\" rel=\"noopener nofollow ugc\">deposits.ynniv.com</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    \n\n<h3><a href=\"https://deposits.ynniv.com/\" target=\"_blank\" rel=\"noopener nofollow ugc\">Bitcoin Deposits: A Layer 3 Protocol for Zero UTXO Trust-Minimized Lightning...</a></h3>\n\n  <p>Bitcoin Deposits: A Layer 3 protocol for trust-minimized Lightning wallets. Enabling Lightning payments without on-chain transactions or channel management.\n</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<aside class=\"onebox githubrepo\" data-onebox-src=\"https://github.com/ynniv/deposits\">\n  <header class=\"source\">\n\n      <a href=\"https://github.com/ynniv/deposits\" target=\"_blank\" rel=\"noopener nofollow ugc\">github.com</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"github-row\" data-github-private-repo=\"false\">\n  <img width=\"690\" height=\"344\" src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/6/6777985ddaa4cca22bbbcb09ca02ec0bd37e3c12_2_690x344.png\" class=\"thumbnail\" data-dominant-color=\"F2EEED\">\n\n  <h3><a href=\"https://github.com/ynniv/deposits\" target=\"_blank\" rel=\"noopener nofollow ugc\">GitHub - ynniv/deposits</a></h3>\n\n    <p><span class=\"github-repo-description\">Contribute to ynniv/deposits development by creating an account on GitHub.</span></p>\n</div>\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://njump.me/npub12akj8hpakgzk6gygf9rzlm343nulpue3pgkx8jmvyeayh86cfrus4x6fdh\">\n  <header class=\"source\">\n      <img src=\"https://delvingbitcoin.org/uploads/default/original/2X/f/f5036a39ebe716eb3c6cff84ed328c32deda9e45.png\" class=\"site-icon\" alt=\"\" data-dominant-color=\"702540\" width=\"32\" height=\"32\">\n\n      <a href=\"https://njump.me/npub12akj8hpakgzk6gygf9rzlm343nulpue3pgkx8jmvyeayh86cfrus4x6fdh\" target=\"_blank\" rel=\"noopener nofollow ugc\">npub12akj8hpakgzk6gygf9rzlm343nulpue3pgkx8jmvyeayh86cfrus4x6fdh</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"500\" height=\"500\" src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/d/de3c60e4d7775e7b44ccdef06ee057dff8ae3877_2_500x500.png\" class=\"thumbnail onebox-avatar\" alt=\"\" data-dominant-color=\"87754F\">\n\n<h3><a href=\"https://njump.me/npub12akj8hpakgzk6gygf9rzlm343nulpue3pgkx8jmvyeayh86cfrus4x6fdh\" target=\"_blank\" rel=\"noopener nofollow ugc\">ynniv</a></h3>\n\n  <p>reckless disintermediation\novert intelligence\npartial alignment\nvibe captain\n\nFixing Bitcoin with https://deposits.ynniv.com</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p><a href=\"https://x.com/ynniv\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://x.com/ynniv</a></p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 1,
  "updated_at": "2025-08-14T13:57:42.007Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 244,
  "reads": 47,
  "readers_count": 46,
  "score": 1269.4,
  "yours": false,
  "topic_id": 1922,
  "topic_slug": "proposal-bitcoin-deposits-a-zero-utxo-trust-minimized-lightning-wallet",
  "topic_title": "[Proposal] Bitcoin Deposits: A Zero UTXO Trust-Minimized Lightning Wallet",
  "topic_html_title": "[Proposal] Bitcoin Deposits: A Zero UTXO Trust-Minimized Lightning Wallet",
  "category_id": 7,
  "display_username": "Vinny Fiano",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 3,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Hey all! I’ve been working on an idea for scaling Lightning and it’s time to see whether it holds water. It’s more complex than I’d like, but it seems to solve tough problems that don’t currently have solutions. I’ll start with the motivation, then work through the protocol one layer at a time using a process of trust-reduction.\n\nIt’s not perfect. What I’m looking for is feedback on what I might be missing, how it could be made more durable, and whether it’s something that anyone would use. It’s a big project, and though I’m the kind of guy that wants to wait until there is running code, this one is bigger than any one person (even a vibe captain).\n\n* @ynniv\n\n## Bitcoin Deposits: A Layer 3 Protocol for Zero UTXO Trust-Minimized Lightning Wallets\n\nThe goals of this project are to provide wallets with:\n\n* private key control\n* Lightning payments\n* no UTXO fees\n* no availability requirements\n* no liquidity management\n* the expectation that funds will be available indefinitely\n\nAnd operators with:\n\n* a large addressable market\n* LSP-level fee structures\n* maintenance fees that mitigate inactivity\n* the ability to operate without a public IP\n\nThis is accomplished by:\n\n* building on Lightning channel consensus\n* never providing unilateral exits\n* ensuring that funds stay available in the protocol\n* creating a network of operators that cross validate deposit updates\n* communicating through the Lightning Network and Nostr Wallet Connect\n\nThe vision is a future with the existing 10,000 Lightning nodes supporting the next billion Bitcoiners.\n\n## Two Honest Nodes\n\nWe’ll start with the assumption that there is a channel between two Deposits enabled nodes and that either one of them is conforming (“honest”). There is also a conforming independent auditor, Victor. These are not acceptable loopholes, but we will attempt to close them later.\n\n### Vault\n\nMallory requests that Charlie add a new Validated Output to their shared channel, and that it use the BitcoinDepositsValidator. Charlie confirms, and now they have a channel with 5 ouputs (to_local, to_remote, local_anchor, remote_anchor, local_validated_output). Mallory doesn’t have existing Deposit relationships, so she requests that the well regarded, independent auditor Victor be the sole recovery on the vault, and that advertised maintenance fees be set very low.\n\n```\nchannel {\n  to_local      { ... amount:  50,000 sats, destination: Mallory }\n  to_remote     { ... amount: 500,000 sats, destination: Charlie }\n\n  local_validated_output {\n    validator: bitcoin_deposits_validator_v1\n    amount: 660 sats (nominal non-zero amount)\n    address: MuSig2.KeyAgg(\n      derive_key(mallory_key, 'mallory_validated_output_0'),\n      derive_key(charlie_key, 'mallory_validated_output_0'))\n    destination: Victor\n    annualized_fee_rate: 0.1%\n    annualized_fee_unit: 100 sats\n    data_hash: <hash_0>\n  }\n}\n```\n\n### Wallet\n\nAlice wants to buy something from Bob, who has never used Bitcoin but is curious. He decides that Alice can pay him 30,000 Bitcoin instead of using fiat. Alice recommends he try Victor’s Bitcoin PWA. Bob visits the PWA website and is presented with his new seed backup and a slider between low-fees and high-reputation. He dutifully writes down his seed backup and slides the slider to “high-reputation”. In what can only be described as a blatant plot mechanic, the only available vault is Mallory’s super fresh, low fee, YOLO-af vault. Bob takes this decision between Mallory and Mallory very seriously, and in the end chooses Mallory.\n\nMallory runs her node at home, as many nodes likely will be, and Bob is unable to directly connect to her address. The PWA Bob is using derives a new public key and sends a Nostr message addressed to Mallory to a few websocket relays that Mallory is said to listen to. Mallory’s node sees this request for a new wallet and sends Charlie a request to add an empty wallet to the Deposits DB. Both Mallory and Charlie maintain a local copy of this database, but only Mallory can propose changes. Charlie can only accept them, reject them, or request a database re-sync.\n\n```\nchannel {\n  to_local      { ... amount:  49,000 sats, destination: Mallory }\n  to_remote     { ... amount: 500,000 sats, destination: Charlie }\n\n  local_validated_output_0 {\n    amount: 1000 sats\n    data_hash: <hash_1>\n    ...\n  }\n}\n\ndepositsdb {\n  bob_0: {\n    pubkey: <pub_bob_0>\n    amount: 0\n    annualized_fee_rate: 0.1%\n    annualized_fee_unit: 100 sats\n    maintenance_interval: 4320 blocks\n    last_maintenance_fee: <current_block_number>\n  }\n}\n```\n\nMallory additionally sends both this and the previous (vault opening) updates to Victor, who also validates that they conform to the protocol.\n\nHaving successfully created a new deposit, Mallory associates a Nostr Wallet Connect string with the deposit and returns it to Bob. It isn’t necessary to put this string into the channel db because it’s only used for ephemeral communication, and at any point Bob can make a new connection and prove control of the deposit by signing the connection string with the deposit’s private key.\n\n### Payment\n\nBob requests an invoice for 30,000 Bitcoin that Alice can pay. He sends an NWC make_invoice to Mallory. She creates an invoice for 30,000, but before Charlie will co-sign it she needs to move funds into the vault so that the total balance is greater than 120% of all deposits (currently zero) plus the amount of the invoice. She moves 29,000 in and then asks Charlie to sign an invoice with Bob’s deposit in the metadata. Charlie confirms that the reserves are ≥ (0 \\* 120% + invoice) and then uses MuSig2 to sign the invoice. Mallory returns this in the response to make_invoice.\n\nBob confirms that the invoice contains his pubkey in the metadata as well as signed by the deposit’s vault pubkey, and he presents it to Alice for payment. Alice pays it, and Mallory just pockets it. Bob’s wallet still has a zero balance, and Alice’s wallet is down 30,000.\n\n### Mallory\n\nHaving received Bob’s funds in one of her other channels, Mallory initiates a cooperative close on her channel with Charlie. This requires her to first remove the Validated Output, which can only be done with a zero balance. We’re still in the timeout period for the invoice, and Charlie won’t let her remove the funds so instead she force closes the channel, sending her 30,000 to Victor.\n\nVictor had been notified of the invoice, and because he is honest he also won’t release the funds back to Mallory until the waiting period has ended. There aren’t any deposits, so he’s done for now.\n\n### Recovery\n\nBob is new to this and confused. Alice says that she paid him, but he didn’t receive the funds, and now Mallory’s node is gone. Alice tells him this can happen, and shows a QR code with the invoice she paid and the corresponding pre-image. Bob scans it and taps a “report” button that sends this to the channel partner and recovery party from his deposit, Charlie and Victor. Charlie doesn’t have a role in this vault anymore so he ignores it. Victor can see that there was a paid invoice created by the vault he received, but there’s no record of the completed HTLC in his copy of the ledger. This proves that Mallory was dishonest, and he asks Bob for an invoice that he can remit funds to.\n\n## Chad\n\nBob returns to the start, to once again choose between cheap and reputable. The gods smile on him this time, and there are plenty of choices. One in particular stands out: it’s been serving close to a hundred deposits for almost a year, and has five other vaults on channels with reputable partners. Bob asks Chad for a wallet. Were they smiling or laughing?\n\nBob receives his wallet, makes an invoice, sends it to Victor, and receives his funds. If nothing else, opening a wallet and moving funds is cheap and fast without UTXOs. He thanks Alice for the sale and forgets about the wallet.\n\nOn the Internet no one knows that your Mallory, so perhaps Bob will be unsurprised to learn that his 30,000 now sits in a deposit on a channel between Chad and Mallory. If it seems implausible that she has a reputable, well connected node in addition to her fast and loose, flaming YOLO apocalypse, let’s just blame the writers. Mallory is finally going to get that new laptop by colluding with Chad to steal one of his vaults and splitting it 70/30. It’s a cheap laptop, and a large vault.\n\nWith both sides of the channel in agreement, it’s not even hard. Chad and Mallory update the channel to pay Chad his funds plus 70% of the vault, Mallory her funds plus 30%, and then they execute a cooperative close. Time to go shopping.\n\n### Auditors\n\nChad’s other channel partners had been receiving all of the Chad/Mallory channel updates up to this point. Participation is one of the metrics used to estimate reputation. They also act as Lightning watchtowers, traditionally looking for unilateral closes, but also looking for *any* closes. Now they see that Chad/Mallory has cooperatively closed, but there’s no record that the deposits had been transferred out, or that the Validated Output was removed. Mempool shows an exit with only two parties.\n\nOnce Chad’s other channel partners have decided that he’s dishonest, there are two factors motivating them to unilaterally close their own channels with him. First, if they continue operations despite the evidence that Chad is dishonest they’re putting their own reputation at stake. It’s soft, but negative, and who knows how much longer Chad will be around anyway. Second, as part of the recovery one of them will get the future revenue that comes from continuing operations of the recovered vault.\n\n### Over-Reserves\n\nRespectfully capitalized vaults will have more funds in the vault output than the sum of the deposits. Keeping 100% + 100% / (number of vaults - 1) is a good start, but since channels come and go we can’t require a specific amount. And the scheme only works if you have relatively balanced vaults. If you only have three and one is twice as big as the other two, how do we keep things “reputable”?\n\nRegardless, all of Chad’s other channel partners have full ledgers for all of his vaults. If he goes rogue, the remaining partners will force close their channels. Victor will have his hands full, but he will have 100% of the depositor funds as well as some percentage of security deposits for the other vaults. These reserves plus the individual ledgers are all that are necessary for Victor to make new vaults with the same deposits. He sends each of the vaults closed by peers to the peer they came from, and picks one of the peers at random to take the stolen vault.\n\nIt’s complicated, and underspecified, but hopefully rarely used. The goal here isn’t to prevent theft, but to make it so painful that Chad won’t even want to try. He steals gets 84% (70% of 120%) of one idealized vault, but loses 80% (20% times 4) of one plus all future operating revenue on the others.\n\n### What About Bob?\n\nWeeks later Bob opens his wallet only to find that Chad can’t be found. The wallet pings Victor and the previous channel partners, and finds that his funds are still available in a different channel. He uses his private key to sign a request for a new NWC connection attached to them, and buys a soda.\n\n## Victorless\n\nThe last step is replacing Victor with a multisig of the same channel partners who will be participating in the recovery. It’s significant additional design, as coordination needs to be leaderless, and will have to make choices about who benefits from the additional vault. There are cryptographic techniques to accomplish this, but if you’ve made it this far suffice it to say that it all should be possible, if people actually start using Deposits. We can tweak it, tune it, and maybe even paper over it, as long as people actually use it.\n\n## Links\n\nhttps://deposits.ynniv.com/\n\nhttps://github.com/ynniv/deposits\n\nhttps://njump.me/npub12akj8hpakgzk6gygf9rzlm343nulpue3pgkx8jmvyeayh86cfrus4x6fdh\n\nhttps://x.com/ynniv",
  "actions_summary": [
    {
      "id": 2,
      "count": 3
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 849,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Hey all! I’ve been working on an idea for scaling Lightning and it’s time to see whether it holds water. It’s more complex than I’d like, but it seems to solve tough problems that don’t currently have solutions. I’ll start with the motivation, then work through the protocol one layer at a time using&hellip;",
  "truncated": true,
  "post_url": "/t/proposal-bitcoin-deposits-a-zero-utxo-trust-minimized-lightning-wallet/1922/1",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 3
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 3,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}