{
  "id": 5781,
  "name": "",
  "username": "josh",
  "avatar_template": "/user_avatar/delvingbitcoin.org/josh/{size}/95_2.png",
  "created_at": "2025-08-29T15:03:53.756Z",
  "cooked": "<p>Hey <a class=\"mention\" href=\"/u/taparoo\">@taparoo</a>, thanks for giving it a skim!</p>\n<p>It is incorrect in my opinion to invoke Gresham’s law to explain bitcoin’s lack of usage as a currency. Gresham’s law is only relevant to <em>physical</em> currencies where people accept payment in two or more “coins” with the same <em>nominal</em> value. The intrinsic properties of physical coins make them different investments, and people will tend to save the one with a superior long-run risk-adjusted real rate of return. This argument does not hold for bitcoin, because there are no physical currencies backed by bitcoin with a non-bitcoin nominal value.</p>\n<p>I somewhat disagree that <span class=\"math\">S=I</span> explains bitcoin’s eventual equilibrium. <span class=\"math\">S = I</span> is a purely accounting identity. All it says is that the definition of investing is the same as the definition of saving.</p>\n<hr>\n<p>It’s been a few months since I’ve revisited this post. My goal was to articulate an academic argument that I haven’t seen elsewhere in the literature. I’ll try to summarize it here.</p>\n<p>In theoretical financial economics, and in particular in asset pricing theory, the concept of “perfect capital markets” is fundamental to valuation. Without it, we have no grounding to assert the market value of an asset relative to something else. While the assumptions may seem unrealistic, they provide the basis for formal logic that gives us something to stand on.</p>\n<p>The challenge then is: <strong>can we prove the equilibrium value of bitcoin under perfect capital market assumptions?</strong> If we can, we’ll have a new tool in our arsenal to explain bitcoin’s value to academics, and to the world at large.</p>\n<p>Perfect capital market assumptions mean that we cannot rely on traditional arguments, like appealing to bitcoin’s censorship resistance, transaction finality, or uniquely guaranteed finite supply. Among other assumptions, we assume frictionless markets and no transaction costs. Trust is free and mathematically assured. The implication is that under these assumptions, Bitcoin has no unique utility as a medium-of-exchange.</p>\n<p>This post argues that <em>unit-of-account</em> is what gives Bitcoin value under perfect capital markets. Perfect capital markets require a unit of account to function, and the post argues that the optimal unit of account represents a constant fraction of the economy’s total wealth, because <strong>it provides the necessary price signals to transmit information through the economy</strong>.</p>\n<p>This is very much a Hayekian argument, and I might call such a unit a “Hayek.” The piece argues that a “Hayek” can only exist through independent valuation, where each economic actor values a single fungible, finite, inert good at the maximum extent of their utility function. A central authority cannot define the “Hayek” in terms of other assets, as that would introduce circular reasoning.</p>\n<p>Therefore, we can establish that a “Hayek” must exist under perfect capital market assumptions. We can then look out at the market and find potential contenders to be humanity’s “Hayek,” and we’ll see that Bitcoin is far and away the leading contender. Therefore, it has value, at least probabilistically.</p>",
  "post_number": 3,
  "post_type": 1,
  "posts_count": 6,
  "updated_at": "2025-08-31T17:11:37.017Z",
  "reply_count": 1,
  "reply_to_post_number": 2,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 34,
  "readers_count": 33,
  "score": 11.8,
  "yours": false,
  "topic_id": 1547,
  "topic_slug": "a-game-theoretic-approach-to-bitcoin-s-valuation-in-equilibrium",
  "topic_title": "A Game-Theoretic Approach to Bitcoin’s Valuation in Equilibrium",
  "topic_html_title": "A Game-Theoretic Approach to Bitcoin’s Valuation in Equilibrium",
  "category_id": 6,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 5,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "id": 899,
    "username": "taparoo",
    "name": "Thor",
    "avatar_template": "/user_avatar/delvingbitcoin.org/taparoo/{size}/1470_2.png"
  },
  "bookmarked": false,
  "raw": "Hey @taparoo, thanks for giving it a skim!\n\nIt is incorrect in my opinion to invoke Gresham's law to explain bitcoin's lack of usage as a currency. Gresham's law is only relevant to *physical* currencies where people accept payment in two or more \"coins\" with the same *nominal* value. The intrinsic properties of physical coins make them different investments, and people will tend to save the one with a superior long-run risk-adjusted real rate of return. This argument does not hold for bitcoin, because there are no physical currencies backed by bitcoin with a non-bitcoin nominal value.\n\nI somewhat disagree that $S=I$ explains bitcoin's eventual equilibrium. $S = I$ is a purely accounting identity. All it says is that the definition of investing is the same as the definition of saving.\n\n---\n\nIt's been a few months since I've revisited this post. My goal was to articulate an academic argument that I haven't seen elsewhere in the literature. I'll try to summarize it here.\n\nIn theoretical financial economics, and in particular in asset pricing theory, the concept of \"perfect capital markets\" is fundamental to valuation. Without it, we have no grounding to assert the market value of an asset relative to something else. While the assumptions may seem unrealistic, they provide the basis for formal logic that gives us something to stand on.\n\nThe challenge then is: **can we prove the equilibrium value of bitcoin under perfect capital market assumptions?** If we can, we'll have a new tool in our arsenal to explain bitcoin's value to academics, and to the world at large.\n\nPerfect capital market assumptions mean that we cannot rely on traditional arguments, like appealing to bitcoin's censorship resistance, transaction finality, or uniquely guaranteed finite supply. Among other assumptions, we assume frictionless markets and no transaction costs. Trust is free and mathematically assured. The implication is that under these assumptions, Bitcoin has no unique utility as a medium-of-exchange.\n\nThis post argues that *unit-of-account* is what gives Bitcoin value under perfect capital markets. Perfect capital markets require a unit of account to function, and the post argues that the optimal unit of account represents a constant fraction of the economy's total wealth, because **it provides the necessary price signals to transmit information through the economy**.\n\nThis is very much a Hayekian argument, and I might call such a unit a \"Hayek.\" The piece argues that a \"Hayek\" can only exist through independent valuation, where each economic actor values a single fungible, finite, inert good at the maximum extent of their utility function. A central authority cannot define the \"Hayek\" in terms of other assets, as that would introduce circular reasoning.\n\nTherefore, we can establish that a \"Hayek\" must exist under perfect capital market assumptions. We can then look out at the market and find potential contenders to be humanity's \"Hayek,\" and we'll see that Bitcoin is far and away the leading contender. Therefore, it has value, at least probabilistically.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 98,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Hey <a class=\"mention\" href=\"/u/taparoo\">@taparoo</a>, thanks for giving it a skim! \nIt is incorrect in my opinion to invoke Gresham’s law to explain bitcoin’s lack of usage as a currency. Gresham’s law is only relevant to physical currencies where people accept payment in two or more “coins” with the same nominal value. The intrinsic prop&hellip;",
  "truncated": true,
  "post_url": "/t/a-game-theoretic-approach-to-bitcoin-s-valuation-in-equilibrium/1547/3",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}