{
  "id": 6021,
  "name": "Zawy",
  "username": "zawy",
  "avatar_template": "/user_avatar/delvingbitcoin.org/zawy/{size}/750_2.png",
  "created_at": "2025-10-08T10:15:08.411Z",
  "cooked": "<p>It could affect my wife’s employment if I hold bitcoin and it becomes common knowledge that it makes no effort to stop CSAM. My family would turn an eye of disgust towards anyone holding it. Not being able to stop it doesn’t matter as much as not trying. Miners better choose to not mine on top of blocks that contain it “in the open”. OFAC isn’t a big concern. CSAM is important because it’s about about public perception. The nodes, devs, miners, and governments don’t matter. Public opinion is what pays the bills for PoW.</p>\n<p>Playing cat and mouse is necessary to show concern. Showing concern is important to public opinion. Kudos to the king of shit-shows in his coup de grâce. Ignoring it isn’t an option.  Any day now Elizabeth Warren is going to get wind of it.</p>\n<p>As soon as a new encoding method for objectionable non-transactional data is discovered, miners could block it without a code update. They can collude to enforce the public consensus that CSAM material must not be easy to include. Miners are already colluding to not conduct a 51% attack because they don’t want to lose public opinion and that in turn is due to not wanting to hurt the value of the coin which is the source of the net present value of their CAPEX. There’s nothing in Nakamoto consensus that promotes, requires, or needs mining decentralization (non-collusion) other than mining not being a centralized entity that can be subject to government force. Permissionless mining only allows decentralization as an option. The security model is based on the CAPEX incentive, not decentralization. A single entity could be behind all miners and it wouldn’t matter. In fact there is a single entity: public opinion. Miners learned it the hard way. Big blockers thought they had it.</p>\n<p>Blocking encoding schemes (imperfect cat and mouse) is very different from allowing images in a field. Look at the extreme: if a distributor of CSAM used random data from old blocks as a one-time pad to encode images, no one would place blame on the blockchain. He has to transmit what looks like random data, a block height, and an encoding scheme (which he wouldn’t need to change). If he includes image data in a block, miners could collude to ignore blocks that use a known encoding scheme and decodes to objectionable material (detectable with A.I.), a CSAM distributor has to develop and distribute a new encoding scheme each time the material is discovered. This is closer to the extreme case that wouldn’t have fault. This is an ugly, awful, and/or unworkable “solution” but the important point is to try.</p>\n<p>If a government doesn’t like bitcoin, it only needs to start including images to kill it. I believe Szabo is correct in his legal takes that unencoded OP_RETURN is different, but public opinion is also important.  Caving in to public opinion is more important than being right. PoW isn’t autistic. It’s based on public opinion.</p>\n<aside class=\"onebox twitterstatus\" data-onebox-src=\"https://x.com/NickSzabo4/status/1973502865143636151\">\n  <header class=\"source\">\n\n      <a href=\"https://x.com/NickSzabo4/status/1973502865143636151\" target=\"_blank\" rel=\"noopener nofollow ugc\">x.com</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    \n<h4><a href=\"https://x.com/NickSzabo4/status/1973502865143636151\" target=\"_blank\" rel=\"noopener nofollow ugc\"></a></h4>\n<div class=\"twitter-screen-name\"><a href=\"https://x.com/NickSzabo4/status/1973502865143636151\" target=\"_blank\" rel=\"noopener nofollow ugc\">@</a></div>\n\n<div class=\"tweet\">\n  <span class=\"tweet-description\"></span>\n</div>\n\n<div class=\"date\">\n  <a href=\"https://x.com/NickSzabo4/status/1973502865143636151\" class=\"timestamp\" target=\"_blank\" rel=\"noopener nofollow ugc\"></a>\n\n\n</div>\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 1,
  "updated_at": "2025-10-08T10:31:48.214Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 2,
  "readers_count": 1,
  "score": 0.4,
  "yours": false,
  "topic_id": 2035,
  "topic_slug": "csam-is-the-elephant-in-the-room",
  "topic_title": "CSAM is the elephant in the room",
  "topic_html_title": "CSAM is the elephant in the room",
  "category_id": 5,
  "display_username": "Zawy",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "It could affect my wife's employment if I hold bitcoin and it becomes common knowledge that it makes no effort to stop CSAM. My family would turn an eye of disgust towards anyone holding it. Not being able to stop it doesn't matter as much as not trying. Miners better choose to not mine on top of blocks that contain it \"in the open\". OFAC isn't a big concern. CSAM is important because it's about about public perception. The nodes, devs, miners, and governments don't matter. Public opinion is what pays the bills for PoW. \n\nPlaying cat and mouse is necessary to show concern. Showing concern is important to public opinion. Kudos to the king of shit-shows in his coup de grâce. Ignoring it isn't an option.  Any day now Elizabeth Warren is going to get wind of it.\n\nAs soon as a new encoding method for objectionable non-transactional data is discovered, miners could block it without a code update. They can collude to enforce the public consensus that CSAM material must not be easy to include. Miners are already colluding to not conduct a 51% attack because they don't want to lose public opinion and that in turn is due to not wanting to hurt the value of the coin which is the source of the net present value of their CAPEX. There's nothing in Nakamoto consensus that promotes, requires, or needs mining decentralization (non-collusion) other than mining not being a centralized entity that can be subject to government force. Permissionless mining only allows decentralization as an option. The security model is based on the CAPEX incentive, not decentralization. A single entity could be behind all miners and it wouldn't matter. In fact there is a single entity: public opinion. Miners learned it the hard way. Big blockers thought they had it.\n\nBlocking encoding schemes (imperfect cat and mouse) is very different from allowing images in a field. Look at the extreme: if a distributor of CSAM used random data from old blocks as a one-time pad to encode images, no one would place blame on the blockchain. He has to transmit what looks like random data, a block height, and an encoding scheme (which he wouldn't need to change). If he includes image data in a block, miners could collude to ignore blocks that use a known encoding scheme and decodes to objectionable material (detectable with A.I.), a CSAM distributor has to develop and distribute a new encoding scheme each time the material is discovered. This is closer to the extreme case that wouldn't have fault. This is an ugly, awful, and/or unworkable \"solution\" but the important point is to try.\n\nIf a government doesn't like bitcoin, it only needs to start including images to kill it. I believe Szabo is correct in his legal takes that unencoded OP_RETURN is different, but public opinion is also important.  Caving in to public opinion is more important than being right. PoW isn't autistic. It's based on public opinion.\n\nhttps://x.com/NickSzabo4/status/1973502865143636151",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 502,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "It could affect my wife’s employment if I hold bitcoin and it becomes common knowledge that it makes no effort to stop CSAM. My family would turn an eye of disgust towards anyone holding it. Not being able to stop it doesn’t matter as much as not trying. Miners better choose to not mine on top of bl&hellip;",
  "truncated": true,
  "post_url": "/t/csam-is-the-elephant-in-the-room/2035/1",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}