{
  "id": 6037,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/417_2.png",
  "created_at": "2025-10-10T02:41:01.361Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"ajtowns\" data-post=\"5\" data-topic=\"1906\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ajtowns/48/417_2.png\" class=\"avatar\"> ajtowns:</div>\n<blockquote>\n<p>Draft BIP text:</p>\n</blockquote>\n</aside>\n<p>This is published as <a href=\"https://github.com/bitcoin-inquisition/binana/blob/613ac5228846b6fa3b8422707a827e75803f3d6e/2025/BIN-2025-0002.md\">BIN25-2</a> now. That only describes the basic protocol, not how to best use it, which is something still to be figured out. It also doesn’t allow for any sort of delta-encoding as discussed in this thread.</p>\n<p>I’ve now done some very limited experimentation on mainnet with it, just between two peers running similar mempool policies. With that setup, I’d expect very few out-of-mempool txs to appear in the templates being shared. The ones I am seeing seem to take the form:</p>\n<ul>\n<li>this tx was just RBFed, but the template was generated beforehand</li>\n<li>this tx was confirmed in the previous block, but a new template hasn’t been created since that block came in</li>\n</ul>\n<p>The just-confirmed txs seem like they might take a little too long to deal with (I’m seeing ~0.3ms each, but when they happen, it can be 3000 txs all at once so that’s still 1s of total processing that doesn’t really achieve any useful progress). But we already have a map of the last block’s transactions, so just using that to quickly move on seems like it might be fine.</p>\n<p>The just-RBFed case could perhaps also be cached and skipped over, though I  like the idea of reconsidering recently RBFed top-of-mempool transactions as a way of mitigating Riard’s replacement cycling attacks, so it might have the potential to be beneficial. In any event there aren’t that many of them and they and easily resolved, so aren’t much of a problem.</p>\n<p>Still haven’t figured out a decent way of covering templates from honest inbound peers that works well in the presence of adversarial inbound peers.</p>\n<p>On the other hand, one thing that occurred to me is that I think if you requested a template from feeler peers before disconnecting and attempted to add any novel txs they had to your mempool, that would provide a fairly good way of increasing relay connectivity to get around attempted relay censorship, without adding much of an ongoing burden.</p>",
  "post_number": 23,
  "post_type": 1,
  "posts_count": 24,
  "updated_at": "2025-10-10T02:46:06.711Z",
  "reply_count": 1,
  "reply_to_post_number": 5,
  "quote_count": 1,
  "incoming_link_count": 1,
  "reads": 24,
  "readers_count": 23,
  "score": 29.6,
  "yours": false,
  "topic_id": 1906,
  "topic_slug": "sharing-block-templates",
  "topic_title": "Sharing block templates",
  "topic_html_title": "Sharing block templates",
  "category_id": 8,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"ajtowns, post:5, topic:1906\"]\nDraft BIP text:\n[/quote]\n\nThis is published as [BIN25-2](https://github.com/bitcoin-inquisition/binana/blob/613ac5228846b6fa3b8422707a827e75803f3d6e/2025/BIN-2025-0002.md) now. That only describes the basic protocol, not how to best use it, which is something still to be figured out. It also doesn't allow for any sort of delta-encoding as discussed in this thread.\n\nI've now done some very limited experimentation on mainnet with it, just between two peers running similar mempool policies. With that setup, I'd expect very few out-of-mempool txs to appear in the templates being shared. The ones I am seeing seem to take the form:\n\n * this tx was just RBFed, but the template was generated beforehand\n * this tx was confirmed in the previous block, but a new template hasn't been created since that block came in\n\nThe just-confirmed txs seem like they might take a little too long to deal with (I'm seeing ~0.3ms each, but when they happen, it can be 3000 txs all at once so that's still 1s of total processing that doesn't really achieve any useful progress). But we already have a map of the last block's transactions, so just using that to quickly move on seems like it might be fine.\n\nThe just-RBFed case could perhaps also be cached and skipped over, though I  like the idea of reconsidering recently RBFed top-of-mempool transactions as a way of mitigating Riard's replacement cycling attacks, so it might have the potential to be beneficial. In any event there aren't that many of them and they and easily resolved, so aren't much of a problem. \n\nStill haven't figured out a decent way of covering templates from honest inbound peers that works well in the presence of adversarial inbound peers.\n\nOn the other hand, one thing that occurred to me is that I think if you requested a template from feeler peers before disconnecting and attempted to add any novel txs they had to your mempool, that would provide a fairly good way of increasing relay connectivity to get around attempted relay censorship, without adding much of an ongoing burden.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "This is published as <a href=\"https://github.com/bitcoin-inquisition/binana/blob/613ac5228846b6fa3b8422707a827e75803f3d6e/2025/BIN-2025-0002.md\">BIN25-2</a> now. That only describes the basic protocol, not how to best use it, which is something still to be figured out. It also doesn’t allow for any sort of delta-encoding as discussed in this thread. \nI’ve now done some very limited experimentation on mainnet with it, just b&hellip;",
  "truncated": true,
  "post_url": "/t/sharing-block-templates/1906/23",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}