{
  "id": 4174,
  "name": "Adam Gibson",
  "username": "AdamISZ",
  "avatar_template": "/user_avatar/delvingbitcoin.org/adamisz/{size}/418_2.png",
  "created_at": "2025-02-04T15:03:32.537Z",
  "cooked": "<blockquote>\n<p>I must confess I’m not understanding what you are saying here <img src=\"https://delvingbitcoin.org/images/emoji/twitter/sweat_smile.png?v=12\" title=\":sweat_smile:\" class=\"emoji\" alt=\":sweat_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"> Could you explain?</p>\n</blockquote>\n<p>Oh sure. Let me write it out carefully (though you probably already know most of it) because I’m not exactly sure which part didn’t click with you:</p>\n<p>If the possession of a channel opening utxo (proved by signing) is sufficient to grant me access to X in the LN protocol, we want to replace that with “ZKP of possession of a channel opening utxo”, for better privacy. But, why does that “gate” exist? Only because it imposes a cost on spamming. It isn’t the case that, logically, the utxo <em>must</em> be a channel-related utxo, in fact. Because from an attacker’s point of view, creating a channel is the same cost as creating a utxo. So far so good? This implies we don’t <em>have</em> to use channel utxos and therefore MuSig2 negotiation.</p>\n<p>Further, because we’re considering a taproot scenario the distinction between one type of utxo is not revealed, in the happy paths.</p>\n<p>So in my work I went to the other extreme, considering only a single sig generated case.</p>\n<p>Then we get into the capacity and cost consideration. As you yourself noted, we don’t want to leak the exact channel amount, defeating the purpose. We can use multipliers or ranges. E.g. <a class=\"mention\" href=\"/u/mattcorallo\">@MattCorallo</a> above comments about M*N worth of channels for one N utxo. I was just noting that economically it seems a bit “off” to not make use of channel utxos in the proofs, but privacy wise it might be better.</p>\n<p>So at the end there I’m trying to say we, maybe, do indeed need MuSig2 support in the ZKP scheme because it’s not economical to not use channel utxos (but tbh I’m not entirely sure).</p>",
  "post_number": 20,
  "post_type": 1,
  "updated_at": "2025-02-04T15:03:32.537Z",
  "reply_count": 0,
  "reply_to_post_number": 19,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 1,
  "readers_count": 0,
  "score": 0,
  "yours": false,
  "topic_id": 1407,
  "topic_slug": "zk-gossip-for-lightning-channel-announcements",
  "topic_title": "ZK-gossip for lightning channel announcements",
  "topic_html_title": "ZK-gossip for lightning channel announcements",
  "category_id": 7,
  "display_username": "Adam Gibson",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "halseth",
    "name": "Johan T. Halseth",
    "avatar_template": "/user_avatar/delvingbitcoin.org/halseth/{size}/198_2.png"
  },
  "bookmarked": false,
  "raw": "> I must confess I’m not understanding what you are saying here :sweat_smile: Could you explain?\n\nOh sure. Let me write it out carefully (though you probably already know most of it) because I'm not exactly sure which part didn't click with you:\n\n If the possession of a channel opening utxo (proved by signing) is sufficient to grant me access to X in the LN protocol, we want to replace that with \"ZKP of possession of a channel opening utxo\", for better privacy. But, why does that \"gate\" exist? Only because it imposes a cost on spamming. It isn't the case that, logically, the utxo *must* be a channel-related utxo, in fact. Because from an attacker's point of view, creating a channel is the same cost as creating a utxo. So far so good? This implies we don't *have* to use channel utxos and therefore MuSig2 negotiation. \n\nFurther, because we're considering a taproot scenario the distinction between one type of utxo is not revealed, in the happy paths.\n\nSo in my work I went to the other extreme, considering only a single sig generated case.\n\nThen we get into the capacity and cost consideration. As you yourself noted, we don't want to leak the exact channel amount, defeating the purpose. We can use multipliers or ranges. E.g. @MattCorallo above comments about M*N worth of channels for one N utxo. I was just noting that economically it seems a bit \"off\" to not make use of channel utxos in the proofs, but privacy wise it might be better.\n\nSo at the end there I'm trying to say we, maybe, do indeed need MuSig2 support in the ZKP scheme because it's not economical to not use channel utxos (but tbh I'm not entirely sure).",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 343,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}