{
  "id": 4176,
  "name": "Sergi Delgado",
  "username": "sr-gi",
  "avatar_template": "/user_avatar/delvingbitcoin.org/sr-gi/{size}/117_2.png",
  "created_at": "2025-02-04T15:33:09.601Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"harding\" data-post=\"2\" data-topic=\"1416\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/harding/48/925_2.png\" class=\"avatar\"> harding:</div>\n<blockquote>\n<p>I’m having a hard time understanding this entire post and I think it’s because I don’t understand the opening paragraphs. It sounds to me like Alice’s node has a transaction and Bob’s node sent her an <code>inv</code> or a sketch with the wtxid, so Alice knows Bob has a validated copy of the transaction. Given that, a particular instance of the general question you seem to be asking is, “should Alice send Bob an <code>inv</code> for that transaction?”</p>\n</blockquote>\n</aside>\n<p>You’re right, I took this from my notes and some context was dropped, making it hard to follow.</p>\n<p>Alice has a transaction <code>t</code> and she is to decide what peers to fanout it to, and reconcile with the rest. Before making the decision, Bob announces <code>t</code>, making Alice aware that Bob already knows about it. The question here is: should Alice consider this when selecting fanout candidates, or should Bob be a potential candidate, even if that announcement would never be sent?</p>\n<p>Regardless of the decision, <code>t</code> will not be announced to Bob. However, filtering means that Alice will maintain a constant fanout rate while the candidate pool is big enough, and afterward, the rate will drop to 0. Not filtering may have a smoother fanout rate reduction effect.</p>\n<p>I’ve re-worded the thesis section to reflect this more clearly. I hope it is easier to follow now.</p>",
  "post_number": 3,
  "post_type": 1,
  "updated_at": "2025-02-04T15:33:09.601Z",
  "reply_count": 0,
  "reply_to_post_number": 2,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 8,
  "readers_count": 7,
  "score": 1.6,
  "yours": false,
  "topic_id": 1416,
  "topic_slug": "erlay-filter-fanout-candidates-based-on-transaction-knowledge",
  "topic_title": "Erlay: Filter fanout candidates based on transaction knowledge",
  "topic_html_title": "Erlay: Filter fanout candidates based on transaction knowledge",
  "category_id": 7,
  "display_username": "Sergi Delgado",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"harding, post:2, topic:1416\"]\nI’m having a hard time understanding this entire post and I think it’s because I don’t understand the opening paragraphs. It sounds to me like Alice’s node has a transaction and Bob’s node sent her an `inv` or a sketch with the wtxid, so Alice knows Bob has a validated copy of the transaction. Given that, a particular instance of the general question you seem to be asking is, “should Alice send Bob an `inv` for that transaction?”\n[/quote]\n\nYou're right, I took this from my notes and some context was dropped, making it hard to follow.\n\nAlice has a transaction `t` and she is to decide what peers to fanout it to, and reconcile with the rest. Before making the decision, Bob announces `t`, making Alice aware that Bob already knows about it. The question here is: should Alice consider this when selecting fanout candidates, or should Bob be a potential candidate, even if that announcement would never be sent?\n\nRegardless of the decision, `t` will not be announced to Bob. However, filtering means that Alice will maintain a constant fanout rate while the candidate pool is big enough, and afterward, the rate will drop to 0. Not filtering may have a smoother fanout rate reduction effect.\n\nI've re-worded the thesis section to reflect this more clearly. I hope it is easier to follow now.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 122,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "heart",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false
}