{
  "id": 4311,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/417_2.png",
  "created_at": "2025-02-14T14:40:05.232Z",
  "cooked": "<p>I appreciated the perspective the <a href=\"https://github.com/bitcoin-cap/bcap\">bcap</a> project offered regarding consensus changes within Bitcoin, but one thing I found a bit dissatisfying was that it lacked specific recommendations on how you should do things, whether as someone proposing consensus changes, or as one of the “stakeholders” who might want to exercise some influence over proposed changes.</p>\n<p>But I guess 2025 is the year of “you can just do things”, so why not be the change I want to see in the world, and write my own guide to making consensus changes in Bitcoin? That also lets me tweak bcap’s list of stakeholders into my preferred set of roles. So here it is:</p>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://ajtowns.github.io/bfg/\">\n  <header class=\"source\">\n\n      <a href=\"https://ajtowns.github.io/bfg/\" target=\"_blank\" rel=\"noopener\">Bitcoin Forking Guide</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"500\" height=\"500\" src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/1/192f56ba4de8b7b6879ab558a4ddec061a110fb3_2_500x500.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"727A75\">\n\n<h3><a href=\"https://ajtowns.github.io/bfg/\" target=\"_blank\" rel=\"noopener\">Introduction</a></h3>\n\n  <p>A guide to building consensus for changes to Bitcoin</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>If you prefer to TLDR, the key idea is in the first paragraph:</p>\n<blockquote>\n<p>This guide advocates the approach of <em><strong>consensus before consensus</strong></em>;\nnamely that it is important to establish social consensus in favour\nof a change prior to changing the consensus code that will make the\nchange reality.</p>\n</blockquote>\n<p>It’s not intended to be the be-all and end-all of how to change Bitcoin – after all, that’s not a goal that’s compatible with a decentralised system in the first place.</p>\n<p>As such, there’s obviously no teeth, per se, to any of its recommendations. At best the only real potential enforcement of any of its recommendations are either your conscience saying “you know, that recommendation is probably a good idea, maybe you should actually do it that way”, or other people saying “you seem like you’re skipping major steps here; that seems shady, so I don’t think I can support you”. But conversely, if you’re skipping steps because you have good reasons, that’s fine: it’s a guide, not a cop.</p>\n<p>Beyond that, it’s also only a fairly high-level guide. In practice, following the steps outlined will require drilling down into a lot of fiddly details at every stage, and doing a lot of work to get all those details right. This isn’t a shortcut for how to have your way with a two-trillion dollar asset.</p>\n<p>And finally, it’s only a guide to the cooperative path, where you make a change that makes everyone’s life better, and more or less everyone ends up agreeing that the change makes everyone’s lives better. It doesn’t provide a path to activation for changes that want to make a more utilitarian calculation where more some people might lose, but more people benefit (apart from saying that until that changes they don’t achieve consensus, and so get stuck forever in the early phases).</p>\n<p>Anyway, I wanted to put forward some concrete, constructive thoughts on what I think is a sensible approach to changing bitcoin looks like, and that’s it.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2025-02-14T14:40:05.232Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 192,
  "reads": 20,
  "readers_count": 19,
  "score": 964.0,
  "yours": false,
  "topic_id": 1451,
  "topic_slug": "bitcoin-forking-guide",
  "topic_title": "Bitcoin Forking Guide",
  "topic_html_title": "Bitcoin Forking Guide",
  "category_id": 5,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I appreciated the perspective the [bcap](https://github.com/bitcoin-cap/bcap) project offered regarding consensus changes within Bitcoin, but one thing I found a bit dissatisfying was that it lacked specific recommendations on how you should do things, whether as someone proposing consensus changes, or as one of the \"stakeholders\" who might want to exercise some influence over proposed changes.\n\nBut I guess 2025 is the year of \"you can just do things\", so why not be the change I want to see in the world, and write my own guide to making consensus changes in Bitcoin? That also lets me tweak bcap's list of stakeholders into my preferred set of roles. So here it is:\n\nhttps://ajtowns.github.io/bfg/\n\nIf you prefer to TLDR, the key idea is in the first paragraph:\n\n> This guide advocates the approach of ***consensus before consensus***;\nnamely that it is important to establish social consensus in favour\nof a change prior to changing the consensus code that will make the\nchange reality.\n\nIt's not intended to be the be-all and end-all of how to change Bitcoin -- after all, that's not a goal that's compatible with a decentralised system in the first place.\n\nAs such, there's obviously no teeth, per se, to any of its recommendations. At best the only real potential enforcement of any of its recommendations are either your conscience saying \"you know, that recommendation is probably a good idea, maybe you should actually do it that way\", or other people saying \"you seem like you're skipping major steps here; that seems shady, so I don't think I can support you\". But conversely, if you're skipping steps because you have good reasons, that's fine: it's a guide, not a cop.\n\nBeyond that, it's also only a fairly high-level guide. In practice, following the steps outlined will require drilling down into a lot of fiddly details at every stage, and doing a lot of work to get all those details right. This isn't a shortcut for how to have your way with a two-trillion dollar asset.\n\nAnd finally, it's only a guide to the cooperative path, where you make a change that makes everyone's life better, and more or less everyone ends up agreeing that the change makes everyone's lives better. It doesn't provide a path to activation for changes that want to make a more utilitarian calculation where more some people might lose, but more people benefit (apart from saying that until that changes they don't achieve consensus, and so get stuck forever in the early phases).\n\nAnyway, I wanted to put forward some concrete, constructive thoughts on what I think is a sensible approach to changing bitcoin looks like, and that's it.",
  "actions_summary": [],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}