{
  "id": 4314,
  "name": "Antoine Riard",
  "username": "ariard",
  "avatar_template": "/letter_avatar_proxy/v4/letter/a/c67d28/{size}.png",
  "created_at": "2025-02-16T21:46:57.823Z",
  "cooked": "<p>From a brief read, I think the guide is summarizing well how social consensus can be build by the champions of any consensus change before reaching technical consensus.</p>\n<blockquote>\n<p>Comparing your idea to similar ideas from the past</p>\n</blockquote>\n<blockquote>\n<p>Documenting the tradeoffs of your idea versus other approaches</p>\n</blockquote>\n<p>I believe this is where we have been mostly been stuck as a community at the very large, especially for covenants and contracting primitives in the last years. There is a multitude of ideas on how to do covenant the Right Way, and of course every time the primitive design is influenced by the use-case(s) thought off.</p>\n<p>That phenomena is easy to point out to the 3 or 4 payments pools designed that have been proposed where according to the off-chain construction semantics wished, the primitive expressivity has changed. This kind of phenomena generally generate a lot of frustration among the bona fides devs and stakeholders involved and it has even led some to claim that the consensus process is “<strong>memoryless</strong>” as the same arguments are re-hashed again and again\nfrom year to another. This is not completely wrong as a viewpoint.</p>\n<p>In my view, we are suffering less than a lack of consensus change methodology and more of a lack of a high-quality technical <strong>archive</strong>, from which researcher and protocol dev in your terminology can converge on same set of experiences, ideas and frameworks argued on. Said archive maintained and established with the highest degree of objectivity and with the best of human ability to do things with a no partisan and disinterested mindset.</p>\n<p>There is a page of the bitcoin wiki which is listing people’s opinion on a bunch of soft-forks, though it’s very <strong>people-centric</strong> rather than being <strong>ideas-centric</strong>. I.e pointing out what are the trade-offs among all the soft-forks proposals or what use-cases are enabled by the proposals, and then having people’s taking positions w.r.t the ideas.</p>\n<p>There has been attempt with the <a href=\"https://github.com/ariard/bitcoin-contracting-primitives-wg\">Bitcoin Contracting Primitives WG</a> in the past, where public IRC meetings were organized for people to speak about their different levels of understanding of a proposal and there was also a <a href=\"https://github.com/bitcoinops/bitcoinops.github.io/pull/806\">similar attempt</a> by the Optech folk to extensively document covenants.</p>\n<p>(-- I do not plan to resurrect the Bitcoin Contracting Primitives WG, no time and no interest, though if optech or others with sufficient credibility are thinking to do the hard work of maintaining a public online archive to document proposed consensus change I believe it would be welcome as a nice initiative).</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2025-02-16T21:49:14.334Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 4,
  "readers_count": 3,
  "score": 0.8,
  "yours": false,
  "topic_id": 1451,
  "topic_slug": "bitcoin-forking-guide",
  "topic_title": "Bitcoin Forking Guide",
  "topic_html_title": "Bitcoin Forking Guide",
  "category_id": 5,
  "display_username": "Antoine Riard",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "From a brief read, I think the guide is summarizing well how social consensus can be build by the champions of any consensus change before reaching technical consensus.\n\n> Comparing your idea to similar ideas from the past\n\n> Documenting the tradeoffs of your idea versus other approaches\n\nI believe this is where we have been mostly been stuck as a community at the very large, especially for covenants and contracting primitives in the last years. There is a multitude of ideas on how to do covenant the Right Way, and of course every time the primitive design is influenced by the use-case(s) thought off.\n\nThat phenomena is easy to point out to the 3 or 4 payments pools designed that have been proposed where according to the off-chain construction semantics wished, the primitive expressivity has changed. This kind of phenomena generally generate a lot of frustration among the bona fides devs and stakeholders involved and it has even led some to claim that the consensus process is \"**memoryless**\" as the same arguments are re-hashed again and again\nfrom year to another. This is not completely wrong as a viewpoint.\n\nIn my view, we are suffering less than a lack of consensus change methodology and more of a lack of a high-quality technical **archive**, from which researcher and protocol dev in your terminology can converge on same set of experiences, ideas and frameworks argued on. Said archive maintained and established with the highest degree of objectivity and with the best of human ability to do things with a no partisan and disinterested mindset.\n\nThere is a page of the bitcoin wiki which is listing people's opinion on a bunch of soft-forks, though it's very **people-centric** rather than being **ideas-centric**. I.e pointing out what are the trade-offs among all the soft-forks proposals or what use-cases are enabled by the proposals, and then having people's taking positions w.r.t the ideas.\n\nThere has been attempt with the [Bitcoin Contracting Primitives WG](https://github.com/ariard/bitcoin-contracting-primitives-wg) in the past, where public IRC meetings were organized for people to speak about their different levels of understanding of a proposal and there was also a [similar attempt](https://github.com/bitcoinops/bitcoinops.github.io/pull/806) by the Optech folk to extensively document covenants.\n\n(-- I do not plan to resurrect the Bitcoin Contracting Primitives WG, no time and no interest, though if optech or others with sufficient credibility are thinking to do the hard work of maintaining a public online archive to document proposed consensus change I believe it would be welcome as a nice initiative).",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 5,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}