{
  "id": 2622,
  "name": "ProofOfKeags",
  "username": "ProofOfKeags",
  "avatar_template": "/user_avatar/delvingbitcoin.org/proofofkeags/{size}/156_2.png",
  "created_at": "2024-06-03T22:30:05.772Z",
  "cooked": "<p>I tend to agree with <a class=\"mention\" href=\"/u/mattcorallo\">@MattCorallo</a> here in that while we are working hard to increase demand for block space across a variety of efforts, we don’t really have reason to believe that block space demand is a foregone conclusion. Changing the block size limit has very non-linear effects on fees too so it’s very <em>very</em> hard to predict how a change to the block size would impact the fee market.</p>\n<p>That said, I do think we should begin to normalize the discussion of expanding block size capacity. I think that in the '15-'17 era it was good for us to take a hard line stance on the issue but I think the wider community has a very reactionary response to even suggesting it and I think we can unwind some of that by talking very openly and honestly about what it might solve and at what expense.</p>\n<p>The main uncertainty I’d like to make everyone aware of is that doubling the block size won’t necessarily cut fees in half. All market prices develop as a clearing some supply against some demand. Bitcoin’s block space supply schedule is <em>perfectly inelastic</em>… no amount of increased prices will invite any sustainable increased supply (modulo consensus forks that… raise the block size <img src=\"https://delvingbitcoin.org/images/emoji/twitter/upside_down_face.png?v=12\" title=\":upside_down_face:\" class=\"emoji\" alt=\":upside_down_face:\" loading=\"lazy\" width=\"20\" height=\"20\">). On the other side of it, the user demand elasticity is fairly immeasurable. Especially in the presence of more sophisticated RBF procedures (like the one we shipped in LND 0.18), the visible fee market isn’t necessarily representative of the overall willingness to pay fees.</p>\n<p>You can imagine a situation where there is <em>exactly</em> 4MWu of transactions every ten minutes that has a willingness to pay 1ksat/vb for their transaction, but has the sophistication to start with 1sat/vb and RBF their way up to ensure they are in the next block. If you had a block space budget of 4MWu + <span class=\"math\">e</span> per block, then the fees would be 1sat/vb, and if you had a budget of 4MWu – <span class=\"math\">e</span> you would end up with fees at 1000sat/vb as the participants RBF their way into winning that bidding war. This example is admittedly contrived, but the point I’m trying to convey here is that a miniscule increase to the block size can wipe out the entire fee market in certain conditions.</p>\n<p>As such, using observed fee levels to try and decide on a new block size limit parameter is likely not a good approach overall. If we were to try and fuck with the block space supply schedule I’d like to see something that changes the <em>elasticity</em> of the block supply as opposed to something that kept <em>perfect inelasticity</em> and just changed the available supply.</p>\n<p>I think this is an important conversation to normalize, though. I don’t think that in 2024 we should mindlessly reject conversations on the subject like it’s still 2017.</p>",
  "post_number": 6,
  "post_type": 1,
  "updated_at": "2024-06-03T22:30:05.772Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 1,
  "reads": 5,
  "readers_count": 4,
  "score": 6.0,
  "yours": false,
  "topic_id": 941,
  "topic_slug": "is-it-time-to-increase-the-blocksize-cap",
  "topic_title": "Is it time to increase the blocksize cap?",
  "topic_html_title": "Is it time to increase the blocksize cap?",
  "category_id": 5,
  "display_username": "ProofOfKeags",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "I tend to agree with @MattCorallo here in that while we are working hard to increase demand for block space across a variety of efforts, we don't really have reason to believe that block space demand is a foregone conclusion. Changing the block size limit has very non-linear effects on fees too so it's very *very* hard to predict how a change to the block size would impact the fee market.\n\nThat said, I do think we should begin to normalize the discussion of expanding block size capacity. I think that in the '15-'17 era it was good for us to take a hard line stance on the issue but I think the wider community has a very reactionary response to even suggesting it and I think we can unwind some of that by talking very openly and honestly about what it might solve and at what expense.\n\nThe main uncertainty I'd like to make everyone aware of is that doubling the block size won't necessarily cut fees in half. All market prices develop as a clearing some supply against some demand. Bitcoin's block space supply schedule is *perfectly inelastic*... no amount of increased prices will invite any sustainable increased supply (modulo consensus forks that... raise the block size 🙃). On the other side of it, the user demand elasticity is fairly immeasurable. Especially in the presence of more sophisticated RBF procedures (like the one we shipped in LND 0.18), the visible fee market isn't necessarily representative of the overall willingness to pay fees.\n\nYou can imagine a situation where there is *exactly* 4MWu of transactions every ten minutes that has a willingness to pay 1ksat/vb for their transaction, but has the sophistication to start with 1sat/vb and RBF their way up to ensure they are in the next block. If you had a block space budget of 4MWu + $e$ per block, then the fees would be 1sat/vb, and if you had a budget of 4MWu -- $e$ you would end up with fees at 1000sat/vb as the participants RBF their way into winning that bidding war. This example is admittedly contrived, but the point I'm trying to convey here is that a miniscule increase to the block size can wipe out the entire fee market in certain conditions.\n\nAs such, using observed fee levels to try and decide on a new block size limit parameter is likely not a good approach overall. If we were to try and fuck with the block space supply schedule I'd like to see something that changes the *elasticity* of the block supply as opposed to something that kept *perfect inelasticity* and just changed the available supply.\n\nI think this is an important conversation to normalize, though. I don't think that in 2024 we should mindlessly reject conversations on the subject like it's still 2017.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 138,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}