{
  "id": 2598,
  "name": "Kevin Ravensberg",
  "username": "kravens",
  "avatar_template": "/user_avatar/delvingbitcoin.org/kravens/{size}/534_2.png",
  "created_at": "2024-06-02T09:59:08.840Z",
  "cooked": "<p>Recently there has been a regulatory move against non-custodial privacy tools that led to the closing of the coordinator servers of Samourai Wallet (<a href=\"https://www.justice.gov/usao-sdny/pr/founders-and-ceo-cryptocurrency-mixing-service-arrested-and-charged-money-laundering\" rel=\"noopener nofollow ugc\">police confiscation of server</a>) and Wasabi Wallet (<a href=\"https://blog.wasabiwallet.io/zksnacks-is-discontinuing-its-coinjoin-coordination-service-1st-of-june/\" rel=\"noopener nofollow ugc\">voluntary shutdown</a>). These were service providers that had attracted a lot of liquidity for CoinJoin transactions that therefore had a good resulting anonymity set for participants. Now there is still the alternative <a href=\"https://jamdocs.org/philosophy/03-joinmarket/\" rel=\"noopener nofollow ugc\">JoinMarket with Jam</a> as an improved user-interface that works without a central coordinator, but has a more complex setup process than the previously mentioned wallets.</p>\n<p>One of the new developments I’ve jumped into is the <a href=\"https://docs.btcpayserver.org/Wabisabi/#installation\" rel=\"noopener nofollow ugc\">BTCPay Server CoinJoin plugin</a> that uses the open WabiSabi protocol (used in Wasabi Wallet) and allows users to easily spin up their own coordinator.</p>\n<p>This BTCPay coordinator also advertises itself via Nostr relay, so to make it easy to find by other wallets that implemented the WabiSabi protocol (e.g. WasabiWallet, Trezor Suite, BTCPay server). An example tool looking for active coordinator servers can be found <a href=\"https://github.com/Kukks/WasabiNostr\" rel=\"noopener nofollow ugc\">here</a>.</p>\n<p>Users of Wasabi Wallet and BTCPay server can already freely choose a different coordinator, to help my local community stay private on-chain I’ve set up a coordinator service too (<a href=\"https://wasabi.kravens.nl\" rel=\"noopener nofollow ugc\">instructions to join are here</a>).</p>\n<p>One of the issues that new coordinators face is the lack of participants, as the wallets don’t yet have a proper flow to guide them towards these alternative coordinators. Or in the case of Trezor Suite the option to switch coordinator server is simply not implemented.</p>\n<p>I’m curious to what solutions the bitcoin privacy community will come, will we see a hydra of BTCPay Coordinators that become more numerous with each head cut off. Or will JoinMarket see more adoption from people whom depended on the centralized coordinators of Samourai and Wasabi Wallet before.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2024-06-02T10:01:26.166Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 20,
  "reads": 17,
  "readers_count": 16,
  "score": 133.4,
  "yours": false,
  "topic_id": 934,
  "topic_slug": "who-will-run-the-coinjoin-coordinators",
  "topic_title": "Who will run the CoinJoin coordinators?",
  "topic_html_title": "Who will run the CoinJoin coordinators?",
  "category_id": 5,
  "display_username": "Kevin Ravensberg",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Recently there has been a regulatory move against non-custodial privacy tools that led to the closing of the coordinator servers of Samourai Wallet ([police confiscation of server](https://www.justice.gov/usao-sdny/pr/founders-and-ceo-cryptocurrency-mixing-service-arrested-and-charged-money-laundering)) and Wasabi Wallet ([voluntary shutdown](https://blog.wasabiwallet.io/zksnacks-is-discontinuing-its-coinjoin-coordination-service-1st-of-june/)). These were service providers that had attracted a lot of liquidity for CoinJoin transactions that therefore had a good resulting anonymity set for participants. Now there is still the alternative [JoinMarket with Jam](https://jamdocs.org/philosophy/03-joinmarket/) as an improved user-interface that works without a central coordinator, but has a more complex setup process than the previously mentioned wallets.\n\nOne of the new developments I've jumped into is the [BTCPay Server CoinJoin plugin](https://docs.btcpayserver.org/Wabisabi/#installation) that uses the open WabiSabi protocol (used in Wasabi Wallet) and allows users to easily spin up their own coordinator.\n\nThis BTCPay coordinator also advertises itself via Nostr relay, so to make it easy to find by other wallets that implemented the WabiSabi protocol (e.g. WasabiWallet, Trezor Suite, BTCPay server). An example tool looking for active coordinator servers can be found [here](https://github.com/Kukks/WasabiNostr).\n\nUsers of Wasabi Wallet and BTCPay server can already freely choose a different coordinator, to help my local community stay private on-chain I've set up a coordinator service too ([instructions to join are here](https://wasabi.kravens.nl)).\n\nOne of the issues that new coordinators face is the lack of participants, as the wallets don't yet have a proper flow to guide them towards these alternative coordinators. Or in the case of Trezor Suite the option to switch coordinator server is simply not implemented.\n\nI'm curious to what solutions the bitcoin privacy community will come, will we see a hydra of BTCPay Coordinators that become more numerous with each head cut off. Or will JoinMarket see more adoption from people whom depended on the centralized coordinators of Samourai and Wasabi Wallet before.",
  "actions_summary": [
    {
      "id": 2,
      "count": 2
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 417,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "rocket",
      "type": "emoji",
      "count": 2
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 2,
  "current_user_used_main_reaction": false
}