{
  "id": 2809,
  "name": "",
  "username": "roasbeef",
  "avatar_template": "/user_avatar/delvingbitcoin.org/roasbeef/{size}/160_2.png",
  "created_at": "2024-06-26T22:48:44.837Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"t-bast\" data-post=\"2\" data-topic=\"991\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/t-bast/48/98_2.png\" class=\"avatar\"> t-bast:</div>\n<blockquote>\n<p>Since both the payer and recipient would need to add code to support this extension, why not simply allow paying a Bolt 12 invoice (without going through the offer / invoice_request flow)?</p>\n</blockquote>\n</aside>\n<p>In the past I brought up the idea of decoupling the Bolt 12 <em>invoice</em> format from Offers itself. Rationale back then is that it would allow us to introduce this new encoding format, then also get the LN Address/LN-URL crowd using the new format. The idea received some pushback, as devs were apprehensive to introduce yet another format into the mix (BOLT 11, BOLT 12 Offers, and BOLT 11 Invoices), so I dropped it all together.</p>\n<p>Since then, based on <a href=\"https://github.com/ACINQ/eclair/pull/2843#discussion_r1544662941\" rel=\"noopener nofollow ugc\">comments like this</a>, it appears there’s a sort of gentleman’s agreement to <em>not</em> expose an encoding format for BOLT12 invoices. Has your thinking here evolved since May?</p>\n<p>Either way, I think we can do <em>both</em>. Though checking out the latest invoice format, it appears there’re many fields that link an offer to an invoice that clients decoding would reject if not present. So if we go in this direction, perhaps we should extract the BOLT12 <em>invoice</em> format from the greater spec, then the BOLT 12 <em>offers</em> section specifies the additional fields (since it’s all TLV now) that need to be present for an invoice.</p>\n<p>Ultimately, extracting the BOLT 12 invoice format does add yet another item to the Offers development priorities. Do the other implementations consider it worthy enough to divert away resources from finalizing the last 20% of Offers? My assumption is/was that they’d prefer just to focus on that last 20%. If that’s the case, then we’d continue with our BOLT 11 experiment outlined here, leaving open a possibility of the BOLT 12 invoice format being extracted in the future.</p>\n<p>Ignoring any user-facing wallet uptake (implications re QR code encoding and multi-formats), there exist fully programmatic flows like the L402 protocol (or sub-swap services like Loop) that can use the BOLT 11 extensions to leverage blinded paths and all their benefits. I think blinded paths are super interesting in the context of sub-swap services as they’d allow a receiver to curate the route to them, potentially picking certain routes they know to be lower fee or more reliable.</p>",
  "post_number": 4,
  "post_type": 1,
  "updated_at": "2024-06-26T22:49:49.832Z",
  "reply_count": 0,
  "reply_to_post_number": 2,
  "quote_count": 1,
  "incoming_link_count": 5,
  "reads": 5,
  "readers_count": 4,
  "score": 20.6,
  "yours": false,
  "topic_id": 991,
  "topic_slug": "blip-bolt-11-invoice-blinded-path-tagged-field",
  "topic_title": "bLIP: BOLT 11 Invoice Blinded Path Tagged Field",
  "topic_html_title": "bLIP: BOLT 11 Invoice Blinded Path Tagged Field",
  "category_id": 7,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"t-bast, post:2, topic:991\"]\nSince both the payer and recipient would need to add code to support this extension, why not simply allow paying a Bolt 12 invoice (without going through the offer / invoice_request flow)?\n[/quote]\n\nIn the past I brought up the idea of decoupling the Bolt 12 _invoice_ format from Offers itself. Rationale back then is that it would allow us to introduce this new encoding format, then also get the LN Address/LN-URL crowd using the new format. The idea received some pushback, as devs were apprehensive to introduce yet another format into the mix (BOLT 11, BOLT 12 Offers, and BOLT 11 Invoices), so I dropped it all together. \n\nSince then, based on [comments like this](https://github.com/ACINQ/eclair/pull/2843#discussion_r1544662941), it appears there's a sort of gentleman's agreement to _not_ expose an encoding format for BOLT12 invoices. Has your thinking here evolved since May? \n\nEither way, I think we can do _both_. Though checking out the latest invoice format, it appears there're many fields that link an offer to an invoice that clients decoding would reject if not present. So if we go in this direction, perhaps we should extract the BOLT12 _invoice_ format from the greater spec, then the BOLT 12 _offers_ section specifies the additional fields (since it's all TLV now) that need to be present for an invoice. \n\nUltimately, extracting the BOLT 12 invoice format does add yet another item to the Offers development priorities. Do the other implementations consider it worthy enough to divert away resources from finalizing the last 20% of Offers? My assumption is/was that they'd prefer just to focus on that last 20%. If that's the case, then we'd continue with our BOLT 11 experiment outlined here, leaving open a possibility of the BOLT 12 invoice format being extracted in the future. \n\nIgnoring any user-facing wallet uptake (implications re QR code encoding and multi-formats), there exist fully programmatic flows like the L402 protocol (or sub-swap services like Loop) that can use the BOLT 11 extensions to leverage blinded paths and all their benefits. I think blinded paths are super interesting in the context of sub-swap services as they'd allow a receiver to curate the route to them, potentially picking certain routes they know to be lower fee or more reliable.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 143,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}