{
  "id": 2617,
  "name": "Corey Haddad",
  "username": "CubicEarth",
  "avatar_template": "/user_avatar/delvingbitcoin.org/cubicearth/{size}/278_2.png",
  "created_at": "2024-06-03T19:39:32.063Z",
  "cooked": "<p>Yes, it is.</p>\n<p>The problem is Bitcoin’s philosophy today is heavily influenced by the fact that there was a “blocksize war”, and many of the advocates for increasing on-chain capacity left bitcoin development or were driven out. It’s a form of political polarization that we are left with.</p>\n<p>The tiny-block arguments are full of contradictions.</p>\n<p>• That the cost of running a node is all that matters, while ignoring the cost to transact</p>\n<p>• That small blocks are critical for decentralization (which only matters here for purposes of censorship resistance), while acknowledging high fees mean Bitcoin will primarily be used by large institutions and governments (who ARE the censors)</p>\n<p>• Thinking that IBD time must be quick (even though regular users are priced out of transacting). Institutions aren’t going to not run node because syncing takes 4 days instead of 1 day.</p>\n<p>•  Arguing that smaller blocks maximize fee revenue for miners. That is just wrong. There is an optimum block size that would maximize fee revenue, which would be neither too big nor too small.</p>\n<p>• Arguing that smaller blocks are more inclusive, because they make it easy for people with bad internet to run a node. The fact is tiny blocks put an absolute cap on access to the base chain, excluding 98% of humans, whereas making running a node only feasible for people who have better than circa-year-2000  3.0 Mbps internet only excludes the 20% of people on the planet who aren’t well connected.</p>\n<p>And bad-faith arguments too:</p>\n<p>• Acting like anyone not in favor of tiny-blocks is a “big-blocker” and should use BSV or some garbage.</p>\n<p>• Arguing that there isn’t a point to increasing block sizes because for any reasonable increase, there will still be unmet demand. (Which BTW, is why fee revenue would go up with marginally larger blocks (to a point)).</p>\n<p>And this misguided ones:</p>\n<p>• Somehow pretending that because other layers are and will be needed, that there is no benefit to increasing layer-1 capacity.</p>\n<p>I think to have a more concrete discussion around this topic, it would help to pick a couple of few block sizes and analyze their potential real-world impacts. What would they actually do to IBD time? And bandwidth and storage requirements? How many new Lightning users could be accommodated? What kind of fee-modeling can be done?</p>\n<p>IMO 8 MB, 16 MB and 32 MB block weights would be the reasonable numbers to study. Assuming that we are at ~4MB right now.</p>\n<p>Edit:</p>\n<p>Blocks should be as large as they can safely be.</p>",
  "post_number": 2,
  "post_type": 1,
  "updated_at": "2024-06-03T19:40:34.364Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 2,
  "reads": 14,
  "readers_count": 13,
  "score": 12.8,
  "yours": false,
  "topic_id": 941,
  "topic_slug": "is-it-time-to-increase-the-blocksize-cap",
  "topic_title": "Is it time to increase the blocksize cap?",
  "topic_html_title": "Is it time to increase the blocksize cap?",
  "category_id": 5,
  "display_username": "Corey Haddad",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Yes, it is.\n\nThe problem is Bitcoin's philosophy today is heavily influenced by the fact that there was a \"blocksize war\", and many of the advocates for increasing on-chain capacity left bitcoin development or were driven out. It's a form of political polarization that we are left with.\n\nThe tiny-block arguments are full of contradictions.\n\n• That the cost of running a node is all that matters, while ignoring the cost to transact\n\n• That small blocks are critical for decentralization (which only matters here for purposes of censorship resistance), while acknowledging high fees mean Bitcoin will primarily be used by large institutions and governments (who ARE the censors)\n\n• Thinking that IBD time must be quick (even though regular users are priced out of transacting). Institutions aren't going to not run node because syncing takes 4 days instead of 1 day.\n\n•  Arguing that smaller blocks maximize fee revenue for miners. That is just wrong. There is an optimum block size that would maximize fee revenue, which would be neither too big nor too small.\n\n• Arguing that smaller blocks are more inclusive, because they make it easy for people with bad internet to run a node. The fact is tiny blocks put an absolute cap on access to the base chain, excluding 98% of humans, whereas making running a node only feasible for people who have better than circa-year-2000  3.0 Mbps internet only excludes the 20% of people on the planet who aren't well connected.\n\nAnd bad-faith arguments too:\n\n• Acting like anyone not in favor of tiny-blocks is a \"big-blocker\" and should use BSV or some garbage.\n\n• Arguing that there isn't a point to increasing block sizes because for any reasonable increase, there will still be unmet demand. (Which BTW, is why fee revenue would go up with marginally larger blocks (to a point)).\n\n\nAnd this misguided ones:\n\n• Somehow pretending that because other layers are and will be needed, that there is no benefit to increasing layer-1 capacity.\n\n\n\nI think to have a more concrete discussion around this topic, it would help to pick a couple of few block sizes and analyze their potential real-world impacts. What would they actually do to IBD time? And bandwidth and storage requirements? How many new Lightning users could be accommodated? What kind of fee-modeling can be done?\n\nIMO 8 MB, 16 MB and 32 MB block weights would be the reasonable numbers to study. Assuming that we are at ~4MB right now.\n\nEdit: \n\nBlocks should be as large as they can safely be.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 238,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}