{
  "id": 2652,
  "name": "David A. Harding",
  "username": "harding",
  "avatar_template": "/user_avatar/delvingbitcoin.org/harding/{size}/6_2.png",
  "created_at": "2024-06-05T10:07:31.898Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"josibake\" data-post=\"13\" data-topic=\"891\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/josibake/48/83_2.png\" class=\"avatar\"> josibake:</div>\n<blockquote>\n<p>So for this attack to work, Mallory must control both the tweak server and the filter server to force a match,</p>\n</blockquote>\n</aside>\n<p>If Mallory created one of the taproot-paying transactions in the block (e.g. Mallory pays Mallory’), then she can create a filter for an alternative transaction (not included in the block) where she used the same input(s) to pay the victim’s SP address <em>x</em>.  That means she only needs control over the filter server.</p>\n<aside class=\"quote no-group\" data-username=\"josibake\" data-post=\"13\" data-topic=\"891\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/josibake/48/83_2.png\" class=\"avatar\"> josibake:</div>\n<blockquote>\n<p>a single server returning tweak data, filters and simplified UTXOs with regular audits gives the same level of privacy as getting full block data from the p2p network</p>\n</blockquote>\n</aside>\n<p>Strongly disagree here.  Audits only tell you that the server was honest in the past.  The victims of a recently compromised server probably won’t find much solace in knowing that their loss of privacy was detected by auditors who will discourage others from using that server in the future.</p>\n<aside class=\"quote no-group\" data-username=\"josibake\" data-post=\"13\" data-topic=\"891\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/josibake/48/83_2.png\" class=\"avatar\"> josibake:</div>\n<blockquote>\n<p>tweak data and simplified UTXOs are both public data sets, making it easy for anyone with access to the full blockchain to audit the data Mallory is returning and detect fake payments</p>\n</blockquote>\n</aside>\n<p>They’re only public datasets if everyone has the same block, but reorgs are possible, so auditing can be somewhat challenging.</p>\n<p>There’s an expensive version of the attack I describe where a completely legitimate block is created with only a transaction that matches the target wallet.  In that case, the tweaks and filters can be 100% legit and yet the server will still learn the network identity of the victim.</p>\n<p>Between the free and expensive versions of the attack is a variant of the well-known dust-spamming attack where the server operator spends small amounts of bitcoin to the target <em>x</em> SP address and keeps track of which network identities download the blocks of “simplified UTXOs” containing those transactions.  If network identity <em>X</em> is the only one that downloaded all of the corresponding blocks, there’s a high probability that they control the <em>x</em> SP address.</p>\n<p>In all these cases, acting like a BIP158 client (ideally using ephemeral Tor identities like Wasabi) significantly boosts the client’s chance of remaining private.  Of course, operating a full node provides even stronger privacy because it performs exactly the same network operations whether transactions belong to the wallet or not (i.e., it has information theoretic perfect privacy).</p>",
  "post_number": 14,
  "post_type": 1,
  "updated_at": "2024-06-05T10:07:31.898Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 1,
  "readers_count": 0,
  "score": 0,
  "yours": false,
  "topic_id": 891,
  "topic_slug": "silent-payments-light-client-protocol",
  "topic_title": "Silent Payments: Light Client Protocol",
  "topic_html_title": "Silent Payments: Light Client Protocol",
  "category_id": 12,
  "display_username": "David A. Harding",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"josibake, post:13, topic:891\"]\nSo for this attack to work, Mallory must control both the tweak server and the filter server to force a match,\n[/quote]\n\nIf Mallory created one of the taproot-paying transactions in the block (e.g. Mallory pays Mallory'), then she can create a filter for an alternative transaction (not included in the block) where she used the same input(s) to pay the victim's SP address _x_.  That means she only needs control over the filter server.\n\n[quote=\"josibake, post:13, topic:891\"]\na single server returning tweak data, filters and simplified UTXOs with regular audits gives the same level of privacy as getting full block data from the p2p network\n[/quote]\n\nStrongly disagree here.  Audits only tell you that the server was honest in the past.  The victims of a recently compromised server probably won't find much solace in knowing that their loss of privacy was detected by auditors who will discourage others from using that server in the future.\n\n[quote=\"josibake, post:13, topic:891\"]\ntweak data and simplified UTXOs are both public data sets, making it easy for anyone with access to the full blockchain to audit the data Mallory is returning and detect fake payments\n[/quote]\n\nThey're only public datasets if everyone has the same block, but reorgs are possible, so auditing can be somewhat challenging.\n\nThere's an expensive version of the attack I describe where a completely legitimate block is created with only a transaction that matches the target wallet.  In that case, the tweaks and filters can be 100% legit and yet the server will still learn the network identity of the victim.\n\nBetween the free and expensive versions of the attack is a variant of the well-known dust-spamming attack where the server operator spends small amounts of bitcoin to the target _x_ SP address and keeps track of which network identities download the blocks of \"simplified UTXOs\" containing those transactions.  If network identity _X_ is the only one that downloaded all of the corresponding blocks, there's a high probability that they control the _x_ SP address.\n\nIn all these cases, acting like a BIP158 client (ideally using ephemeral Tor identities like Wasabi) significantly boosts the client's chance of remaining private.  Of course, operating a full node provides even stronger privacy because it performs exactly the same network operations whether transactions belong to the wallet or not (i.e., it has information theoretic perfect privacy).",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 6,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}