{
  "id": 2770,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/417_2.png",
  "created_at": "2024-06-20T03:18:30.173Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"Chris_Stewart_5\" data-post=\"21\" data-topic=\"805\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/chris_stewart_5/48/296_2.png\" class=\"avatar\"> Chris_Stewart_5:</div>\n<blockquote>\n<p>How could you keep more than one weak block? Would these blocks be competing chain tips or blocks built on top of one another?</p>\n</blockquote>\n</aside>\n<p>If your current tip is height X, you’d accept up to k weak blocks for height X+1. Maybe you’d require them not only to be on the right height, but also to have your current tip as their parent. You might only accept the first k weak blocks and ignore subsequent ones, or you might rotate out older weak blocks for newer ones, perhaps preferring later timestamps (to avoid cycling back to older weak blocks of the same height if they’re re-announced).</p>\n<p>The idea behind keeping more than one would be if there are divergent mining policies on the network – eg, just mining by feerate, filtering txs, heavily prioritising transactions via out of band fees, including txs that were enabled via some new soft fork rule that your node doesn’t support.</p>\n<p>However the odds of multiple weak blocks actually being mined using independent policies is low (consider the runs of real blocks all found sequentially by Foundry, eg), so until you’ve seen k weak blocks at height X+1, it could be worth keeping weak blocks of height X or X-1 etc around if they contain still-consensus-valid txs that aren’t mempool compatible and haven’t been seen in newer weak blocks. OTOH, tracking that might be more complex than it’s worth too.</p>",
  "post_number": 22,
  "post_type": 1,
  "updated_at": "2024-06-20T03:18:30.173Z",
  "reply_count": 0,
  "reply_to_post_number": 21,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 7,
  "readers_count": 6,
  "score": 16.4,
  "yours": false,
  "topic_id": 805,
  "topic_slug": "second-look-at-weak-blocks",
  "topic_title": "Second Look at Weak Blocks",
  "topic_html_title": "Second Look at Weak Blocks",
  "category_id": 8,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"Chris_Stewart_5, post:21, topic:805\"]\nHow could you keep more than one weak block? Would these blocks be competing chain tips or blocks built on top of one another?\n[/quote]\n\nIf your current tip is height X, you'd accept up to k weak blocks for height X+1. Maybe you'd require them not only to be on the right height, but also to have your current tip as their parent. You might only accept the first k weak blocks and ignore subsequent ones, or you might rotate out older weak blocks for newer ones, perhaps preferring later timestamps (to avoid cycling back to older weak blocks of the same height if they're re-announced).\n\nThe idea behind keeping more than one would be if there are divergent mining policies on the network -- eg, just mining by feerate, filtering txs, heavily prioritising transactions via out of band fees, including txs that were enabled via some new soft fork rule that your node doesn't support.\n\nHowever the odds of multiple weak blocks actually being mined using independent policies is low (consider the runs of real blocks all found sequentially by Foundry, eg), so until you've seen k weak blocks at height X+1, it could be worth keeping weak blocks of height X or X-1 etc around if they contain still-consensus-valid txs that aren't mempool compatible and haven't been seen in newer weak blocks. OTOH, tracking that might be more complex than it's worth too.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "heart",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false
}