{
  "id": 6399,
  "name": "Ilya Evdokimov",
  "username": "evd0kim",
  "avatar_template": "/user_avatar/delvingbitcoin.org/evd0kim/{size}/1111_2.png",
  "created_at": "2025-12-09T12:20:01.251Z",
  "cooked": "<p><em>Disclaimer: We propose a new protocol flavor that must undergo a strict security audit before release into production.</em> <a href=\"https://vault.satsbridge.com/\" rel=\"noopener nofollow ugc\">The early alpha version</a> <em>currently works on the Ethereum Sepolia testnet, Ethereum and Arbitrum and can’t work with custodial Lightning wallets. Please join our <a href=\"https://t.me/SatsBridge\" rel=\"noopener nofollow ugc\">Telegram group</a> for updates and discussions.</em></p>\n<p>Bitcoin’s Lightning Network has proven that authentication can be secure, user-friendly, and easy through LNURL AUTH. It should be acknowledged that LNURL AUTH also enables air-gapping and second-factor authentication. Meanwhile, Ethereum’s account abstraction has demonstrated how smart contracts can enable sophisticated multi-signature security models and modular external signers. The convergence of these technologies presents an opportunity to create a unified cross-chain wallet architecture where Lightning Network wallets become remote signers for Ethereum accounts, enabling experienced Bitcoin users to seamlessly access the DeFi ecosystem while maintaining their preferred security model using familiar tools.</p>\n<p><strong>When Lightning meets Ethereum</strong></p>\n<p>The proposed protocol extends <a href=\"https://github.com/lnurl/luds/blob/luds/04.md\" rel=\"noopener nofollow ugc\">LNURL AUTH (LUD-04)</a> to manage Ethereum abstracted accounts and requires no changes to Lightning wallets because it flexibly adopts programmable components provided by various Ethereum projects. Let’s consider <a href=\"https://medium.com/u/d37a03e62785?source=post_page---user_mention--d2159018f7d5---------------------------------------\" rel=\"noopener nofollow ugc\">Safe Protocol</a> vaults, for instance, although during the Unite DeFi <a href=\"https://medium.com/u/2c9a654f35d?source=post_page---user_mention--d2159018f7d5---------------------------------------\" rel=\"noopener nofollow ugc\">1inch</a> hackathon, SatsBridge’s team also demonstrated a way to integrate LNURL with specific implementations of account abstraction working with <a href=\"https://medium.com/u/2c9a654f35d?source=post_page---user_mention--d2159018f7d5---------------------------------------\" rel=\"noopener nofollow ugc\">1inch</a> libraries. With Safe, SatsBridge backen creates a configurable vault that relies on Bitcoin’s Lightning Network QR-code-driven user experience and Ethereum’s programmable smart contract capabilities. This integration leverages the cryptographic compatibility between Bitcoin’s secp256k1 signatures and Ethereum’s signing schemes while maintaining the privacy and security properties that make LNURL AUTH effective.</p>\n<p>The system operates through a three-layer architecture (Bitcoin L1, L2, and LNURL on top) where Lightning wallets generate domain-specific authentication keys using existing LNURL AUTH derivation mechanisms (BIP32-based or SignMessage-based). However, instead of simple web authentication, these keys become owners in Safe multi-signature vaults. The “three-layer architecture” refers to the fact that all keys are derived from the main seed phrase backing the onchain wallet, Lightning Network client, and LNURL AUTH keys.</p>\n<pre data-code-wrap=\"mermaid\"><code class=\"lang-mermaid\">sequenceDiagram\nparticipant User as LNURL-enabled Wallet\nparticipant SB as SatsBridge Service\nparticipant AA as Account Abstraction Layer\nparticipant Safe as Safe Smart Account\nparticipant Sepolia as Sepolia Network\nparticipant Paymaster as Paymaster Service\n\nNote over User, Sepolia: SatsBridge LNURL Account Abstraction Protocol\n\n%% Step 0: Initial Setup\nUser-&gt;&gt;SB: Register at SatsBridge via LNURL AUTH - Register\nNote right of User: LNURL1DP...3GALG\n\n%% Step 1: Session Initialization\nSB-&gt;&gt;User: Session Init (ID: 0)\nNote left of SB: sessionK1: 060b707a88cc309f334ab93c2bb080018287caf881d29e455ab66438c4cc6a3f&lt;br/&gt;chainId: 11155111 (Sepolia)\n\n%% Step 2: Authentication &amp; Preparation\nUser-&gt;&gt;SB: Authentication &amp; Key Exchange\nSB-&gt;&gt;AA: Prepare Account Abstraction\nNote right of AA: Generate counterparty key:&lt;br/&gt;027c86723fbdabd767b42cf46979e34d32feeda7d90d8a88b5de84150055c4093e\n\n%% Step 3: Safe Account Configuration\nAA-&gt;&gt;Safe: Configure Safe Account Parameters\nNote left of Safe: Multi-sig setup:&lt;br/&gt;Threshold: 2/2&lt;br/&gt;Owners:&lt;br/&gt;• 0xfb4e51Af21643CFe6e920A91855bcc5eb36aaFaA (local)&lt;br/&gt;• 0x52C86B8DD8fE9E770266E64600F3AC6f30723036 (counterparty)\n\nSafe-&gt;&gt;AA: Safe Configuration Complete\nNote right of Safe: Safe Address:&lt;br/&gt;0xDcf0bCD3BAc926F42d2e163f3572B5aE2c91F0AD\n\n%% Step 4: UserOp Preparation\nAA-&gt;&gt;Paymaster: Request Sponsorship\nPaymaster-&gt;&gt;AA: Paymaster Data &amp; Signature\nNote left of Paymaster: Paymaster: 0x777777777777AeC03fd955926DbF81597e66834C\n\nAA-&gt;&gt;SB: UserOp Prepared\nSB-&gt;&gt;User: Login &amp; Prepare Complete (ID: 1)\nNote right of SB: userOpK1: f66b011fadd32cf5021a1af8aa97ae7f79abbbec3ffc3c9725c5a891630aec82\n\n%% Step 5: Transaction Execution\nUser-&gt;&gt;SB: Authorize Vault Creation via LNURL AUTH - Action\nSB-&gt;&gt;AA: Execute signed UserOp\nAA-&gt;&gt;Sepolia: Submit Transaction\nNote left of Sepolia: Factory: 0x4e1DCf7AD4e460CfD30791CCC4F9c8a4f820ec67&lt;br/&gt;Gas: maxFeePerGas: 1163448&lt;br/&gt;callGasLimit: 17955\n\n%% Step 6: Transaction Confirmation\nSepolia-&gt;&gt;AA: Transaction Mined\nAA-&gt;&gt;SB: Transaction Confirmed\nSB-&gt;&gt;User: Vault Created (ID: 2)\n</code></pre>\n<p>When a user initiates the account creation process, the system generates a new Safe vault configuration as shown in the figure above. The sequence protocol diagram provides a high-level representation of interactions between the Lightning wallet as a remote signer (1), SatsBridge Frontend as a fully functional Web3 app that can provide important information for the user (2), the Account Abstraction provider (3), and Safe as a convenient platform that enables access to multisignature-based smart contracts (4). Safe’s modular architecture supports this through its signature verification system (<a href=\"https://eip.tools/eip/1271\" rel=\"noopener nofollow ugc\">EIP-1271</a>), enabling the vault to validate signatures from Lightning wallets that have never directly interacted with Ethereum. This choice is dictated by the resilience of Safe and the intention to provide SatsBridge users an option to change providers after extending the vault configuration with additional signers compatible with the Safe frontend.</p>\n<p>To begin authorization and remote signing, the Safe vault generates a UserOperation (according to the ERC-4337 standard) containing the transaction details. This UserOperation is hashed and provided to the user as an LNURL AUTH k1 challenge that commits to both the traditional 32-byte challenge as a nonce and all remaining UserOperation data.</p>\n<p>For people not familiar with relevant Ethereum standards, the UserOperation k1 commits to:</p>\n<ul>\n<li>\n<p>A nonce</p>\n</li>\n<li>\n<p>Safe Account Parameters (owners, threshold, modules, etc.)</p>\n</li>\n<li>\n<p>Transaction Details (calls, gas limits, fees)</p>\n</li>\n<li>\n<p>Chain ID (11155111 for Sepolia)</p>\n</li>\n<li>\n<p>Account Abstraction Data (factory, paymaster)</p>\n</li>\n</ul>\n<p>As a result, the signing process is fully deterministic in the sense that the same UserOp parameters always produce the same hash. It is chain-specific because it includes the chainId to prevent cross-chain replay attacks and covers all aspects of the transaction. The signature proves authorization for a specific UserOperation, and the signed UserOp can be submitted to the EntryPoint contract. The UserOpK1 essentially represents a cryptographic commitment to the exact transaction parameters, ensuring that users can only authorize the specific operation they intend to execute.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/1/1f15df6c1663960f3112dad1ac6422d9c61c9c00.jpeg\" data-download-href=\"https://delvingbitcoin.org/uploads/default/1f15df6c1663960f3112dad1ac6422d9c61c9c00\" title=\"\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/1/1f15df6c1663960f3112dad1ac6422d9c61c9c00_2_478x500.jpeg\" alt=\"\" data-base62-sha1=\"4qZF9kZXbHZzIfO3sIJs1nnYwve\" width=\"478\" height=\"500\" role=\"presentation\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/1/1f15df6c1663960f3112dad1ac6422d9c61c9c00_2_478x500.jpeg, https://delvingbitcoin.org/uploads/default/original/2X/1/1f15df6c1663960f3112dad1ac6422d9c61c9c00.jpeg 1.5x, https://delvingbitcoin.org/uploads/default/original/2X/1/1f15df6c1663960f3112dad1ac6422d9c61c9c00.jpeg 2x\" data-dominant-color=\"3E3E40\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\"></span><span class=\"informations\">700×730 49.7 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p>Authorisation (left) of the Abstracted Account creation and domain-linked authorisation key (right) in the <a href=\"https://f-droid.org/packages/finance.valet/\" rel=\"noopener nofollow ugc\">Valet</a> app.</p>\n<p>The table below provides a brief overview of the differences between a normal LNURL challenge and UserOperation’s k1 that allows integration with Account Abstraction.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/a/a31699a7daa4fa7e15826c776c055500f5fb33fe.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/a31699a7daa4fa7e15826c776c055500f5fb33fe\" title=\"\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/a/a31699a7daa4fa7e15826c776c055500f5fb33fe_2_690x142.png\" alt=\"\" data-base62-sha1=\"ngKfoWQcFOYadYX2knzcmTHWUHQ\" width=\"690\" height=\"142\" role=\"presentation\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/a/a31699a7daa4fa7e15826c776c055500f5fb33fe_2_690x142.png, https://delvingbitcoin.org/uploads/default/original/2X/a/a31699a7daa4fa7e15826c776c055500f5fb33fe.png 1.5x, https://delvingbitcoin.org/uploads/default/original/2X/a/a31699a7daa4fa7e15826c776c055500f5fb33fe.png 2x\" data-dominant-color=\"EEEEED\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\"></span><span class=\"informations\">700×144 20.2 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p>Key Differences between LUD-04 k1 and UserOperation’s k1</p>\n<p>Lightning wallets receive this enhanced LNURL challenge with k1 that commits to the UserOperation through their existing QR code scanning or deep-linking mechanisms. The wallet derives the appropriate signing key using the same domain-specific derivation that ensures each Safe vault has a unique identity relationship with the Lightning wallet and a provider on the Lightning side, for example, SatsBridge.</p>\n<p>Safe vaults accessed via SatsBridge and managed by Lightning wallets enable comprehensive Ethereum ecosystem access while maintaining the security properties Lightning users expect. Gas abstraction through ERC-4337 eliminates the need for users to hold ETH for transaction fees, as paymasters can sponsor transactions or accept ERC-20 token payments. This architectural choice removes a significant barrier to DeFi adoption for Bitcoin-native users and allows more flexibility when their peers demand payments in non-Bitcoin tokens. At the same time, additional features may increase security when interacting with DeFi.</p>\n<p><strong>Perils of the blind signing</strong></p>\n<p>Despite major UX and UI conveniences and a sophisticated security stack including battle-tested standards, the LNURL-AA specification faces the same fundamental vulnerability that enabled the $1.5 billion Bybit hack. Lightning Network wallets cannot reliably display the actual state of vaults because they cannot deserialize and display Ethereum transaction data and AA UserOperation structure by default.</p>\n<p>Lightning wallets like Phoenix, <a href=\"https://f-droid.org/packages/finance.valet/\" rel=\"noopener nofollow ugc\">Valet</a>, and BlueWallet display LNURL AUTH challenges as simple signing requests without a detailed transaction context. When extended to Ethereum transactions, these wallets would show users cryptographic hashes and request signatures for operations they cannot fully understand. The wallet displays might show “Sign Ethereum transaction: 0x4f2ac7…” without revealing that the transaction transfers all vault assets to an attacker’s address. Our solution here is to propose an actual open-source Web3 paired app served by SatsBridge that will allow users to have the highest possible level of protection when it comes to situational awareness and LNURL-AA protocol interactions. Going further, we could consider a self-hosted open-source application stack that could work alongside widely adopted personal nodes such as Umbrel or StartOS. In the best-case scenario, the client doesn’t blindly trust the server’s UserOpK1 anymore, and any manipulation by the server would be caught during validation. The client essentially performs a “trust but verify” approach.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/1/1a7f922fd09db92157c933a1b033883381f74655.png\" data-download-href=\"https://delvingbitcoin.org/uploads/default/1a7f922fd09db92157c933a1b033883381f74655\" title=\"\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/1/1a7f922fd09db92157c933a1b033883381f74655_2_690x349.png\" alt=\"\" data-base62-sha1=\"3MpJvdN1OCOZ5zALWYvNGZ6NDmJ\" width=\"690\" height=\"349\" role=\"presentation\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/1/1a7f922fd09db92157c933a1b033883381f74655_2_690x349.png, https://delvingbitcoin.org/uploads/default/original/2X/1/1a7f922fd09db92157c933a1b033883381f74655.png 1.5x, https://delvingbitcoin.org/uploads/default/original/2X/1/1a7f922fd09db92157c933a1b033883381f74655.png 2x\" data-dominant-color=\"3E3F42\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\"></span><span class=\"informations\">1000×505 235 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p>The AA-aware application design, for smartphones. Bitcoin Wallet scans QR codes on the left, and the SatsBridge Vault application shows account balances and UserOperation k1 payload, so the user does not sign blindly anymore.</p>\n<p>Another workaround could involve adding Metamask as another co-signer wallet. For obvious reasons, Metamask better supports the set of required standards that have allowed Ethereum wallets to become relatively safe options for interacting with sophisticated smart contracts. ERC-4337 UserOperations are actually complex structures. They contain multiple fields (callData, signature, paymasterAndData) that are encoded as opaque byte strings. Furthermore, Ethereum smart contract interactions often involve complex nested function calls with parameters that determine the actual operation outcome. For instance, a Uniswap swap contains a “to” parameter specifying the recipient address. If this parameter is changed from the user’s address to an attacker’s address, Lightning wallets cannot detect this manipulation because they cannot parse the transaction’s internal structure, though this may be sufficient for the basic functionality of receiving and sending tokens non-custodially and without a native asset.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://delvingbitcoin.org/uploads/default/original/2X/e/ef1ae226435fa94bf5e791afaa194a70c06d88e9.jpeg\" data-download-href=\"https://delvingbitcoin.org/uploads/default/ef1ae226435fa94bf5e791afaa194a70c06d88e9\" title=\"send-screens\"><img src=\"https://delvingbitcoin.org/uploads/default/optimized/2X/e/ef1ae226435fa94bf5e791afaa194a70c06d88e9_2_690x262.jpeg\" alt=\"send-screens\" data-base62-sha1=\"y7dIcbIYSKpEosSzhYCTbkpWc0V\" width=\"690\" height=\"262\" srcset=\"https://delvingbitcoin.org/uploads/default/optimized/2X/e/ef1ae226435fa94bf5e791afaa194a70c06d88e9_2_690x262.jpeg, https://delvingbitcoin.org/uploads/default/optimized/2X/e/ef1ae226435fa94bf5e791afaa194a70c06d88e9_2_1035x393.jpeg 1.5x, https://delvingbitcoin.org/uploads/default/optimized/2X/e/ef1ae226435fa94bf5e791afaa194a70c06d88e9_2_1380x524.jpeg 2x\" data-dominant-color=\"2F3338\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">send-screens</span><span class=\"informations\">1932×735 187 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div></p>\n<p>Sending USDCs via LNURL-Account Abstraction. Similar <a href=\"https://njump.to/nevent1qqsfmxdfrl2fgf6vvjljm6xepdzw4pseqxxxsr9klxapta5uexjyhpspr4mhxue69uhkummnw3ezucnfw33k76twv4ezuum0vd5kzmp0qgsfxrt9p8s99z4qct8z9krrnwgxrxvgwaz5g69u4sflnfp5xkqy75qrqsqqqqqpecnwm3\" rel=\"noopener nofollow ugc\">demo on Nostr</a></p>\n<p>Advanced implementations could use multiple independent verification channels where Lightning users confirm transaction details through separate networks before signing. The first obvious candidate here would be Etherscan as a source of information about the current Ethereum state, but even experienced users may have difficulty understanding what actually happened in the chain of contract calls. Another approach would be to choose the Safe platform as the main platform for creating vaults and leverage its features for delivering more situational awareness to SatsBridge users for better security. Future research aims to find a reliable way to enable secure operations with vaults from any Lightning wallets available on the market.</p>\n<p>The Bitcoin space would benefit from experience accumulated in Ethereum when it comes to user-smart-contract interactions, although Bitcoin smart contracts are likely to be very different from what we know in Ethereum. In Ethereum, standards like EIP-712 enable structured message signing that could include both transaction data and human-readable descriptions in a single cryptographically verifiable package. Lightning wallets could verify these signatures using their existing cryptographic capabilities while displaying verified transaction descriptions to users. Fortunately, the entirely off-chain nature of the Lightning Network allows lots of experimentation to be done in the short term and new protocols to be built overnight. The development there is less problematic, and Bitcoin Core gives a clear example of how even a small feature such as message signing, which is not related to consensus, could easily<a href=\"https://github.com/bitcoin/bitcoin/pull/24058\" rel=\"noopener nofollow ugc\"> get stuck</a> and remain unfinished for years.</p>\n<p>To conclude the post, we evaluate the LNURL-AA protocol as one of the interesting opportunities to connect very different networks for the benefit of users who wish to stay close to their favorite wallets. SatsBridge’s early experiments included research related to embedding non-custodial Lightning wallets into Metamask, and we believe that going in a different direction with LNURL-AA has more flexibility and therefore more chances for success. We thank Pimlico and personally Sergey Potekhin for consultations and continuing support when we needed validation and endorsement.</p>\n<p><em>Please join our <a href=\"https://t.me/SatsBridge\" rel=\"noopener nofollow ugc\">Telegram group</a> for further updates and discussions.</em></p>\n<p>Authors: Ilya Evdokimov, Sergey Sherkunov</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 1,
  "updated_at": "2025-12-09T12:26:19.968Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 9,
  "reads": 23,
  "readers_count": 22,
  "score": 49.6,
  "yours": false,
  "topic_id": 2152,
  "topic_slug": "bitcoin-lightning-wallets-as-abstracted-accounts-in-evm-protocols",
  "topic_title": "Bitcoin Lightning Wallets as Abstracted Accounts in EVM Protocols",
  "topic_html_title": "Bitcoin Lightning Wallets as Abstracted Accounts in EVM Protocols",
  "category_id": 7,
  "display_username": "Ilya Evdokimov",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 4,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "*Disclaimer: We propose a new protocol flavor that must undergo a strict security audit before release into production.* [The early alpha version](https://vault.satsbridge.com/) *currently works on the Ethereum Sepolia testnet, Ethereum and Arbitrum and can’t work with custodial Lightning wallets. Please join our [Telegram group](https://t.me/SatsBridge) for updates and discussions.*\n\nBitcoin’s Lightning Network has proven that authentication can be secure, user-friendly, and easy through LNURL AUTH. It should be acknowledged that LNURL AUTH also enables air-gapping and second-factor authentication. Meanwhile, Ethereum’s account abstraction has demonstrated how smart contracts can enable sophisticated multi-signature security models and modular external signers. The convergence of these technologies presents an opportunity to create a unified cross-chain wallet architecture where Lightning Network wallets become remote signers for Ethereum accounts, enabling experienced Bitcoin users to seamlessly access the DeFi ecosystem while maintaining their preferred security model using familiar tools.\n\n**When Lightning meets Ethereum**\n\nThe proposed protocol extends [LNURL AUTH (LUD-04)](https://github.com/lnurl/luds/blob/luds/04.md) to manage Ethereum abstracted accounts and requires no changes to Lightning wallets because it flexibly adopts programmable components provided by various Ethereum projects. Let’s consider [Safe Protocol](https://medium.com/u/d37a03e62785?source=post_page---user_mention--d2159018f7d5---------------------------------------) vaults, for instance, although during the Unite DeFi [1inch](https://medium.com/u/2c9a654f35d?source=post_page---user_mention--d2159018f7d5---------------------------------------) hackathon, SatsBridge’s team also demonstrated a way to integrate LNURL with specific implementations of account abstraction working with [1inch](https://medium.com/u/2c9a654f35d?source=post_page---user_mention--d2159018f7d5---------------------------------------) libraries. With Safe, SatsBridge backen creates a configurable vault that relies on Bitcoin’s Lightning Network QR-code-driven user experience and Ethereum’s programmable smart contract capabilities. This integration leverages the cryptographic compatibility between Bitcoin’s secp256k1 signatures and Ethereum’s signing schemes while maintaining the privacy and security properties that make LNURL AUTH effective.\n\nThe system operates through a three-layer architecture (Bitcoin L1, L2, and LNURL on top) where Lightning wallets generate domain-specific authentication keys using existing LNURL AUTH derivation mechanisms (BIP32-based or SignMessage-based). However, instead of simple web authentication, these keys become owners in Safe multi-signature vaults. The “three-layer architecture” refers to the fact that all keys are derived from the main seed phrase backing the onchain wallet, Lightning Network client, and LNURL AUTH keys.\n\n```mermaid\nsequenceDiagram\nparticipant User as LNURL-enabled Wallet\nparticipant SB as SatsBridge Service\nparticipant AA as Account Abstraction Layer\nparticipant Safe as Safe Smart Account\nparticipant Sepolia as Sepolia Network\nparticipant Paymaster as Paymaster Service\n\nNote over User, Sepolia: SatsBridge LNURL Account Abstraction Protocol\n\n%% Step 0: Initial Setup\nUser->>SB: Register at SatsBridge via LNURL AUTH - Register\nNote right of User: LNURL1DP...3GALG\n\n%% Step 1: Session Initialization\nSB->>User: Session Init (ID: 0)\nNote left of SB: sessionK1: 060b707a88cc309f334ab93c2bb080018287caf881d29e455ab66438c4cc6a3f<br/>chainId: 11155111 (Sepolia)\n\n%% Step 2: Authentication & Preparation\nUser->>SB: Authentication & Key Exchange\nSB->>AA: Prepare Account Abstraction\nNote right of AA: Generate counterparty key:<br/>027c86723fbdabd767b42cf46979e34d32feeda7d90d8a88b5de84150055c4093e\n\n%% Step 3: Safe Account Configuration\nAA->>Safe: Configure Safe Account Parameters\nNote left of Safe: Multi-sig setup:<br/>Threshold: 2/2<br/>Owners:<br/>• 0xfb4e51Af21643CFe6e920A91855bcc5eb36aaFaA (local)<br/>• 0x52C86B8DD8fE9E770266E64600F3AC6f30723036 (counterparty)\n\nSafe->>AA: Safe Configuration Complete\nNote right of Safe: Safe Address:<br/>0xDcf0bCD3BAc926F42d2e163f3572B5aE2c91F0AD\n\n%% Step 4: UserOp Preparation\nAA->>Paymaster: Request Sponsorship\nPaymaster->>AA: Paymaster Data & Signature\nNote left of Paymaster: Paymaster: 0x777777777777AeC03fd955926DbF81597e66834C\n\nAA->>SB: UserOp Prepared\nSB->>User: Login & Prepare Complete (ID: 1)\nNote right of SB: userOpK1: f66b011fadd32cf5021a1af8aa97ae7f79abbbec3ffc3c9725c5a891630aec82\n\n%% Step 5: Transaction Execution\nUser->>SB: Authorize Vault Creation via LNURL AUTH - Action\nSB->>AA: Execute signed UserOp\nAA->>Sepolia: Submit Transaction\nNote left of Sepolia: Factory: 0x4e1DCf7AD4e460CfD30791CCC4F9c8a4f820ec67<br/>Gas: maxFeePerGas: 1163448<br/>callGasLimit: 17955\n\n%% Step 6: Transaction Confirmation\nSepolia->>AA: Transaction Mined\nAA->>SB: Transaction Confirmed\nSB->>User: Vault Created (ID: 2)\n```\n\nWhen a user initiates the account creation process, the system generates a new Safe vault configuration as shown in the figure above. The sequence protocol diagram provides a high-level representation of interactions between the Lightning wallet as a remote signer (1), SatsBridge Frontend as a fully functional Web3 app that can provide important information for the user (2), the Account Abstraction provider (3), and Safe as a convenient platform that enables access to multisignature-based smart contracts (4). Safe’s modular architecture supports this through its signature verification system ([EIP-1271](https://eip.tools/eip/1271)), enabling the vault to validate signatures from Lightning wallets that have never directly interacted with Ethereum. This choice is dictated by the resilience of Safe and the intention to provide SatsBridge users an option to change providers after extending the vault configuration with additional signers compatible with the Safe frontend.\n\nTo begin authorization and remote signing, the Safe vault generates a UserOperation (according to the ERC-4337 standard) containing the transaction details. This UserOperation is hashed and provided to the user as an LNURL AUTH k1 challenge that commits to both the traditional 32-byte challenge as a nonce and all remaining UserOperation data.\n\nFor people not familiar with relevant Ethereum standards, the UserOperation k1 commits to:\n\n* A nonce\n\n* Safe Account Parameters (owners, threshold, modules, etc.)\n\n* Transaction Details (calls, gas limits, fees)\n\n* Chain ID (11155111 for Sepolia)\n\n* Account Abstraction Data (factory, paymaster)\n\nAs a result, the signing process is fully deterministic in the sense that the same UserOp parameters always produce the same hash. It is chain-specific because it includes the chainId to prevent cross-chain replay attacks and covers all aspects of the transaction. The signature proves authorization for a specific UserOperation, and the signed UserOp can be submitted to the EntryPoint contract. The UserOpK1 essentially represents a cryptographic commitment to the exact transaction parameters, ensuring that users can only authorize the specific operation they intend to execute.\n\n![|700x731](upload://4qZF9kZXbHZzIfO3sIJs1nnYwve.jpeg)\n\nAuthorisation (left) of the Abstracted Account creation and domain-linked authorisation key (right) in the [Valet](https://f-droid.org/packages/finance.valet/) app.\n\nThe table below provides a brief overview of the differences between a normal LNURL challenge and UserOperation’s k1 that allows integration with Account Abstraction.\n\n![|700x145](upload://ngKfoWQcFOYadYX2knzcmTHWUHQ.png)\n\nKey Differences between LUD-04 k1 and UserOperation’s k1\n\nLightning wallets receive this enhanced LNURL challenge with k1 that commits to the UserOperation through their existing QR code scanning or deep-linking mechanisms. The wallet derives the appropriate signing key using the same domain-specific derivation that ensures each Safe vault has a unique identity relationship with the Lightning wallet and a provider on the Lightning side, for example, SatsBridge.\n\nSafe vaults accessed via SatsBridge and managed by Lightning wallets enable comprehensive Ethereum ecosystem access while maintaining the security properties Lightning users expect. Gas abstraction through ERC-4337 eliminates the need for users to hold ETH for transaction fees, as paymasters can sponsor transactions or accept ERC-20 token payments. This architectural choice removes a significant barrier to DeFi adoption for Bitcoin-native users and allows more flexibility when their peers demand payments in non-Bitcoin tokens. At the same time, additional features may increase security when interacting with DeFi.\n\n**Perils of the blind signing**\n\nDespite major UX and UI conveniences and a sophisticated security stack including battle-tested standards, the LNURL-AA specification faces the same fundamental vulnerability that enabled the $1.5 billion Bybit hack. Lightning Network wallets cannot reliably display the actual state of vaults because they cannot deserialize and display Ethereum transaction data and AA UserOperation structure by default.\n\nLightning wallets like Phoenix, [Valet](https://f-droid.org/packages/finance.valet/), and BlueWallet display LNURL AUTH challenges as simple signing requests without a detailed transaction context. When extended to Ethereum transactions, these wallets would show users cryptographic hashes and request signatures for operations they cannot fully understand. The wallet displays might show “Sign Ethereum transaction: 0x4f2ac7…” without revealing that the transaction transfers all vault assets to an attacker’s address. Our solution here is to propose an actual open-source Web3 paired app served by SatsBridge that will allow users to have the highest possible level of protection when it comes to situational awareness and LNURL-AA protocol interactions. Going further, we could consider a self-hosted open-source application stack that could work alongside widely adopted personal nodes such as Umbrel or StartOS. In the best-case scenario, the client doesn’t blindly trust the server’s UserOpK1 anymore, and any manipulation by the server would be caught during validation. The client essentially performs a “trust but verify” approach.\n\n![|1000x506](upload://3MpJvdN1OCOZ5zALWYvNGZ6NDmJ.png)\n\nThe AA-aware application design, for smartphones. Bitcoin Wallet scans QR codes on the left, and the SatsBridge Vault application shows account balances and UserOperation k1 payload, so the user does not sign blindly anymore.\n\nAnother workaround could involve adding Metamask as another co-signer wallet. For obvious reasons, Metamask better supports the set of required standards that have allowed Ethereum wallets to become relatively safe options for interacting with sophisticated smart contracts. ERC-4337 UserOperations are actually complex structures. They contain multiple fields (callData, signature, paymasterAndData) that are encoded as opaque byte strings. Furthermore, Ethereum smart contract interactions often involve complex nested function calls with parameters that determine the actual operation outcome. For instance, a Uniswap swap contains a “to” parameter specifying the recipient address. If this parameter is changed from the user’s address to an attacker’s address, Lightning wallets cannot detect this manipulation because they cannot parse the transaction’s internal structure, though this may be sufficient for the basic functionality of receiving and sending tokens non-custodially and without a native asset.\n\n![send-screens|690x262](upload://y7dIcbIYSKpEosSzhYCTbkpWc0V.jpeg)\n\nSending USDCs via LNURL-Account Abstraction. Similar [demo on Nostr](https://njump.to/nevent1qqsfmxdfrl2fgf6vvjljm6xepdzw4pseqxxxsr9klxapta5uexjyhpspr4mhxue69uhkummnw3ezucnfw33k76twv4ezuum0vd5kzmp0qgsfxrt9p8s99z4qct8z9krrnwgxrxvgwaz5g69u4sflnfp5xkqy75qrqsqqqqqpecnwm3)\n\nAdvanced implementations could use multiple independent verification channels where Lightning users confirm transaction details through separate networks before signing. The first obvious candidate here would be Etherscan as a source of information about the current Ethereum state, but even experienced users may have difficulty understanding what actually happened in the chain of contract calls. Another approach would be to choose the Safe platform as the main platform for creating vaults and leverage its features for delivering more situational awareness to SatsBridge users for better security. Future research aims to find a reliable way to enable secure operations with vaults from any Lightning wallets available on the market.\n\nThe Bitcoin space would benefit from experience accumulated in Ethereum when it comes to user-smart-contract interactions, although Bitcoin smart contracts are likely to be very different from what we know in Ethereum. In Ethereum, standards like EIP-712 enable structured message signing that could include both transaction data and human-readable descriptions in a single cryptographically verifiable package. Lightning wallets could verify these signatures using their existing cryptographic capabilities while displaying verified transaction descriptions to users. Fortunately, the entirely off-chain nature of the Lightning Network allows lots of experimentation to be done in the short term and new protocols to be built overnight. The development there is less problematic, and Bitcoin Core gives a clear example of how even a small feature such as message signing, which is not related to consensus, could easily[ get stuck](https://github.com/bitcoin/bitcoin/pull/24058) and remain unfinished for years.\n\nTo conclude the post, we evaluate the LNURL-AA protocol as one of the interesting opportunities to connect very different networks for the benefit of users who wish to stay close to their favorite wallets. SatsBridge’s early experiments included research related to embedding non-custodial Lightning wallets into Metamask, and we believe that going in a different direction with LNURL-AA has more flexibility and therefore more chances for success. We thank Pimlico and personally Sergey Potekhin for consultations and continuing support when we needed validation and endorsement.\n\n*Please join our [Telegram group](https://t.me/SatsBridge) for further updates and discussions.*\n\nAuthors: Ilya Evdokimov, Sergey Sherkunov",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 710,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "downloaded local copies of images",
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Disclaimer: We propose a new protocol flavor that must undergo a strict security audit before release into production. <a href=\"https://vault.satsbridge.com/\" rel=\"noopener nofollow ugc\">The early alpha version</a> currently works on the Ethereum Sepolia testnet, Ethereum and Arbitrum and can’t work with custodial Lightning wallets. Please join our <a href=\"https://t.me/SatsBridge\" rel=\"noopener nofollow ugc\">Telegram group</a> for up&hellip;",
  "truncated": true,
  "post_url": "/t/bitcoin-lightning-wallets-as-abstracted-accounts-in-evm-protocols/2152/1",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}