{
  "id": 6463,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/417_2.png",
  "created_at": "2025-12-19T13:22:24.479Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"VzxPLnHqr\" data-post=\"4\" data-topic=\"2165\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/vzxplnhqr/48/121_2.png\" class=\"avatar\"> VzxPLnHqr:</div>\n<blockquote>\n<p>by definition of a 0% risk free rate, people would value the future as much as the present.</p>\n</blockquote>\n</aside>\n<p>I wouldn’t go that far; it’s just that the price pressure on a future BTC seems to narrow to 1:1 – if I want to have 1 BTC in ten years’ time, then if I already have 1 BTC (or more) that’s obviously easy, I just time lock 1 BTC somewhere; but if I have less than 1 BTC, exchanging that for some other good, and then hoping I can sell it for a BTC-denominated profit soon doesn’t seem very safe.</p>\n<p>For inflationary currencies, the opposite is true – trade $100k for shares, or gold, or land, or a bunch of other things, and you’ll probably end up with more than $100k if you sell it a few years later, even without involving a counterparty, or adding value to whatever you bought before you sell it.</p>\n<p>So to me, the risk free rate is just a different measure of currency inflation vs real goods. The “time value of money”, where you’re getting a zero-effort profit by loaning someone money now and (hopefully) getting repaid later, adds counterparty risk (whether that be the borrower directly, the intermediary bank, or the guaranteeing insurnace firm, government, or currency issuer) and gets you an corresponding profit.</p>\n<p>I don’t think you get the same “get interest on your bank deposits with 0 risk” behaviour if you don’t have a currency issuer that can turn large scale defaults into just an inflationary shock.</p>\n<p>That’s how I look at it, anyway. YMMV obviously.</p>\n<aside class=\"quote no-group\" data-username=\"VzxPLnHqr\" data-post=\"4\" data-topic=\"2165\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/vzxplnhqr/48/121_2.png\" class=\"avatar\"> VzxPLnHqr:</div>\n<blockquote>\n<p>Yes, there is counterparty-risk here, but the sharechain network itself is the counterparty to the shareholders and bondholders.</p>\n</blockquote>\n</aside>\n<p>So the way I’d look at this is that the counterparties here are future\nminers vs present share holders, and via the FIFO queue, the risk that’s\ncreated is how long it will take the queue to drain so that you receive\nyour funds.</p>\n<p>I’m not really following the logic for the unbonded shares though; it\nseems buggy to me. Suppose when the sharechain is new, I mine 50% of\nshares with 1% of global hashrate over a two week period, and leave all\nmy shares unbonded. In that case, the sharechain will get ~40 blocks\nin a two week period, my shares will be selected for 50% of them,\nand I’ll get 20 blocks worth of reward, same as I would on any other\npool. But then if I stop mining, over the next two week period only ~20\nblocks will be mined, but my shares are still eligible to be selected,\nand that will happen about 33% of the time, so I’ll get an additional\n~6 blocks worth of reward.</p>\n<p>So I think at that point everyone else would abandon the sharepool as\nnon-competitive and it would die (since ongoing participants are losing\nfunds to me whether or not they bond their shares). I think similar\nlogic applies after the long term – once there’s any substantial amount\nof unbonded shares in the pool, creating new shares by mining into\nthe sharepool isn’t going to be profitable compared to mining against\nsome other pool. So I think you need a rolling window of some sort for\nunbonded shares, rather than a perpetual claim.</p>\n<p>Assuming that’s fixed somehow, recasting it as a “miners insurance”\ntype scheme, rather than a “time value of BTC” thing, would look\nsomething like:</p>\n<ul>\n<li>if your shares are unbonded, you have a chance of getting a big reward</li>\n<li>if your shares are bonded, you will definitely get a smaller reward,\nbut it will be delayed (both due to the time it takes to gather enough\nunbonded shares to buy a bonded share, and the time for the bonded\nFIFO queue to get to your share)</li>\n</ul>\n<p>Targeting the expected value of both those to be roughly <span class=\"math\">R \\cdot\n\\frac{D_S}{D_B}</span> should be plausible and make the pool viable.</p>\n<p>If you imagine there was some safe way for the sharechain to store rewards\nthen distribute it later (very non-trivial ofc), you could make the rule be that each share found\nfor a 2016 block retarget period (at constant target difficulty <span class=\"math\">D_B</span>)\naccrues a total block reward of <span class=\"math\">nR</span>, which is then distributed evenly,\nwith roughly <span class=\"math\">\\alpha n R</span> BTC going to bonded shares, and the remaining\n<span class=\"math\">(1-\\alpha) n R</span> BTC going to to <span class=\"math\">n</span> lucky unbonded share holders.</p>\n<p>That would involve bonded and unbonded share holders getting their payouts\nat exactly the same time, so there’s no conflict between present and\nfuture value, just a risk tradeoff. You could probably have the bonded\npayouts suffer a penalty that increases the unbonded miners’ payouts,\nperhaps encouraging more participation by large miners, helping to make\nyour pool more viable.</p>\n<p>If you’re targeting both forms of reward to have similar present value to\nmining in a regular pool, then you’re already distributing 100% of the\nblock reward, and I don’t think you have any degrees of freedom left to\nget interesting behaviour over the long term.</p>\n<p>If you look at it as going from a 1-in-a-million chance at a million\ndollars vs a 1-in-1 certainty of $1, you could perhaps consider mid-range\nshares as well, where you might have a 1/10000 chance at $10,000 or a\n1/100 chance at $100, so to speak. ie, the fundamental limit might be that you can\nhave 1000 outputs per block reward, but you have 1,000,000 shares per\nblock on average, then each share has a 1/1M chance of a 3.125BTC reward,\nand you could combine 1000 of them to have a certainty of a 3.1mBTC\nreward, but perhaps you could provide 100 of them to have a 10% chance of\na 3.1mBTC reward, or 1000 of them to have a 1% chance of a 0.3BTC reward.</p>\n<p>Selling (bonded) shares for immediate BTC on an open market with an\nautomated market maker would likely be very useful, allowing miners\nto be immediately liquid, without requiring the pool to act as an insurer.\nI expect there’s significant demand for a facility like that.</p>",
  "post_number": 5,
  "post_type": 1,
  "posts_count": 7,
  "updated_at": "2025-12-19T13:22:24.479Z",
  "reply_count": 1,
  "reply_to_post_number": 4,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 17,
  "readers_count": 16,
  "score": 8.4,
  "yours": false,
  "topic_id": 2165,
  "topic_slug": "bmax-pricing-sats-now-vs-sats-later-via-a-mining-sharechain-no-l1-changes-no-custodians-no-oracles",
  "topic_title": "BMAX: pricing “sats now vs sats later” via a mining sharechain (no L1 changes, no custodians, no oracles)",
  "topic_html_title": "BMAX: pricing “sats now vs sats later” via a mining sharechain (no L1 changes, no custodians, no oracles)",
  "category_id": 6,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"VzxPLnHqr, post:4, topic:2165\"]\nby definition of a 0% risk free rate, people would value the future as much as the present.\n[/quote]\n\nI wouldn't go that far; it's just that the price pressure on a future BTC seems to narrow to 1:1 -- if I want to have 1 BTC in ten years' time, then if I already have 1 BTC (or more) that's obviously easy, I just time lock 1 BTC somewhere; but if I have less than 1 BTC, exchanging that for some other good, and then hoping I can sell it for a BTC-denominated profit soon doesn't seem very safe.\n\nFor inflationary currencies, the opposite is true -- trade $100k for shares, or gold, or land, or a bunch of other things, and you'll probably end up with more than $100k if you sell it a few years later, even without involving a counterparty, or adding value to whatever you bought before you sell it.\n\nSo to me, the risk free rate is just a different measure of currency inflation vs real goods. The \"time value of money\", where you're getting a zero-effort profit by loaning someone money now and (hopefully) getting repaid later, adds counterparty risk (whether that be the borrower directly, the intermediary bank, or the guaranteeing insurnace firm, government, or currency issuer) and gets you an corresponding profit.\n\nI don't think you get the same \"get interest on your bank deposits with 0 risk\" behaviour if you don't have a currency issuer that can turn large scale defaults into just an inflationary shock.\n\nThat's how I look at it, anyway. YMMV obviously.\n\n[quote=\"VzxPLnHqr, post:4, topic:2165\"]\nYes, there is counterparty-risk here, but the sharechain network itself is the counterparty to the shareholders and bondholders.\n[/quote]\n\n\nSo the way I'd look at this is that the counterparties here are future\nminers vs present share holders, and via the FIFO queue, the risk that's\ncreated is how long it will take the queue to drain so that you receive\nyour funds.\n\nI'm not really following the logic for the unbonded shares though; it\nseems buggy to me. Suppose when the sharechain is new, I mine 50% of\nshares with 1% of global hashrate over a two week period, and leave all\nmy shares unbonded. In that case, the sharechain will get ~40 blocks\nin a two week period, my shares will be selected for 50% of them,\nand I'll get 20 blocks worth of reward, same as I would on any other\npool. But then if I stop mining, over the next two week period only ~20\nblocks will be mined, but my shares are still eligible to be selected,\nand that will happen about 33% of the time, so I'll get an additional\n~6 blocks worth of reward.\n\nSo I think at that point everyone else would abandon the sharepool as\nnon-competitive and it would die (since ongoing participants are losing\nfunds to me whether or not they bond their shares). I think similar\nlogic applies after the long term -- once there's any substantial amount\nof unbonded shares in the pool, creating new shares by mining into\nthe sharepool isn't going to be profitable compared to mining against\nsome other pool. So I think you need a rolling window of some sort for\nunbonded shares, rather than a perpetual claim.\n\nAssuming that's fixed somehow, recasting it as a \"miners insurance\"\ntype scheme, rather than a \"time value of BTC\" thing, would look\nsomething like:\n\n * if your shares are unbonded, you have a chance of getting a big reward\n * if your shares are bonded, you will definitely get a smaller reward,\n   but it will be delayed (both due to the time it takes to gather enough\n   unbonded shares to buy a bonded share, and the time for the bonded\n   FIFO queue to get to your share)\n\nTargeting the expected value of both those to be roughly $R \\cdot\n\\frac{D_S}{D_B}$ should be plausible and make the pool viable.\n\nIf you imagine there was some safe way for the sharechain to store rewards\nthen distribute it later (very non-trivial ofc), you could make the rule be that each share found\nfor a 2016 block retarget period (at constant target difficulty $D_B$)\naccrues a total block reward of $nR$, which is then distributed evenly,\nwith roughly $\\alpha n R$ BTC going to bonded shares, and the remaining\n$(1-\\alpha) n R$ BTC going to to $n$ lucky unbonded share holders.\n\nThat would involve bonded and unbonded share holders getting their payouts\nat exactly the same time, so there's no conflict between present and\nfuture value, just a risk tradeoff. You could probably have the bonded\npayouts suffer a penalty that increases the unbonded miners' payouts,\nperhaps encouraging more participation by large miners, helping to make\nyour pool more viable.\n\nIf you're targeting both forms of reward to have similar present value to\nmining in a regular pool, then you're already distributing 100% of the\nblock reward, and I don't think you have any degrees of freedom left to\nget interesting behaviour over the long term.\n\nIf you look at it as going from a 1-in-a-million chance at a million\ndollars vs a 1-in-1 certainty of $1, you could perhaps consider mid-range\nshares as well, where you might have a 1/10000 chance at $10,000 or a\n1/100 chance at $100, so to speak. ie, the fundamental limit might be that you can\nhave 1000 outputs per block reward, but you have 1,000,000 shares per\nblock on average, then each share has a 1/1M chance of a 3.125BTC reward,\nand you could combine 1000 of them to have a certainty of a 3.1mBTC\nreward, but perhaps you could provide 100 of them to have a 10% chance of\na 3.1mBTC reward, or 1000 of them to have a 1% chance of a 0.3BTC reward.\n\nSelling (bonded) shares for immediate BTC on an open market with an\nautomated market maker would likely be very useful, allowing miners\nto be immediately liquid, without requiring the pool to act as an insurer.\nI expect there's significant demand for a facility like that.",
  "actions_summary": [],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "I wouldn’t go that far; it’s just that the price pressure on a future BTC seems to narrow to 1:1 – if I want to have 1 BTC in ten years’ time, then if I already have 1 BTC (or more) that’s obviously easy, I just time lock 1 BTC somewhere; but if I have less than 1 BTC, exchanging that for some othe&hellip;",
  "truncated": true,
  "post_url": "/t/bmax-pricing-sats-now-vs-sats-later-via-a-mining-sharechain-no-l1-changes-no-custodians-no-oracles/2165/5",
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}