{
  "id": 6369,
  "name": "Bob McElrath",
  "username": "mcelrath",
  "avatar_template": "/user_avatar/delvingbitcoin.org/mcelrath/{size}/521_2.png",
  "created_at": "2025-12-03T12:49:27.107Z",
  "cooked": "<p>Indeed this has been discussed for a long time. Sometimes it’s called “headers first mining” or “SPV mining” and it’s a <a href=\"https://bitcoinmagazine.com/business/why-do-some-bitcoin-mining-pools-mine-empty-blocks-1468337739\" rel=\"noopener nofollow ugc\">cause of empty blocks being mined</a>. (When you do this you can’t have any txs in your block because if anything in your block conflicts with the block you haven’t validated yet, your block will be invalid). You are however taking a risk on the incoming block being valid and may generate orphans if it is invalid.</p>\n<p>Braidpool will solve this in a unique way: by using our committed mempool, block templates are deterministic and already known to all Braidpool nodes. Often we will have pre-computed the template for the incoming block and validation is as fast as comparing the Merkle root. When we can’t do that it’s because we’re missing parent shares (beads) of the incoming block. But that validation is still much faster because we only need to validate ~5 txs, not the entire block. Our share relay is also a lot faster than Bitcoin because shares are small and we use UDP/QUIC to avoid a round trip. Every Braidpool node can generate the corresponding block and feed it to Bitcoin once it sees the share.</p>\n<p>Another optimization we may implement is to precompute the template for a <em>second</em> block, so if the block we expect comes in as a Bitcoin block, we can instantly switch to the second template, full of transactions, maximizing miner profit. This will matter more in a high fee rate environment, and of course it only works for blocks mined by Braidpool. For blocks mined by others we’re in the same situation as you describe. But, it’s safe for 100% of miners to be on Braidpool. The 51% attack still exists but it’s transferred to Braidpool itself.</p>",
  "post_number": 2,
  "post_type": 1,
  "posts_count": 7,
  "updated_at": "2025-12-03T12:49:27.107Z",
  "reply_count": 1,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 5,
  "reads": 34,
  "readers_count": 33,
  "score": 51.8,
  "yours": false,
  "topic_id": 2139,
  "topic_slug": "optimistic-mining-tip-slow-block-propagation",
  "topic_title": "Optimistic mining tip (slow block propagation)",
  "topic_html_title": "Optimistic mining tip (slow block propagation)",
  "category_id": 8,
  "display_username": "Bob McElrath",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Indeed this has been discussed for a long time. Sometimes it's called “headers first mining” or “SPV mining” and it's a [cause of empty blocks being mined](https://bitcoinmagazine.com/business/why-do-some-bitcoin-mining-pools-mine-empty-blocks-1468337739). (When you do this you can't have any txs in your block because if anything in your block conflicts with the block you haven't validated yet, your block will be invalid). You are however taking a risk on the incoming block being valid and may generate orphans if it is invalid.\n\nBraidpool will solve this in a unique way: by using our committed mempool, block templates are deterministic and already known to all Braidpool nodes. Often we will have pre-computed the template for the incoming block and validation is as fast as comparing the Merkle root. When we can't do that it's because we're missing parent shares (beads) of the incoming block. But that validation is still much faster because we only need to validate \\~5 txs, not the entire block. Our share relay is also a lot faster than Bitcoin because shares are small and we use UDP/QUIC to avoid a round trip. Every Braidpool node can generate the corresponding block and feed it to Bitcoin once it sees the share.\n\nAnother optimization we may implement is to precompute the template for a *second* block, so if the block we expect comes in as a Bitcoin block, we can instantly switch to the second template, full of transactions, maximizing miner profit. This will matter more in a high fee rate environment, and of course it only works for blocks mined by Braidpool. For blocks mined by others we're in the same situation as you describe. But, it's safe for 100% of miners to be on Braidpool. The 51% attack still exists but it's transferred to Braidpool itself.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 406,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Indeed this has been discussed for a long time. Sometimes it’s called “headers first mining” or “SPV mining” and it’s a <a href=\"https://bitcoinmagazine.com/business/why-do-some-bitcoin-mining-pools-mine-empty-blocks-1468337739\" rel=\"noopener nofollow ugc\">cause of empty blocks being mined</a>. (When you do this you can’t have any txs in your block because if anything in your block conflicts with the block you haven’t validated yet, your&hellip;",
  "truncated": true,
  "post_url": "/t/optimistic-mining-tip-slow-block-propagation/2139/2",
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null
}