{
  "id": 6497,
  "name": "Rene Pickhardt",
  "username": "renepickhardt",
  "avatar_template": "/user_avatar/delvingbitcoin.org/renepickhardt/{size}/7_2.png",
  "created_at": "2025-12-31T11:37:46.294Z",
  "cooked": "<p>Over the past months, I have discussed the ideas in this post in many bilateral conversations. To avoid repeating arguments inconsistently and to invite broader feedback, I am writing them down here. I apologize to readers already familiar with these concepts and welcome comments, objections, and open questions.</p>\n<p>Note: <strong>As I am not a native english speaker I used an LLM for copy editing; the technical content and arguments are my own. While I supervised the LLM I did not diverge from the typical formatting and linguistic style</strong></p>\n<h2><a name=\"p-6497-abstract-1\" class=\"anchor\" href=\"#p-6497-abstract-1\"></a>Abstract</h2>\n<p>The Lightning Network enables fast, non-custodial Bitcoin payments when sufficient liquidity exists along a payment flow (often just a single path). However, <strong>payment feasibility</strong> (the existence of such a flow) is a structural constraint that cannot be resolved by routing heuristics or off-chain rebalancing alone. When liquidity is insufficient, <strong>on-chain transactions are required to modify the channel graph</strong>, which fundamentally limits the Lightning Network’s ability to scale bitcoin payments.</p>\n<p>Multi-party channels are known to improve capital efficiency but are difficult to coordinate in practice. Ark proposes a mechanism for coordinating multi-party state updates in rounds with a relatively low coordination overhead for the members to agree on a new state. This post challenges the emerging narrative that Ark should primarily serve as a last-mile payment system interconnected via Lightning channels. Instead, it argues that Ark might be better understood as <strong>infrastructure for Lightning</strong>, specifically as a <strong>channel factory</strong> enabling efficient reconfiguration of liquidity. The focus is on trade-offs, feasibility constraints, and open research questions.</p>\n<p><strong>Important</strong>: This document explicitly does not advocate against Ark as Payments it just asks whether there may be a better usecase.</p>\n<h2><a name=\"p-6497-h-1-review-of-payment-feasibility-and-structural-limits-in-lightning-2\" class=\"anchor\" href=\"#p-6497-h-1-review-of-payment-feasibility-and-structural-limits-in-lightning-2\"></a>1. Review of Payment Feasibility and Structural Limits in Lightning</h2>\n<p>A Lightning payment is feasible if the <strong>minimum cut</strong> between sender and receiver in the liquidity graph exceeds the payment amount. In practice, feasibility is difficult to determine due to <a href=\"https://arxiv.org/abs/2103.08576\" rel=\"noopener nofollow ugc\">uncertainty about remote channel balances</a>. This uncertainty can be reduced using <a href=\"https://arxiv.org/abs/2107.05322\" rel=\"noopener nofollow ugc\">probabilistic routing and optimally reliable payment flows</a>.</p>\n<p>However, while improved routing, fee updates, and rebalancing can increase utilization, <a href=\"https://github.com/renepickhardt/Lightning-Network-Limitations/blob/f670738cd2af93a55c3c919c9a864015f6dd042a/Limits%20of%20two%20party%20channels/paper/a%20mathematical%20theory%20of%20payment%20channel%20networks.pdf\" rel=\"noopener nofollow ugc\">they do not change global feasibility unless the channel graph itself is modified</a>.</p>\n<p>In particular:</p>\n<ul>\n<li>Off-chain rebalancing redistributes liquidity within existing channels.</li>\n<li>It does <em>not</em> create new connectivity or directional capacity.</li>\n<li>When no feasible flow exists, an <strong>on-chain transaction</strong> (open, close, splice, etc.) is required.</li>\n</ul>\n<p>This distinction is central. Even if a node can move liquidity from one channel to another via circulations, such operations also affect remote channels and therefore do not selectively increase feasibility for a desired payment. Changing feasibility locally without altering the rest of the network requires on-chain intervention.</p>\n<p>Formal analysis in <a href=\"https://github.com/renepickhardt/Lightning-Network-Limitations/blob/f670738cd2af93a55c3c919c9a864015f6dd042a/Limits%20of%20two%20party%20channels/paper/a%20mathematical%20theory%20of%20payment%20channel%20networks.pdf\" rel=\"noopener nofollow ugc\">A Mathematical Theory of Payment Channel Networks</a> shows that the <strong>maximum supported payment rate</strong> depends critically on:</p>\n<ul>\n<li>fixed available on-chain bandwidth, and</li>\n<li>the expected rate of infeasible payments.</li>\n</ul>\n<p>The constraints on two-party channel networks are sufficiently severe that, under realistic assumptions, the expected rate of infeasible payments becomes too high for such an off-chain network to scale Bitcoin payments without substantial on-chain support. This limitation motivates exploring coordination mechanisms that can restructure the graph topology more efficiently utilizing less on chain footprint.</p>\n<h2><a name=\"p-6497-h-2-ark-rounds-and-virtual-utxos-3\" class=\"anchor\" href=\"#p-6497-h-2-ark-rounds-and-virtual-utxos-3\"></a>2. Ark: Rounds and Virtual UTXOs</h2>\n<p>Ark introduces <strong>rounds</strong> in which participants exchange <strong>virtual UTXOs (vTXOs)</strong> coordinated by an Ark Service Provider (ASP). These vTXOs represent off-chain value commitments that can be reassigned over time.</p>\n<p>It seems that Ark style systems reduce the coordination and interactivity requirements of the coin pool by introducing the ark service provider as a coordinator who overprovisions liquidity for a fixed time window so that not everyone has to agree on every new state immediately but only eventually. This is a very nice property.</p>\n<p>However, when Ark is used <em>directly</em> as a payment system, three properties become relevant:</p>\n<ol>\n<li><strong>Liquidity lock-up due to expiry</strong>\nvTXOs release liquidity only after their timeout, binding the ASP’s capital for the duration of the expiry window.</li>\n<li><strong>Change amplification</strong>\nPayments typically destroy one input and create multiple outputs (recipient and change), increasing the amount of liquidity the ASP must front.</li>\n<li><strong>Trust during inter-round settlement</strong>\nPayments settle conclusively only at round boundaries. Between rounds, spent vTXOs could theoretically be double-spent, raising questions about custody and regulatory interpretation of the ASP’s role.</li>\n</ol>\n<p>Under frequent payment patterns within the expiry window, the ASP’s required working capital can <a href=\"https://bitcoin.stackexchange.com/questions/128113/how-well-does-ark-scale-bitcoin-payments\" rel=\"noopener nofollow ugc\">grow substantially relative to net payment volume</a>. This complicates claims that Ark alone provides a low-overhead, scalable payment layer.</p>\n<h2><a name=\"p-6497-h-3-interpreting-ark-as-a-channel-factory-and-ln-infrastructure-layer-4\" class=\"anchor\" href=\"#p-6497-h-3-interpreting-ark-as-a-channel-factory-and-ln-infrastructure-layer-4\"></a>3. Interpreting Ark as a Channel Factory and LN Infrastructure Layer</h2>\n<p>An alternative interpretation is to treat Ark not as a payment system competing with Lightning, but as <strong>infrastructure beneath it</strong>. More specifically it can be understood as a <strong>channel factory or multi-party channel mechanism</strong>.</p>\n<p>In this framing:</p>\n<ul>\n<li>vTXOs correspond to Lightning channels,</li>\n<li>an Ark round can open, close, or reshape many channels atomically,</li>\n<li>a <strong>single on-chain transaction</strong> can <strong>reconfigure a large fraction</strong> of the channel graph.</li>\n</ul>\n<p>This differs fundamentally from routing or rebalancing. Rather than optimizing flows <em>on</em> a fixed graph, Ark enables structural changes to the topology of the graph itself, which potentially makes previously infeasible payments feasible.</p>\n<p>Multiple channel operations - funding, closing, or splicing - may be compressed into a single Ark round transaction. Since Lightning already requires on-chain confirmations for such changes, Ark does not worsen latency from this perspective as ark rounds could eventually take place in every block.</p>\n<h2><a name=\"p-6497-h-4-liquidity-reconfiguration-and-operational-considerations-5\" class=\"anchor\" href=\"#p-6497-h-4-liquidity-reconfiguration-and-operational-considerations-5\"></a>4. Liquidity Reconfiguration and Operational Considerations</h2>\n<p>Lightning node operators already need to:</p>\n<ul>\n<li>monitor channels,</li>\n<li>respond to on-chain events,</li>\n<li>occasionally rebalance or close channels.</li>\n</ul>\n<p>Rolling vTXOs in Ark rounds (e.g., a few times per month) is operationally comparable. Channels with higher utilization may require more frequent rollovers, which can be coordinated while the channel is actively used.</p>\n<p>Failure assumptions change in detail but not in kind: operators require periodic engagement rather than continuous supervision.</p>\n<h2><a name=\"p-6497-h-5-liquidity-pooling-and-dynamic-allocation-6\" class=\"anchor\" href=\"#p-6497-h-5-liquidity-pooling-and-dynamic-allocation-6\"></a>5. Liquidity Pooling and Dynamic Allocation</h2>\n<p>In a channel factory or multi-party channel:</p>\n<ul>\n<li>liquidity is pooled across participants,</li>\n<li>allocation can be adjusted round by round,</li>\n<li>demand can be forecast or reacted to dynamically.</li>\n</ul>\n<p>This contrasts with the current LSP model, where liquidity is provisioned per customer and often remains idle or asymmetrically distributed.</p>\n<p>Pooling may improve capital efficiency - particularly but not only for mobile clients. in the case of Ark it does however introduce trade-offs involving expiry selection, coordination overhead, and ASP liquidity management. Determining optimal timeout parameters for the LSP to reclaim vTXOs remains an open problem.</p>\n<h2><a name=\"p-6497-h-6-integration-with-lightning-and-custody-considerations-7\" class=\"anchor\" href=\"#p-6497-h-6-integration-with-lightning-and-custody-considerations-7\"></a>6. Integration with Lightning and Custody Considerations</h2>\n<p>When Ark is used as infrastructure:</p>\n<ul>\n<li>payments occur over Lightning,</li>\n<li>settlement remains atomic and end-to-end,</li>\n<li>the ASP coordinates liquidity but does not intermediate payments.</li>\n</ul>\n<p>This preserves Lightning’s non-custodial real-time settlement properties. In contrast, using Ark directly for payments introduces trust assumptions between rounds.</p>\n<p>The separation of concerns - Lightning for payments, Ark for liquidity coordination - maintains Lightning’s core guarantees like instant settlement of payments with strong privacy while addressing structural scalability limits.</p>\n<h2><a name=\"p-6497-h-7-routing-gossip-and-open-questions-8\" class=\"anchor\" href=\"#p-6497-h-7-routing-gossip-and-open-questions-8\"></a>7. Routing, Gossip, and Open Questions</h2>\n<p>Channels funded via vTXOs lack on-chain funding transactions and therefore cannot currently be announced via Lightning gossip. This raises several open questions:</p>\n<ul>\n<li>How should such channels be represented to routers?</li>\n<li>Should routing operate at the factory level?</li>\n<li>Are new abstractions needed for liquidity advertisement?</li>\n<li>How do these mechanisms affect privacy and reliability?</li>\n<li>Should vTXO-backed channels exist only between ASP and users, or also directly between users?</li>\n</ul>\n<h2><a name=\"p-6497-h-8-extended-open-questions-9\" class=\"anchor\" href=\"#p-6497-h-8-extended-open-questions-9\"></a>8. Extended Open Questions</h2>\n<p>Viewing Ark as infrastructure for Lightning rather than as a standalone payment system clarifies some trade-offs, but also raises additional open questions that merit further study.</p>\n<ul>\n<li>\n<p><strong>Incentives and ASP behavior:</strong>\nHow should incentives be aligned such that an ASP’s liquidity management decisions improve Lightning-wide feasibility rather than only local profitability? How does competition between multiple ASPs affect liquidity allocation and pricing?</p>\n</li>\n<li>\n<p><strong>Centralization pressure:</strong>\nDoes pooling liquidity in multi-party constructions introduce economies of scale that favor a small number of large factories? How does this compare to existing hub and LSP dynamics in Lightning?</p>\n</li>\n<li>\n<p><strong>Failure modes and exits:</strong>\nFollowing <a href=\"https://petertodd.org/2024/covenant-dependent-layer-2-review\" rel=\"noopener nofollow ugc\">Peter Todd’s article on layer 2 review</a>: What are the on-chain and operational consequences of ASP failure or mass exits? How gracefully does the system degrade under stress, and what are the worst-case on-chain costs?</p>\n</li>\n<li>\n<p><strong>Latency versus feasibility:</strong>\nArk enables structural reconfiguration, but only at round boundaries. How should round frequency and expiry windows be chosen to balance payment feasibility, capital efficiency, and user experience?</p>\n</li>\n<li>\n<p><strong>Privacy considerations:</strong>\nDoes round-based coordination leak information about demand patterns or user activity over time? How do anonymity sets compare to those of bilateral Lightning channels?</p>\n</li>\n<li>\n<p><strong>Interoperability and routing abstractions:</strong>\nHow should vTXO-funded channels be represented to routers given the lack of on-chain funding transactions? Are new gossip or factory-level abstractions required?</p>\n</li>\n</ul>\n<p>These questions are not specific to Ark, but arise naturally whenever multi-party liquidity coordination is introduced. Addressing them is essential to understanding whether such mechanisms can sustainably complement the Lightning Network</p>\n<h2><a name=\"p-6497-references-10\" class=\"anchor\" href=\"#p-6497-references-10\"></a>References</h2>\n<ol>\n<li>Pickhardt et al., <em>On the Uncertainty of Lightning Network Channel Balances</em>\n<a href=\"https://arxiv.org/abs/2103.08576\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">[2103.08576] Security and Privacy of Lightning Network Payments with Uncertain Channel Balances</a></li>\n<li>Pickhardt &amp; Richter, <em>Optimally Reliable Payment Flows on the Lightning Network</em>\n<a href=\"https://arxiv.org/abs/2107.05322\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">[2107.05322] Optimally Reliable &amp; Cheap Payment Flows on the Lightning Network</a></li>\n<li>Pickhardt  <em>A Mathematical Theory of Payment Channel Networks</em> (draft)\n<a href=\"https://github.com/renepickhardt/Lightning-Network-Limitations/blob/f670738cd2af93a55c3c919c9a864015f6dd042a/Limits%20of%20two%20party%20channels/paper/a%20mathematical%20theory%20of%20payment%20channel%20networks.pdf\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Lightning-Network-Limitations/Limits of two party channels/paper/a mathematical theory of payment channel networks.pdf at f670738cd2af93a55c3c919c9a864015f6dd042a · renepickhardt/Lightning-Network-Limitations · GitHub</a></li>\n<li>Pickhardt <em>How well does Ark scale Bitcoin payments?</em>\n<a href=\"https://bitcoin.stackexchange.com/questions/128113/how-well-does-ark-scale-bitcoin-payments\" rel=\"noopener nofollow ugc\">https://bitcoin.stackexchange.com/questions/128113/how-well-does-ark-scale-bitcoin-payments</a>\n5 Todd, <em>Covenant dependent layer 2 review</em>  <a href=\"https://petertodd.org/2024/covenant-dependent-layer-2-review\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Soft-Fork/Covenant Dependent Layer 2 Review</a>.</li>\n<li>BTC++ Talk on Lightning scaling and limitations\n<a href=\"https://www.youtube.com/watch?v=c3AuaHJordg\" rel=\"noopener nofollow ugc\">https://www.youtube.com/watch?v=c3AuaHJordg</a></li>\n<li>Bitcoin Amsterdam LN vs Ark panel (2025)\n<a href=\"https://www.youtube.com/watch?v=AU52kQz2zIM\" rel=\"noopener nofollow ugc\">https://www.youtube.com/watch?v=AU52kQz2zIM</a></li>\n</ol>\n<hr>\n<h2><a name=\"p-6497-acknowledgements-11\" class=\"anchor\" href=\"#p-6497-acknowledgements-11\"></a>Acknowledgements</h2>\n<p>Discussions with peers and feedback from presentations at BTC++ and Bitcoin Amsterdam helped clarify the arguments and trade-offs presented here. This research was sponsored through opensats and patreons.</p>",
  "post_number": 1,
  "post_type": 1,
  "posts_count": 8,
  "updated_at": "2025-12-31T11:42:49.388Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 209,
  "reads": 46,
  "readers_count": 45,
  "score": 1174.2,
  "yours": false,
  "topic_id": 2179,
  "topic_slug": "ark-as-a-channel-factory-compressed-liquidity-management-for-improved-payment-feasibility",
  "topic_title": "Ark as a Channel Factory: Compressed Liquidity Management for Improved Payment Feasibility",
  "topic_html_title": "Ark as a Channel Factory: Compressed Liquidity Management for Improved Payment Feasibility",
  "category_id": 7,
  "display_username": "Rene Pickhardt",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "badges_granted": [],
  "version": 2,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Over the past months, I have discussed the ideas in this post in many bilateral conversations. To avoid repeating arguments inconsistently and to invite broader feedback, I am writing them down here. I apologize to readers already familiar with these concepts and welcome comments, objections, and open questions. \n\nNote: **As I am not a native english speaker I used an LLM for copy editing; the technical content and arguments are my own. While I supervised the LLM I did not diverge from the typical formatting and linguistic style**\n\n\n## Abstract\n\nThe Lightning Network enables fast, non-custodial Bitcoin payments when sufficient liquidity exists along a payment flow (often just a single path). However, **payment feasibility** (the existence of such a flow) is a structural constraint that cannot be resolved by routing heuristics or off-chain rebalancing alone. When liquidity is insufficient, **on-chain transactions are required to modify the channel graph**, which fundamentally limits the Lightning Network’s ability to scale bitcoin payments.\n\nMulti-party channels are known to improve capital efficiency but are difficult to coordinate in practice. Ark proposes a mechanism for coordinating multi-party state updates in rounds with a relatively low coordination overhead for the members to agree on a new state. This post challenges the emerging narrative that Ark should primarily serve as a last-mile payment system interconnected via Lightning channels. Instead, it argues that Ark might be better understood as **infrastructure for Lightning**, specifically as a **channel factory** enabling efficient reconfiguration of liquidity. The focus is on trade-offs, feasibility constraints, and open research questions.\n\n**Important**: This document explicitly does not advocate against Ark as Payments it just asks whether there may be a better usecase. \n\n## 1. Review of Payment Feasibility and Structural Limits in Lightning\n\nA Lightning payment is feasible if the **minimum cut** between sender and receiver in the liquidity graph exceeds the payment amount. In practice, feasibility is difficult to determine due to [uncertainty about remote channel balances](https://arxiv.org/abs/2103.08576\n). This uncertainty can be reduced using [probabilistic routing and optimally reliable payment flows](https://arxiv.org/abs/2107.05322).\n\nHowever, while improved routing, fee updates, and rebalancing can increase utilization, [they do not change global feasibility unless the channel graph itself is modified](https://github.com/renepickhardt/Lightning-Network-Limitations/blob/f670738cd2af93a55c3c919c9a864015f6dd042a/Limits%20of%20two%20party%20channels/paper/a%20mathematical%20theory%20of%20payment%20channel%20networks.pdf\n).\n\nIn particular:\n\n* Off-chain rebalancing redistributes liquidity within existing channels.\n* It does *not* create new connectivity or directional capacity.\n* When no feasible flow exists, an **on-chain transaction** (open, close, splice, etc.) is required.\n\nThis distinction is central. Even if a node can move liquidity from one channel to another via circulations, such operations also affect remote channels and therefore do not selectively increase feasibility for a desired payment. Changing feasibility locally without altering the rest of the network requires on-chain intervention.\n\nFormal analysis in [A Mathematical Theory of Payment Channel Networks](https://github.com/renepickhardt/Lightning-Network-Limitations/blob/f670738cd2af93a55c3c919c9a864015f6dd042a/Limits%20of%20two%20party%20channels/paper/a%20mathematical%20theory%20of%20payment%20channel%20networks.pdf\n) shows that the **maximum supported payment rate** depends critically on:\n\n* fixed available on-chain bandwidth, and\n* the expected rate of infeasible payments.\n\nThe constraints on two-party channel networks are sufficiently severe that, under realistic assumptions, the expected rate of infeasible payments becomes too high for such an off-chain network to scale Bitcoin payments without substantial on-chain support. This limitation motivates exploring coordination mechanisms that can restructure the graph topology more efficiently utilizing less on chain footprint.\n\n\n## 2. Ark: Rounds and Virtual UTXOs\n\nArk introduces **rounds** in which participants exchange **virtual UTXOs (vTXOs)** coordinated by an Ark Service Provider (ASP). These vTXOs represent off-chain value commitments that can be reassigned over time. \n\nIt seems that Ark style systems reduce the coordination and interactivity requirements of the coin pool by introducing the ark service provider as a coordinator who overprovisions liquidity for a fixed time window so that not everyone has to agree on every new state immediately but only eventually. This is a very nice property.\n\nHowever, when Ark is used *directly* as a payment system, three properties become relevant:\n\n1. **Liquidity lock-up due to expiry**\nvTXOs release liquidity only after their timeout, binding the ASP’s capital for the duration of the expiry window.\n2. **Change amplification**\nPayments typically destroy one input and create multiple outputs (recipient and change), increasing the amount of liquidity the ASP must front.\n3. **Trust during inter-round settlement**\nPayments settle conclusively only at round boundaries. Between rounds, spent vTXOs could theoretically be double-spent, raising questions about custody and regulatory interpretation of the ASP’s role.\n\nUnder frequent payment patterns within the expiry window, the ASP’s required working capital can [grow substantially relative to net payment volume](https://bitcoin.stackexchange.com/questions/128113/how-well-does-ark-scale-bitcoin-payments). This complicates claims that Ark alone provides a low-overhead, scalable payment layer.\n\n\n## 3. Interpreting Ark as a Channel Factory and LN Infrastructure Layer\n\nAn alternative interpretation is to treat Ark not as a payment system competing with Lightning, but as **infrastructure beneath it**. More specifically it can be understood as a **channel factory or multi-party channel mechanism**.\n\nIn this framing:\n\n* vTXOs correspond to Lightning channels,\n* an Ark round can open, close, or reshape many channels atomically,\n* a **single on-chain transaction** can **reconfigure a large fraction** of the channel graph.\n\nThis differs fundamentally from routing or rebalancing. Rather than optimizing flows *on* a fixed graph, Ark enables structural changes to the topology of the graph itself, which potentially makes previously infeasible payments feasible.\n\nMultiple channel operations - funding, closing, or splicing - may be compressed into a single Ark round transaction. Since Lightning already requires on-chain confirmations for such changes, Ark does not worsen latency from this perspective as ark rounds could eventually take place in every block.\n\n## 4. Liquidity Reconfiguration and Operational Considerations\n\nLightning node operators already need to:\n\n* monitor channels,\n* respond to on-chain events,\n* occasionally rebalance or close channels.\n\nRolling vTXOs in Ark rounds (e.g., a few times per month) is operationally comparable. Channels with higher utilization may require more frequent rollovers, which can be coordinated while the channel is actively used.\n\nFailure assumptions change in detail but not in kind: operators require periodic engagement rather than continuous supervision.\n\n\n## 5. Liquidity Pooling and Dynamic Allocation\n\nIn a channel factory or multi-party channel:\n\n* liquidity is pooled across participants,\n* allocation can be adjusted round by round,\n* demand can be forecast or reacted to dynamically.\n\nThis contrasts with the current LSP model, where liquidity is provisioned per customer and often remains idle or asymmetrically distributed.\n\nPooling may improve capital efficiency - particularly but not only for mobile clients. in the case of Ark it does however introduce trade-offs involving expiry selection, coordination overhead, and ASP liquidity management. Determining optimal timeout parameters for the LSP to reclaim vTXOs remains an open problem.\n\n## 6. Integration with Lightning and Custody Considerations\n\nWhen Ark is used as infrastructure:\n\n* payments occur over Lightning,\n* settlement remains atomic and end-to-end,\n* the ASP coordinates liquidity but does not intermediate payments.\n\nThis preserves Lightning’s non-custodial real-time settlement properties. In contrast, using Ark directly for payments introduces trust assumptions between rounds.\n\nThe separation of concerns - Lightning for payments, Ark for liquidity coordination - maintains Lightning’s core guarantees like instant settlement of payments with strong privacy while addressing structural scalability limits.\n\n\n## 7. Routing, Gossip, and Open Questions\n\nChannels funded via vTXOs lack on-chain funding transactions and therefore cannot currently be announced via Lightning gossip. This raises several open questions:\n\n* How should such channels be represented to routers?\n* Should routing operate at the factory level?\n* Are new abstractions needed for liquidity advertisement?\n* How do these mechanisms affect privacy and reliability?\n* Should vTXO-backed channels exist only between ASP and users, or also directly between users?\n\n## 8. Extended Open Questions\n\nViewing Ark as infrastructure for Lightning rather than as a standalone payment system clarifies some trade-offs, but also raises additional open questions that merit further study.\n\n* **Incentives and ASP behavior:**\nHow should incentives be aligned such that an ASP’s liquidity management decisions improve Lightning-wide feasibility rather than only local profitability? How does competition between multiple ASPs affect liquidity allocation and pricing?\n\n* **Centralization pressure:**\nDoes pooling liquidity in multi-party constructions introduce economies of scale that favor a small number of large factories? How does this compare to existing hub and LSP dynamics in Lightning?\n\n* **Failure modes and exits:**\nFollowing [Peter Todd's article on layer 2 review](https://petertodd.org/2024/covenant-dependent-layer-2-review): What are the on-chain and operational consequences of ASP failure or mass exits? How gracefully does the system degrade under stress, and what are the worst-case on-chain costs?\n\n* **Latency versus feasibility:**\nArk enables structural reconfiguration, but only at round boundaries. How should round frequency and expiry windows be chosen to balance payment feasibility, capital efficiency, and user experience?\n\n* **Privacy considerations:**\nDoes round-based coordination leak information about demand patterns or user activity over time? How do anonymity sets compare to those of bilateral Lightning channels? \n\n* **Interoperability and routing abstractions:**\nHow should vTXO-funded channels be represented to routers given the lack of on-chain funding transactions? Are new gossip or factory-level abstractions required?\n\nThese questions are not specific to Ark, but arise naturally whenever multi-party liquidity coordination is introduced. Addressing them is essential to understanding whether such mechanisms can sustainably complement the Lightning Network\n\n## References\n\n1. Pickhardt et al., *On the Uncertainty of Lightning Network Channel Balances*\nhttps://arxiv.org/abs/2103.08576\n2. Pickhardt & Richter, *Optimally Reliable Payment Flows on the Lightning Network*\nhttps://arxiv.org/abs/2107.05322\n3. Pickhardt  *A Mathematical Theory of Payment Channel Networks* (draft)\nhttps://github.com/renepickhardt/Lightning-Network-Limitations/blob/f670738cd2af93a55c3c919c9a864015f6dd042a/Limits%20of%20two%20party%20channels/paper/a%20mathematical%20theory%20of%20payment%20channel%20networks.pdf\n4. Pickhardt *How well does Ark scale Bitcoin payments?*\n[https://bitcoin.stackexchange.com/questions/128113/how-well-does-ark-scale-bitcoin-payments](https://bitcoin.stackexchange.com/questions/128113/how-well-does-ark-scale-bitcoin-payments)\n5 Todd, *Covenant dependent layer 2 review*  https://petertodd.org/2024/covenant-dependent-layer-2-review. \n6. BTC++ Talk on Lightning scaling and limitations\nhttps://www.youtube.com/watch?v=c3AuaHJordg\n7. Bitcoin Amsterdam LN vs Ark panel (2025)\nhttps://www.youtube.com/watch?v=AU52kQz2zIM\n\n---\n\n## Acknowledgements\n\nDiscussions with peers and feedback from presentations at BTC++ and Bitcoin Amsterdam helped clarify the arguments and trade-offs presented here. This research was sponsored through opensats and patreons.",
  "actions_summary": [
    {
      "id": 2,
      "count": 8
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 8,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": "Github link was replaced with a permanent link",
  "can_view_edit_history": true,
  "wiki": false,
  "excerpt": "Over the past months, I have discussed the ideas in this post in many bilateral conversations. To avoid repeating arguments inconsistently and to invite broader feedback, I am writing them down here. I apologize to readers already familiar with these concepts and welcome comments, objections, and op&hellip;",
  "truncated": true,
  "post_url": "/t/ark-as-a-channel-factory-compressed-liquidity-management-for-improved-payment-feasibility/2179/1",
  "reactions": [
    {
      "id": "heart",
      "type": "emoji",
      "count": 5
    },
    {
      "id": "+1",
      "type": "emoji",
      "count": 3
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 8,
  "current_user_used_main_reaction": false,
  "can_accept_answer": false,
  "can_unaccept_answer": false,
  "accepted_answer": false,
  "topic_accepted_answer": null,
  "can_vote": false
}