{
  "id": 222,
  "name": "James O'Beirne",
  "username": "jamesob",
  "avatar_template": "/letter_avatar_proxy/v4/letter/j/958977/{size}.png",
  "created_at": "2023-09-30T11:34:20.911Z",
  "cooked": "<p>During recent discussions about <a href=\"https://delvingbitcoin.org/t/covenant-tools-softfork/98\" class=\"inline-onebox\">Covenant tools softfork</a>, a few people have raised the ideas that</p>\n<ol>\n<li>Vaults can be implemented today using transactions which are presigned with ephemeral keys, and</li>\n<li>The apparent absence of these vaults indicates a lack of demand for vaults as a custody approach.</li>\n</ol>\n<p>I will argue here that (i) large operations are using vaults (or painfully emulating them), and (ii) the limitations of vaults with existing script capability make them basically unusable for most people.</p>\n<h3><a name=\"quotes-1\" class=\"anchor\" href=\"#quotes-1\"></a>Quotes</h3>\n<blockquote>\n<p>With vaults in particular, if those were a strong justification we’d expect someone to be simulating them on mainnet with a semi-trusted third party oracle service.</p>\n<ul>\n<li><a href=\"https://twitter.com/peterktodd/status/1707761756704051532\">Peter Todd</a></li>\n</ul>\n</blockquote>\n<blockquote>\n<p>Vaults can be done today with pre-signed transactions, even if the trade-offs are different it’s a practical construction.</p>\n<ul>\n<li><a class=\"mention\" href=\"/u/ariard\">@ariard</a> (<a href=\"https://github.com/bitcoin/bitcoin/pull/28550#issuecomment-1741554330\" class=\"inline-onebox\">Covenant tools softfork by jamesob · Pull Request #28550 · bitcoin/bitcoin · GitHub</a>)</li>\n</ul>\n</blockquote>\n<blockquote>\n<p><strong>Vaults</strong> can be done today with presigned transactions. The presigned versions are a lot harder to implement correctly than with <code>OP_CTV</code> + <code>OP_VAULT</code>, they can’t receive payments without interaction with the payer, and the vault user needs to store more data. However, it seems to me that if there were high demand for the general ability to have hot spends announced onchain with a cancellation window, a significant number of people would be using presigned vaults—but I’m not aware of that happening.</p>\n<ul>\n<li><a class=\"mention\" href=\"/u/harding\">@harding</a> in <a href=\"https://delvingbitcoin.org/t/covenant-tools-softfork/98/11\" class=\"inline-onebox\">Covenant tools softfork - #11 by harding</a></li>\n</ul>\n</blockquote>\n<h2><a name=\"no-one-using-vaults-2\" class=\"anchor\" href=\"#no-one-using-vaults-2\"></a>No one using vaults?</h2>\n<p>This point is quick and easy to address: there are large custodial operations that are both emulating vaults with automated multisig signing <em>and</em> implementing vaults with presigned transactions, however this isn’t widely publicized. These are institutions that manage a lot of bitcoin. I have firsthand knowledge of one (presigned), and I’ll describe the shortcomings that motivated me to pursue CTV and then ultimately <code>OP_VAULT</code>.</p>\n<p>It’s worth noting that there are open efforts to implement (or emulate) vaults using the existing scripting capabilities we have today, namely <a href=\"https://wizardsardine.com/revault/\">Revault</a>, <a href=\"https://wizardsardine.com/liana/\">Liana</a>, and Bryan Bishop’s <a href=\"https://github.com/kanzure/python-vaults\">prototype code</a>.</p>\n<h2><a name=\"vaults-with-presigned-transactions-3\" class=\"anchor\" href=\"#vaults-with-presigned-transactions-3\"></a>Vaults with presigned transactions</h2>\n<p>As Bryan Bishop first noted a few years ago, and as I described at length in <a href=\"http://jameso.be/vaults.pdf\">my vaults paper</a>, one form of vaults <em>can</em> be implemented using ephemeral keys, however there are major usability issues with this approach.</p>\n<ul>\n<li><strong>Use of ephemeral keys</strong>: to emulate vaults today (without multisig/autosigning), users must generate temporary private keys that must be destroyed after use to lock funds into a pretermined spend path using “bearer asset” transactions. None but the most sophisticated and well-funded operations can generate ephemeral keys in a way that is convincingly secure, and even then there are questions. Proving non-existence of attack is impossible.</li>\n<li><strong>Address reuse =&gt; burnt coins</strong>: because transaction graphs are pregenerated, if coins are accidentally sent to an “already sealed” presigned txn vault, the coins are burnt. This means end users cannot be given vault addresses publicly, and even sophisticated users must be very careful.</li>\n<li><strong>Difficult UTXO management</strong>: vault creation is very onerous since it requires generating ephemeral keys securely, and this setup process must be performed every time the user deposits. This makes coin consolidation difficult.</li>\n<li><strong>Static/difficult fee management</strong>: because transactions are pregenerated, the fee management strategy must be decided up front and locked in. This means that inefficient CPFP must be used with a statically defined fee wallet. If that fee wallet is lost, the vault’s operation is hampered.</li>\n<li><strong>“Toxic” vault data must be persisted indefinitely</strong>: the nature of using presigned transaction means that vaulted funds become “bearer assets” within these transactions, and they must be persisted indefinitely by the user.</li>\n<li><strong>Inefficient chain use</strong>: since no batched withdrawals or recoveries are possible, each deposit must have its own on-chain lifecycle, resulting in much more chain use (and fee spend) than is strictly necessary.</li>\n</ul>\n<h2><a name=\"presigned-transaction-vaults-are-functionally-hopeless-4\" class=\"anchor\" href=\"#presigned-transaction-vaults-are-functionally-hopeless-4\"></a>Presigned transaction vaults are functionally hopeless</h2>\n<p>Needless to say, no one aside from the most sophisticated industrial operation is going to make use of this strategy. To claim that no one implementing a scheme like this is evidence that no one wants or would benefit from vaults is a fraught argument.</p>\n<h2><a name=\"what-about-just-using-ctv-5\" class=\"anchor\" href=\"#what-about-just-using-ctv-5\"></a>What about just using CTV?</h2>\n<p>Some time ago I <a href=\"https://github.com/jamesob/simple-ctv-vault\">implemented a prototype</a> of vaults assuming the availability of CTV. I was hoping to make usable vaults with just one new primitive. I discovered that this approach removes the need for ephemeral key generation and backup of critical data, but all of the problems associated with the nature of pregenerated transactions graphs persist.</p>\n<p>This exercise led me to write <a href=\"https://jameso.be/vaults.pdf\">the vaults paper</a>, which details the ways that these usability issues are solved by <code>OP_VAULT</code>.</p>\n<h3><a name=\"summary-6\" class=\"anchor\" href=\"#summary-6\"></a>Summary</h3>\n<p>In summary, presigned transactions are not really a suitable substrate for vaults unless you have a large, well-funded engineering team. I fear the clear infeasibility of this particular design has predisposed some contributors to assuming vault operation is more onerous than it needs to be. It should come as no surprise that this is not a widely deployed design, and shouldn’t be used as an indictment against other vault strategies.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2023-09-30T11:54:55.817Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 64,
  "reads": 4,
  "readers_count": 3,
  "score": 310.8,
  "yours": false,
  "topic_id": 113,
  "topic_slug": "the-unsuitability-of-presigned-transactions-for-vaults",
  "topic_title": "The unsuitability of presigned transactions for vaults",
  "topic_html_title": "The unsuitability of presigned transactions for vaults",
  "category_id": 7,
  "display_username": "James O'Beirne",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 4,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "During recent discussions about https://delvingbitcoin.org/t/covenant-tools-softfork/98, a few people have raised the ideas that\n1. Vaults can be implemented today using transactions which are presigned with ephemeral keys, and\n2. The apparent absence of these vaults indicates a lack of demand for vaults as a custody approach.\n\nI will argue here that (i) large operations are using vaults (or painfully emulating them), and (ii) the limitations of vaults with existing script capability make them basically unusable for most people.\n\n### Quotes\n\n> With vaults in particular, if those were a strong justification we'd expect someone to be simulating them on mainnet with a semi-trusted third party oracle service.\n> - [Peter Todd](https://twitter.com/peterktodd/status/1707761756704051532)\n\n> Vaults can be done today with pre-signed transactions, even if the trade-offs are different it’s a practical construction.\n> - @ariard (https://github.com/bitcoin/bitcoin/pull/28550#issuecomment-1741554330)\n\n> \n> **Vaults** can be done today with presigned transactions. The presigned versions are a lot harder to implement correctly than with `OP_CTV` + `OP_VAULT`, they can’t receive payments without interaction with the payer, and the vault user needs to store more data. However, it seems to me that if there were high demand for the general ability to have hot spends announced onchain with a cancellation window, a significant number of people would be using presigned vaults—but I’m not aware of that happening.\n> - @harding in https://delvingbitcoin.org/t/covenant-tools-softfork/98/11\n\n## No one using vaults? \n\nThis point is quick and easy to address: there are large custodial operations that are both emulating vaults with automated multisig signing _and_ implementing vaults with presigned transactions, however this isn't widely publicized. These are institutions that manage a lot of bitcoin. I have firsthand knowledge of one (presigned), and I'll describe the shortcomings that motivated me to pursue CTV and then ultimately `OP_VAULT`.\n\nIt's worth noting that there are open efforts to implement (or emulate) vaults using the existing scripting capabilities we have today, namely [Revault](https://wizardsardine.com/revault/), [Liana](https://wizardsardine.com/liana/), and Bryan Bishop's [prototype code](https://github.com/kanzure/python-vaults).\n\n## Vaults with presigned transactions\n\nAs Bryan Bishop first noted a few years ago, and as I described at length in [my vaults paper](http://jameso.be/vaults.pdf), one form of vaults _can_ be implemented using ephemeral keys, however there are major usability issues with this approach.\n\n- **Use of ephemeral keys**: to emulate vaults today (without multisig/autosigning), users must generate temporary private keys that must be destroyed after use to lock funds into a pretermined spend path using \"bearer asset\" transactions. None but the most sophisticated and well-funded operations can generate ephemeral keys in a way that is convincingly secure, and even then there are questions. Proving non-existence of attack is impossible.\n- **Address reuse => burnt coins**: because transaction graphs are pregenerated, if coins are accidentally sent to an \"already sealed\" presigned txn vault, the coins are burnt. This means end users cannot be given vault addresses publicly, and even sophisticated users must be very careful.\n- **Difficult UTXO management**: vault creation is very onerous since it requires generating ephemeral keys securely, and this setup process must be performed every time the user deposits. This makes coin consolidation difficult.\n- **Static/difficult fee management**: because transactions are pregenerated, the fee management strategy must be decided up front and locked in. This means that inefficient CPFP must be used with a statically defined fee wallet. If that fee wallet is lost, the vault's operation is hampered.\n- **\"Toxic\" vault data must be persisted indefinitely**: the nature of using presigned transaction means that vaulted funds become \"bearer assets\" within these transactions, and they must be persisted indefinitely by the user.\n- **Inefficient chain use**: since no batched withdrawals or recoveries are possible, each deposit must have its own on-chain lifecycle, resulting in much more chain use (and fee spend) than is strictly necessary.\n\n## Presigned transaction vaults are functionally hopeless\n\nNeedless to say, no one aside from the most sophisticated industrial operation is going to make use of this strategy. To claim that no one implementing a scheme like this is evidence that no one wants or would benefit from vaults is a fraught argument.\n\n## What about just using CTV?\n\nSome time ago I [implemented a prototype](https://github.com/jamesob/simple-ctv-vault) of vaults assuming the availability of CTV. I was hoping to make usable vaults with just one new primitive. I discovered that this approach removes the need for ephemeral key generation and backup of critical data, but all of the problems associated with the nature of pregenerated transactions graphs persist.\n\nThis exercise led me to write [the vaults paper](https://jameso.be/vaults.pdf), which details the ways that these usability issues are solved by `OP_VAULT`.\n\n### Summary\n\nIn summary, presigned transactions are not really a suitable substrate for vaults unless you have a large, well-funded engineering team. I fear the clear infeasibility of this particular design has predisposed some contributors to assuming vault operation is more onerous than it needs to be. It should come as no surprise that this is not a widely deployed design, and shouldn't be used as an indictment against other vault strategies.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 9,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false
}