{
  "id": 219,
  "name": "Ethan Tuttle",
  "username": "EthnTuttle",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ethntuttle/{size}/26_2.png",
  "created_at": "2023-09-29T22:50:14.709Z",
  "cooked": "<p>As I’ve spent time in the <a href=\"https://github.com/fedimint\" rel=\"noopener nofollow ugc\">fedimint</a> and technical Bitcoin space (not very long), there seems to be a lot of questions about fedimint, and some misconceptions. I hope to unpack some of the comments I’ve encountered and clarify anything I found to be erroneous. Admittedly, I have <a href=\"https://opensats.org/blog/bitcoin-and-nostr-grants-august-2023#fedimint-modules-and-resources\" rel=\"noopener nofollow ugc\">more understanding and bias toward Fedimint</a> so I might miss the mark on other Bitcoin-related technologies, especially mining (out of principle, I run an under-clocked S9 at 500w).</p>\n<h1><a name=\"intro-1\" class=\"anchor\" href=\"#intro-1\"></a>Intro</h1>\n<p>I began looking into fedipool as a concept after reading <a href=\"https://www.discreetlog.com/fedipool/\" rel=\"noopener nofollow ugc\">this blog post.</a> I read some more about <a href=\"https://github.com/stratum-mining\" rel=\"noopener nofollow ugc\">Stratum v2 (Sv2)</a> and came to the conclusion that Sv2, along with the decentralization of mining, might be the most important aspects of Bitcoin to work on. (Perhaps in another thread I can elaborate on this for debate.) This, coupled with some <a href=\"https://yakihonne.com/article/naddr1qqxnzd3exvenzvpj8q6rjd3jqgs9ajvxw0lwe25ntjq52qtfygf9ngh3xf35u7y35rzn0h9k8meulvgrqsqqqa283uvvyw\" rel=\"noopener nofollow ugc\">other reasons</a>, encouraged me to begin working toward a goal, implementing fedipool.</p>\n<p>In this post, I’ll first cover fedimint and hopefully clarify some misconceptions. Then I’ll cover a basic (probably naive) implementation that I think could enable fedipools ASAP. Finally, I’ll discuss a more involved implementation outline using a fedimint module. Hopefully this can serve as an introductory and exploratory post for those considering fedimint or those interested in fedipools.</p>\n<h2><a name=\"fedimint-2\" class=\"anchor\" href=\"#fedimint-2\"></a>fedimint</h2>\n<p>According to the <a href=\"https://fedimint.org/docs/intro\" rel=\"noopener nofollow ugc\">protocol website</a></p>\n<blockquote>\n<p>Fedimint is a modular open source protocol to custody and transact bitcoin in a community context, built on a strong foundation of privacy.</p>\n</blockquote>\n<p>I see the following as key features:</p>\n<p><strong>Privacy</strong> - <a href=\"https://en.wikipedia.org/wiki/Ecash\" rel=\"noopener nofollow ugc\">Chaumian ecash</a> (the data is the asset)</p>\n<p>Probably the most well known aspect of fedimint is the privacy trade off for the federated custody. Every ecash note is 1:1 with custodial bitcoin by the fedimint nodes. The most common critique of fedimint also stems from this 1:1 bitcoin:ecash since <a href=\"https://gist.github.com/callebtc/ed5228d1d8cbaade0104db5d1cf63939\" rel=\"noopener nofollow ugc\">ecash proof of liabilities</a> is not a solved problem.</p>\n<p><strong>Offline</strong> - It’s data (transfer it without the internet)</p>\n<p>This can make it ideal for places with poor connectivity (conferences/large gatherings or the developing world). This presents a trust race condition though, if the sender were malicious, they could race to get online faster than the receiver, and redeem the “sent” ecash thus causing any attempts by the receiver to redeem the ecash notes to fail.</p>\n<p><strong>Modular</strong> - Default modules are wallet, mint, and LN</p>\n<p>Different modules can be designed using a core primitive called <code>Transaction</code> that has a set of inputs, a set of outputs, and a signature. These are then signed into consensus by the nodes of the fedimint. However, a module does not need to use a <code>Transaction</code>, it can just store arbitrary data as a <code>ConsensusItem</code> in the fedimint. A simple example of this is a password manager. A more complex example would be stability pools (stable fiat price for users doing finance magic I don’t understand yet). I believe fedimint modules can become an interoperability point for lots of other tech and Bitcoin.</p>\n<p><strong>You don’t have to do the LN thing</strong> - Best feature, imho</p>\n<p>A fedimint node runner, does not have to also run a Bitcoin node or a LN node. They can just run <code>fedimintd</code> and connect to some other Bitcoin node of their choice with all the standard trade offs. A LN node can join a fedimint as a special client called a <code>gateway</code>. They can then offer their liquidity to the fedimint users. Ecash can then be swapped for LN based sats, and vice versa, using the module system. This means a super awesome LN node operator can do what they do best and the fedimint node runner doesn’t have to manage the challenges of a LN node. Currently CLN and LND are supported and both require the running of <code>gatewayd</code> to connect/interact with the fedimint.</p>\n<p>There are probably some more features, but these are the ones top of mind to myself.</p>\n<h2><a name=\"naive-approach-3\" class=\"anchor\" href=\"#naive-approach-3\"></a>Naive Approach</h2>\n<p>A mining pool needs a coinbase address to put into a block. The pool just joins a fedimint and gets a deposit address for each block they mine. After the block confirms beyond the fedimint’s desired block count, the pool can then redeem ecash from the fedimint. Using the same accounting for shares and payout, the pool sends ecash to the miners. The miners can then go to the fedimint at their leisure and swap for on-chain or LN sats. The pool operator is not managing a fedimint node, nor a LN node. The trust remains relatively the same between the miners and pool. You’re trusting the pool to not rug you and/or double spend you. However, this would require the miners to form another relationship with a new entity: the fedimint and its node runners.</p>\n<h2><a name=\"poolimint-module-all-modules-should-be-imint-4\" class=\"anchor\" href=\"#poolimint-module-all-modules-should-be-imint-4\"></a><code>poolimint</code> module (all modules should be <code>-imint</code>)</h2>\n<p>There are some ideas discussed in <a href=\"https://github.com/fedimint/fedimint/discussions/1504\" rel=\"noopener nofollow ugc\">this GitHub Discussion</a> but I hope to explore some more thoughts and pose some questions I have.</p>\n<p>First, some observation I have made/learned (please correct if wrong):</p>\n<ul>\n<li>latency is a big deal in mining</li>\n<li>Sv2 enables anyone to generate the block template</li>\n<li>LN doesn’t work for pools because liquidity challenges</li>\n<li>small miners want faster/smaller payouts (me!)</li>\n</ul>\n<p>Since latency for block generation is a critical aspect of pool technology, I think it best that fedipools follow the Sv2 model and delegate that to where it makes sense. Perhaps that is as part of fedimint consensus, but perhaps not. I lean toward the latter so do not consider this approach.</p>\n<p>Pool shares do not seem like something that would be latency sensitive. Validating mining shares using fedimint consensus now decentralizes the validation of these shares to multiple entities. All fedimint nodes would have to agree that a share is valid in order for it to be considered in the pay out accounting. Only shares with the correct coinbase address would be considered valid. There are other criteria to evaluate shares on but I am ignorant of them so will avoid incorrect assumptions.</p>\n<p>Which piece(s) of a mining share is(are) critical to validate? What else might a pool care to have validated by a quorum?</p>\n<p>Once a block is found and confirmed beyond the required block count, ecash can be made ready for immediate redemption in any amount. This increases speed, privacy, and optionality of the miners being paid out. This does not prohibit on-chain payments for those miners so inclined. A LN gateway can also provide liquidity to those that desire payment via the lightning network.</p>\n<p>Are there other solutions offering this optionality to miners?</p>\n<p>A pool can decentralize custodial risk of the funds held on behalf of the miners, as well as reduce the amount of on-chain activity that may be needed. This means cost savings for an industry with razor thin margins and cut-throat dynamics. Additionally, a pool operator will only hold one key of a threshold needed to move funds so it introduces some interesting questions around who technically has custody of the miners’ funds awaiting withdrawal from the pool. All of this while still maintaining a similar trust trade-off that miners and pools already have.</p>\n<p>Are these trade offs appealing to pool operators and/or miners?</p>\n<p>There must be some way for a pool to differentiate miners from each other, to my understanding this is done with a <code>user:password</code> combination. Since a fedipool would also have to understand this differentiation, we need a privacy preserving mechanism of claiming ecash from shares of a certain “account”. This makes me consider <a href=\"https://nostr.com/\" rel=\"noopener nofollow ugc\">nostr</a> as a solution, since anyone can generate a nsec/npub key pair or any other cryptographic key pair, and then used derived secrets as their mining pool “account”. The poolimint modules could then only redeem ecash for someone proving ownership of the correct keys.</p>\n<p>Are there better ways to safe guard privacy of miners?</p>\n<hr>\n<p>I look forward to your comments and questions.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2023-09-29T22:50:14.709Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 7,
  "reads": 7,
  "readers_count": 6,
  "score": 46.2,
  "yours": false,
  "topic_id": 110,
  "topic_slug": "fedimint-overview-and-fedipool-theorizing",
  "topic_title": "Fedimint Overview and Fedipool Theorizing",
  "topic_html_title": "Fedimint Overview and Fedipool Theorizing",
  "category_id": 8,
  "display_username": "Ethan Tuttle",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "As I've spent time in the [fedimint](https://github.com/fedimint) and technical Bitcoin space (not very long), there seems to be a lot of questions about fedimint, and some misconceptions. I hope to unpack some of the comments I've encountered and clarify anything I found to be erroneous. Admittedly, I have [more understanding and bias toward Fedimint](https://opensats.org/blog/bitcoin-and-nostr-grants-august-2023#fedimint-modules-and-resources) so I might miss the mark on other Bitcoin-related technologies, especially mining (out of principle, I run an under-clocked S9 at 500w). \n\n# Intro\n\nI began looking into fedipool as a concept after reading [this blog post.](https://www.discreetlog.com/fedipool/) I read some more about [Stratum v2 (Sv2)](https://github.com/stratum-mining) and came to the conclusion that Sv2, along with the decentralization of mining, might be the most important aspects of Bitcoin to work on. (Perhaps in another thread I can elaborate on this for debate.) This, coupled with some [other reasons](https://yakihonne.com/article/naddr1qqxnzd3exvenzvpj8q6rjd3jqgs9ajvxw0lwe25ntjq52qtfygf9ngh3xf35u7y35rzn0h9k8meulvgrqsqqqa283uvvyw), encouraged me to begin working toward a goal, implementing fedipool. \n\nIn this post, I'll first cover fedimint and hopefully clarify some misconceptions. Then I'll cover a basic (probably naive) implementation that I think could enable fedipools ASAP. Finally, I'll discuss a more involved implementation outline using a fedimint module. Hopefully this can serve as an introductory and exploratory post for those considering fedimint or those interested in fedipools.\n\n## fedimint\n\nAccording to the [protocol website](https://fedimint.org/docs/intro)\n\n> Fedimint is a modular open source protocol to custody and transact bitcoin in a community context, built on a strong foundation of privacy.\n\nI see the following as key features:\n\n**Privacy** - [Chaumian ecash](https://en.wikipedia.org/wiki/Ecash) (the data is the asset)\n\nProbably the most well known aspect of fedimint is the privacy trade off for the federated custody. Every ecash note is 1:1 with custodial bitcoin by the fedimint nodes. The most common critique of fedimint also stems from this 1:1 bitcoin:ecash since [ecash proof of liabilities](https://gist.github.com/callebtc/ed5228d1d8cbaade0104db5d1cf63939) is not a solved problem.\n\n**Offline** - It's data (transfer it without the internet)\n\nThis can make it ideal for places with poor connectivity (conferences/large gatherings or the developing world). This presents a trust race condition though, if the sender were malicious, they could race to get online faster than the receiver, and redeem the \"sent\" ecash thus causing any attempts by the receiver to redeem the ecash notes to fail.\n\n**Modular** - Default modules are wallet, mint, and LN\n\nDifferent modules can be designed using a core primitive called `Transaction` that has a set of inputs, a set of outputs, and a signature. These are then signed into consensus by the nodes of the fedimint. However, a module does not need to use a `Transaction`, it can just store arbitrary data as a `ConsensusItem` in the fedimint. A simple example of this is a password manager. A more complex example would be stability pools (stable fiat price for users doing finance magic I don't understand yet). I believe fedimint modules can become an interoperability point for lots of other tech and Bitcoin.\n\n**You don't have to do the LN thing** - Best feature, imho\n\nA fedimint node runner, does not have to also run a Bitcoin node or a LN node. They can just run `fedimintd` and connect to some other Bitcoin node of their choice with all the standard trade offs. A LN node can join a fedimint as a special client called a `gateway`. They can then offer their liquidity to the fedimint users. Ecash can then be swapped for LN based sats, and vice versa, using the module system. This means a super awesome LN node operator can do what they do best and the fedimint node runner doesn't have to manage the challenges of a LN node. Currently CLN and LND are supported and both require the running of `gatewayd` to connect/interact with the fedimint.\n\nThere are probably some more features, but these are the ones top of mind to myself.\n\n## Naive Approach\n\nA mining pool needs a coinbase address to put into a block. The pool just joins a fedimint and gets a deposit address for each block they mine. After the block confirms beyond the fedimint's desired block count, the pool can then redeem ecash from the fedimint. Using the same accounting for shares and payout, the pool sends ecash to the miners. The miners can then go to the fedimint at their leisure and swap for on-chain or LN sats. The pool operator is not managing a fedimint node, nor a LN node. The trust remains relatively the same between the miners and pool. You're trusting the pool to not rug you and/or double spend you. However, this would require the miners to form another relationship with a new entity: the fedimint and its node runners.\n\n## `poolimint` module (all modules should be `-imint`)\n\nThere are some ideas discussed in [this GitHub Discussion](https://github.com/fedimint/fedimint/discussions/1504) but I hope to explore some more thoughts and pose some questions I have.\n\nFirst, some observation I have made/learned (please correct if wrong):\n\n- latency is a big deal in mining\n- Sv2 enables anyone to generate the block template\n- LN doesn't work for pools because liquidity challenges\n- small miners want faster/smaller payouts (me!)\n\nSince latency for block generation is a critical aspect of pool technology, I think it best that fedipools follow the Sv2 model and delegate that to where it makes sense. Perhaps that is as part of fedimint consensus, but perhaps not. I lean toward the latter so do not consider this approach.\n\nPool shares do not seem like something that would be latency sensitive. Validating mining shares using fedimint consensus now decentralizes the validation of these shares to multiple entities. All fedimint nodes would have to agree that a share is valid in order for it to be considered in the pay out accounting. Only shares with the correct coinbase address would be considered valid. There are other criteria to evaluate shares on but I am ignorant of them so will avoid incorrect assumptions. \n\nWhich piece(s) of a mining share is(are) critical to validate? What else might a pool care to have validated by a quorum?\n\nOnce a block is found and confirmed beyond the required block count, ecash can be made ready for immediate redemption in any amount. This increases speed, privacy, and optionality of the miners being paid out. This does not prohibit on-chain payments for those miners so inclined. A LN gateway can also provide liquidity to those that desire payment via the lightning network. \n\nAre there other solutions offering this optionality to miners?\n\nA pool can decentralize custodial risk of the funds held on behalf of the miners, as well as reduce the amount of on-chain activity that may be needed. This means cost savings for an industry with razor thin margins and cut-throat dynamics. Additionally, a pool operator will only hold one key of a threshold needed to move funds so it introduces some interesting questions around who technically has custody of the miners’ funds awaiting withdrawal from the pool. All of this while still maintaining a similar trust trade-off that miners and pools already have. \n\nAre these trade offs appealing to pool operators and/or miners?\n\nThere must be some way for a pool to differentiate miners from each other, to my understanding this is done with a `user:password` combination. Since a fedipool would also have to understand this differentiation, we need a privacy preserving mechanism of claiming ecash from shares of a certain \"account\". This makes me consider [nostr](https://nostr.com/) as a solution, since anyone can generate a nsec/npub key pair or any other cryptographic key pair, and then used derived secrets as their mining pool \"account\". The poolimint modules could then only redeem ecash for someone proving ownership of the correct keys. \n\nAre there better ways to safe guard privacy of miners? \n\n--------\n\nI look forward to your comments and questions.",
  "actions_summary": [
    {
      "id": 2,
      "count": 1
    }
  ],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 29,
  "hidden": false,
  "trust_level": 2,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [
    {
      "id": "+1",
      "type": "emoji",
      "count": 1
    }
  ],
  "current_user_reaction": null,
  "reaction_users_count": 1,
  "current_user_used_main_reaction": false
}