{
  "id": 225,
  "name": "James O'Beirne",
  "username": "jamesob",
  "avatar_template": "/letter_avatar_proxy/v4/letter/j/958977/{size}.png",
  "created_at": "2023-09-30T12:15:35.093Z",
  "cooked": "<aside class=\"quote no-group\" data-username=\"ajtowns\" data-post=\"9\" data-topic=\"98\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ajtowns/48/3_2.png\" class=\"avatar\"> ajtowns:</div>\n<blockquote>\n<p>Personally, I think the “activation” part is probably the least interesting/useful thing to talk about.</p>\n</blockquote>\n</aside>\n<p>I heartily agree. I meant less to talk about particular activation method and more put a stake in the ground on what I think a desirable target feature-set would be for the next soft fork.</p>\n<p>I also didn’t mean to suggest that the literal HEAD of the draft PR is what I think we should merge - again, it was to give people a tangible reference point for what the shape of the change would look like.</p>\n<aside class=\"quote no-group\" data-username=\"ajtowns\" data-post=\"9\" data-topic=\"98\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ajtowns/48/3_2.png\" class=\"avatar\"> ajtowns:</div>\n<blockquote>\n<p>I don’t really think that’s quite true: there’s a couple of outstanding changes to BIP 118 that seem pretty likely to be desirable (<a href=\"https://github.com/bitcoin-inquisition/bitcoin/issues/19\">inq#19 </a>); and I don’t really think either 118 or 119 have really been super well scrutinized. Meanwhile, 345 hasn’t had been officially published yet.</p>\n</blockquote>\n</aside>\n<p>I should maybe walk back some of my initial exuberance. In suggesting this fork, my goal was to focus the community on a particular feature set. It wasn’t to say that all the details have been ironed out and we’re ready to ship next week.</p>\n<p>But consider how long both APO and CTV have been publicized. The refrain seems to always be “we just need <code>x</code> more years of thought experiments and testing.” If, as Jeremy said at some point, progress is a memoryless process, what are we really doing here?</p>\n<p>At some point we need to decide on a direction and start getting serious about activating things that are widely regarded as desirable and safe in concept. Otherwise, in the immortal words of Jim Morrison, we’re just wallowing in the mire. Saying “we need more demos and tooling” hasn’t delivered a lot over the last few years, maybe in part because Bitcoin’s human capital is apparently out of proportion with our expectations on hurdles to clear.</p>\n<aside class=\"quote no-group\" data-username=\"ajtowns\" data-post=\"9\" data-topic=\"98\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ajtowns/48/3_2.png\" class=\"avatar\"> ajtowns:</div>\n<blockquote>\n<p>But using a two week old demo as an argument for activating a consensus change just seems way over-eager.</p>\n</blockquote>\n</aside>\n<p>That’s a reasonable objection, my bad.</p>\n<aside class=\"quote no-group\" data-username=\"ajtowns\" data-post=\"10\" data-topic=\"98\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/ajtowns/48/3_2.png\" class=\"avatar\"> ajtowns:</div>\n<blockquote>\n<p>Oh, also: ln-symmetry likely needs work on package relay and fees paid via ephemeral transactions and ways to avoid pinning</p>\n</blockquote>\n</aside>\n<p>Just because something has multiple dependencies doesn’t mean we need to hold up progress on all the dependencies until they can proceed lockstep together. I think solving the package relay problem is pretty orthogonal to signatures that can bind to different outpoints, although no doubt that ln-symmetry certainly informs package relay’s design.</p>\n<hr>\n<p>I want to be clear that my proposal isn’t “let’s merge this code now.” It’s “I think this would be a great feature set for the next update to script; can we agree on it and start to work towards particulars?”</p>\n<p>I completely agree with you that more scrutiny, and testing is needed. But can you see the benefits of determining a shared goal to work towards? Right now the design space is so open and amorphous that paralysis seems pretty much assured.</p>",
  "post_number": 13,
  "post_type": 1,
  "updated_at": "2023-09-30T12:15:35.093Z",
  "reply_count": 1,
  "reply_to_post_number": 9,
  "quote_count": 2,
  "incoming_link_count": 0,
  "reads": 7,
  "readers_count": 6,
  "score": 6.4,
  "yours": false,
  "topic_id": 98,
  "topic_slug": "covenant-tools-softfork",
  "topic_title": "Covenant tools softfork",
  "topic_html_title": "Covenant tools softfork",
  "category_id": 7,
  "display_username": "James O'Beirne",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"ajtowns, post:9, topic:98\"]\nPersonally, I think the “activation” part is probably the least interesting/useful thing to talk about.\n[/quote]\n\nI heartily agree. I meant less to talk about particular activation method and more put a stake in the ground on what I think a desirable target feature-set would be for the next soft fork.\n\nI also didn't mean to suggest that the literal HEAD of the draft PR is what I think we should merge - again, it was to give people a tangible reference point for what the shape of the change would look like.\n\n[quote=\"ajtowns, post:9, topic:98\"]\nI don’t really think that’s quite true: there’s a couple of outstanding changes to BIP 118 that seem pretty likely to be desirable ([inq#19 ](https://github.com/bitcoin-inquisition/bitcoin/issues/19)); and I don’t really think either 118 or 119 have really been super well scrutinized. Meanwhile, 345 hasn’t had been officially published yet.\n[/quote] \n\nI should maybe walk back some of my initial exuberance. In suggesting this fork, my goal was to focus the community on a particular feature set. It wasn't to say that all the details have been ironed out and we're ready to ship next week.\n\nBut consider how long both APO and CTV have been publicized. The refrain seems to always be \"we just need `x` more years of thought experiments and testing.\" If, as Jeremy said at some point, progress is a memoryless process, what are we really doing here?\n\nAt some point we need to decide on a direction and start getting serious about activating things that are widely regarded as desirable and safe in concept. Otherwise, in the immortal words of Jim Morrison, we're just wallowing in the mire. Saying \"we need more demos and tooling\" hasn't delivered a lot over the last few years, maybe in part because Bitcoin's human capital is apparently out of proportion with our expectations on hurdles to clear.\n\n[quote=\"ajtowns, post:9, topic:98\"]\nBut using a two week old demo as an argument for activating a consensus change just seems way over-eager.\n[/quote]\n\nThat's a reasonable objection, my bad.\n\n[quote=\"ajtowns, post:10, topic:98\"]\nOh, also: ln-symmetry likely needs work on package relay and fees paid via ephemeral transactions and ways to avoid pinning\n[/quote]\n\nJust because something has multiple dependencies doesn't mean we need to hold up progress on all the dependencies until they can proceed lockstep together. I think solving the package relay problem is pretty orthogonal to signatures that can bind to different outpoints, although no doubt that ln-symmetry certainly informs package relay's design.\n\n---\n\nI want to be clear that my proposal isn't \"let's merge this code now.\" It's \"I think this would be a great feature set for the next update to script; can we agree on it and start to work towards particulars?\"\n\nI completely agree with you that more scrutiny, and testing is needed. But can you see the benefits of determining a shared goal to work towards? Right now the design space is so open and amorphous that paralysis seems pretty much assured.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 9,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}