{
  "id": 227,
  "name": "Anthony Towns",
  "username": "ajtowns",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ajtowns/{size}/3_2.png",
  "created_at": "2023-09-30T13:05:27.484Z",
  "cooked": "<aside class=\"quote no-group quote-modified\" data-username=\"harding\" data-post=\"11\" data-topic=\"98\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/harding/48/6_2.png\" class=\"avatar\"> harding:</div>\n<blockquote>\n<p>The presigned versions are a lot harder to implement correctly than with <code>OP_CTV</code> + <code>OP_VAULT</code>, they can’t receive payments without interaction with the payer, […] However, it seems to me that if there were high demand for the general ability to have hot spends announced onchain with a cancellation window, a significant number of people would be using presigned vaults—but I’m not aware of that happening.</p>\n</blockquote>\n</aside>\n<p>Ease of (correct) use is a big deal though – otherwise you could say “Linux is a lot harder to use than Windows NT, however if there were high demand for an OS that didn’t [suck], a significant number of people would be using Linux–but everyone’s running Windows NT” and conclude Linux is worthless.</p>\n<aside class=\"quote no-group\" data-username=\"harding\" data-post=\"11\" data-topic=\"98\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/harding/48/6_2.png\" class=\"avatar\"> harding:</div>\n<blockquote>\n<p>why is it that so few developers are working on the 2x-5x improvement that presigned vaults provides and few users seem excited about presigned vaults?</p>\n</blockquote>\n</aside>\n<p>I don’t think pre-signed vaults really get the right security properties? As described in <a href=\"https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2019-August/017231.html\">2019</a>:</p>\n<blockquote>\n<p>One of the biggest problems with the vault scheme […] is an attacker that<br>\nsilently steals the hot wallet private key and waits for the vault’s<br>\nowner to make a delayed-spend transaction to initiate a withdrawal<br>\nfrom the vault. If the user was unaware of the theft of the key, then<br>\nthe attacker could steal the funds after the delay period.</p>\n</blockquote>\n<p>I think you <strong>could</strong> simulate everything about OP_VAULT if you have access to an HSM that you trust – then you just have a “vault key” that only the HSM has the privkey for, and have the HSM enforce the rules that OP_VAULT would when signing for that key. However if you have an HSM that you trust already, I think you don’t really have a need for the “withdraw everything to an offline wallet in the case of attempted theft” behaviour that OP_VAULT is all about providing.</p>\n<p>I think the answer to the same question but for CTV/OP_VAULT vaults (vs presigned ones) is that many people estimate the chance of a successful consensus change to Bitcoin – especially one advocated for by Bitcoin businesses – at something like 0.01%, so a 5x improvement reduces down to something like 1.0004x when you calculate the expected value. And of course, new consensus features are immediately part of the commons, so you’re not getting an obvious competitive advantage by having them available.</p>\n<p>Personally, I’d say: improve the demo, make it easier to try yourself, and to understand what’s going on (eg, run an optech workshop about it) – if there’s interest in that (people go to the workshop, people are interested in podcasts/videos about the demo, people run the demo themselves), then that starts becoming a good reason to think about activation/etc. IMHO, etc.</p>\n<aside class=\"quote no-group\" data-username=\"harding\" data-post=\"11\" data-topic=\"98\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://delvingbitcoin.org/user_avatar/delvingbitcoin.org/harding/48/6_2.png\" class=\"avatar\"> harding:</div>\n<blockquote>\n<p>It also seems to me personally that John Law’s tunable penalties protocol provides the primary advantage of LN-Symmetry (proper assignment of penalties when &gt;2 parties are involved) without requiring any consensus change.</p>\n</blockquote>\n</aside>\n<p>I think n-party channels are a bit futuristic, really – we still have enough problems getting 2-party channels to work, and there’s currently enough room on-chain for spam floods so the efficiency gains aren’t yet necessary. For me, for now, the main benefits of eltoo/ln-symmetry/tunable penalties is rather that:</p>\n<ol>\n<li>if your node has a problem, you’re no longer necessarily risking 100% of your channel balance if you try to close the channel; and</li>\n<li>you only need to keep a constant amount of state in order to close the channel and claim all your funds, rather than having to remember an ever increasing amount of data potentially forever.</li>\n</ol>\n<p>Without APO (or equivalent), though, you don’t quite achieve the first of those in a sufficiently hostile scenario even with Law’s tunable penalties (<a href=\"https://lists.linuxfoundation.org/pipermail/lightning-dev/2023-April/003899.html\">ref</a>).</p>",
  "post_number": 15,
  "post_type": 1,
  "updated_at": "2023-09-30T13:05:27.484Z",
  "reply_count": 0,
  "reply_to_post_number": 11,
  "quote_count": 1,
  "incoming_link_count": 0,
  "reads": 7,
  "readers_count": 6,
  "score": 1.4,
  "yours": false,
  "topic_id": 98,
  "topic_slug": "covenant-tools-softfork",
  "topic_title": "Covenant tools softfork",
  "topic_html_title": "Covenant tools softfork",
  "category_id": 7,
  "display_username": "Anthony Towns",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "[quote=\"harding, post:11, topic:98\"]\nThe presigned versions are a lot harder to implement correctly than with `OP_CTV` + `OP_VAULT`, they can’t receive payments without interaction with the payer, [...] However, it seems to me that if there were high demand for the general ability to have hot spends announced onchain with a cancellation window, a significant number of people would be using presigned vaults—but I’m not aware of that happening.\n[/quote]\n\nEase of (correct) use is a big deal though -- otherwise you could say \"Linux is a lot harder to use than Windows NT, however if there were high demand for an OS that didn't [suck], a significant number of people would be using Linux--but everyone's running Windows NT\" and conclude Linux is worthless.\n\n[quote=\"harding, post:11, topic:98\"]\nwhy is it that so few developers are working on the 2x-5x improvement that presigned vaults provides and few users seem excited about presigned vaults?\n[/quote]\n\nI don't think pre-signed vaults really get the right security properties? As described in [2019](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2019-August/017231.html):\n\n> One of the biggest problems with the vault scheme [..] is an attacker that\n> silently steals the hot wallet private key and waits for the vault's\n> owner to make a delayed-spend transaction to initiate a withdrawal\n> from the vault. If the user was unaware of the theft of the key, then\n> the attacker could steal the funds after the delay period.\n\nI think you **could** simulate everything about OP_VAULT if you have access to an HSM that you trust -- then you just have a \"vault key\" that only the HSM has the privkey for, and have the HSM enforce the rules that OP_VAULT would when signing for that key. However if you have an HSM that you trust already, I think you don't really have a need for the \"withdraw everything to an offline wallet in the case of attempted theft\" behaviour that OP_VAULT is all about providing.\n\nI think the answer to the same question but for CTV/OP_VAULT vaults (vs presigned ones) is that many people estimate the chance of a successful consensus change to Bitcoin -- especially one advocated for by Bitcoin businesses -- at something like 0.01%, so a 5x improvement reduces down to something like 1.0004x when you calculate the expected value. And of course, new consensus features are immediately part of the commons, so you're not getting an obvious competitive advantage by having them available.\n\nPersonally, I'd say: improve the demo, make it easier to try yourself, and to understand what's going on (eg, run an optech workshop about it) -- if there's interest in that (people go to the workshop, people are interested in podcasts/videos about the demo, people run the demo themselves), then that starts becoming a good reason to think about activation/etc. IMHO, etc.\n\n[quote=\"harding, post:11, topic:98\"]\nIt also seems to me personally that John Law’s tunable penalties protocol provides the primary advantage of LN-Symmetry (proper assignment of penalties when >2 parties are involved) without requiring any consensus change.\n[/quote]\n\nI think n-party channels are a bit futuristic, really -- we still have enough problems getting 2-party channels to work, and there's currently enough room on-chain for spam floods so the efficiency gains aren't yet necessary. For me, for now, the main benefits of eltoo/ln-symmetry/tunable penalties is rather that:\n\n1. if your node has a problem, you're no longer necessarily risking 100% of your channel balance if you try to close the channel; and\n2. you only need to keep a constant amount of state in order to close the channel and claim all your funds, rather than having to remember an ever increasing amount of data potentially forever.\n\nWithout APO (or equivalent), though, you don't quite achieve the first of those in a sufficiently hostile scenario even with Law's tunable penalties ([ref](https://lists.linuxfoundation.org/pipermail/lightning-dev/2023-April/003899.html)).",
  "actions_summary": [],
  "moderator": true,
  "admin": true,
  "staff": true,
  "user_id": 3,
  "hidden": false,
  "trust_level": 4,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}