{
  "id": 183,
  "name": "Ryan Breen",
  "username": "ursuscamp",
  "avatar_template": "/user_avatar/delvingbitcoin.org/ursuscamp/{size}/39_2.png",
  "created_at": "2023-09-11T01:47:14.975Z",
  "cooked": "<h2><a name=\"preface-1\" class=\"anchor\" href=\"#preface-1\"></a>Preface</h2>\n<p>Since the furor over drivechains began recently, I have been thinking on ideas to maybe improve the BIP-300 sidechain withdrawal implementation in various ways.</p>\n<p>I landed on the concept of a lightweight daemon (a <strong>Sentinel</strong>) which can run next to Bitcoin Core. Its job is to tell miners (and potentially other full nodes) when a withdrawal is valid so that it may be mined, using Nostr as a secondary communication layer to coordinate with sidechain nodes and users.</p>\n<p>The first iteration of this was a distributed trust-based model where Bitcoin full nodes would trust their own preferred quoroms of sidechain nodes (companies, community members, etc) to tell them which withdrawal transactions are invalid. Other than the fact that it is less than ideal from a trust perspective, there are understandable fears about sidechain disagreements leading to Bitcoin forks.</p>\n<p>So here is an alternative, improved approach.</p>\n<h2><a name=\"the-idea-2\" class=\"anchor\" href=\"#the-idea-2\"></a>The Idea</h2>\n<p>There are three parties: The sidechain <code>S</code>, miner <code>M</code> and sidechain user <code>U</code>.</p>\n<p>There are some interesting sidechain that <code>M</code> wants to support, so he begins running the Sentinel daemon.</p>\n<p>In order to function as a Sentinel chain, the sidechain <code>S</code> must provide a loadable WASM module of configuration and consensus code for the sidechain. WASM is ideal for this because it is truly cross-platform and properly sandboxed. The WASM module is loaded by <code>M</code> into the Sentinel daemon. It configures the Sentinel daemon about where and how to find the sidechain blockheaders. Don’t worry, our Sentinels will NOT be validating and storing the sidechain’s blockchain. They will be SPV light clients for the sidechain. They will validate the blockheaders correctly descend from the sidechain genesis block, according to the consensus rules of sidechain (using PoW or other rules).</p>\n<p>If you’re thinking, “Wait, SPV requires trust or people can just generate fake blockheaders with thefts!” Don’t worry, we’ll get there.</p>\n<p>So sidechain user <code>U</code> wishes to make a withdrawal from sidechain to Bitcoin. How would this work?</p>\n<ol>\n<li><code>U</code> makes a withdrawal transaction on <code>S</code> and it is included in an <code>S</code> block. The header of the block must include a merkle root for the transaction tree, and also a merkle root for the global state (UTXO set, account set, etc).</li>\n<li>A marker transaction is placed on the Bitcoin blockchain with the <code>S</code> blockhash. This proves a sidechain block (and thus the withdrawal) existed at this point in history. This can be placed by any means, such as MM, BMM or whatever mechanism we choose.</li>\n<li>There is some arbitrary delay. Let’s say 100 blocks. After the marker transacation, the blockhashes of the <em>Bitcoin</em> blocks are aggregated through XOR or cryptographic hashing and used as randomized input for the next steps.</li>\n<li>After the mandated delay, <code>U</code> makes the withdrawal transaction from a sidechain UTXO on the Bitcoin chain.</li>\n<li>At the same time, <code>U</code> publishes a withdrawal proof on Nostr. The randomized data from step <code>3</code> is used as input to a function that determines which random parts of the block must be revealed in the proof. The proof must contain:<br>\nA. Proof that their withdrawal is in the transaction.<br>\nB. Deterministic set of transactions generated from the random data of the blockhashes.<br>\nC. Enough of the global state to validation A and B.</li>\n<li>If step <code>5</code> returns <code>true</code>, then the transaction is valid and miners can mine it. If it returns <code>false</code> the withdrawal is a forgery. Miners should not attempt to mine a withdrawal transaction until a valid proof is available, or they risk their block being invalidated by nodes.</li>\n</ol>\n<h2><a name=\"why-this-works-3\" class=\"anchor\" href=\"#why-this-works-3\"></a>Why This Works</h2>\n<p>Under a normal SPV proof, the node you receive the block header from must be trusted because they can create a blockhash where the transaction merkle root is filled with nothing but dummy data except for the exact path that the user’s transction is in.</p>\n<p>In the described system above, someone publishes the block with the withdrawal to Bitcoin first. The Bitcoin blockhases in the mandatory delay after the above withdrawal introduce randomness. The randomness is used to determine which parts of the withdrawal block must be revealed by the withdrawer to prove they are withdrawing from a real block. In order to fake such a block, they would have to somehow predict all of the Bitcoin blockhashes <em>after</em> they made their withdraw in order to create a fake block that passed the proof. In this way, we can be sure that even though only a small amount of the transactions in the sidechain block was validated, that it is a real block.</p>\n<h2><a name=\"question-of-data-availability-4\" class=\"anchor\" href=\"#question-of-data-availability-4\"></a>Question of Data Availability</h2>\n<p>Some may have concerns about availability of historical data. I am not sure this is a concern. There are two types of data that would be necessary: Sidechain block headers and historical withdrawal proofs.</p>\n<ol>\n<li><strong>Sidechain block headers</strong>: Upon supporting <code>S</code> the Sentinel daemon will need to grab the block headers, so those much be available. Sidechain nodes will be motivated to make sure those are available on public Nostr servers since sidechain withdrawals will freeze unless they’re available. Sidechains may even provide their own dedicated Nostr server.</li>\n<li><strong>Historical withdrawal proofs</strong>: These are possibly not necessary. There’s no need for the Sentinel daemon to validate historical withdrawals by scanning the Bitcoin blockchain with historical proofs. If there was ever an invalid withdrawal (i.e. theft) then the sidechain will collapse immediately on its own as the peg falters and trust breaks. Thus, if a sidechain is still operating at the time a Sentinel daemon begins the validation, it’s safe to assume the withdrawals prior to that date are valid.</li>\n</ol>\n<h2><a name=\"sentinel-chains-vs-drivechains-5\" class=\"anchor\" href=\"#sentinel-chains-vs-drivechains-5\"></a>Sentinel chains vs. Drivechains</h2>\n<p>Pros:</p>\n<ul>\n<li>No consensus changes required in Bitcoin Core. Possibly no changes at all. Thus, no bug risk for node runners that don’t care about sidechains.</li>\n<li>Long delays for withdrawals are not necessary.</li>\n<li>Large withdrawal packages are also not necessary.</li>\n<li>If a sidechain gains wide community support, non-miners nodes could also run the software, transitioning the withdrawal process from trusted to trustless.</li>\n</ul>\n<p>Cons:</p>\n<ul>\n<li>More difficult to launch sidechains because it requires off chain coordination among miners or nodes prior to launch.</li>\n<li>Potential for forks with node participation.</li>\n<li>Drivechains are currently a more complete proposal.</li>\n</ul>\n<h2><a name=\"inspirations-6\" class=\"anchor\" href=\"#inspirations-6\"></a>Inspirations</h2>\n<ul>\n<li><a href=\"https://www.drivechain.info\" rel=\"noopener nofollow ugc\">Drivechains/BIP-300</a></li>\n<li><a href=\"https://gist.github.com/RubenSomsen/7ecf7f13dc2496aa7eed8815a02f13d1\" rel=\"noopener nofollow ugc\">Softchains</a></li>\n</ul>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2023-09-11T11:59:50.603Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 2,
  "reads": 8,
  "readers_count": 7,
  "score": 1.0,
  "yours": false,
  "topic_id": 91,
  "topic_slug": "alternative-sidechain-withdrawal-implementation",
  "topic_title": "Alternative sidechain withdrawal implementation",
  "topic_html_title": "Alternative sidechain withdrawal implementation",
  "category_id": 7,
  "display_username": "Ryan Breen",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 4,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "## Preface\n\nSince the furor over drivechains began recently, I have been thinking on ideas to maybe improve the BIP-300 sidechain withdrawal implementation in various ways.\n\nI landed on the concept of a lightweight daemon (a **Sentinel**) which can run next to Bitcoin Core. Its job is to tell miners (and potentially other full nodes) when a withdrawal is valid so that it may be mined, using Nostr as a secondary communication layer to coordinate with sidechain nodes and users.\n\nThe first iteration of this was a distributed trust-based model where Bitcoin full nodes would trust their own preferred quoroms of sidechain nodes (companies, community members, etc) to tell them which withdrawal transactions are invalid. Other than the fact that it is less than ideal from a trust perspective, there are understandable fears about sidechain disagreements leading to Bitcoin forks.\n\nSo here is an alternative, improved approach.\n\n## The Idea\n\nThere are three parties: The sidechain `S`, miner `M` and sidechain user `U`.\n\nThere are some interesting sidechain that `M` wants to support, so he begins running the Sentinel daemon.\n\nIn order to function as a Sentinel chain, the sidechain `S` must provide a loadable WASM module of configuration and consensus code for the sidechain. WASM is ideal for this because it is truly cross-platform and properly sandboxed. The WASM module is loaded by `M` into the Sentinel daemon. It configures the Sentinel daemon about where and how to find the sidechain blockheaders. Don't worry, our Sentinels will NOT be validating and storing the sidechain's blockchain. They will be SPV light clients for the sidechain. They will validate the blockheaders correctly descend from the sidechain genesis block, according to the consensus rules of sidechain (using PoW or other rules).\n\nIf you're thinking, \"Wait, SPV requires trust or people can just generate fake blockheaders with thefts!\" Don't worry, we'll get there.\n\nSo sidechain user `U` wishes to make a withdrawal from sidechain to Bitcoin. How would this work?\n\n1. `U` makes a withdrawal transaction on `S` and it is included in an `S` block. The header of the block must include a merkle root for the transaction tree, and also a merkle root for the global state (UTXO set, account set, etc).\n2. A marker transaction is placed on the Bitcoin blockchain with the `S` blockhash. This proves a sidechain block (and thus the withdrawal) existed at this point in history. This can be placed by any means, such as MM, BMM or whatever mechanism we choose.\n3. There is some arbitrary delay. Let's say 100 blocks. After the marker transacation, the blockhashes of the _Bitcoin_ blocks are aggregated through XOR or cryptographic hashing and used as randomized input for the next steps.\n4. After the mandated delay, `U` makes the withdrawal transaction from a sidechain UTXO on the Bitcoin chain.\n5. At the same time, `U` publishes a withdrawal proof on Nostr. The randomized data from step `3` is used as input to a function that determines which random parts of the block must be revealed in the proof. The proof must contain:\n  A. Proof that their withdrawal is in the transaction. \n  B. Deterministic set of transactions generated from the random data of the blockhashes.\n  C. Enough of the global state to validation A and B.\n6. If step `5` returns `true`, then the transaction is valid and miners can mine it. If it returns `false` the withdrawal is a forgery. Miners should not attempt to mine a withdrawal transaction until a valid proof is available, or they risk their block being invalidated by nodes.\n\n## Why This Works\n\nUnder a normal SPV proof, the node you receive the block header from must be trusted because they can create a blockhash where the transaction merkle root is filled with nothing but dummy data except for the exact path that the user's transction is in.\n\nIn the described system above, someone publishes the block with the withdrawal to Bitcoin first. The Bitcoin blockhases in the mandatory delay after the above withdrawal introduce randomness. The randomness is used to determine which parts of the withdrawal block must be revealed by the withdrawer to prove they are withdrawing from a real block. In order to fake such a block, they would have to somehow predict all of the Bitcoin blockhashes *after* they made their withdraw in order to create a fake block that passed the proof. In this way, we can be sure that even though only a small amount of the transactions in the sidechain block was validated, that it is a real block.\n\n## Question of Data Availability\n\nSome may have concerns about availability of historical data. I am not sure this is a concern. There are two types of data that would be necessary: Sidechain block headers and historical withdrawal proofs.\n\n1. **Sidechain block headers**: Upon supporting `S` the Sentinel daemon will need to grab the block headers, so those much be available. Sidechain nodes will be motivated to make sure those are available on public Nostr servers since sidechain withdrawals will freeze unless they're available. Sidechains may even provide their own dedicated Nostr server.\n2. **Historical withdrawal proofs**: These are possibly not necessary. There's no need for the Sentinel daemon to validate historical withdrawals by scanning the Bitcoin blockchain with historical proofs. If there was ever an invalid withdrawal (i.e. theft) then the sidechain will collapse immediately on its own as the peg falters and trust breaks. Thus, if a sidechain is still operating at the time a Sentinel daemon begins the validation, it's safe to assume the withdrawals prior to that date are valid.\n\n## Sentinel chains vs. Drivechains\n\nPros:\n\n* No consensus changes required in Bitcoin Core. Possibly no changes at all. Thus, no bug risk for node runners that don't care about sidechains.\n* Long delays for withdrawals are not necessary.\n* Large withdrawal packages are also not necessary.\n* If a sidechain gains wide community support, non-miners nodes could also run the software, transitioning the withdrawal process from trusted to trustless.\n\nCons:\n\n* More difficult to launch sidechains because it requires off chain coordination among miners or nodes prior to launch.\n* Potential for forks with node participation.\n* Drivechains are currently a more complete proposal.\n\n## Inspirations\n\n* [Drivechains/BIP-300](https://www.drivechain.info)\n* [Softchains](https://gist.github.com/RubenSomsen/7ecf7f13dc2496aa7eed8815a02f13d1)",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 49,
  "hidden": false,
  "trust_level": 0,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}