{
  "id": 207,
  "name": "James O'Beirne",
  "username": "jamesob",
  "avatar_template": "/letter_avatar_proxy/v4/letter/j/958977/{size}.png",
  "created_at": "2023-09-29T14:44:58.556Z",
  "cooked": "<blockquote>\n<p>I would rather be in a situation where only one of these proposals makes it through the review filter and gets activated, then having them all stuck.</p>\n</blockquote>\n<p>This is a point worth consideration.</p>\n<p>My goal here is not to have an omnibus softfork - I hope it’s clear the contents here seem much more limited in scope and depth than either segwit or taproot. But I think we can’t ignore the practical realities of the fixed overhead that comes with the activation process, both social and technical. If I’ve learned anything from the assumeutxo development cycle, it’s that slicing changes too granularly, even when in some abstract software-engineering sense seeming like the “clean” thing to do, actually hampers the overall process because extensive review cannot be consolidated on a single package. I think there is an analogue here.</p>\n<p>At our current clip, it’s looking like we navigate the softfork process about once every four years. That means if we did these efforts independently, we might have many years go by before having usable vaults in Bitcoin and/or either CTV or APO. I don’t think this is a good outcome.</p>\n<p>Yes, in the abstract miners may be able to elect to signal independently for each proposal, but will they really show that level of involvement while simultaneously having neglected the review process up until the point of deployment? I think they’ll likely just continue to default to whatever Core ships with (short of an egregious change).</p>\n<p>I was originally going to propose APO and CTV together without vault, but after speaking with a number of involved contributors it became clear that people felt</p>\n<ol>\n<li>OP_VAULT is a major “realization” of the use of CTV. The criticism among involved contributors a few years ago was that CTV doesn’t go “far enough” to fully realize any one use-case, which OP_VAULT solves.</li>\n<li>Vaults are essential enough to fundamental bitcoin use that the “dead weight loss” of not having them available for another few years is significant.</li>\n</ol>\n<p>When I saw the relatively modest size of the patch for all three together (7,000 lines added including tests, of which there probably need to be more), I became convinced that it’s worth, as a community, amortizing the painful effort of consensus review and deployment over the three of them.</p>\n<p>On a lighter note, there are uses that involve both CTV and APO - <a class=\"mention\" href=\"/u/instagibbs\">@instagibbs</a> notes that his version of ln-symmetry makes use of CTV, or could be made to very easily.</p>\n<hr>\n<p>It is my hope that people will agree</p>\n<ol>\n<li>CTV and APO have been extant long enough that there is broad consensus among most that both are safe changes, and they’re both easy to review and reason about, and</li>\n<li>Vaults are a vital enough use-case that taking the effort to focus review for a few months is a good priority for those interested in matters of consensus.</li>\n</ol>\n<p>I think having all three together in the same package attracts many with varying interests and motivations. This seems important in summoning the “activation energy” necessary to perform a thorough review process and navigate the hazards of a consensus change.</p>",
  "post_number": 6,
  "post_type": 1,
  "updated_at": "2023-09-29T14:44:58.556Z",
  "reply_count": 0,
  "reply_to_post_number": 3,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 17,
  "readers_count": 16,
  "score": 3.4,
  "yours": false,
  "topic_id": 98,
  "topic_slug": "covenant-tools-softfork",
  "topic_title": "Covenant tools softfork",
  "topic_html_title": "Covenant tools softfork",
  "category_id": 7,
  "display_username": "James O'Beirne",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "reply_to_user": {
    "username": "sjors",
    "name": "Sjors Provoost",
    "avatar_template": "/user_avatar/delvingbitcoin.org/sjors/{size}/59_2.png"
  },
  "bookmarked": false,
  "raw": "> I would rather be in a situation where only one of these proposals makes it through the review filter and gets activated, then having them all stuck.\n\nThis is a point worth consideration.\n\nMy goal here is not to have an omnibus softfork - I hope it's clear the contents here seem much more limited in scope and depth than either segwit or taproot. But I think we can't ignore the practical realities of the fixed overhead that comes with the activation process, both social and technical. If I've learned anything from the assumeutxo development cycle, it's that slicing changes too granularly, even when in some abstract software-engineering sense seeming like the \"clean\" thing to do, actually hampers the overall process because extensive review cannot be consolidated on a single package. I think there is an analogue here.\n\nAt our current clip, it's looking like we navigate the softfork process about once every four years. That means if we did these efforts independently, we might have many years go by before having usable vaults in Bitcoin and/or either CTV or APO. I don't think this is a good outcome.\n\nYes, in the abstract miners may be able to elect to signal independently for each proposal, but will they really show that level of involvement while simultaneously having neglected the review process up until the point of deployment? I think they'll likely just continue to default to whatever Core ships with (short of an egregious change).\n\nI was originally going to propose APO and CTV together without vault, but after speaking with a number of involved contributors it became clear that people felt\n1. OP_VAULT is a major \"realization\" of the use of CTV. The criticism among involved contributors a few years ago was that CTV doesn't go \"far enough\" to fully realize any one use-case, which OP_VAULT solves.\n2. Vaults are essential enough to fundamental bitcoin use that the \"dead weight loss\" of not having them available for another few years is significant.\n\nWhen I saw the relatively modest size of the patch for all three together (7,000 lines added including tests, of which there probably need to be more), I became convinced that it's worth, as a community, amortizing the painful effort of consensus review and deployment over the three of them.\n\nOn a lighter note, there are uses that involve both CTV and APO - @instagibbs notes that his version of ln-symmetry makes use of CTV, or could be made to very easily.\n\n---\n\nIt is my hope that people will agree\n1. CTV and APO have been extant long enough that there is broad consensus among most that both are safe changes, and they're both easy to review and reason about, and\n2. Vaults are a vital enough use-case that taking the effort to focus review for a few months is a good priority for those interested in matters of consensus.\n\nI think having all three together in the same package attracts many with varying interests and motivations. This seems important in summoning the \"activation energy\" necessary to perform a thorough review process and navigate the hazards of a consensus change.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 9,
  "hidden": false,
  "trust_level": 3,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}