{
  "id": 233,
  "name": "",
  "username": "thunderbiscuit",
  "avatar_template": "/user_avatar/delvingbitcoin.org/thunderbiscuit/{size}/32_2.png",
  "created_at": "2023-09-30T17:58:08.638Z",
  "cooked": "<p>Hi there! Thank you for building this forum. I love the idea of a modern space to host high quality discussions around bitcoin that’s longer form than Twitter and not as hard to follow as the mailing list. I read the forum every week, and I promote it in my circles.</p>\n<p>I’m wondering if you could clarify the scope of what you’d like on the forum with regards to things like L2s and other bitcoin-related-but-not-directly-bitcoin protocols. For example I came today to post a high-level explanation of the blinding signature scheme used in the Cashu protocol (it’s different than Fedimint), but realized I wasn’t sure where this post might belong, or even if it was welcome on this forum in the first place.</p>\n<p>A post clarifying the general scope for the forum would be great! No hard feelings if Cashu does not fit within that scope of course.</p>",
  "post_number": 1,
  "post_type": 1,
  "updated_at": "2023-09-30T17:58:08.638Z",
  "reply_count": 0,
  "reply_to_post_number": null,
  "quote_count": 0,
  "incoming_link_count": 0,
  "reads": 4,
  "readers_count": 3,
  "score": 0.8,
  "yours": false,
  "topic_id": 116,
  "topic_slug": "wondering-about-the-scope-of-the-forum",
  "topic_title": "Wondering about the scope of the forum",
  "topic_html_title": "Wondering about the scope of the forum",
  "category_id": 2,
  "display_username": "",
  "primary_group_name": null,
  "flair_name": null,
  "flair_url": null,
  "flair_bg_color": null,
  "flair_color": null,
  "flair_group_id": null,
  "version": 1,
  "can_edit": false,
  "can_delete": false,
  "can_recover": false,
  "can_see_hidden_post": false,
  "can_wiki": false,
  "user_title": null,
  "bookmarked": false,
  "raw": "Hi there! Thank you for building this forum. I love the idea of a modern space to host high quality discussions around bitcoin that's longer form than Twitter and not as hard to follow as the mailing list. I read the forum every week, and I promote it in my circles.\n\nI'm wondering if you could clarify the scope of what you'd like on the forum with regards to things like L2s and other bitcoin-related-but-not-directly-bitcoin protocols. For example I came today to post a high-level explanation of the blinding signature scheme used in the Cashu protocol (it's different than Fedimint), but realized I wasn't sure where this post might belong, or even if it was welcome on this forum in the first place.\n\nA post clarifying the general scope for the forum would be great! No hard feelings if Cashu does not fit within that scope of course.",
  "actions_summary": [],
  "moderator": false,
  "admin": false,
  "staff": false,
  "user_id": 36,
  "hidden": false,
  "trust_level": 1,
  "deleted_at": null,
  "user_deleted": false,
  "edit_reason": null,
  "can_view_edit_history": true,
  "wiki": false,
  "reactions": [],
  "current_user_reaction": null,
  "reaction_users_count": 0,
  "current_user_used_main_reaction": false
}